#----
# Производства (промышленность)
    # Список фабрик и заводов Российской империи (1907-1909 годы):
    # https://istmat.org/node/26498
    # https://ru.wikisource.org/wiki/Категория:ЭСБЕ:Производство
    # Справочная книга для фабрикантов заводчиков и владельцев промышленных зданий 1898 год:
    # https://rusneb.ru/catalog/000199_000009_002415658/
    # ЭСБЕ категория производство:
    # https://ru.wikisource.org/wiki/Категория:ЭСБЕ:Производство
    # Таблицы ресурсов и использования товаров и услуг Российской Федерации за 2014 год.
    # https://ru.m.wikipedia.org/wiki/Межотраслевой_баланс#Пример_расчета_межотраслевого_баланса
    # http://www.gks.ru/free_doc/new_site/vvp/tri-2014.xlsx
# Коэффициент веса стали к весу изделия (Первая Мировая война):
    # - для снарядов бралось М(сн) = 4;
    # - для орудий — М(ор) = 8;
    # - для винтовок — М(вин) = 10;
    # - для пулеметов — М(пул) = 20.
    # Война и революция. 1928. № 1. С. 3—32. 
    # https://paul-atrydes.livejournal.com/108785.html
    # https://paul-atrydes.livejournal.com/108959.html
# Коэффициент веса стали к весу изделия (Вторая Мировая война):
    # 150-мм гаубица s.FH 18 (5.5 тонны) -- 5500 нормо-часов, 15 тонн сырой стали, коэффициент ×3
    # 105-мм гаубица l.FH 18 (3.5 тонны) -- 3200 нормо-часов, 4.8 тонны стали, коэффициент ×1.4
    # Танк Pz.4 (18.4 тонны) -- 88k нормо-часов, 39 тонн стали, коэффициент 2.1
    # Танк Panther (44.8 тонны) -- 150k нормо-часов, 81 тонн стали, коэффициент 1.8
    # Танк Tiger (57 тонны) -- 300k нормо-часов, 103.5 тонн стали, коэффициент 1.8
# Коэффициент веса стали к весу изделия (Современность):
    # Сталь к прокату (Россия, 2000 год) -- 1159.7 кг на 1000 кг проката
    # Сталь к прокату (Россия, 2009 год) -- 1103 кг на 1000 кг проката
    # Инвестиции 45-48 долларов/тонну выплавляемой стали в год (2-3 бит/тонна)
    # https://ljsear.ch/savedcopy?comm=1834745732
# Трудоёмкость изделий (США):
    # Автомобиль (1904) -- 1291 нормо-часов
    # Автомобиль (1919) -- 303 нормо-часов
    # Автомобиль (1929) -- 92 нормо-часов
    # Автомобиль, General Motors (1995) -- 46 нормо-часов
    # Автомобиль, Toyota (1995) -- 29 нормо-часов
    # Bentley Limousine (2009) -- 6000 нормо-часов (0.5 млн долларов)
    # "Time Magazine, 1932"
    # https://ljsear.ch/savedcopy?post=530183365
# Трудовая стоимость килограмма деталей: 1.4 нормо-часа.
    # Стоимость слесарных работ (2017 год)
    # Виды обработки                      | рублей/нормо-час
    # ----------------------------------- | ----------------
    # Токарные работы                     | 620
    # Фрезерные работы                    | 690
    # Зубофрезерные работы                | 1000
    # Строгальные и долбежные работы      | 950
    # Нарезание резьбы, сверление         | 550
    # Слесарные и механосборочные работы  | 490
# Примерный расчет детали штуцер НПЦ 03.020, партия не меньше 150 штук.
    # Заготовительная обработка: нарезание заготовки в размер с припуском на мехобработку — 1 минута.
    # Токарные работы: проточка наружных диаметров, канавок и нарезание резьбы — 3 минуты.
    # Сверлильные работы: обработка внутренних поверхностей — 2,5 минуты.
    # Токарные работы: расточка внутреннего диаметра под конус — 1,5 минуты.
    # Итого: 8 минут.

#----
# Промышленность Швейцарии (1895 год, 3.3 млн:
    # Производств на 10k жителей    | Заведений/10k | Рабочих/10k | кВт/заведение
    # ----------------------------- | ------------- | ----------- | -------------
    # Хлопок                        | 3.8           | 147         | 25
    # Шёлк                          | 0.7           | 94          | 36
    # Шерсть                        | 0.2           | 13          | 71
    # Лён                           | 0.04          | 2.4         | 45
    # Другие волокна                | 0.73          | 21          | 2.2
    # Обработка кожи                | 0.4           | 25          | 9.4
    # Пищевые продукты              | 1.6           | 42          | 26
    # Бумага и полиграфика          | 1.3           | 34          | 21
    # Обработка дерева              | 1.6           | 34          | 14
    # Обработка металлов            | 0.7           | 30          | 33
    # Машиностроение                | 1.2           | 73          | 20
    # Физ-хим инструменты и приборы | 0.5           | 12          | 63
    # Часовые мастера и ювелиры     | 1.5           | 50          | 3.6
    # Солеварение и обработка камня | 0.9           | 29          | 25
    # Всего                         | 15.1          | 607         | 341 кВт/10k
    # Швейцария (1888 год, 3.3 млн): 18.5% живут в 6 городах с 50+ тыс.
    # https://ru.wikisource.org/wiki/ЭСБЕ/Швейцария
# Германия (1895 год, 52.5 млн. человек) -- 18 КВт/предприятие, 48 Ватт/человека
    # - 27 промышленных предприятий и 477 КВт на 10 000 населения.
    # - 139 687 промышленных предприятий, 2 502 970 КВт
    # https://ru.wikisource.org/wiki/ЭСБЕ/Торговля
    # https://ru.wikisource.org/wiki/ЭСБЕ/Фабрика

#----
# Производства (строительные материалы)

metadict_detail['_Производство толя (квадратный метр)'] = {
        # Толщиною картон берется обыкновенно от 1 мм или немного менее до 1,7 мм,
            # причем на вес в 50 кг идет от 120 до 60 кв. м (550 грамм/кв.метр)
            # На 100 вес. частей картона расход смолы составляет от 140 до 150 весов. частей.
            # Стало быть расход смолы: 0.55 * 1.45 = 0.8 кг/кв.метр
            # https://ru.wikisource.org/wiki/ЭСБЕ/Толь
            # https://ru.wikisource.org/wiki/ЭСБЕ/Дёготь
        '_-Смоление картона (кубометр)':1 / 100,
        'Картон строительный (квадратный метр)':1,
        'Дёготь (килограмм)':0.8,
        }

metadict_detail['_Производство смоляной пакли (килограмм)'] = {
        # Массовая доля пропитки -- 40%
        # Скипидар используется как разжижитель для дёгтя (13% пропитки)
        '_-Смоление пакли (кубометр)':1 / 55,
        '_-Прессование пакли (кубометр)':1 / 55,
        'Пакля (килограмм)':0.6,
        'Дёготь (килограмм)':0.35,
        'Скипидар (килограмм)':0.05,
        }

#----
# Производства (строительные материалы, полевое)

metadict_detail['_Производство железобетона тяжёлого, полевое (кубометров)'] = {
        # Готовят на стройке, в works_buildning
        '_-Железобетон тяжёлый (100 кубометров)':1 / 100,
        }

metadict_detail['_Производство раствора кладочного М200, полевое (кубометров)'] = {
        '_-Раствор кладочный М200 (100 кубометров)':1 / 100,
        }

metadict_model['_Производство раствора асбестоцементного, полевое (кубометров)'] = {
        '_-Раствор асбестоцементный (100 кубометров)':1 / 100,
        }

metadict_model['_Производство раствора отделочного известкового, полевое (кубометров)'] = {
        '_-Раствор отделочный известковый (100 кубометров)':1 / 100,
        }

metadict_model['_Производство раствора отделочного известково-глинопесчанного, полевое (кубометров)'] = {
        '_-Раствор отделочный известково-глинопесчанный (100 кубометров)':1 / 100,
        }

metadict_model['_Производство раствора отделочного цементно-известкового, полевое (кубометров)'] = {
        '_-Раствор отделочный цементно-известковый (100 кубометров)':1 / 100,
        }

metadict_detail['_Производство Бетона М400, полевое (кубометров)'] = {
        '_-Бетон М400 (100 кубометров)':1 / 100,
        }

metadict_detail['_Производство Бетона М250, полевое (кубометров)'] = {
        '_-Бетон М250 (100 кубометров)':1 / 100,
        }

#----
# Производства (строительные материалы, полевое)

metadict_model['_Производство мастики на жидком стекле, полевое (килограмм)'] = {
        '_-Мастика на жидком стекле (кубометр)':1 / 1350,
        }

metadict_detail['_Производство мастики битумной, полевое (килограмм)'] = {
        '_-Мастика битумная (кубометр)':1 / 1200,
        }

#----
# Производства (строительные материалы)

metadict_detail['_Производство кирпича саманного (кубометр)'] = {
        # https://ru.wikisource.org/wiki/ЭСБЕ/Саманные_и_сырцовые_кирпичи
        # https://ru.wikisource.org/wiki/ЭСБЕ/Солома,_технические_применения
        # Прессованная солома (плотность 0.1 тонна/кубометр)
            # Плотность глины -- 2.6 тонны/кубометр; плотность кирпича -- 0.5 тонны/кубометр;
            # Влажность глины -- 30%; потери сырца -- 20% (коэффициенты 1.3 и 1.2)
        '_-Формирование сырца саманного кирпича (кубометр)':1,
        '_-Сушка сырца саманного кирпича (кубометр)':1,
        'Глина мятая (кубометр)':1 / (2.6 / 0.5 / 1.3 / 1.2),
        'Солома прессованная (кубометр)':0.8 * 1.2,
        }

metadict_detail['_Производство кирпича опилкобетонного (кубометр)'] = {
        # Плотность арболита -- 0.5 тонны/кубометр
        '_-Производство опилкобетона (кубометр)':1,
        '_-Формирование сырца опилкобетонного кирпича (кубометр)':1,
        'Опилки древесные (кубометр)':1.2,
        'Известь негашёная (кубометр)':0.1,
        'Цемент (кубометр)':0.1,
        'Песок (кубометр)':0.15,
        'Вода для промышленности (литр)':500,
        }

metadict_detail['_Производство прессованной соломы (кубометр)'] = {
        # - пресс для сена (тюки 25.6x15.7x14.4 верш. 0.5 кубометра, 60-70 кг, пресс 615 кг)
            # 2 рабочих для пресса, 3 для прочих работ -- 75 тюков/день (38 кубометров, 5 тонн/день)
            # плотность сена -- 130 кг/кубометр
        # Плотность сухой соломы -- 0.05 тонны/кубометр; прессованной -- 0.13 тонны/кубометр
        '_-Уплотнение соломы (кубометр)':1 / (0.05 / 0.13),
        'Солома сухая (килограмм)':130,
        #'_Пресс для соломы (годовой оборот)':1 / 7500,
        }

metadict_detail['_Производство прессованного жмыха (кубометр)'] = {
        # Тот же пресс, что и для соломы. Плотность повыше.
        # Плотность пресованного подсолнечного жмыха -- 0.15 тонны/кубометр
        '_-Уплотнение соломы (кубометр)':1 / (0.05 / 0.15),
        '-Жмых (требуется/килограмм)':200,
        #'_Пресс для соломы (годовой оборот)':1 / 7500,
        }

metadict_detail['_Производство прессованных отрубей (кубометр)'] = {
        '_-Уплотнение соломы (кубометр)':1 / (0.05 / 0.15),
        '-Отруби (требуется/килограмм)':200,
        #'_Пресс для соломы (годовой оборот)':1 / 7500,
        }

metadict_detail['_Пропитка глиной соломенных ковров (квадратный метр)'] = {
        # 1) Ковёр в яму первым слоем. Залить глиной на 2 вершка.
        # 2) Топтать, пока не выйдет воздух. Повторить со вторым слоем и т.д.
        # 3) Прижать тяжестью, оставить замачиваться на ночь (12 часов)
        # Размеры ямы:
            # Ширина ямы -- 1 метр; длина ямы -- 3.6-7.1 метров
            # Глубина ямы (для удобства пони) -- 0.5 метра
            # Объём ямы: 1 x 5.35 x 0.5 = 2.7 кубометра (106 кв.метров ковров за раз).
            # На обычный дом требуется 324 кв.метра ковров и ~300 нормо-часов кровельщиков.
            # Одной ямы на дом достаточно для кровельных работ.
        # Также можно пропустить ковёр между валами в ящике с глиной. Два раза достаточно.
        '_-Пропитка глиной соломенных ковров (квадратный метр)':1,
        'Соломенные ковры 25-мм (квадратный метр)':1,
        'Глина необработанная (кубометр)':0.01,
        '_-Котлован (кубометр)':(2 * 5.35 * 0.5) / 300,
        }
