#----
# Южноморский рацион:
    # TODO: Южноморский рацион. Дополнения.
        # Нужно больше сухофруктов (в том числе инжира и сушёной дыни)
        # Маловато ягод (кроме винограда) даже в сравнении с городским рационом.
        # Маловато пряной зелени, даже в сравнении с горожанами. Но пряных семян много.
    # Китайский рацион -- рис, пшеница, просо; соя, бобы; кунжут; капуста, редис, лук, чеснок, имбирь; слива, груша, шелковица, яблоко, персик, апельсин, мандарин
    # Японский рацион -- рис, ячмень, рожь, овёс, пшеница, просо, Hie, Kimi, гречиха; соя, бобы, горох, Daizo, Atzouki; кунжут; батат, дайкон, лук, баклажан, грибы; шелковица, слива, груша, персик, хурма, апельсин, yuzu
    # Среднеазиатский рацион -- пшеница, рис, джугара, просо, ячмень; люцерна, люфа; кунжут; морковь, огурцы, баклажан, лук, чеснок; дыня, абрикос, персик, виноград, финик, шелковица, айва, груша, яблоко, слива, черешня, гранат, барбарис
    # Что ели в Фергане (кулинария Ферганской долины 1891 года)
    # https://rus-turk.livejournal.com/244147.html
    # https://rus-turk.livejournal.com/244969.html

metadict_detail['Южноморский рацион (пони/год)'] = {
        'Южноморский весенний рацион (пони/день)':90,
        'Южноморский летний рацион (пони/день)':90,
        'Южноморский осенний рацион (пони/день)':90,
        'Южноморский зимний рацион (пони/день)':90,
        }

#----
# Южноморский рацион (времена года):

metadict_detail['Южноморский весенний рацион (пони/день)'] = {
        # amber -sm "Южноморский весенний рацион" -n 360
        # +-| Энергия затраченная (МДж)............... | 21,465
        # +-| Энергия полезная (МДж).................. | 9,636
        # --| Энергия на готовку (МДж)................ | 5,906
        # -|$ Продукция, стоимость (бит).............. | 41
        # -|- Трудозатраты (нормо-часов).............. | 152
        # -|- Трудозатраты, дом (нормо-часов)......... | 299
        # -|1 Полевые работы (нормо-часов)............ | 110
        # -|2 Хозяйственные работы (нормо-часов)...... | 8
        # -|2 Хозяйственные работы, дом (нормо-часов). | 34
        # -|3 Обработка пищи (нормо-часов)............ | 7
        # -|3 Обработка пищи, дом (нормо-часов)....... | 84
        # -|4 Приготовление пищи, дом (нормо-часов)... | 182
        # -|5 Транспортировка (нормо-часов)........... | 27
        'Южноморский весенний повседневный рацион (пони/день)':5 / 6,
        'Южноморский весенний праздничный рацион (пони/день)':1 / 6,
        }

metadict_detail['Южноморский летний рацион (пони/день)'] = {
        # +-| Энергия затраченная (МДж)............... | 17,734
        # +-| Энергия полезная (МДж).................. | 7,976
        # --| Энергия на готовку (МДж)................ | 5,458
        # -|$ Продукция, стоимость (бит).............. | 40
        # -|- Трудозатраты (нормо-часов).............. | 161
        # -|- Трудозатраты, дом (нормо-часов)......... | 289
        # -|1 Полевые работы (нормо-часов)............ | 124
        # -|2 Хозяйственные работы (нормо-часов)...... | 6
        # -|2 Хозяйственные работы, дом (нормо-часов). | 32
        # -|3 Обработка пищи (нормо-часов)............ | 7
        # -|3 Обработка пищи, дом (нормо-часов)....... | 76
        # -|4 Приготовление пищи, дом (нормо-часов)... | 181
        # -|5 Транспортировка (нормо-часов)........... | 25
        'Южноморский летний повседневный рацион (пони/день)':5 / 6,
        'Южноморский летний праздничный рацион (пони/день)':1 / 6,
        }

metadict_detail['Южноморский осенний рацион (пони/день)'] = {
        # +-| Энергия затраченная (МДж)............... | 17,859
        # +-| Энергия полезная (МДж).................. | 8,019
        # --| Энергия на готовку (МДж)................ | 5,028
        # -|$ Продукция, стоимость (бит).............. | 51
        # -|- Трудозатраты (нормо-часов).............. | 192
        # -|- Трудозатраты, дом (нормо-часов)......... | 334
        # -|1 Полевые работы (нормо-часов)............ | 151
        # -|2 Хозяйственные работы (нормо-часов)...... | 6
        # -|2 Хозяйственные работы, дом (нормо-часов). | 38
        # -|3 Обработка пищи (нормо-часов)............ | 7
        # -|3 Обработка пищи, дом (нормо-часов)....... | 83
        # -|4 Приготовление пищи, дом (нормо-часов)... | 213
        # -|5 Транспортировка (нормо-часов)........... | 28
        'Южноморский осенний повседневный рацион (пони/день)':5 / 6,
        'Южноморский осенний праздничный рацион (пони/день)':1 / 6,
        }

metadict_detail['Южноморский зимний рацион (пони/день)'] = {
        # +-| Энергия затраченная (МДж)............... | 19,448
        # +-| Энергия полезная (МДж).................. | 8,643
        # --| Энергия на готовку (МДж)................ | 5,146
        # -|$ Продукция, стоимость (бит).............. | 46
        # -|- Трудозатраты (нормо-часов).............. | 167
        # -|- Трудозатраты, дом (нормо-часов)......... | 250
        # -|1 Полевые работы (нормо-часов)............ | 124
        # -|2 Хозяйственные работы (нормо-часов)...... | 7
        # -|2 Хозяйственные работы, дом (нормо-часов). | 32
        # -|3 Обработка пищи (нормо-часов)............ | 8
        # -|3 Обработка пищи, дом (нормо-часов)....... | 54
        # -|4 Приготовление пищи, дом (нормо-часов)... | 164
        # -|5 Транспортировка (нормо-часов)........... | 28
        'Южноморский зимний повседневный рацион (пони/день)':5 / 6,
        'Южноморский зимний праздничный рацион (пони/день)':1 / 6,
        }

#----
# Южноморский рацион (дни недели):

metadict_detail['Южноморский весенний повседневный рацион (пони/день)'] = {
        'Южноморский весенний повседневный завтрак':1,
        'Южноморский весенний повседневный обед':1,
        'Южноморский весенний повседневный ужин':1,
        'Южноморское весеннее повседневное питьё v1':3 / 3,
        'Южноморское весеннее повседневное питьё v2':3 / 3,
        'Южноморское весеннее повседневное питьё v3':3 / 3,
        }

metadict_detail['Южноморский весенний праздничный рацион (пони/день)'] = {
        'Южноморский весенний праздничный завтрак':1,
        'Южноморский весенний праздничный обед':1,
        'Южноморский весенний праздничный ужин':1,
        'Южноморское весеннее праздничное питьё v1':3 / 3,
        'Южноморское весеннее праздничное питьё v2':3 / 3,
        'Южноморское весеннее праздничное питьё v3':3 / 3,
        }

metadict_detail['Южноморский летний повседневный рацион (пони/день)'] = {
        'Южноморский летний повседневный завтрак':1,
        'Южноморский летний повседневный обед':1,
        'Южноморский летний повседневный ужин':1,
        'Южноморское летнее повседневное питьё v1':3 / 3,
        'Южноморское летнее повседневное питьё v2':3 / 3,
        'Южноморское летнее повседневное питьё v3':3 / 3,
        }

metadict_detail['Южноморский летний праздничный рацион (пони/день)'] = {
        'Южноморский летний праздничный завтрак':1,
        'Южноморский летний праздничный обед':1,
        'Южноморский летний праздничный ужин':1,
        'Южноморское летнее праздничное питьё v1':3 / 3,
        'Южноморское летнее праздничное питьё v2':3 / 3,
        'Южноморское летнее праздничное питьё v3':3 / 3,
        }

metadict_detail['Южноморский осенний повседневный рацион (пони/день)'] = {
        'Южноморский осенний повседневный завтрак':1,
        'Южноморский осенний повседневный обед':1,
        'Южноморский осенний повседневный ужин':1,
        'Южноморское осеннее повседневное питьё v1':3 / 3,
        'Южноморское осеннее повседневное питьё v2':3 / 3,
        'Южноморское осеннее повседневное питьё v3':3 / 3,
        }

metadict_detail['Южноморский осенний праздничный рацион (пони/день)'] = {
        'Южноморский осенний праздничный завтрак':1,
        'Южноморский осенний праздничный обед':1,
        'Южноморский осенний праздничный ужин':1,
        'Южноморское осеннее праздничное питьё v1':3 / 3,
        'Южноморское осеннее праздничное питьё v2':3 / 3,
        'Южноморское осеннее праздничное питьё v3':3 / 3,
        }

metadict_detail['Южноморский зимний повседневный рацион (пони/день)'] = {
        'Южноморский зимний повседневный завтрак':1,
        'Южноморский зимний повседневный обед':1,
        'Южноморский зимний повседневный ужин':1,
        'Южноморское зимнее повседневное питьё v1':3 / 3,
        'Южноморское зимнее повседневное питьё v2':3 / 3,
        'Южноморское зимнее повседневное питьё v3':3 / 3,
        }

metadict_detail['Южноморский зимний праздничный рацион (пони/день)'] = {
        'Южноморский зимний праздничный завтрак':1,
        'Южноморский зимний праздничный обед':1,
        'Южноморский зимний праздничный ужин':1,
        'Южноморское зимнее праздничное питьё v1':3 / 3,
        'Южноморское зимнее праздничное питьё v2':3 / 3,
        'Южноморское зимнее праздничное питьё v3':3 / 3,
        }

#----
# Южноморский рацион (весна):
    # Март, апрель, май

metadict_detail['Южноморский весенний повседневный завтрак'] = {
        # ----Калорийность пищи (килокалорий)......... | 601
        # +-| Энергия затраченная (МДж)............... | 4,400
        # +-| Энергия полезная (МДж).................. | 1,998
        # --| Энергия на готовку (МДж)................ | 989
        # -|$ Продукция, стоимость (бит).............. | 9
        # -|- Трудозатраты (нормо-часов).............. | 35
        # -|- Трудозатраты, дом (нормо-часов)......... | 77
        # -|1 Полевые работы (нормо-часов)............ | 25
        # -|2 Хозяйственные работы (нормо-часов)...... | 2
        # -|2 Хозяйственные работы, дом (нормо-часов). | 7
        # -|3 Обработка пищи (нормо-часов)............ | 1
        # -|3 Обработка пищи, дом (нормо-часов)....... | 19
        # -|4 Приготовление пищи, дом (нормо-часов)... | 50
        # -|5 Транспортировка (нормо-часов)........... | 6
        'Лепёшки рисово-просяные паровые (грамм)':50 * 2,
        'Рис обжаренный с капустой и спаржей (грамм)':200,
        'Картофель печёный с тамариндовым соусом (грамм)':100,
        'Салат из морской капусты с соевым соусом (грамм)':100,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        '||Блюдо второе холодное (100-грамм/порция)':1,
        }

metadict_detail['Южноморский весенний повседневный обед'] = {
        # Соевый соус у нас вместо соли:
        # - 4 грамма соевого соуса на завтрак.
        # - 14 граммов соевого соуса на обед (10 грамм соли, чайная ложка, 1.5% от массы пищи!)
        # - 0 грамм соевого соуса на ужин (1-2 грамма соли в обычном виде)
        # У южноморцев избыточное потребление соли, 5.3 кг/год, а у остальных 4-4.5 кг/год.
        # Исторически, так много соли из-за жаркого влажного климата, холодильников-то нет.
        # ----Калорийность пищи (килокалорий)......... | 743
        # +-| Энергия затраченная (МДж)............... | 7,634
        # +-| Энергия полезная (МДж).................. | 3,408
        # --| Энергия на готовку (МДж)................ | 1,469
        # -|$ Продукция, стоимость (бит).............. | 12
        # -|- Трудозатраты (нормо-часов).............. | 46
        # -|- Трудозатраты, дом (нормо-часов)......... | 84
        # -|1 Полевые работы (нормо-часов)............ | 31
        # -|2 Хозяйственные работы (нормо-часов)...... | 3
        # -|2 Хозяйственные работы, дом (нормо-часов). | 11
        # -|3 Обработка пищи (нормо-часов)............ | 3
        # -|3 Обработка пищи, дом (нормо-часов)....... | 17
        # -|4 Приготовление пищи, дом (нормо-часов)... | 56
        # -|5 Транспортировка (нормо-часов)........... | 9
        'Рис варёный (грамм)':200,
        'Суп-пюре пряный гороховый (грамм)':200,
        'Суп-лапша с морской капустой (грамм)':100,
        'Батат печёный со шпинатом и соевым соусом (грамм)':100,
        'Капуста квашеная с соевым соусом (грамм)':100,
        '||Антреме горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (100-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        '||Блюдо второе холодное (100-грамм/порция)':1,
        }

metadict_detail['Южноморский весенний повседневный ужин'] = {
        # ----Калорийность пищи (килокалорий)......... | 582
        # +-| Энергия затраченная (МДж)............... | 2,644
        # +-| Энергия полезная (МДж).................. | 1,247
        # --| Энергия на готовку (МДж)................ | 864
        # -|$ Продукция, стоимость (бит).............. | 8
        # -|- Трудозатраты (нормо-часов).............. | 29
        # -|- Трудозатраты, дом (нормо-часов)......... | 60
        # -|1 Полевые работы (нормо-часов)............ | 22
        # -|2 Хозяйственные работы, дом (нормо-часов). | 6
        # -|3 Обработка пищи (нормо-часов)............ | 1
        # -|3 Обработка пищи, дом (нормо-часов)....... | 14
        # -|4 Приготовление пищи, дом (нормо-часов)... | 40
        # -|5 Транспортировка (нормо-часов)........... | 5
        'Лепёшки рисово-ячменные паровые (грамм)':50 * 2,
        'Каша пшённая с чечевицей и спаржей (грамм)':200,
        'Пюре бататное с тамариндовым соусом (грамм)':200,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе холодное (200-грамм/порция)':1,
        }

metadict_detail['Южноморское весеннее повседневное питьё v1'] = {
        # ----Калорийность пищи (килокалорий)......... | 211
        # +-| Энергия затраченная (МДж)............... | 1,406
        # +-| Энергия полезная (МДж).................. | 630
        # --| Энергия на готовку (МДж)................ | 503
        # -|$ Продукция, стоимость (бит).............. | 3
        # -|- Трудозатраты (нормо-часов).............. | 12
        # -|- Трудозатраты, дом (нормо-часов)......... | 17
        # -|1 Полевые работы (нормо-часов)............ | 9
        # -|2 Хозяйственные работы, дом (нормо-часов). | 3
        # -|3 Обработка пищи, дом (нормо-часов)....... | 6
        # -|4 Приготовление пищи, дом (нормо-часов)... | 7
        # -|5 Транспортировка (нормо-часов)........... | 2
        'Чай чёрный (грамм)':200 * 2,
        'Кубики рисовые в сахарной глазури (грамм)':50,
        'Финики без косточек (грамм)':10 * 2,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка жареная (50-грамм/порция)':1,
        '||Сладости (10-грамм/порция)':2,
        }

metadict_detail['Южноморское весеннее повседневное питьё v2'] = {
        # ----Калорийность пищи (килокалорий)......... | 374
        # +-| Энергия затраченная (МДж)............... | 568
        # +-| Энергия полезная (МДж).................. | 285
        # --| Энергия на готовку (МДж)................ | 155
        # -|$ Продукция, стоимость (бит).............. | 4
        # -|- Трудозатраты (нормо-часов).............. | 16
        # -|- Трудозатраты, дом (нормо-часов)......... | 28
        # -|1 Полевые работы (нормо-часов)............ | 13
        # -|2 Хозяйственные работы, дом (нормо-часов). | 2
        # -|3 Обработка пищи, дом (нормо-часов)....... | 17
        # -|4 Приготовление пищи, дом (нормо-часов)... | 9
        # -|5 Транспортировка (нормо-часов)........... | 2
        'Сидр яблочный (грамм)':200,
        'Блины рисовые с арахисовой пастой (грамм)':50,
        '||Питьё холодное (200-грамм/порция)':1,
        '||Выпечка жареная (50-грамм/порция)':1,
        }

metadict_detail['Южноморское весеннее повседневное питьё v3'] = {
        # ----Калорийность пищи (килокалорий)......... | 227
        # +-| Энергия затраченная (МДж)............... | 3,374
        # +-| Энергия полезная (МДж).................. | 1,450
        # --| Энергия на готовку (МДж)................ | 1,284
        # -|$ Продукция, стоимость (бит).............. | 3
        # -|- Трудозатраты (нормо-часов).............. | 7
        # -|- Трудозатраты, дом (нормо-часов)......... | 28
        # -|1 Полевые работы (нормо-часов)............ | 4
        # -|2 Хозяйственные работы, дом (нормо-часов). | 3
        # -|3 Обработка пищи, дом (нормо-часов)....... | 11
        # -|4 Приготовление пищи, дом (нормо-часов)... | 14
        # -|5 Транспортировка (нормо-часов)........... | 2
        'Кофе с сахаром (грамм)':200 * 2,
        'Блины рисовые с темпе (грамм)':50,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка жареная (50-грамм/порция)':1,
        }

metadict_detail['Южноморский весенний праздничный завтрак'] = {
        # ----Калорийность пищи (килокалорий)......... | 629
        # +-| Энергия затраченная (МДж)............... | 5,359
        # +-| Энергия полезная (МДж).................. | 2,414
        # --| Энергия на готовку (МДж)................ | 1,238
        # -|$ Продукция, стоимость (бит).............. | 11
        # -|- Трудозатраты (нормо-часов).............. | 37
        # -|- Трудозатраты, дом (нормо-часов)......... | 94
        # -|1 Полевые работы (нормо-часов)............ | 26
        # -|2 Хозяйственные работы (нормо-часов)...... | 2
        # -|2 Хозяйственные работы, дом (нормо-часов). | 9
        # -|3 Обработка пищи (нормо-часов)............ | 2
        # -|3 Обработка пищи, дом (нормо-часов)....... | 25
        # -|4 Приготовление пищи, дом (нормо-часов)... | 60
        # -|5 Транспортировка (нормо-часов)........... | 7
        'Лепёшки рисово-ячменные паровые (грамм)':50 * 2,
        'Рис обжаренный с консервированными овощами (грамм)':200,
        'Суп-лапша с бататом и солёными томатами (грамм)':100,
        'Вёшенки тушёные (грамм)':100,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (100-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        }

metadict_detail['Южноморский весенний праздничный обед'] = {
        # ----Калорийность пищи (килокалорий)......... | 1,220
        # +-| Энергия затраченная (МДж)............... | 7,662
        # +-| Энергия полезная (МДж).................. | 3,429
        # --| Энергия на готовку (МДж)................ | 1,837
        # -|$ Продукция, стоимость (бит).............. | 21
        # -|- Трудозатраты (нормо-часов).............. | 73
        # -|- Трудозатраты, дом (нормо-часов)......... | 103
        # -|1 Полевые работы (нормо-часов)............ | 54
        # -|2 Хозяйственные работы (нормо-часов)...... | 3
        # -|2 Хозяйственные работы, дом (нормо-часов). | 12
        # -|3 Обработка пищи (нормо-часов)............ | 5
        # -|3 Обработка пищи, дом (нормо-часов)....... | 19
        # -|4 Приготовление пищи, дом (нормо-часов)... | 71
        # -|5 Транспортировка (нормо-часов)........... | 11
        'Шарики фасолевые жареные во фритюре (грамм)':25 * 5,
        'Рис варёный с соевым соусом (грамм)':200,
        'Пюре гороховое с пряностями (грамм)':200,
        'Суп-пюре пряный чечевичный со шпинатом (грамм)':100,
        'Картофель жареный брусками во фритюре (грамм)':100,
        'Горчица медовая (грамм)':25,
        '||Выпечка жареная (25-грамм/порция)':5,
        '||Антреме горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (100-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        '||Соус холодный (25-грамм/порция)':1,
        }

metadict_detail['Южноморский весенний праздничный ужин'] = {
        # ----Калорийность пищи (килокалорий)......... | 658
        # +-| Энергия затраченная (МДж)............... | 5,220
        # +-| Энергия полезная (МДж).................. | 2,265
        # --| Энергия на готовку (МДж)................ | 1,649
        # -|$ Продукция, стоимость (бит).............. | 7
        # -|- Трудозатраты (нормо-часов).............. | 24
        # -|- Трудозатраты, дом (нормо-часов)......... | 61
        # -|1 Полевые работы (нормо-часов)............ | 16
        # -|2 Хозяйственные работы (нормо-часов)...... | 1
        # -|2 Хозяйственные работы, дом (нормо-часов). | 7
        # -|3 Обработка пищи (нормо-часов)............ | 1
        # -|3 Обработка пищи, дом (нормо-часов)....... | 9
        # -|4 Приготовление пищи, дом (нормо-часов)... | 45
        # -|5 Транспортировка (нормо-часов)........... | 6
        'Хлеб пшеничный домашний (грамм)':50 * 2,
        'Картофель тушёный в соевом соусе (грамм)':200,
        'Халва морковная (грамм)':100,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Десерт холодный (100-грамм/порция)':1,
        }

metadict_detail['Южноморское весеннее праздничное питьё v1'] = {
        # ----Калорийность пищи (килокалорий)......... | 267
        # +-| Энергия затраченная (МДж)............... | 4,679
        # +-| Энергия полезная (МДж).................. | 2,030
        # --| Энергия на готовку (МДж)................ | 1,933
        # -|$ Продукция, стоимость (бит).............. | 4
        # -|- Трудозатраты (нормо-часов).............. | 11
        # -|- Трудозатраты, дом (нормо-часов)......... | 25
        # -|1 Полевые работы (нормо-часов)............ | 7
        # -|2 Хозяйственные работы, дом (нормо-часов). | 5
        # -|3 Обработка пищи, дом (нормо-часов)....... | 11
        # -|4 Приготовление пищи, дом (нормо-часов)... | 9
        # -|5 Транспортировка (нормо-часов)........... | 3
        'Чай чёрный (грамм)':200 * 2,
        'Лепёшки рисовые с лимонным сиропом (грамм)':50 * 2,
        'Желе из ревеня (грамм)':100,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка жареная (50-грамм/порция)':2,
        '||Десерт холодный (100-грамм/порция)':1,
        }

metadict_detail['Южноморское весеннее праздничное питьё v2'] = {
        # ----Калорийность пищи (килокалорий)......... | 228
        # +-| Энергия затраченная (МДж)............... | 537
        # +-| Энергия полезная (МДж).................. | 322
        # --| Энергия на готовку (МДж)................ | 127
        # -|$ Продукция, стоимость (бит).............. | 8
        # -|- Трудозатраты (нормо-часов).............. | 31
        # -|- Трудозатраты, дом (нормо-часов)......... | 23
        # -|1 Полевые работы (нормо-часов)............ | 27
        # -|2 Хозяйственные работы, дом (нормо-часов). | 1
        # -|3 Обработка пищи, дом (нормо-часов)....... | 13
        # -|4 Приготовление пищи, дом (нормо-часов)... | 8
        # -|5 Транспортировка (нормо-часов)........... | 3
        'Вино белое сухое (грамм)':200,
        'Козинаки медовые с фисташками (грамм)':10 * 2,
        '||Питьё холодное (200-грамм/порция)':1,
        '||Сладости (10-грамм/порция)':2,
        }

metadict_detail['Южноморское весеннее праздничное питьё v3'] = {
        # ----Калорийность пищи (килокалорий)......... | 211
        # +-| Энергия затраченная (МДж)............... | 5,203
        # +-| Энергия полезная (МДж).................. | 2,265
        # --| Энергия на готовку (МДж)................ | 2,335
        # -|$ Продукция, стоимость (бит).............. | 4
        # -|- Трудозатраты (нормо-часов).............. | 14
        # -|- Трудозатраты, дом (нормо-часов)......... | 18
        # -|1 Полевые работы (нормо-часов)............ | 9
        # -|2 Хозяйственные работы, дом (нормо-часов). | 2
        # -|3 Обработка пищи, дом (нормо-часов)....... | 2
        # -|4 Приготовление пищи, дом (нормо-часов)... | 14
        # -|5 Транспортировка (нормо-часов)........... | 4
        'Компот из свежего ревеня (грамм)':200 * 2,
        '||Питьё холодное (200-грамм/порция)':2,
        }

#----
# Южноморский рацион (лето):
    # Июнь, июль, август

metadict_detail['Южноморский летний повседневный завтрак'] = {
        # ----Калорийность пищи (килокалорий)......... | 513
        # +-| Энергия затраченная (МДж)............... | 3,933
        # +-| Энергия полезная (МДж).................. | 1,764
        # --| Энергия на готовку (МДж)................ | 943
        # -|$ Продукция, стоимость (бит).............. | 7
        # -|- Трудозатраты (нормо-часов).............. | 28
        # -|- Трудозатраты, дом (нормо-часов)......... | 73
        # -|1 Полевые работы (нормо-часов)............ | 20
        # -|2 Хозяйственные работы (нормо-часов)...... | 1
        # -|2 Хозяйственные работы, дом (нормо-часов). | 7
        # -|3 Обработка пищи, дом (нормо-часов)....... | 15
        # -|4 Приготовление пищи, дом (нормо-часов)... | 51
        # -|5 Транспортировка (нормо-часов)........... | 6
        'Лепёшки рисово-просяные паровые (грамм)':50 * 2,
        'Рис обжаренный с капустой и овощами (грамм)':200,
        'Пастернак печёный дольками (грамм)':100,
        'Салат огуречно-морковный с соевым соусом (грамм)':100,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        '||Блюдо второе холодное (100-грамм/порция)':1,
        }

metadict_detail['Южноморский летний повседневный обед'] = {
        # TODO: Замени томатный суп на какой-нибудь суп-соус.
        # ----Калорийность пищи (килокалорий)......... | 705
        # +-| Энергия затраченная (МДж)............... | 4,806
        # +-| Энергия полезная (МДж).................. | 2,173
        # --| Энергия на готовку (МДж)................ | 1,404
        # -|$ Продукция, стоимость (бит).............. | 11
        # -|- Трудозатраты (нормо-часов).............. | 43
        # -|- Трудозатраты, дом (нормо-часов)......... | 81
        # -|1 Полевые работы (нормо-часов)............ | 32
        # -|2 Хозяйственные работы (нормо-часов)...... | 2
        # -|2 Хозяйственные работы, дом (нормо-часов). | 11
        # -|3 Обработка пищи (нормо-часов)............ | 3
        # -|3 Обработка пищи, дом (нормо-часов)....... | 14
        # -|4 Приготовление пищи, дом (нормо-часов)... | 56
        # -|5 Транспортировка (нормо-часов)........... | 6
        'Рис варёный с соевым соусом (грамм)':200,
        'Суп-пюре пряный нутовый с луком-пореем (грамм)':200,
        'Суп томатный с фасолью (грамм)':100,
        'Овощи обжаренные в остром арахисовом соусе (грамм)':100,
        'Салат капустный с пряностями (грамм)':100,
        '||Антреме горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (100-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        '||Блюдо второе холодное (100-грамм/порция)':1,
        }

metadict_detail['Южноморский летний повседневный ужин'] = {
        # ----Калорийность пищи (килокалорий)......... | 451
        # +-| Энергия затраченная (МДж)............... | 1,680
        # +-| Энергия полезная (МДж).................. | 815
        # --| Энергия на готовку (МДж)................ | 542
        # -|$ Продукция, стоимость (бит).............. | 7
        # -|- Трудозатраты (нормо-часов).............. | 31
        # -|- Трудозатраты, дом (нормо-часов)......... | 48
        # -|1 Полевые работы (нормо-часов)............ | 24
        # -|2 Хозяйственные работы, дом (нормо-часов). | 5
        # -|3 Обработка пищи (нормо-часов)............ | 1
        # -|3 Обработка пищи, дом (нормо-часов)....... | 11
        # -|4 Приготовление пищи, дом (нормо-часов)... | 32
        # -|5 Транспортировка (нормо-часов)........... | 4
        'Лепёшки рисово-ячменные паровые (грамм)':50 * 2,
        'Каша пшённая с чечевицей и овощами (грамм)':200,
        'Фрукты летние южноморские (грамм)':200,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Фрукты свежие (200-грамм/порция)':1,
        }

metadict_detail['Южноморское летнее повседневное питьё v1'] = {
        # ----Калорийность пищи (килокалорий)......... | 299
        # +-| Энергия затраченная (МДж)............... | 894
        # +-| Энергия полезная (МДж).................. | 414
        # --| Энергия на готовку (МДж)................ | 298
        # -|$ Продукция, стоимость (бит).............. | 3
        # -|- Трудозатраты (нормо-часов).............. | 13
        # -|- Трудозатраты, дом (нормо-часов)......... | 20
        # -|1 Полевые работы (нормо-часов)............ | 11
        # -|2 Хозяйственные работы, дом (нормо-часов). | 3
        # -|3 Обработка пищи, дом (нормо-часов)....... | 8
        # -|4 Приготовление пищи, дом (нормо-часов)... | 8
        # -|5 Транспортировка (нормо-часов)........... | 1
        'Чай чёрный (грамм)':200 * 2,
        'Лепёшки рисовые с финиковым соусом (грамм)':50 * 2,
        'Орех грецкий чищенный (грамм)':10 * 2,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка жареная (50-грамм/порция)':2,
        '||Орешки (10-грамм/порция)':2,
        }

metadict_detail['Южноморское летнее повседневное питьё v2'] = {
        # ----Калорийность пищи (килокалорий)......... | 447
        # +-| Энергия затраченная (МДж)............... | 1,204
        # +-| Энергия полезная (МДж).................. | 644
        # --| Энергия на готовку (МДж)................ | 309
        # -|$ Продукция, стоимость (бит).............. | 8
        # -|- Трудозатраты (нормо-часов).............. | 33
        # -|- Трудозатраты, дом (нормо-часов)......... | 49
        # -|1 Полевые работы (нормо-часов)............ | 27
        # -|2 Хозяйственные работы, дом (нормо-часов). | 3
        # -|3 Обработка пищи, дом (нормо-часов)....... | 25
        # -|4 Приготовление пищи, дом (нормо-часов)... | 22
        # -|5 Транспортировка (нормо-часов)........... | 5
        'Вино красное сухое (грамм)':200,
        'Блины рисовые с арахисовой пастой (грамм)':50 * 2,
        '||Питьё холодное (200-грамм/порция)':1,
        '||Выпечка жареная (50-грамм/порция)':2,
        }

metadict_detail['Южноморское летнее повседневное питьё v3'] = {
        # ----Калорийность пищи (килокалорий)......... | 166
        # +-| Энергия затраченная (МДж)............... | 3,263
        # +-| Энергия полезная (МДж).................. | 1,392
        # --| Энергия на готовку (МДж)................ | 1,289
        # -|$ Продукция, стоимость (бит).............. | 2
        # -|- Трудозатраты (нормо-часов).............. | 5
        # -|- Трудозатраты, дом (нормо-часов)......... | 16
        # -|1 Полевые работы (нормо-часов)............ | 3
        # -|2 Хозяйственные работы, дом (нормо-часов). | 3
        # -|3 Обработка пищи, дом (нормо-часов)....... | 1
        # -|4 Приготовление пищи, дом (нормо-часов)... | 12
        # -|5 Транспортировка (нормо-часов)........... | 2
        'Чай чёрный с сахаром (грамм)':200 * 2,
        'Оладьи картофельные с пряностями (грамм)':50,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка жареная (50-грамм/порция)':1,
        }

metadict_detail['Южноморский летний праздничный завтрак'] = {
        # ----Калорийность пищи (килокалорий)......... | 646
        # +-| Энергия затраченная (МДж)............... | 4,290
        # +-| Энергия полезная (МДж).................. | 1,973
        # --| Энергия на готовку (МДж)................ | 1,312
        # -|$ Продукция, стоимость (бит).............. | 10
        # -|- Трудозатраты (нормо-часов).............. | 39
        # -|- Трудозатраты, дом (нормо-часов)......... | 68
        # -|1 Полевые работы (нормо-часов)............ | 29
        # -|2 Хозяйственные работы (нормо-часов)...... | 2
        # -|2 Хозяйственные работы, дом (нормо-часов). | 7
        # -|3 Обработка пищи (нормо-часов)............ | 2
        # -|3 Обработка пищи, дом (нормо-часов)....... | 19
        # -|4 Приготовление пищи, дом (нормо-часов)... | 42
        # -|5 Транспортировка (нормо-часов)........... | 7
        'Лепёшки рисово-ячменные паровые (грамм)':50 * 2,
        'Рис тушёный с вёшенками и овощами (грамм)':200,
        'Суп-лапша с кабачком и свежими томатами (грамм)':100,
        'Салат огуречный с лимонно-соевым соусом (грамм)':100,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (100-грамм/порция)':1,
        '||Блюдо второе холодное (100-грамм/порция)':1,
        }

metadict_detail['Южноморский летний праздничный обед'] = {
        # ----Калорийность пищи (килокалорий)......... | 967
        # +-| Энергия затраченная (МДж)............... | 7,598
        # +-| Энергия полезная (МДж).................. | 3,248
        # --| Энергия на готовку (МДж)................ | 2,113
        # -|$ Продукция, стоимость (бит).............. | 17
        # -|- Трудозатраты (нормо-часов).............. | 66
        # -|- Трудозатраты, дом (нормо-часов)......... | 117
        # -|1 Полевые работы (нормо-часов)............ | 48
        # -|2 Хозяйственные работы (нормо-часов)...... | 3
        # -|2 Хозяйственные работы, дом (нормо-часов). | 12
        # -|3 Обработка пищи (нормо-часов)............ | 6
        # -|3 Обработка пищи, дом (нормо-часов)....... | 29
        # -|4 Приготовление пищи, дом (нормо-часов)... | 76
        # -|5 Транспортировка (нормо-часов)........... | 9
        'Шарики картофельные жареные во фритюре (грамм)':25 * 5,
        'Рис варёный с соевым соусом (грамм)':200,
        'Суп-пюре пряный шпинатный с темпе (грамм)':200,
        'Суп-пюре пряный бататный (грамм)':100,
        'Пастернак запечённый с томатами (грамм)':100,
        'Паста чесночно-кинзовая (грамм)':25,
        '||Выпечка жареная (25-грамм/порция)':5,
        '||Антреме горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (100-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        '||Соус холодный (25-грамм/порция)':1,
        }

metadict_detail['Южноморский летний праздничный ужин'] = {
        # ----Калорийность пищи (килокалорий)......... | 710
        # +-| Энергия затраченная (МДж)............... | 5,173
        # +-| Энергия полезная (МДж).................. | 2,049
        # --| Энергия на готовку (МДж)................ | 968
        # -|$ Продукция, стоимость (бит).............. | 10
        # -|- Трудозатраты (нормо-часов).............. | 39
        # -|- Трудозатраты, дом (нормо-часов)......... | 53
        # -|1 Полевые работы (нормо-часов)............ | 29
        # -|2 Хозяйственные работы (нормо-часов)...... | 2
        # -|2 Хозяйственные работы, дом (нормо-часов). | 7
        # -|3 Обработка пищи (нормо-часов)............ | 2
        # -|3 Обработка пищи, дом (нормо-часов)....... | 15
        # -|4 Приготовление пищи, дом (нормо-часов)... | 31
        # -|5 Транспортировка (нормо-часов)........... | 7
        'Хлеб пшеничный домашний (грамм)':50 * 2,
        'Картофель тушёный с горошком и пряностями (грамм)':200,
        'Пудинг кукурузно-миндальный с изюмом (грамм)':100,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Десерт холодный (100-грамм/порция)':1,
        }

metadict_detail['Южноморское летнее праздничное питьё v1'] = {
        # ----Калорийность пищи (килокалорий)......... | 271
        # +-| Энергия затраченная (МДж)............... | 4,665
        # +-| Энергия полезная (МДж).................. | 2,016
        # --| Энергия на готовку (МДж)................ | 1,933
        # -|$ Продукция, стоимость (бит).............. | 4
        # -|- Трудозатраты (нормо-часов).............. | 11
        # -|- Трудозатраты, дом (нормо-часов)......... | 26
        # -|1 Полевые работы (нормо-часов)............ | 7
        # -|2 Хозяйственные работы, дом (нормо-часов). | 5
        # -|3 Обработка пищи, дом (нормо-часов)....... | 11
        # -|4 Приготовление пищи, дом (нормо-часов)... | 10
        # -|5 Транспортировка (нормо-часов)........... | 3
        'Чай чёрный (грамм)':200 * 2,
        'Лепёшки рисовые с яблочным сиропом (грамм)':50 * 2,
        'Желе лимонное (грамм)':100,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка жареная (50-грамм/порция)':2,
        '||Десерт холодный (100-грамм/порция)':1,
        }

metadict_detail['Южноморское летнее праздничное питьё v2'] = {
        # ----Калорийность пищи (килокалорий)......... | 229
        # +-| Энергия затраченная (МДж)............... | 551
        # +-| Энергия полезная (МДж).................. | 327
        # --| Энергия на готовку (МДж)................ | 130
        # -|$ Продукция, стоимость (бит).............. | 8
        # -|- Трудозатраты (нормо-часов).............. | 30
        # -|- Трудозатраты, дом (нормо-часов)......... | 24
        # -|1 Полевые работы (нормо-часов)............ | 26
        # -|2 Хозяйственные работы, дом (нормо-часов). | 1
        # -|3 Обработка пищи, дом (нормо-часов)....... | 14
        # -|4 Приготовление пищи, дом (нормо-часов)... | 9
        # -|5 Транспортировка (нормо-часов)........... | 3
        'Вино белое сухое (грамм)':200,
        'Козинаки медовые с миндалем (грамм)':10 * 2,
        '||Питьё холодное (200-грамм/порция)':1,
        '||Сладости (10-грамм/порция)':2,
        }

metadict_detail['Южноморское летнее праздничное питьё v3'] = {
        # ----Калорийность пищи (килокалорий)......... | 269
        # +-| Энергия затраченная (МДж)............... | 5,226
        # +-| Энергия полезная (МДж).................. | 2,236
        # --| Энергия на готовку (МДж)................ | 2,366
        # -|$ Продукция, стоимость (бит).............. | 5
        # -|- Трудозатраты (нормо-часов).............. | 20
        # -|- Трудозатраты, дом (нормо-часов)......... | 18
        # -|1 Полевые работы (нормо-часов)............ | 17
        # -|2 Хозяйственные работы, дом (нормо-часов). | 2
        # -|3 Обработка пищи, дом (нормо-часов)....... | 2
        # -|4 Приготовление пищи, дом (нормо-часов)... | 13
        # -|5 Транспортировка (нормо-часов)........... | 3
        'Компот из свежих персиков (грамм)':200 * 2,
        '||Питьё холодное (200-грамм/порция)':2,
        }


#----
# Южноморский рацион (осень):
    # Сентябрь, октябрь, ноябрь

metadict_detail['Южноморский осенний повседневный завтрак'] = {
        # ----Калорийность пищи (килокалорий)......... | 569
        # +-| Энергия затраченная (МДж)............... | 3,894
        # +-| Энергия полезная (МДж).................. | 1,782
        # --| Энергия на готовку (МДж)................ | 931
        # -|$ Продукция, стоимость (бит).............. | 8
        # -|- Трудозатраты (нормо-часов).............. | 29
        # -|- Трудозатраты, дом (нормо-часов)......... | 69
        # -|1 Полевые работы (нормо-часов)............ | 21
        # -|2 Хозяйственные работы (нормо-часов)...... | 1
        # -|2 Хозяйственные работы, дом (нормо-часов). | 7
        # -|3 Обработка пищи (нормо-часов)............ | 1
        # -|3 Обработка пищи, дом (нормо-часов)....... | 16
        # -|4 Приготовление пищи, дом (нормо-часов)... | 46
        # -|5 Транспортировка (нормо-часов)........... | 6
        'Лепёшки рисово-ячменные паровые (грамм)':50 * 2,
        'Рис обжаренный с капустой и грибами (грамм)':200,
        'Батат печёный дольками (грамм)':100,
        'Салат огуречно-морковный с соевым соусом (грамм)':100,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        '||Блюдо второе холодное (100-грамм/порция)':1,
        }

metadict_detail['Южноморский осенний повседневный обед'] = {
        # TODO: Слишком большая порция самбара. Это же скорее соус, чем суп.
        # Просто уменьши порцию и дай к обеду кукурузные лепёшки.
        # ----Калорийность пищи (килокалорий)......... | 740
        # +-| Энергия затраченная (МДж)............... | 5,504
        # +-| Энергия полезная (МДж).................. | 2,493
        # --| Энергия на готовку (МДж)................ | 1,394
        # -|$ Продукция, стоимость (бит).............. | 11
        # -|- Трудозатраты (нормо-часов).............. | 43
        # -|- Трудозатраты, дом (нормо-часов)......... | 82
        # -|1 Полевые работы (нормо-часов)............ | 31
        # -|2 Хозяйственные работы (нормо-часов)...... | 2
        # -|2 Хозяйственные работы, дом (нормо-часов). | 11
        # -|3 Обработка пищи (нормо-часов)............ | 3
        # -|3 Обработка пищи, дом (нормо-часов)....... | 18
        # -|4 Приготовление пищи, дом (нормо-часов)... | 53
        # -|5 Транспортировка (нормо-часов)........... | 8
        'Рис варёный с соевым соусом (грамм)':200,
        'Суп-пюре пряный чечевичный с тыквой (грамм)':200,
        'Суп томатный с фасолью (грамм)':100,
        'Кукуруза печёная с соевым соусом (грамм)':100,
        'Салат капустный с пряностями (грамм)':100,
        '||Антреме горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (100-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        '||Блюдо второе холодное (100-грамм/порция)':1,
        }

metadict_detail['Южноморский осенний повседневный ужин'] = {
        # ----Калорийность пищи (килокалорий)......... | 570
        # +-| Энергия затраченная (МДж)............... | 2,104
        # +-| Энергия полезная (МДж).................. | 958
        # --| Энергия на готовку (МДж)................ | 590
        # -|$ Продукция, стоимость (бит).............. | 9
        # -|- Трудозатраты (нормо-часов).............. | 34
        # -|- Трудозатраты, дом (нормо-часов)......... | 51
        # -|1 Полевые работы (нормо-часов)............ | 27
        # -|2 Хозяйственные работы, дом (нормо-часов). | 4
        # -|3 Обработка пищи (нормо-часов)............ | 1
        # -|3 Обработка пищи, дом (нормо-часов)....... | 17
        # -|4 Приготовление пищи, дом (нормо-часов)... | 29
        # -|5 Транспортировка (нормо-часов)........... | 5
        'Хлеб соевый домашний (грамм)':50 * 2,
        'Каша пшённая с чечевицей и горошком (грамм)':200,
        'Фрукты осенние южноморские (грамм)':200,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Фрукты свежие (200-грамм/порция)':1,
        }

metadict_detail['Южноморское осеннее повседневное питьё v1'] = {
        # ----Калорийность пищи (килокалорий)......... | 265
        # +-| Энергия затраченная (МДж)............... | 998
        # +-| Энергия полезная (МДж).................. | 453
        # --| Энергия на готовку (МДж)................ | 333
        # -|$ Продукция, стоимость (бит).............. | 2
        # -|- Трудозатраты (нормо-часов).............. | 10
        # -|- Трудозатраты, дом (нормо-часов)......... | 21
        # -|1 Полевые работы (нормо-часов)............ | 8
        # -|2 Хозяйственные работы, дом (нормо-часов). | 4
        # -|3 Обработка пищи, дом (нормо-часов)....... | 10
        # -|4 Приготовление пищи, дом (нормо-часов)... | 7
        # -|5 Транспортировка (нормо-часов)........... | 1
        'Чай чёрный (грамм)':200 * 2,
        'Лепёшки рисовые с алычовым соусом (грамм)':50 * 2,
        'Орех кешью обжаренный (грамм)':10 * 2,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка жареная (50-грамм/порция)':2,
        '||Орешки (10-грамм/порция)':2,
        }

metadict_detail['Южноморское осеннее повседневное питьё v2'] = {
        # ----Калорийность пищи (килокалорий)......... | 478
        # +-| Энергия затраченная (МДж)............... | 1,269
        # +-| Энергия полезная (МДж).................. | 693
        # --| Энергия на готовку (МДж)................ | 310
        # -|$ Продукция, стоимость (бит).............. | 13
        # -|- Трудозатраты (нормо-часов).............. | 60
        # -|- Трудозатраты, дом (нормо-часов)......... | 91
        # -|1 Полевые работы (нормо-часов)............ | 53
        # -|2 Хозяйственные работы, дом (нормо-часов). | 4
        # -|3 Обработка пищи, дом (нормо-часов)....... | 20
        # -|4 Приготовление пищи, дом (нормо-часов)... | 66
        # -|5 Транспортировка (нормо-часов)........... | 6
        'Сок яблочный (грамм)':200 * 2,
        'Блины рисовые с арахисовой пастой (грамм)':50 * 2,
        '||Питьё холодное (200-грамм/порция)':2,
        '||Выпечка жареная (50-грамм/порция)':2,
        }

metadict_detail['Южноморское осеннее повседневное питьё v3'] = {
        # ----Калорийность пищи (килокалорий)......... | 152
        # +-| Энергия затраченная (МДж)............... | 941
        # +-| Энергия полезная (МДж).................. | 413
        # --| Энергия на готовку (МДж)................ | 281
        # -|$ Продукция, стоимость (бит).............. | 6
        # -|- Трудозатраты (нормо-часов).............. | 13
        # -|- Трудозатраты, дом (нормо-часов)......... | 16
        # -|1 Полевые работы (нормо-часов)............ | 11
        # -|2 Хозяйственные работы, дом (нормо-часов). | 3
        # -|3 Обработка пищи, дом (нормо-часов)....... | 1
        # -|4 Приготовление пищи, дом (нормо-часов)... | 12
        'Чай чёрный с мёдом (грамм)':200 * 2,
        'Оладьи картофельные с пряностями (грамм)':50,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка жареная (50-грамм/порция)':1,
        }

metadict_detail['Южноморский осенний праздничный завтрак'] = {
        # ----Калорийность пищи (килокалорий)......... | 650
        # +-| Энергия затраченная (МДж)............... | 4,645
        # +-| Энергия полезная (МДж).................. | 2,079
        # --| Энергия на готовку (МДж)................ | 1,361
        # -|$ Продукция, стоимость (бит).............. | 11
        # -|- Трудозатраты (нормо-часов).............. | 41
        # -|- Трудозатраты, дом (нормо-часов)......... | 67
        # -|1 Полевые работы (нормо-часов)............ | 31
        # -|2 Хозяйственные работы (нормо-часов)...... | 2
        # -|2 Хозяйственные работы, дом (нормо-часов). | 8
        # -|3 Обработка пищи (нормо-часов)............ | 2
        # -|3 Обработка пищи, дом (нормо-часов)....... | 19
        # -|4 Приготовление пищи, дом (нормо-часов)... | 40
        # -|5 Транспортировка (нормо-часов)........... | 7
        'Лепёшки рисово-ячменные паровые (грамм)':50 * 2,
        'Рис тушёный с вёшенками и овощами (грамм)':200,
        'Суп-лапша с кабачком и свежими томатами (грамм)':100,
        'Тыква фаршированная картофелем с пряностями (грамм)':100,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (100-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        }

metadict_detail['Южноморский осенний праздничный обед'] = {
        # ----Калорийность пищи (килокалорий)......... | 1,097
        # +-| Энергия затраченная (МДж)............... | 8,243
        # +-| Энергия полезная (МДж).................. | 3,402
        # --| Энергия на готовку (МДж)................ | 2,254
        # -|$ Продукция, стоимость (бит).............. | 20
        # -|- Трудозатраты (нормо-часов).............. | 73
        # -|- Трудозатраты, дом (нормо-часов)......... | 111
        # -|1 Полевые работы (нормо-часов)............ | 53
        # -|2 Хозяйственные работы (нормо-часов)...... | 3
        # -|2 Хозяйственные работы, дом (нормо-часов). | 13
        # -|3 Обработка пищи (нормо-часов)............ | 6
        # -|3 Обработка пищи, дом (нормо-часов)....... | 28
        # -|4 Приготовление пищи, дом (нормо-часов)... | 70
        # -|5 Транспортировка (нормо-часов)........... | 10
        'Шарики овощные жареные во фритюре (грамм)':25 * 5,
        'Рис варёный с соевым соусом (грамм)':200,
        'Нут тушёный с томатами и пряностями (грамм)':200,
        'Суп-пюре пряный морковный (грамм)':100,
        'Картофель жареный в томатном соусе (грамм)':100,
        'Соус арахисовый острый (грамм)':25,
        '||Выпечка жареная (25-грамм/порция)':5,
        '||Антреме горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (100-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        '||Соус холодный (25-грамм/порция)':1,
        }

metadict_detail['Южноморский осенний праздничный ужин'] = {
        # ----Калорийность пищи (килокалорий)......... | 656
        # +-| Энергия затраченная (МДж)............... | 6,440
        # +-| Энергия полезная (МДж).................. | 2,524
        # --| Энергия на готовку (МДж)................ | 1,469
        # -|$ Продукция, стоимость (бит).............. | 12
        # -|- Трудозатраты (нормо-часов).............. | 42
        # -|- Трудозатраты, дом (нормо-часов)......... | 59
        # -|1 Полевые работы (нормо-часов)............ | 31
        # -|2 Хозяйственные работы (нормо-часов)...... | 2
        # -|2 Хозяйственные работы, дом (нормо-часов). | 7
        # -|3 Обработка пищи (нормо-часов)............ | 2
        # -|3 Обработка пищи, дом (нормо-часов)....... | 16
        # -|4 Приготовление пищи, дом (нормо-часов)... | 36
        # -|5 Транспортировка (нормо-часов)........... | 8
        'Хлеб пшеничный домашний (грамм)':50 * 2,
        'Фасоль стручковая тушёная (грамм)':200,
        'Халва тыквенная (грамм)':100,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Десерт холодный (100-грамм/порция)':1,
        }

metadict_detail['Южноморское осеннее праздничное питьё v1'] = {
        # ----Калорийность пищи (килокалорий)......... | 279
        # +-| Энергия затраченная (МДж)............... | 4,670
        # +-| Энергия полезная (МДж).................. | 2,020
        # --| Энергия на готовку (МДж)................ | 1,933
        # -|$ Продукция, стоимость (бит).............. | 4
        # -|- Трудозатраты (нормо-часов).............. | 14
        # -|- Трудозатраты, дом (нормо-часов)......... | 31
        # -|1 Полевые работы (нормо-часов)............ | 9
        # -|2 Хозяйственные работы, дом (нормо-часов). | 5
        # -|3 Обработка пищи, дом (нормо-часов)....... | 11
        # -|4 Приготовление пищи, дом (нормо-часов)... | 14
        # -|5 Транспортировка (нормо-часов)........... | 3
        'Чай чёрный (грамм)':200 * 2,
        'Лепёшки рисовые с лимонным сиропом (грамм)':50 * 2,
        'Желе яблочное (грамм)':100,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка жареная (50-грамм/порция)':2,
        '||Десерт холодный (100-грамм/порция)':1,
        }

metadict_detail['Южноморское осеннее праздничное питьё v2'] = {
        # ----Калорийность пищи (килокалорий)......... | 337
        # +-| Энергия затраченная (МДж)............... | 4,378
        # +-| Энергия полезная (МДж).................. | 1,888
        # --| Энергия на готовку (МДж)................ | 1,592
        # -|$ Продукция, стоимость (бит).............. | 5
        # -|- Трудозатраты (нормо-часов).............. | 21
        # -|- Трудозатраты, дом (нормо-часов)......... | 53
        # -|1 Полевые работы (нормо-часов)............ | 16
        # -|2 Хозяйственные работы (нормо-часов)...... | 2
        # -|2 Хозяйственные работы, дом (нормо-часов). | 28
        # -|3 Обработка пищи, дом (нормо-часов)....... | 9
        # -|4 Приготовление пищи, дом (нормо-часов)... | 17
        # -|5 Транспортировка (нормо-часов)........... | 3
        'Компот гранатово-яблочный с имбирем (грамм)':200,
        'Чурчхела с грецкими орехами (грамм)':10 * 2,
        'Чурчхела с миндалем (грамм)':10 * 2,
        '||Питьё холодное (200-грамм/порция)':1,
        '||Сладости (10-грамм/порция)':4,
        }

metadict_detail['Южноморское осеннее праздничное питьё v3'] = {
        # ----Калорийность пищи (килокалорий)......... | 281
        # +-| Энергия затраченная (МДж)............... | 5,232
        # +-| Энергия полезная (МДж).................. | 2,238
        # --| Энергия на готовку (МДж)................ | 2,366
        # -|$ Продукция, стоимость (бит).............. | 5
        # -|- Трудозатраты (нормо-часов).............. | 18
        # -|- Трудозатраты, дом (нормо-часов)......... | 36
        # -|1 Полевые работы (нормо-часов)............ | 14
        # -|2 Хозяйственные работы, дом (нормо-часов). | 3
        # -|3 Обработка пищи, дом (нормо-часов)....... | 2
        # -|4 Приготовление пищи, дом (нормо-часов)... | 31
        # -|5 Транспортировка (нормо-часов)........... | 3
        'Компот из свежей вишни (грамм)':200 * 2,
        '||Питьё холодное (200-грамм/порция)':2,
        }

#----
# Южноморский рацион (зима):
    # Декабрь, январь, февраль

metadict_detail['Южноморский зимний повседневный завтрак'] = {
        # ----Калорийность пищи (килокалорий)......... | 757
        # +-| Энергия затраченная (МДж)............... | 3,462
        # +-| Энергия полезная (МДж).................. | 1,599
        # --| Энергия на готовку (МДж)................ | 1,040
        # -|$ Продукция, стоимость (бит).............. | 9
        # -|- Трудозатраты (нормо-часов).............. | 32
        # -|- Трудозатраты, дом (нормо-часов)......... | 69
        # -|1 Полевые работы (нормо-часов)............ | 23
        # -|2 Хозяйственные работы (нормо-часов)...... | 1
        # -|2 Хозяйственные работы, дом (нормо-часов). | 6
        # -|3 Обработка пищи (нормо-часов)............ | 2
        # -|3 Обработка пищи, дом (нормо-часов)....... | 10
        # -|4 Приготовление пищи, дом (нормо-часов)... | 52
        # -|5 Транспортировка (нормо-часов)........... | 6
        'Лепёшки кукурузные (грамм)':50 * 2,
        'Рис тушёный с чечевицей и луком (грамм)':200,
        'Батат печёный дольками (грамм)':100,
        'Салат морковный с соевым соусом (грамм)':100,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        '||Блюдо второе холодное (100-грамм/порция)':1,
        }

metadict_detail['Южноморский зимний повседневный обед'] = {
        # ----Калорийность пищи (килокалорий)......... | 741
        # +-| Энергия затраченная (МДж)............... | 7,405
        # +-| Энергия полезная (МДж).................. | 3,314
        # --| Энергия на готовку (МДж)................ | 1,459
        # -|$ Продукция, стоимость (бит).............. | 12
        # -|- Трудозатраты (нормо-часов).............. | 47
        # -|- Трудозатраты, дом (нормо-часов)......... | 80
        # -|1 Полевые работы (нормо-часов)............ | 32
        # -|2 Хозяйственные работы (нормо-часов)...... | 3
        # -|2 Хозяйственные работы, дом (нормо-часов). | 11
        # -|3 Обработка пищи (нормо-часов)............ | 3
        # -|3 Обработка пищи, дом (нормо-часов)....... | 17
        # -|4 Приготовление пищи, дом (нормо-часов)... | 52
        # -|5 Транспортировка (нормо-часов)........... | 9
        'Рис варёный (грамм)':200,
        'Суп-пюре пряный фасолевый (грамм)':200,
        'Суп-лапша с морской капустой (грамм)':100,
        'Корень сельдерея печёный с соевым соусом (грамм)':100,
        'Капуста квашеная с соевым соусом (грамм)':100,
        '||Антреме горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (100-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        '||Блюдо второе холодное (100-грамм/порция)':1,
        }

metadict_detail['Южноморский зимний повседневный ужин'] = {
        # ----Калорийность пищи (килокалорий)......... | 609
        # +-| Энергия затраченная (МДж)............... | 3,216
        # +-| Энергия полезная (МДж).................. | 1,370
        # --| Энергия на готовку (МДж)................ | 926
        # -|$ Продукция, стоимость (бит).............. | 8
        # -|- Трудозатраты (нормо-часов).............. | 29
        # -|- Трудозатраты, дом (нормо-часов)......... | 46
        # -|1 Полевые работы (нормо-часов)............ | 20
        # -|2 Хозяйственные работы (нормо-часов)...... | 1
        # -|2 Хозяйственные работы, дом (нормо-часов). | 6
        # -|3 Обработка пищи (нормо-часов)............ | 2
        # -|3 Обработка пищи, дом (нормо-часов)....... | 7
        # -|4 Приготовление пищи, дом (нормо-часов)... | 34
        # -|5 Транспортировка (нормо-часов)........... | 6
        'Хлеб кукурузный домашний (грамм)':50 * 2,
        'Каша пшённая с чечевицей (грамм)':200,
        'Пюре тыквенное (грамм)':200,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе холодное (200-грамм/порция)':1,
        }

metadict_detail['Южноморское зимнее повседневное питьё v1'] = {
        # ----Калорийность пищи (килокалорий)......... | 338
        # +-| Энергия затраченная (МДж)............... | 1,612
        # +-| Энергия полезная (МДж).................. | 726
        # --| Энергия на готовку (МДж)................ | 584
        # -|$ Продукция, стоимость (бит).............. | 5
        # -|- Трудозатраты (нормо-часов).............. | 17
        # -|- Трудозатраты, дом (нормо-часов)......... | 12
        # -|1 Полевые работы (нормо-часов)............ | 14
        # -|2 Хозяйственные работы, дом (нормо-часов). | 3
        # -|3 Обработка пищи, дом (нормо-часов)....... | 4
        # -|4 Приготовление пищи, дом (нормо-часов)... | 6
        # -|5 Транспортировка (нормо-часов)........... | 2
        'Чай чёрный (грамм)':200 * 2,
        'Крендельки в сахарной глазури (грамм)':50,
        'Фисташки обжаренные (грамм)':10 * 2,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка жареная (50-грамм/порция)':1,
        '||Орешки (10-грамм/порция)':2,
        }

metadict_detail['Южноморское зимнее повседневное питьё v2'] = {
        # TODO: Добавь пирожки самса, samosa.
        # ----Калорийность пищи (килокалорий)......... | 72
        # +-| Энергия затраченная (МДж)............... | 90
        # +-| Энергия полезная (МДж).................. | 84
        # -|$ Продукция, стоимость (бит).............. | 4
        # -|- Трудозатраты (нормо-часов).............. | 20
        # -|- Трудозатраты, дом (нормо-часов)......... | 13
        # -|1 Полевые работы (нормо-часов)............ | 17
        # -|3 Обработка пищи, дом (нормо-часов)....... | 10
        # -|4 Приготовление пищи, дом (нормо-часов)... | 3
        # -|5 Транспортировка (нормо-часов)........... | 2
        'Сидр грушевый (грамм)':200,
        '||Питьё холодное (200-грамм/порция)':1,
        #'||Выпечка жареная (50-грамм/порция)':1,
        }

metadict_detail['Южноморское зимнее повседневное питьё v3'] = {
        # ----Калорийность пищи (килокалорий)......... | 209
        # +-| Энергия затраченная (МДж)............... | 1,460
        # +-| Энергия полезная (МДж).................. | 644
        # --| Энергия на готовку (МДж)................ | 293
        # -|$ Продукция, стоимость (бит).............. | 6
        # -|- Трудозатраты (нормо-часов).............. | 15
        # -|- Трудозатраты, дом (нормо-часов)......... | 19
        # -|1 Полевые работы (нормо-часов)............ | 13
        # -|2 Хозяйственные работы, дом (нормо-часов). | 3
        # -|3 Обработка пищи, дом (нормо-часов)....... | 4
        # -|4 Приготовление пищи, дом (нормо-часов)... | 11
        # -|5 Транспортировка (нормо-часов)........... | 1
        'Чай чёрный с мёдом (грамм)':200 * 2,
        'Темпе обжаренный (грамм)':50,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка жареная (50-грамм/порция)':1,
        }

metadict_detail['Южноморский зимний праздничный завтрак'] = {
        # ----Калорийность пищи (килокалорий)......... | 736
        # +-| Энергия затраченная (МДж)............... | 4,550
        # +-| Энергия полезная (МДж).................. | 2,043
        # --| Энергия на готовку (МДж)................ | 1,030
        # -|$ Продукция, стоимость (бит).............. | 10
        # -|- Трудозатраты (нормо-часов).............. | 36
        # -|- Трудозатраты, дом (нормо-часов)......... | 79
        # -|1 Полевые работы (нормо-часов)............ | 26
        # -|2 Хозяйственные работы (нормо-часов)...... | 2
        # -|2 Хозяйственные работы, дом (нормо-часов). | 8
        # -|3 Обработка пищи (нормо-часов)............ | 2
        # -|3 Обработка пищи, дом (нормо-часов)....... | 13
        # -|4 Приготовление пищи, дом (нормо-часов)... | 58
        # -|5 Транспортировка (нормо-часов)........... | 7
        'Хлеб пшеничный домашний (грамм)':50 * 2,
        'Рис обжаренный с консервированными овощами (грамм)':200,
        'Суп-лапша с бататом и солёными томатами (грамм)':100,
        'Вёшенки обжаренные с соевым соусом (грамм)':100,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (100-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        }

metadict_detail['Южноморский зимний праздничный обед'] = {
        # ----Калорийность пищи (килокалорий)......... | 1,130
        # +-| Энергия затраченная (МДж)............... | 8,292
        # +-| Энергия полезная (МДж).................. | 3,685
        # --| Энергия на готовку (МДж)................ | 1,977
        # -|$ Продукция, стоимость (бит).............. | 20
        # -|- Трудозатраты (нормо-часов).............. | 73
        # -|- Трудозатраты, дом (нормо-часов)......... | 99
        # -|1 Полевые работы (нормо-часов)............ | 54
        # -|2 Хозяйственные работы (нормо-часов)...... | 3
        # -|2 Хозяйственные работы, дом (нормо-часов). | 12
        # -|3 Обработка пищи (нормо-часов)............ | 5
        # -|3 Обработка пищи, дом (нормо-часов)....... | 22
        # -|4 Приготовление пищи, дом (нормо-часов)... | 65
        # -|5 Транспортировка (нормо-часов)........... | 11
        'Шарики нутовые жареные во фритюре (грамм)':25 * 5,
        'Рис варёный с соевым соусом (грамм)':200,
        'Пюре гороховое с пряностями (грамм)':200,
        'Суп-пюре пряный нутово-томатный (грамм)':100,
        'Корень сельдерея жареный брусками во фритюре (грамм)':100,
        'Паста морковно-чесночная (грамм)':25,
        '||Выпечка жареная (25-грамм/порция)':5,
        '||Антреме горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (100-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        '||Соус холодный (25-грамм/порция)':1,
        }

metadict_detail['Южноморский зимний праздничный ужин'] = {
        # ----Калорийность пищи (килокалорий)......... | 581
        # +-| Энергия затраченная (МДж)............... | 2,272
        # +-| Энергия полезная (МДж).................. | 1,043
        # --| Энергия на готовку (МДж)................ | 527
        # -|$ Продукция, стоимость (бит).............. | 9
        # -|- Трудозатраты (нормо-часов).............. | 35
        # -|- Трудозатраты, дом (нормо-часов)......... | 53
        # -|1 Полевые работы (нормо-часов)............ | 28
        # -|2 Хозяйственные работы, дом (нормо-часов). | 6
        # -|3 Обработка пищи (нормо-часов)............ | 1
        # -|3 Обработка пищи, дом (нормо-часов)....... | 5
        # -|4 Приготовление пищи, дом (нормо-часов)... | 43
        # -|5 Транспортировка (нормо-часов)........... | 5
        'Хлеб пшеничный домашний (грамм)':50 * 2,
        'Картофель тушёный с оливками и лимоном (грамм)':200,
        'Айва тушёная с мёдом и красным вином (грамм)':100,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Десерт холодный (100-грамм/порция)':1,
        }

metadict_detail['Южноморское зимнее праздничное питьё v1'] = {
        # ----Калорийность пищи (килокалорий)......... | 291
        # +-| Энергия затраченная (МДж)............... | 4,650
        # +-| Энергия полезная (МДж).................. | 2,011
        # --| Энергия на готовку (МДж)................ | 1,925
        # -|$ Продукция, стоимость (бит).............. | 4
        # -|- Трудозатраты (нормо-часов).............. | 13
        # -|- Трудозатраты, дом (нормо-часов)......... | 27
        # -|1 Полевые работы (нормо-часов)............ | 9
        # -|2 Хозяйственные работы, дом (нормо-часов). | 5
        # -|3 Обработка пищи, дом (нормо-часов)....... | 11
        # -|4 Приготовление пищи, дом (нормо-часов)... | 10
        # -|5 Транспортировка (нормо-часов)........... | 3
        'Чай чёрный с лимоном (грамм)':200 * 2,
        'Лепёшки рисовые с айвовым сиропом (грамм)':50 * 2,
        'Желе виноградное (грамм)':100,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка жареная (50-грамм/порция)':2,
        '||Десерт холодный (100-грамм/порция)':1,
        }

metadict_detail['Южноморское зимнее праздничное питьё v2'] = {
        # ----Калорийность пищи (килокалорий)......... | 392
        # +-| Энергия затраченная (МДж)............... | 5,195
        # +-| Энергия полезная (МДж).................. | 2,020
        # --| Энергия на готовку (МДж)................ | 1,521
        # -|$ Продукция, стоимость (бит).............. | 6
        # -|- Трудозатраты (нормо-часов).............. | 15
        # -|- Трудозатраты, дом (нормо-часов)......... | 32
        # -|1 Полевые работы (нормо-часов)............ | 10
        # -|2 Хозяйственные работы (нормо-часов)...... | 1
        # -|2 Хозяйственные работы, дом (нормо-часов). | 5
        # -|3 Обработка пищи, дом (нормо-часов)....... | 14
        # -|4 Приготовление пищи, дом (нормо-часов)... | 13
        # -|5 Транспортировка (нормо-часов)........... | 3
        'Кофе с шоколадом (грамм)':200,
        'Темпе запечённый с сахаром (грамм)':100,
        '||Питьё холодное (200-грамм/порция)':1,
        '||Десерт холодный (100-грамм/порция)':1,
        }

metadict_detail['Южноморское зимнее праздничное питьё v3'] = {
        # ----Калорийность пищи (килокалорий)......... | 256
        # +-| Энергия затраченная (МДж)............... | 5,503
        # +-| Энергия полезная (МДж).................. | 2,367
        # --| Энергия на готовку (МДж)................ | 2,385
        # -|$ Продукция, стоимость (бит).............. | 6
        # -|- Трудозатраты (нормо-часов).............. | 23
        # -|- Трудозатраты, дом (нормо-часов)......... | 13
        # -|1 Полевые работы (нормо-часов)............ | 19
        # -|2 Хозяйственные работы (нормо-часов)...... | 1
        # -|2 Хозяйственные работы, дом (нормо-часов). | 3
        # -|3 Обработка пищи, дом (нормо-часов)....... | 3
        # -|4 Приготовление пищи, дом (нормо-часов)... | 8
        # -|5 Транспортировка (нормо-часов)........... | 4
        'Компот из сухофруктов с красным вином (грамм)':200 * 2,
        '||Питьё холодное (200-грамм/порция)':2,
        }
