#----
# Железнодорожные инструменты (дистанции пути):

metadict_detail['Оборудование дистанции пути'] = {
        # TODO:
            # Не используется.
            # Да и не допилено, слишком современно для понях.
        # https://ru.wikisource.org/wiki/ЭСБЕ/Мастерские_железнодорожные
        'Тяжёлые машины дистанции пути':1,
        'Средства механизации путевых работ':1,
        'Контрольно-измерительные приборы дистанции пути':1,
        'Цеховое оборудование дистанции пути':1,
        'Оборудование малярного цеха':1,
        }

metadict_detail['Тяжёлые машины дистанции пути'] = {
        # TODO:
            # Маневровые локомотивы относятся к станциям.
        '|Дрезина (грузовая)':2,
        '|Дрезина (стреловой кран)':1,
        '|Кран железнодорожный козловой (10 тонн)':1,
        '|Кран железнодорожный портальный (для перевозки рельсов)':1,
        '|Дренажная машина железнодорожная':1,
        '|Локомотив маневровый':1,
        }

metadict_detail['Средства механизации путевых работ'] = {
        # http://www.tdesant.ru/info/item/6
        '|Домкрат винтовой (10 тонн)':10,
        '|Компрессор винтовой (30 кВт)':2,
        '|Домкрат гидравлический (20 тонн)':4,
        '|Насос для водоотлива механический':2,
        '|Молоток клепальный пневматический (2 кВт)':2,
        '|Перфоратор пневматический (1.5 кВт)':2,
        '|Бетонолом пневматический (2 кВт)':2,
        '|Дрель пневматическая (0.5 кВт)':1,
        '|Растворомешалка механическая':1,
        '|Бетономешалка механическая':1,
        }

metadict_detail['Контрольно-измерительные приборы дистанции пути'] = {
        '|Штангенциркуль (для измерения износа стрелочного перевода)':1,
        '|Тележка (для измерения волнообразного износа рельсов)':1,
        '|Термометр (для измерения температуры рельсов)':1,
        '|Прибор оптический (для рихтовки пути)':1,
        '|Шаблон КОР (для стрелочных переводов)':1,
        '|Скоба (для измерения износа рельс)':1,
        '|Тележка путеизмерительная':1,
        '|Шаблон путеизмерительный':1,
        '|Теодолит':1,
        '|Нивелир':1,
        }

metadict_detail['Цеховое оборудование дистанции пути'] = {
        # TODO:
            # Хорошая такая механическая мастерская.
            # Слишком хорошая для 19 века маленьких поняш.
            # Да нормально. Все эти упряжные грейдеры, скреперы, хай-тек телеги.
        # ЛТ-10 Станок токарно-винторезный универсальный
        # http://stanki-katalog.ru/sprav_lt10.htm
        # 2Г125 станок вертикально-сверлильный универсальный одношпиндельный
        # http://stanki-katalog.ru/sprav_2g125.htm
        '|Станок заточный (1 кВт)':2,
        '|Станок токарно-винторезный (3 кВт)':2,
        '|Станок поперечно-строгальный (7 кВт)':1,
        '|Станок универсально-фрезерный (3 кВт)':1,
        '|Станок универсально-шлифовальный (3 кВТ)':1,
        '|Станок вертикально-сверлильный (25 мм) (3 кВт)':2,
        '|Станок вертикально-сверлильный (75 мм) (12 кВт)':1,
        '|Молот ковочный пневматический (15 кВт)':2,
        '|Пресс гидравлический (40 тонн)':1,
        '|Лебёдка (0.5 тонны)':1,
        '|Таль (0.5 тонны)':1,
        }

metadict_detail['Оборудование малярного цеха'] = {
        '|Краскопульт':1,
        '|Моечная машина':1,
        '|Красконагнетательный бак':1,
        '|Краскораспылитель пневматический':1,
        '|Компрессор винтовой (30 кВт)':1,
        }

#----
# Железнодорожные инструменты (монтажной бригады):

metadict_detail['||Инструменты железнодорожника (комплект)'] = {
        # Бригада, это мобильное подразделение дистанции пути (ПЧ).
        'Инструменты железнодорожника (комплект бригады)':1 / 12,
        }

metadict_detail['Инструменты железнодорожника (комплект бригады)'] = {
        'Инструменты путевые (комплект бригады)':1,
        'Измерительные приборы путевые (комплект бригады)':1,
        'Инструменты путевые механизированные (комплект бригады)':1,
        'Инструменты для земляных работ (комплект бригады)':1,
        'Инструменты уборщика (комплект бригады)':1,
        'Инструменты слесаря (комплект бригады)':1,
        'Инструменты столяра (комплект бригады)':1,
        }

metadict_detail['Инструменты путевые (комплект бригады)'] = {
        # http://www.tdesant.ru/info/item/6
        '|Клещи шпальные':8,
        '|Шпалоноска':8,
        '|Лом лапчатый':8,
        '|Лом остроконечный':8,
        '|Молоток костыльный':8,
        '|Кувалда (5 килограмм)':1,
        '|Ключ путевой рожковый':8,
        '|Шпалоподбойка торцовая':10,
        '|Скоба (для перегонки шпал)':8,
        '|Дексель (для затёски шпал)':4,
        '|Ключ торцовый (гаечный)':10,
        '|Ключ торцовый (шурупный)':4,
        '|Наддёргиватель путевых костылей':10,
        '|Прибор стяжной (для перешивки пути)':2,
        '|Струбница (для стягивания накладок)':4,
        }

metadict_detail['Инструменты путевые механизированные (комплект бригады)'] = {
        '|Домкрат винтовой (10 тонн)':10,
        '|Станок рельсорезный (1.5 кВт)':1,
        '|Станок рельсосверлильный (1.5 кВт)':1,
        '|Станок рельсошлифовальный (1 кВт)':1,
        '|Путевой ключ механичесикй (0.4 кВт)':1,
        '|Шуруповёрт механический (1.7 кВт)':1,
        '|Пила механическая цепная (2 кВт)':2,
        '|Шпалоподбойка пневматическая (0.4 кВт)':1,
        '|Дрель пневматическая (0.5 кВт)':1,
        '|Компрессор винтовой (30 кВт)':2,
        '|Рихтовщик гидравлический':7,
        '|Разгонщик гидравлический':1,
        }

metadict_detail['Инструменты для земляных работ (комплект бригады)'] = {
        '|Вилы щебёночные':10,
        '|Когти для щебня':4,
        '|Трамбовка простая':3,
        '|Кирка остроконечная':12,
        '|Кружка мерная (для суфляжа)':2,
        '|Лопата штыковая':20,
        '|Лопата совковая':15,
        '|Лопата деревянная':25,
        '|Лопата суфляжная':4,
        }

metadict_detail['Инструменты слесаря (комплект бригады)'] = {
        # TODO:
            # Допиливай:
            # Колхозный кузнец с квалификацией слесаря, жестянщика и медника
            # http://sinref.ru/000_uchebniki/03400metalurg/002_kolhozni_kuznec_medvukov_1958/000.htm
        '|Коловорот (по металлу)':4,
        '|Напильник трёхгранный (150 мм)':1,
        '|Клещи обыкновенные':1,
        '|Молоток слесарный':1,
        '|Зубило кузнечное':6,
        }

metadict_detail['Инструменты столяра (комплект бригады)'] = {
        # TODO:
            # Допиливай, вот список инструментов:
        # https://ru.wikisource.org/wiki/ЭСБЕ/Столярное_дело
        '|Коловорот (по дереву)':2,
        '|Зубило слесарное':4,
        '|Топор плотничий':4,
        '|Пила поперечная':3,
        '|Пила-ножовка':1,
        '|Рубанок':1,
        '|Долото':1,
        '|Стаместка':1,
        }

metadict_detail['Инструменты уборщика (комплект бригады)'] = {
        # TODO:
            # Вообще-то это для работы железнодорожников
        '|Ёмкость бондарная (ведро 10-литровое, 35x27x27-см)':6,
        '|Метла':2,
        }

metadict_detail['Измерительные приборы путевые (комплект бригады)'] = {
        '|Прозорник стыковой':1,
        '|Прозорник-прокладка':2,
        '|Угольник путевой (для проверки стыков)':2,
        '|Линейка метровая (для измерения неровностей рельсов)':1,
        '|Визирки (для определения величины просадок)':1,
        '|Зеркало (для осмотра рельсов)':4,
        '|Молоток (для остукивания рельсов)':2,
        '|Лупа (для осмотра рельсов)':4,
        '|Рулетка (30 метров)':1,
        '|Метр металлический':1,
        '|Обводной привод':1,
        '|Щуп (комплект)':2,
        '|Бинокль':1,
        }

#----
# Утварь домашняя:

metadict_detail['|Утварь кухонная (комплект)'] = {
        # http://www.molohovetc.ru/liv-ii/dinner_table/
        # http://www.molohovetc.ru/liv-ii/accessories/
        'Инструменты печные (комплект)':1,
        'Инструменты кухонные (комплект)':1,
        'Ёмкости кухонные (комплект)':1,
        'Приборы столовые (комплект)':1,
        }

metadict_detail['Инструменты печные (комплект)'] = {
        # - два ухвата для чугунков разных размеров.
        # - Лопата для выпечки, испекаемой на поду.
        # - Горшок для углей.
        # https://totmafermer.com/2018/10/01/инвентарь-для-русской-печи/
        '|Инструмент чугунный литой (ухват)':2,
        '|Инструмент чугунный литой (кочерга)':1,
        '|Инструмент чугунный литой (сковородник)':1,
        '|Инструмент чугунный литой (мангал 45x30-см)':1 / 4,
        '|Инструмент железный кованый (щипцы для дров)':1,
        '|Инструмент деревянный шлифованный (совок печной)':1,
        '|Инструмент деревянный шлифованный (лопата печная)':1,
        '|Инструмент плетёный мочальный (метёлка печная)':1,
        '|Посуда керамическая (горшок печной 10-литровый)':1,
        }

metadict_detail['Инструменты кухонные (комплект)'] = {
        # - сито для муки
        # - решето рогожное для мытья
        # - Две доски 40x60 для овощей
        # - Доска 60x75 для теста
        # - венчик для мытья овощей
        '|Утварь текстильная (сито)':1,
        '|Утварь текстильная (решето)':1,
        '|Утварь текстильная (полотенце 40x60 вафельное)':4,
        '|Посуда керамическая (ступа 5-литровая, 25x25x12-см)':1 / 4,
        '|Механизм стальной кованый (пресс-пюре)':1 / 2,
        '|Механизм винтовой (жернова кухонные, 1-кг/час)':1 / 4,
        '|Инструмент деревянный шлифованный (доска 40x60x3-см кухонная)':2,
        '|Инструмент деревянный шлифованный (доска 60x75x3-см кухонная)':1 / 2,
        '|Инструмент деревянный долблёный (скалка)':1 / 2,
        '|Инструмент деревянный долблёный (лопатка)':3,
        '|Инструмент стальной кованый (нож-овощечистка)':1,
        '|Инструмент стальной кованый (ножницы, 10-см)':1,
        '|Инструмент стальной кованый (тесак, 20-см)':1,
        '|Инструмент стальной кованый (нож, 10-см)':2,
        '|Инструмент стальной кованый (нож, 6-см)':1,
        '|Инструмент жестяной штампованный (ложка мерная)':1,
        '|Инструмент жестяной штампованный (тёрка кухонная)':1,
        '|Инструмент жестяной штампованный (воронка кухонная)':1,
        '|Инструмент жестяной штампованный (дуршлаг 0.25-литровый)':1,
        '|Инструмент жестяной штампованный (шумовка 0.125-литровая)':1,
        '|Инструмент жестяной штампованный (половник 0.125-литровый)':1,
        '|Инструмент деревянный долблёный (половник 0.25-литровый)':2,
        '|Инструмент плетёный мочальный (венчик)':2,
        }

metadict_detail['Ёмкости кухонные (комплект)'] = {
        # - кадки -- квашня для теста и ёмкость для воды.
        # - таз эмалированный -- варка варенья и уваривание фруктов.
        '|Ёмкость бондарная (кадка 50-литровая, 48x45x45-см)':2,
        '|Ёмкость бондарная (ведро 10-литровое, 35x27x27-см)':2,
        '|Посуда деревянная долблёная (ковш 5-литровый)':1,
        '|Посуда деревянная долблёная (ковш 1-литровый)':1,
        '|Посуда керамическая (миска 5-литровая)':2,
        '|Посуда керамическая (миска 3-литровая)':2,
        '|Посуда керамическая (кувшин 5-литровый)':1,
        '|Посуда керамическая (кувшин 3-литровый)':1,
        '|Посуда керамическая (чайник 1-литровый)':1 / 2,
        '|Посуда керамическая (кофейник 1-литровый)':1 / 4,
        '|Посуда керамическая (горшок печной 5-литровый)':1,
        '|Посуда керамическая (горшок печной 3-литровый)':2,
        '|Посуда керамическая (горшок печной 1-литровый)':1,
        '|Посуда чугунная литая (котёл 25-литровый)':1,
        '|Посуда чугунная литая (котелок 10-литровый)':1,
        '|Посуда чугунная литая (чугунок эмалированный 5-литровый)':1 / 2,
        '|Посуда чугунная литая (чугунок 3-литровый)':1,
        '|Посуда чугунная литая (чугунок 1-литровый)':1 / 2,
        '|Посуда чугунная литая (сковорода 1-литровая)':1 / 4,
        '|Посуда чугунная литая (таз эмалированный 10-литровый)':1 / 4,
        '|Посуда жестяная штампованная (противень 12-литровый)':1 / 4,
        '|Посуда стальная никелированная (сотейник 2-литровый)':1 / 2,
        '|Посуда медная лужёная (самовар 5-литровый)':1,
        # Вместо форм используются чашки и миски.
        #'|Ёмкость жестяная кованая (форма для выпечки 2-литровая)':5,
        #'|Ёмкость жестяная кованая (форма для выпечки 0.5-литровая)':5,
        #'|Ёмкость жестяная кованая (форма для выпечки 0.125-литровая)':10,
        }

metadict_detail['Приборы столовые (комплект)'] = {
        '|Инструмент стальной кованый (нож столовый, 10-см)':1,
        '|Инструмент жестяной штампованный (ложка столовая)':1,
        '|Посуда деревянная долблёная (солонка 0.25-литровая)':1,
        '|Посуда деревянная долблёная (ковш 1-литровый)':1,
        '|Посуда керамическая (кувшин 3-литровый)':1,
        '|Посуда керамическая (кружка 0.5-литровая)':5,
        '|Посуда керамическая (чашка 0.25-литровая)':5,
        '|Посуда керамическая (миска 0.5-литровая)':5,
        }

#----
# Постельное бельё:

metadict_army['|Постельное бельё богатое (комплект)'] = {
        # https://ru.wikipedia.org/wiki/Стёганое_полотно
        # https://ru.wikipedia.org/wiki/Лоскутное_одеяло
        '|Бельё, подушка стёганная (вата)':1,
        '|Бельё, одеяло стёганное (вата)':1,
        '|Бельё, простыня махровая (хлопок)':1,
        '|Бельё, матрац стёганный (вата)':1,
        }

metadict_army['|Постельное бельё простое (комплект)'] = {
        '|Бельё, одеяло лоскутное (вата)':1,
        '|Бельё, простыня (парусина)':1 / 2,
        '|Бельё, простыня (хлопок)':1 / 2,
        '|Бельё, чехол тюфяка (мешковина)':1,
        }

#----
# Одежда:

metadict_detail['|Одежда богатая зимняя (комплект)'] = {
        '|Одежда, шапка (хлопок)':1,
        '|Одежда, плащ (хлопок)':1,
        '|Одежда, бушлат (хлопок)':1,
        '|Одежда, чулки (хлопок)':1,
        '|Обувь, ботинки (кирза)':1,
        }

metadict_detail['|Одежда богатая летняя (комплект)'] = {
        '|Одежда, шляпа (хлопок)':1,
        '|Одежда, пиджак (хлопок)':1,
        '|Одежда, жилет (хлопок)':1,
        '|Одежда, жакет (хлопок)':1,
        '|Одежда, платье (хлопок)':1,
        '|Обувь, туфли (кирза)':1,
        }

metadict_detail['|Одежда простая зимняя (комплект)'] = {
        '|Одежда, плащ (брезент)':1,
        '|Одежда, пальто (хлопок)':1,
        '|Одежда, чулки (хлопок)':1,
        '|Обувь, туфли (джут)':1,
        '|Обувь, галоши (резина)':1,
        }

metadict_detail['|Одежда простая летняя (комплект)'] = {
        '|Одежда, шляпа (солома)':1,
        '|Одежда, чепчик (хлопок)':1,
        '|Одежда, ветровка (брезент)':1,
        '|Одежда, жилет (парусина)':1,
        '|Обувь, туфли (джут)':1,
        }
