#----
# Ценность продуктов и их распределение (Германия):
    # Германия 1896 года, 52.5 млн. населения
    # Национальный доход (оценочно) -- 33 140 млрд. марок (631 м/чел, 292 руб/чел)
    # Национальный доход (Мелгалл, уточнить) -- 21 000 млрд. марок (400 м/чел, 184 руб/чел)
    # Национальное состояние (капиталы) -- 125 000 млн. марок (2381 м/чел, 1102 руб/чел)
    # https://istmat.org/node/27529
    # https://ru.wikisource.org/wiki/ЭСБЕ/Цена
    # https://ru.wikisource.org/wiki/ЭСБЕ/Германия
    # * Марка = 0.463 золотого рубля 1897 года = 0.358 грамма золота.
    # * Цены в марках/кг, сумма в миллионах марок. Цены розничные.
    # | Пищевые продукты                 | количество (кг) | на человека  | цена м/кг | сумма (млн м)
    # | -------------------------------- | --------------- | ------------ | --------- | -----------
    # | Хлеб (2/3 пшеничный, 1/3 ржаной) | 10 000 млн.     | 191 кг       | 0.32      | 3 200
    # | Мясо (говядина)                  |  6 000 млн.     | 114 кг       | 1.30      | 7 800
    # | Поваренная и столовая соль       |    560 млн.     |  11 кг       | 0.18      |   100
    # | Масло (сливочное)                |  1 000 млн.     |  19 кг       | 2.2       | 2 200
    # | Сыр                              |    300 млн.     |   6 кг       | 1.5       |   450
    # | Столовый картофель               |  9 000 млн.     | 171 кг       | 0.06      |   540
    # | Спирт                            |    300 млн.     |   6 кг       | 2.0       |   600
    # | Вино                             |  1 000 млн.     |  19 кг       | 0.6       |   600
    # | Пиво                             | 12 000 млн.     | 229 кг       | 0.25      | 3 000
    # | Свежее молоко                    |    300 млн.     |   6 кг       | 0.12      |   360
    # Всего: 18 850 млн. марок
    # 
    # | Колониальные продукты (импорт)   | количество (кг) | на человека  | цена м/кг | сумма (млн м)
    # | -------------------------------- | --------------- | ------------ | --------- | -----------
    # | Кофе                             |    500 млн.     |  10 кг       | 2.5       | 1 250
    # | Табак                            |    100 млн.     |   2 кг       | 5.0       |   500
    # | Какао, ваниль и т.д.             | -               | -            | -         |   100
    # | Фрукты                           | -               | -            | -         |   200
    # Всего: 2 050 млн. марок
    # 
    # | Одежда                           | количество      | на человека  | цена м/кг | сумма (млн м)
    # | -------------------------------- | --------------- | ------------ | --------- | -----------
    # | Костюмы шерстяные                |     53 млн. шт. |  1 штук      | 40        | 2 100
    # | Костюмы полушерстяные            |     53 млн.     |  1           | 30        | 1 600
    # | Пальто                           |     53 млн.     |  1           | 30        | 1 600
    # | Бельё (рубахи и панталоны)       |    400 млн.     |  8           | -         | 1 600
    # | Полотенца и постельное бельё     |     60 млн. кг. |  1.1 кг      | -         | -    
    # | Обувь                            |    150 млн. кг. |  2.9 кг      | 6.7       | 1 000
    # Всего: 7 900 млн. марок
    # 
    # | Промышленность                   | количество      | на человека  | цена м/кг | сумма (млн м)
    # | -------------------------------- | --------------- | ------------ | --------- | -----------
    # | Газовое отопление и печи         | 22 000 млн. м³  | 420 м³       | 0.025     |   550
    # | Мыло и стеариновые свечи         |    650 млн. кг. | 12.4 кг      | 0.77      |   500
    # | Сода                             |    221 млн. кг. |  4.2 кг      | -         | -    
    # | Писчая бумага                    |    270 млн. кг. |  5.1 кг      | 0.38      |   100
    # | Стеклянные изделия               | -               | -            | -         |   100
    # Всего: 1 250 млн. марок
    # 
    # | Транспорт и связь                | количество      | на человека  | цена м/кг | сумма (млн м)
    # | -------------------------------- | --------------- | ------------ | --------- | -----------
    # | Железнодорожные билеты (1989 г.) | 377 млн шт.     | 7.2          | 2.26      |   850
    # | Пароходное сообщение             | -               | -            | -         |   100
    # | Почта и телеграф                 | -               | -            | -         |   250
    # Всего: 1 200 млн. марок
    # 
    # | Горнозаводская пром. (1890 год)  | количество      | на человека  | цена м/кг | сумма (млн м)
    # | -------------------------------- | --------------- | ------------ | --------- | -----------
    # | Каменный уголь                   | 70 200 млн. кг. | 1300 кг.     | -         | -
    # | Бурый уголь (лигнит)             | 19 000          |  360         | -         | -
    # | Железная руда                    | 11 410          |  220         | -         | -
    # | Цинковая руда                    |    700          |   13         | -         | -
    # | Свинцовая руда                   |    170          |    3         | -         | -
    # | Медная руда                      |    600          |   11         | -         | -
    # | Каменная соль                    |    560          |   11         | -         | -
    # | Калиевые соли                    |  1 175          |   22         | -         | -
    # | Другие минералы                  |    271          |    5         | -         | -
    # Всего: 726 млн. марок
    # 
    # | Добыча и выплавка (1889 год)     | количество      | на человека  | цена м/кг | сумма (млн м)
    # | -------------------------------- | --------------- | ------------ | --------- | -----------
    # | Чугун                            |  4 525 млн. кг. |   86.0 кг.   | 0.05      |   217
    # | Цинк                             |    136          |    2.6       | 0.31      |    42
    # | Свинец                           |    101          |    1.9       | 0.26      |    26
    # | Медь                             |     25          |    0.5       | 1.12      |    28
    # | Сера и серная кислота            |    482          |    9.2       | 0.08      |    45
    # | Серебро                          |      0.4        |    7.6 г.    | 62.5      |    25
    # | Золото                           |      0.002      | -            | 2750      |     5.5
    # | Никеля, висмута, купороса и т.д. |     26          |    0.5       | -         |     9.6
    # Всего: 398 млн. марок
    # Карл Баллод "Государство будущего. Производство и потребление в социальном государстве"
    # https://istmat.org/node/27169

#----
# Ценность продуктов и их распределение (Россия):
    # Россия 1903 года (европейская часть), 116 млн. населения
    # Национальный доход, 1900 года (на 97 млн чел) -- 6 125 млн руб (64 руб/чел)
    # - Сельское хозяйство -- 2 738 млн руб.
    # - Лесоводство и рыболовство -- 325 млн руб.
    # - Добывающая и обрабатывающая промышленность -- 1 495 млн руб.
    # - Транспортное дело -- 531 млн руб.
    # - Строительное дело -- 473 млн руб.
    # - Торговля -- 562 млн руб.
    # https://istmat.org/node/24561
    # Торговля:
    # - Ярмарки (1911 год) -- 1 000 млн рублей (16 000 ярмарок, 63 тыс/ярмарку, 8 руб/человека)
    # 87% ярмарок (14 тыс) -- менее 10 тыс руб/год, розничные сельскохозяйственные, торжки
    # 12% ярмарок (1900) -- 10-100 тыс руб/год, средних размеров
    # 1% ярмарок (160) -- >100 тыс руб/год, оптовые
    # Национальное состояние (капиталы):
    # - 2 240 млн рублей банковских вкладов (1900 год)
    # - 5 270 млн рублей банковских вкладов (1914 год)
    #
    # Годовой сбор   | млн. четв. | млн. м³ | т/м³  | млн.т | кг/чел (1903) | кг/чел. (2014)
    # -------------- | ---------- | ------- | ----- | ----- | ------------- | ---------------
    # Рожь           | 123        | 25.8    | 0.71  | 18.2  | 157           | 22
    # Картофель      | 100        | 21      | 0.67  | 14.1  | 122           | 219
    # Овёс           | 97         | 20.4    | 0.43  | 8.8   | 76            | 37
    # Пшеница        | 48         | 10      | 0.78  | 7.8   | 67            | 415
    # Ячмень         | 33         | 7       | 0.60  | 4.2   | 36            | 142
    # Гречиха        | 9.5        | 2       | 0.66  | 1.3   | 11            | 4.6
    # Просо          | 8.9        | 1.9     | 0.78  | 1.5   | 13            | 3.4
    # Кукуруза       | 4.6        | 1       | 0.76  | 0.8   | 7             | 78.5
    # Горох          | 3.9        | 0.8     | 0.73  | 0.6   | 5             | 10.4
    # * четверть = 209.9 литров (0.21 кубометра)
    # Килограмм муки = 1.3 килограмма зерна
    # Пшеничной и ржаной муки в белый и черный хлеб соотношения 1:1.25 и 1:1.45
    # https://upload.wikimedia.org/wikipedia/commons/b/bc/Illustrated_map_of_European_Russia_(1903).jpeg
    # https://upload.wikimedia.org/wikipedia/commons/3/31/1903._Наглядная_карта_Европейской_России_03.jpg
    #
    # Годовое производство  | млн. пудов | млн. тонн | кг/человека
    # --------------------- | ---------- | --------- | -----------
    # Каменный уголь        | 747        | 12.3      | 90
    # Чугун                 | 136        | 2.2       | 16.2
    # Сталь                 | 98         | 1.6       | 11.8
    # Соль                  | 85         | 1.4       | 10.3
    # Железо                | 29         | 0.5       | 3.7
    # Медь                  | 0.43       | 0.007     | 0.05
    # Цинк                  | 0.35       | 0.006     | 0.044
    # * пуд = 16.38 килограмма (1/61 тонны)
    #
    # Годовое производство  | млн. пудов | млн. тонн | кг/человека
    # --------------------- | ---------- | --------- | -----------
    # Лён                   | 24.4       | 0.4       | 3.45
    # Пенька                | 12.2       | 0.2       | 1.72
    # Шерсть                | 8.0        | 0.13      | 1.12
    # Табак                 | 5.2        | 0.08      | 0.69
    # Хлопок                | 0.6        | 0.0098    | 0.085
    # Шёлк                  | 0.03       | 0.0005    | 0.0043
    #
    # Годовое производство  | млн. пудов | млн. тонн | кг/человека
    # --------------------- | ---------- | --------- | -----------
    # Нефть                 | 549        | 9.0       | 77
    # Сахар                 | 44         | 0.72      | 6
    # Смазочные масла       | 10         | 0.17      | 1.47
    # Растительные масла    | 1.5        | 0.025     | 0.22
    #
    # Годовое производство   | млн. вёдер | млн. литров | литров/человека
    # ---------------------- | ---------- | ----------- | ---------------
    # Пиво                   | 43         | 529         | 4.6
    # Спирт                  | 30         | 369         | 3.2
    # Виноградное вино       | 24         | 295         | 2.5
    # * ведро = 12.3 литра
    #
    # Хлебный экспорт Российской империи (средний показатель за 1892-1901 годы, 129 млн. человек):
    # Годовой экспорт   | млн. пудов | млн. тонн | кг/человека
    # ----------------- | ---------- | --------- | -----------
    # Пшеница           | 168        | 2.76      | 21.40
    # Ячмень            | 86         | 1.41      | 10.93
    # Рожь              | 64         | 1.05      | 8.14
    # Овёс              | 56         | 0.92      | 7.13
    # Кукуруза          | 19         | 0.31      | 2.40
    # Всего хлебов      | 393        | 6.49      | 50.31

#----
# Зарплаты (Российская империя, 1900-1914 годы),
    # Богатеи (0.42/2.1% населения/семей, 1000+ руб/год, 84+ руб/мес) -- 30% нац. дохода
        # Доходы (1905 г) | 1-2k р.  | 2-5k р.  | 5-10k р. | 10-20k р. | 20-50k р. | >50k р. | Всего (млн)
        # --------------- | -------- | -------- | -------- | --------- | --------- | ------- | -----------
        # Землевладельцы  |  24 004  |  20 380  |  8 375   |  4 148    | 2 007     |   707   |   355.6
        # Город. недвиж.  |  26 958  |  18 256  |  7 350   |  3 556    | 1 375     |   360   |   264.6
        # Денеж. капиталы |  27 321  |  18 171  |  5 713   |  2 570    | 1 128     |   333   |   239
        # Торгово-промыш. |  37 179  |  28 028  |  9 937   |  4 668    | 2 383     | 1 384   |   646.4
        # Личный труд     | 105 027  |  36 086  |  5 726   |  1 131    |   307     |    66   |   342.6
        # Всего (407 713) | 220 489  | 120 930  | 37 111   | 16 073    | 7 265     | 2 845   | 1 848.2
        # 1910г (696 700) | 396 500  | 216 100  | 52 000   | 19 900    | 8 700     | 3 500   | 2 644.7
        # Н.А. Рубакин "Россия в цифрах"
        # https://istmat.org/node/24561
    # Чиновники (1-8 классов, 21% чинов, 1000+ руб/год, 84+ руб/мес) -- 3% национального дохода
        # Доходы (1905 г) | 1-2k р.  | 2-5k р.  | 5-10k р. | 10-20k р. | 20-50k р. | >50k р. | Всего (млн)
        # --------------- | -------- | -------- | -------- | --------- | --------- | ------- | -----------
        # Число чинов.    | 66 775   | 23 116   | 1 981    | 282       | 40        | 10      | 91 204
        # От общего числа | 72.1%    | 25.3%    | 2.2%     | 0.3%      | 0.04%     | 0.01%   | 100%
        # Сумма зарплат   | 96.6 млн | 65.8 млн | 12.8 млн | 3.7 млн   | 1.13 млн  | 0.7 млн | 181 млн
        # Доля бюджета    | 53.5%    | 36.3%    | 7.1%     | 2.1%      | 0.6%      | 0.4%    | 100%
        # Всего чиновников -- 435 818 человек, у не учтённых 334 614 чинов 9-15 класса зарплаты учителей.
        # https://web.archive.org/web/20180830211348/http://vivovoco.astronet.ru/VV/PAPERS/MEN/PISAR_1.HTM
        # https://istmat.org/node/24427
    # Образование:
        # - средний оклад сельского учителя (1911 год) -- 28 рублей/месяц
            # в 1870-х -- 120−150 рублей/год
            # в 1880-х -- 150−200 рублей/год
            # в 1890-х -- 200−240 рублей/год
            # в 1900-х -- 250−300 рублей/год
            # к 1911 г -- 364 рублей/год
            # https://ru.wikipedia.org/wiki/Земская_школа
        # - оклад земского учителя начальной школы (1908 год) -- 30 рублей/месяц
        # - оклад земского учителя (после 5 лет службы) -- 37 рублей/месяц
        # - средний оклад городского учителя (1911 год) -- 37-44 рубля/месяц
        # - оклад учителя высших начальных училищ (средняя школа) -- 80 рублей/месяц
        # - оклад ординарного профессора Томского технологического института -- 375 рублей/месяц
            # - из этого оклада квартирных -- 87 рублей/месяц
            # - из этого оклада столовых -- 87 рублей/месяц
            # https://www.politforums.net/historypages/1525073158.html
        # - Московский университет 1895 года (4147 студентов, 233 преподавателя):
            # Бюджет -- 4.1 млн. рублей/год (987 рублей/студента)
            # Полное содержание в общежитии (расходы) -- 190 рублей/год (16 рублей/месяц)
            # Бесплатные обеды (расходы) -- 0.4 рубля/студента
            # Стипендии (12% студентов) -- 308 рублей/год (26 рублей/месяц)
            # https://ru.wikisource.org/wiki/ЭСБЕ/Московский_университет
        # - Казанский университет 1893 года (892 студентов, 109 преподавателей):
            # Бюджет -- 0.75 млн рублей (841 рублей/студента)
            # Стипендия (20% студентов) -- 226 рублей/год (19 рублей/месяц)
            # https://ru.wikisource.org/wiki/ЭСБЕ/Казанский_университет
        # - Расходы на образование (1911):
            # - начальная школа (1872 год) -- 3 рубля/ученика
            # - начальная школа (1904 год) -- 10 рублей/ученика
            # - начальная школа (1910 год) -- 14-17 рублей/ученика
            # - городское училище (1911 год, Киев) -- 27-38 рублей/ученика
            # - мужская гимназия (1911 год) -- 127 рублей/ученика
            # - женская гимназия (1911 год) -- 76 рублей/ученицу
            # - реальное училище (1911 год) -- 133 рублей/ученика
            # - ремесленная школа (1911 год) -- 142 рублей/ученика
            # - среднее техническое училище (1911 год) -- 211 рублей/ученика
    # Рабочие:
        # - средняя зарплата рабочего (1913 год) -- 21 рубль/месяц
        # Диапазон модальной заработной платы (1910 год):
        # - чернорабочий мужчина (Санкт-Петербург) -- 40-110 копеек/день (10-27.5 рублей/месяц)
        # - чернорабочий женщина (Санкт-Петербург) -- 25-80 копеек/день (6.25-20 рублей/месяц)
        # - чернорабочий мужчина (Вологда) -- 50-100 копеек/день (12.5-25 рублей/месяц)
        # - чернорабочий женщина (Вологда) -- 40-60 копеек/день (10 рублей/месяц)
        # - домашняя прислуга мужчина (Вологда) -- 12-70 рублей/месяц
        # - домашняя прислуга женщина (Вологда) -- 4-8 рублей/месяц
        # Центральный статистический комитет МВД -- "Города России в 1910 году"
    # Шахта (Урал, Решетский рудник, 1913 год)
        # Просеянная железная руда (45% железа) -- 1.25-1.56 рубля/кубометр
        # Добыча железной руды кирками -- 0.8 тонны/человеко-день
    # Шахта (Берёзовские промыслы, 1906 год)
        # - подённые работы, рассыпное золото -- 0.5-9.95 рублей/день (среднее 1.3 рубля/день)
        # - сдача рассыпного и рудного золота -- 640-680 рублей/килограмм (1.47-1.56 грамм/рубль)
        # Рубль (1897 года) = 0.774 грамма чистого золота (18 грамм серебра)
        # https://zolotodb.ru/article/11637/
    # Шахта (Сихоте-Алинь, Рудник Тетюхе, свинцово-цинковые руды, 1914 год):
        # - подённые работы на шахте, подземные (12 часов) -- 1.86 рубля/день
        # - подённые работы на шахте, поверхностные (12 часов) -- 1.49 рубля/день
        # - подённые работы на шахте, вспомогательные (12 часов) -- 1.26 рубля/день
        # Экспорт:
        # - Цинковые руды, галмея (обжиг, 55% цинка) -- 44.3 рубля/тонна
        # - Серебро-свинцовые руды (концентрат, 71% свинца, 4.5% цинк, 1.1 кг серебра) -- 1068 рублей/тонна
        # Себестоимость:
        # - Оплата труда к добытой руде -- 11 рублей/тонна
        # - Себестоимость руды -- 22.18 рублей (64% транспортировка)
        # 42 км узкоколейная железная дорога до бухты, конные дрезины
        # 75% рабочих -- китайцы; посёлок на 120 дворов, 1072 жителя, 670 сезонных.
        # http://www.bryners.ru/content.php?material=38
    # Кустари:
        # Гончар (Дон) -- 225-300 рублей/год (за 15k горшков скупщику)
        # Бондарь (Молога) -- 60-80 рублей/год (сбыт в Москве)
        # Стул плетёный, черёмуха -- 0.5 рубля (25 прутьев),
        # Кресло плетёное, черёмуха -- 0.9 рубля (30 прутьев)
        # Черёмуховые прутья в коре (1.25-1.88 см, 1.4-2.13 метра) -- 0.35 рубля/100 штук без подвоза
    # Сезонные работы:
        # Подённые работы. Заработная денежная плата мужчин на хозяйских харчах (1882-1891 годы)
        # - подённые рабочие в период яровых посевов, черноземье -- 0.28 рубля/день (5.6 рублей/месяц)
        # - подённые рабочие в период уборки трав, черноземье -- 0.42 рубля/день (8.3 рубля/месяц)
        # - подённые рабочие в период уборки хлеба, черноземье -- 0.56 рубля/день (11.2 рубля/месяц)
        # - уборка хлопка вручную (15-50 кг/день) -- 2.4 копейки/килограмм (9-30 рублей/месяц)
        # https://ru.wikisource.org/wiki/ЭСБЕ/Земледельческие_рабочие
        # https://ru.wikisource.org/wiki/ЭСБЕ/Хлопчатник
    # Строительство:
        # Оплата излишней работы:
        # - Рабочий/землекоп (Москва) -- 0.8 рубля/день (0.08 рубля/час, 20 рублей/месяц)
        # - Слесарь с инструментом -- 1.5 рубля/день (0.15 рублей/час, 37.5 рублей/месяц)
        # - Водопроводчик/колодезник -- 1.2 рубля/день (0.12 рубля/час, 30 рублей/месяц)
        # - Одноконная подвода с проводником -- 2 рубля (0.2 рубля/час, 50 рублей/месяц)
        # - Две подводы с одним проводником -- 3.6 рубля (0.36 рубля/час, 90 рублей/месяц)
        # Стоимость укладочных работ:
        # - 4-дюймовые трубы -- 1.57 рубля/метр
        # - 5-дюймовые трубы -- 1.64 рубля/метр
        # - 6-дюймовые трубы -- 1.78 рубля/метр
        # - 7-дюймовые трубы -- 2.00 рубля/метр
        # - 8-дюймовые трубы -- 2.18 рубля/метр
        # - 9-дюймовые трубы -- 2.4 рубля/метр
        # - Устройство булыжной мостовой (Москва, Дельвиговский проспект) -- 0.4 рубля/кв.метр
        # "Описание сооружения нового Мытищинского водопровода (1897-1906 гг.)" Н. П. Зимин
    # Земляные работы (орошение в Египте, 1900 год):
        # - Землекоп (Египет, 1900 год) -- 0.37-0.57 рубля/день (0.05 рубля/час, 12.5 рублей/месяц)
        # - Землекоп (Египет, 1900 год, объёмы) -- 0.12-0.2 рубля/кубометр (2.85-3.1 кубометра/день)
        # - Землесос (машина, донный грунт) -- 0.063-0.1 рубля/кубометр (450-1500 кубометров/час)
        # https://ru.wikisource.org/wiki/ВЭ/ВТ/Земляные_работы
        # https://ru.wikisource.org/wiki/ЭСБЕ/Землечерпание
    # Покраска металлоконструкций:
        # - Эйфелева башня -- 9.9 нормо-часов/тонну металла (8 кг краски/тонну, раз в 7 лет)

#----
# Расходы (Российская империя, 1908 год),
    # Распределение отдельных статей расхода в бюджетах рабочих:
        # Петербургские рабочие в 1907/08 г.
        # №  | Статья расходов            | семейные | одинокие  | В рублях (312 р/год)
        # -- | -------------------------- | -------- | --------- | --------------------
        #  1 | Помещение                  | 15.3%    | 12.8%     | 40-48
        #  2 | Отопление и освещение      |  3.9%    |  0.9%     | 3-12
        #  3 | Хозяйственные вещи         |  1.5%    |  1.0%     | 3-4
        #  4 | Питание                    | 48.7%    | 37.3%     | 116-152
        #  5 | Табак и алкоголь           |  5.0%    |  8.1%     | 16-25
        #  6 | Одежда и обувь             | 12.2%    | 13.8%     | 38-43
        #  7 | Стирка и гигиена           |  3.3%    |  3.5%     | 10-11
        #  8 | Лечение                    |  1.2%    |  0.9%     | 3-4
        #  9 | Культурно-просветительные  |  3.3%    |  4.6%     | 10-14
        # 10 | Общественно-политические   |  1.2%    |  1.6%     | 4-5
        # 11 | Религия                    |  0.3%    |  0.2%     | 0-1
        # 12 | На собственное хозяйство   |  -       |  -        | -
        # 13 | Помощь родным              |  2.2     | 10.9      | 7-34
        # 14 | Прочие расходы             |  1.9     |  4.4      | 6-14
        # https://istmat.org/node/59
    # Рацион фабричного рабочего (Петербург, малая выборка):
        # Рацион рабочего -- 20 копеек/день, 6 рублей/месяц, 72 рубля/год
        # Продукт          | грамм/день     | килокаллорий | кг/год | рублей/год
        # ---------------- | -------------- | ------------ | ------ | ----------
        # Хлеб ржаной      | 600-1200       | 1800         | 288    | 18
        # Капуста          | 120-260        |   37         | 77     | 6
        # Картофель        | 4-172          |  131         | 63     | 3
        # Крупа гречневая  | 150-300        |  756         | 84     | 8
        # Крупа перловая   | 1.6-6.8        |   13         | 1.4    | -
        # Горох            | 6.8-47.2       |   78         | 9      | 1
        # Масло постное    | 26-87          |  405         | 16.5   | 5
        # Сало топлёное    | 22-64          |  360         | 14.6   | 8
        # Мясо             | 6-188          |  120         | 26     | 10
        # Рыба             | 0.6-30         |    9         | 4      | 2
        # Лук и грибы      | 0.8-5          |    1         | 1.1    | -
        # Солод и дрожжи   | 23-26          |   80         | 8.6 *  | 1
        # Чай сухой        | 0.8-5.6        |    2         | 2      | 6-10
        # Сахар            | 5-43           |  119         | 11     | 4-7
        # ---------------- | -------------- | ------------ | ------ | ----------
        # Всего            | 967-2435       | 3911 ккалл   | 606    | 72-79
        # * 8.6 кг солода в год = 172 литра кваса
        # https://istmat.org/node/52
    # Прожиточный минимум (Европа, 1738-1925 годы):
        # №  | Продукт    | каллорий/день | кг/год  | рублей/год
        # -- | ---------- | ------------- | ------- | ----------
        # 1  | Хлеб       | 1300 ккалл    | 182 кг  | 13.3
        # 2  | Бобы       | 380           |  40     | 3.3
        # 7  | Пиво       | 217           | 182     | 21
        # 3  | Мясо       | 130           |  26     | 9.5
        # 6  | Слив.масло | 116           |   5.2   | 4.2
        # 4  | Сыр        | 43            |   5.2   | 4.2
        # 5  | Яйца       | 9             |  52 шт  | 7.8
        # 8  | Ламп.масло | -             | 2.6 кг  | 1.1
        # 9  | Свечи      | -             | 2.6     | 2.5
        # 10 | Мыло       | -             | 2.6     | 0.7
        # 11 | Ткани      | -             | 5 метр  | 3
        # 12 | Дрова      | -             | 5.4 ГДж | 0.36
        # -  | Всего      | 2195          | -       | 71
        # Wages, prices, and living standards in China, 1738–1925: in comparison with Europe, Japan, and India
        # https://onlinelibrary.wiley.com/doi/full/10.1111/j.1468-0289.2010.00515.x

#----
# Соотношение цен товаров (Валюты и наценки):
    # Рубль (1897 года) = 0.774 грамма чистого золота (18 грамм серебра)
        # Монета             | рублей | грамм золота   | грамм серебра
        # ------------------ | ------ | -------------- | -------------
        # Рубль (1897 года)  | 1      | 0.77           |  18.0
        # Фунт стерлингов    | 9.46   | 7.32           | 170.3
        # Шиллинг (1/20 фнт) | 0.47   | 0.37           |   8.5  
        # Германская марка   | 0.46   | 0.36           |   8.3  
        # Французский франк  | 0.38   | 0.29           |   5.2
        # Доллар США         | 1.96   | 1.52           |  35.3 
        # ------------------------------------------------------------
        # Рубль 1897 года -- 1000 рублей 2020 года (отклонения ±500 рублей) *
        # Рубль 1913 года -- 1513 рублей 2016 года (счётная палата РФ)
        # * По покупательной способности. Счётная палата тупо по золоту.
    # Инфляция серебра:
        # 1866-1870 -- 15 грамм серебра за грамм золота.
        # 1889 -- 22.1 грамма
        # 1898 -- 35 грамм
        # https://ru.wikisource.org/wiki/ЭСБЕ/Латинский_монетный_союз
    # Наценка:
        # Наценка мелких торговцев -- 30-127% стоимости товара
        # Наценка крупных магазинов -- 10-40% стоимости товара
        # https://ru.wikisource.org/wiki/ЭСБЕ/Магазины_универсальные
        # https://ru.wikisource.org/wiki/ЭСБЕ/Масло_коровье,_в_торговле
    # Ярмарки:
        # Средний товарооборот ярмарки -- 8 рублей/жителя
        # Реализация товаров на ярмарке -- 50-70% от привоза
        # Товарооборот ярмарок -- 73% городские, 27% сельские
        # Ярмарки менее 2 недель свободны от налогооблажения
        # https://science-education.ru/ru/article/view?id=9578
    # Цена сельскохозяйственной земли (1880 год):
        # Густонаселённые губернии Российской империи -- 300 рублей/гектар
        # Редконаселённые и удалённые от рынков уезды -- 30-60 рублей/гектар
        # Массачузетс, Нью-Джерси, Нью-Йорк, Пенсильвания (50 чел/гектар) -- 313 рублей/гектар
        # Огайо, Индиана, Иллинойс, Кентукки, Миссури, Айова, Канзас, Небраска (13 чел/гектар) -- 110 руб/га
        # Мичиган, Висконсин, Мэн, Миннесота, Дакота (6 чел/гектар) -- 86 рублей/гектар
        # https://ru.wikisource.org/wiki/ЭСБЕ/Цена

#----
# Соотношение цен товаров (Российская Империя, 1913-1914 годы):
    # "Справочник довоенных цен на сырьё, вспомогательные материалы, проз. и спец. одежду, продовольствен. и др. товары 1913-1914 года" 1923 год
        # копейки/пуд в рубли/тонна: (61 / 100) * копеек/пуд
        # рубли/куб.сажень в рубли/кубометр: (1 / (2.13 ** 3)) * рублей/куб.сажень
        # рубли/куб.фут в рубли/кубометр: (35.32 / 100) * рублей/куб.фут
    # Руда и флюсы:
        # Товар -- себестоимость|рыночная_цена
        # Руда железная 1 сорта -- 3.05|6.1 рублей/тонна
        # Руда железная 2 сорта -- 2.14|5.49 рублей/тонна
        # Руда железная 3 сорта -- 1.53|3.66 рублей/тонна
        # Руда железная кварцитная -- 1.22|2.75 рублей/тонна
        # Руда марганец 1 сорта -- 12.2|18.3 рублей/тонна
        # Руда марганец 3 сорта -- 7.32|12.2 рублей/тонна
        # Скрап крупный -- 12.2|15.25 рублей/тонна
        # Скрап мелкий -- 6.1|9.15 рублей/тонна
        # Хромистый железняк -- 30.5|36.6 рублей/тонна
    # Топливо твёрдое
        # Антрацит А. П. -- 14.64|18.3 рублей/тонна
        # Антрацит А. К. -- 13.42|17.08 рублей/тонна
        # Антрацит А. Р. -- 10.98|14.64 рублей/тонна
        # Антрацит А. О. -- 12.2|15.86 рублей/тонна
        # Антрацит А. С. -- 10.98|14.64 рублей/тонна
        # Антрацит А. Ш. -- 7.32|10.98 рублей/тонна
        # Уголь газовый -- 13.42|17.08 рублей/тонна
        # Уголь паров. П. Ж. -- 10.98|14.64 рублей/тонна
        # Уголь кузнечный мытый -- 12.2|15.86 рублей/тонна
        # Уголь рядовой -- 9.76|13.42 рублей/тонна
        # Кокс крупный -- 18.3|24.4 рублей/тонна
        # Кокс мелкий -- 9.15|17.08 рублей/тонна
        # Уголь древесный -- 122|152.5 рублей/тонна (sic!)
        # Дрова дубовые -- 3.73|4.66 рублей/кубометр
        # Дрова сосновые -- 3.01|3.83 рублей/кубометр
        # Дрова ольховые -- 3.31|3.14 рублей/кубометр
    # Топливо жидкое
        # Нефть -- 36.6/45.75 рублей/тонна
        # Мазут -- 30.5/39.65 рублей/тонна
    # Смазочные и осветит. материалы:
        # Бензин -- 229|284 рублей/тонна (sic!)
        # По ППС в 2020 году это стоило бы 230-280 тыс.рублей/тонна (а стоит 40 тыс.руб/тонна)
        # Ваклит -- 586|732 рублей/тонна
        # Дёготь -- 98|122 рублей/тонна
        # Керосин -- 92|116 рублей/тонна
        # Калипсоль -- 1318|1647 рублей/тонна
        # Мазь восковая -- 214|268 рублей/тонна
        # Мазь для машин. ремней -- 1556|1946 рублей/тонна
        # Мазь для каната -- 512|641 рублей/тонна
        # Мазь Эйзенберга -- 372|467 рублей/тонна
        # Мазь Левинсона -- 150|186 рублей/тонна
        # Масло для Динамо-машин -- 366|458 рублей/тонна
        # Масло сверлильное -- 323|412 рублей/тонна
        # Масло антраценовое -- 195|244 рублей/тонна
        # Масло бурильное -- 747|933 рублей/тонна
        # Масло машин. светлое -- 165|207 рублей/тонна
        # Масло минеральное себонафт -- 238|299 рублей/тонна
        # Масло цилиндровое мигроль -- 171|214 рублей/тонна
        # Масло Эйзенберга -- 238|299 рублей/тонна
        # Масло Гарголь -- 409|512 рублей/тонна
        # Масло цилиндровое -- 113|140 рублей/тонна
        # Масло машинное (Олеон №1) -- 140|177 рублей/тонна
        # Масло моторное -- 366|458 рублей/тонна
        # Масло трансформаторное -- 341|427 рублей/тонна
        # Масло турбинное -- 366|458 рублей/тонна
        # Масло автомобильное -- 274|351 рублей/тонна
        # Масло веретенное жидкое -- 183|229 рублей/тонна (для прядильных веретен?)
        # Масло костяное -- 397|497 рублей/тонна
        # Масло деревянное -- 763|955 рублей/тонна
        # Мазь Мадия -- 244|305 рублей/тонна
        # Мазь колёсная -- 113|140 рублей/тонна
        # Мазь солидол -- 317|396 рублей/тонна
        # Мазь Штауфера -- 104|131 рублей/тонна
        # Нефть Калужская -- 42.7|54.9 рублей/тонна
        # Смола газовая -- 36.6|42.7 рублей/тонна
        # Свечи стеариновые -- 781|976 рублей/тонна
        # Спички -- 10 копеек/десяток
        # Сало топлёное -- 445|555 рублей/тонна
        # Сало сырое говяжье -- 384|482 рублей/тонна
        # Сало пушечное -- 464|580 рублей/тонна
        # Нити обтирочные -- 214|268 рублей/тонна
        # Гудрон русский -- 54.9|67.1 рублей/тонна
        # Гудрон заграничный -- 61|76.25 рублей/тонна
    # Металлы чёрные
        # Железо листовое -- 98|122 рублей/тонна
        # Железо кровельное -- 164|183 рублей/тонна
        # Железо оцинкованное -- 220|275 рублей/тонна
        # Железо белое -- 366|458 рублей/тонна
        # Железо полосовое -- 92|110 рублей/тонна
        # Железо квадратное -- 92|110 рублей/тонна
        # Железо круглое -- 92|110 рублей/тонна
        # Железо угловое -- 92|116 рублей/тонна
        # Железо лом заводской и покупной -- 24.4|30.5 рублей/тонна
        # Жесть белая (лист) -- 0.15|0.20 рублей/лист
        # Проволока 5-6 миллиметров -- 107|134 рублей/тонна
        # Сталь "Рапид" -- 2593|3239 рублей/тонна
        # Сталь сортовая инструментальная -- 580|726 рублей/тонна
        # Сталь полукруглая -- 464|580 рублей/тонна
        # Сталь рессорная -- 92|110 рублей/тонна
        # Сталь лом заводской и покупной -- 24.4|30.5 рублей/тонна
        # Чугун передельный -- 44|55 рублей/тонна
        # Чугун зеркальный -- 73|92 рублей/тонна
        # Чугун литейный №0 -- 48|58 рублей/тонна
        # Чугун литейный №1 -- 46|58 рублей/тонна
        # Чугун литейный №2 -- 45|58 рублей/тонна
        # Чугун лом заводской и покупной -- 24.4|30.5 рублей/тонна
        # Ферро марганец 80% -- 134|171 рублей/тонна
        # Ферро-силидт 48% -- 186|231 рублей/тонна
        # Ферро-силидт 60% -- 223|278 рублей/тонна
        # Ферро-силидт 70% -- 268|336 рублей/тонна
        # Ферро-тритан -- 1556|1952 рублей/тонна
        # Ферро-фосфор -- 192|238 рублей/тонна
        # Ферро-хром -- 268|336 рублей/тонна
    # Металлы цветные
        # Аллюминий -- 1220|1525 рублей/тонна
        # Аллюминий кисло-серный -- 110|140 рублей/тонна
        # Антимоний -- 397|497 рублей/тонна
        # Бабит -- 1281|1601 рублей/тонна
        # Бронза в чушках -- 732|915 рублей/тонна
        # Висмут -- 10 980|13 725 рублей/тонна
        # Зильберметалл -- 1745|2181 рублей/тонна
        # Лом красной меди -- 610|763 рублей/тонна
        # Лом жёлтой меди -- 610|763 рублей/тонна
        # Лом бронзовой меди -- 366|458 рублей/тонна
        # Медь чушковая красная -- 976|1220 рублей/тонна
        # Медь прутковая красная -- 1342|1678 рублей/тонна
        # Медь листовая красная -- 1427|1783 рублей/тонна
        # Медь прутковая жёлтая -- 1495|1867 рублей/тонна
        # Медь листовая жёлтая -- 1220|1525 рублей/тонна
        # Медь фосфористая -- 1510|1888 рублей/тонна
        # Медь красная фосфористая в чушках -- 1482|1830 рублей/тонна
        # Стружки медные -- 305|381 рублей/тонна
        # Медь штыковая -- 921|1150 рублей/тонна
        # Никель чушковой -- 976|1220 рублей/тонна
        # Никель в кубиках -- 1934|2416 рублей/тонна
        # Никель листовой -- 2989|3736 рублей/тонна
        # Олово чушковое -- 2022|2525 рублей/тонна
        # Олово прутковое -- 2562|3813 рублей/тонна
        # Проволока медная -- 1464|1830 рублей/тонна
        # Пломбы свинцовые -- 311|387 рублей/тонна
        # Припой средний медный -- 939|1208 рублей/тонна
        # Свинец чушковой -- 244|305 рублей/тонна
        # Свинец листовой -- 281|351 рублей/тонна
        # Цинк чушковой -- 296|372 рублей/тонна
        # Цинк листовой -- 397|497 рублей/тонна
        # Лом и стружка бронзовые -- 232|290 рублей/тонна
        # Лом и стружка белого металла -- 122|153 рублей/тонна
    # Железнодорожные материалы
        # Рельсы железнодорожные Вильямса св. 15 фт -- 76|95 рублей/тонна
        # Рельсы железнодорожные рудничные -- 92|116 рублей/тонна
        # Рельсы железнодорожные Виньоля -- 79|101 рублей/тонна
        # Рельсы железнодорожные трамвайные -- 85|107 рублей/тонна
        # Рессоры для кранов -- 366|458 рублей/тонна
        # Костыли -- 146|183 рублей/тонна
        # Накладки -- 110|137 рублей/тонна
        # Подкладки -- 110|137 рублей/тонна
        # Скаты паровозные и тендерные -- 153|171 рублей/тонна
        # Тарелки буферные -- 134|159 рублей/тонна
        # Фаркопфы -- 183|220 рублей/тонна
        # Фонари сигнальные для сцепщиков -- 2.5|3.1 рублей/штука
        # Фонари сигнальные для буферов и паровозов -- 8|10 рублей/штука
    # Лесные материалы
        # Брусья дубовые -- 84.8|106 рублей/кубометр
        # Брусья сосновые -- 65.6|79.5 рублей/кубометр
        # Брусья еловые -- 51.2|63.6 рублей/кубометр
        # Брёвна дубовые -- 21.2|26.5 рублей/кубометр
        # Брёвна сосновые -- 10.6|14.1 рублей/кубометр
        # Брёвна еловые -- 8.8|10.6 рублей/кубометр
        # Болванки дубовые -- 26.5|33.6 рублей/кубометр
        # Болванки сосновые -- 14.1|17.7 рублей/кубометр
        # Болванки еловые -- 10.6|14.1 рублей/кубометр
        # Пластины дубовые (брёвна 22+ см, распиленые вдоль) -- 15.3|18.3 рублей/тонна
        # Пластины сосновые (брёвна 22+ см, распиленые вдоль) -- 12.2|15.3 рублей/тонна
        # Пластины еловые (брёвна 22+ см, распиленые вдоль) -- 12.2|15.3 рублей/тонна
        # Стойки дубовые -- 12.2|15.3 рублей/тонна
        # Стойки соснвоые -- 12.2|15.3 рублей/тонна
        # Стойки еловые -- 12.2|15.3 рублей/тонна
        # Кора липовая -- 61|76 рублей/тонна
        # Кряжи дубовые (нижние части ствола) -- 1.7|2.1 рублей/штука
        # Шпалы (размеры не указаны) -- 1.8|2.3 рублей/штука
    # Огнеупорные и строительные материалы
        # Алебастр -- 18.3|24.4 рублей/тонна
        # Глина простая -- 0.92|1.22 рублей/тонна
        # Глина огнеупорная -- 6.1|6.1 рублей/тонна
        # Глина формовочная -- 3.1|3.1 рублей/тонна
        # Глина огнеупорная шамотная -- 15.3|18.3 рублей/тонна
        # Глина огнеупорная каолиновая -- 6.1|6.1 рублей/тонна
        # Известь негашёная -- 9.2|12.2 рублей/тонна
        # Кирпич огнеупорный -- 400|500 рублей/1000_штук
        # Кирпич данасовый стр. фас. -- 550|700 рублей/1000_штук
        # Кирпич шамотный стр. фас. -- 400|500 рублей/1000_штук
        # Кирпич железняк -- 13|16.35 рублей/1000_штук
        # Кирпич шлаковый -- 11|13.75 рублей/1000_штук
        # Кирпич магнезитовый -- 322|400 рублей/1000_штук
        # Кирпич (Киев --> Харьков) -- 35|40 рублей/1000_штук
        # Мел кусковой -- 12.2|15.25 рублей/тонна
        # Мел молотый -- 15.25|18.3 рублей/тонна
        # Песок красный -- 6.1|6.1 рублей/тонна
        # Песок жёлтый -- 1.22|1.22 рублей/тонна
        # Рубероид -- 293|366 рублей/тонна
        # Цемент -- 24.4|30.5 рублей/тонна
        # Черепица -- 100|150 рублей/1000_штук
        # Изразцы печные -- 250|300 рублей/1000_штук
        # Песок речной -- 0.92|1.14 рублей/кубометр
        # Песок кварцевый -- 6.1|6.1 рублей/тонна
        # Шамот -- 12.2|15.25 рублей/тонна
        # Щебень бутовый -- 1.24|1.55 рублей/кубометр
        # Щебень мраморный -- 42.7|54.9 рублей/тонна
        # Земля формовочная -- 3.1|3.1 рублей/тонна
        # Камень доломит обожжённый -- 18.3|24.4 рублей/тонна
        # Камень доломит сырой -- 6.1|9.15 рублей/тонна
        # Камень известковый -- 1.83|3.66 рублей/тонна
        # Камень кварцевый (Донецк --> Харьков) -- 9.15|12.2 рублей/тонна
        # Камень Криворожский (Кривой Рог --> Харьков) -- 2.44|4.88 рублей/тонна
        # Камень бутовый -- 1.97|2.46 рублей/кубометр
        # Кирпич красный -- 20.25|25.30 рублей/1000_штук
        # Кирпич полонье -- 10|12.50 рублей/1000_штук
        # Кирпич черкасский -- 32|40 рублей/1000_штук
    # Болтовые и гвоздильные материалы
        # Болты железные с гайками -- от 171|214 до 323|406 рублей/тонна
        # Гвозди деревянные сапожные -- 488|610 рублей/тонна
        # Гвозди кованые -- 351|439 рублей/тонна
        # Гвозди обойные -- 250|315 рублей/тонна
        # Гвозди подковные -- 427|534 рублей/тонна
        # Гвозди проволочные от 230 мм до 25 мм -- от 140|315 до 226|284 рублей/тонна
        # Гвозди стекольные -- 299|375 рублей/тонна
        # Гвозди толевые -- 247|308 рублей/тонна
        # Гвозди штукатурные №13 -- 296|369 рублей/тонна
        # Заклёпки железные 3 мм -- 378|473 рублей/тонна
        # Заклёпки железные от 22 мм до 6.4 мм -- от 146|183 до 262|329 рублей/тонна
        # Костыли железнодорожные -- 113|140 рублей/тонна
        # Шайбы железные разные -- 366|458 рублей/тонна
    # Арматуры, трубы и части к ним
        # Котлы чугунные -- 122|153 рублей/тонна
        # Раковины чугунные -- 18|22.5 рублей/штука
        # Резервуары клозетные -- 10|12.6 рублей/штука
        # Манометры от 2.5x200 до 12x8 -- от 8|10 до 26|32 рублей/штука
        # Стёкла оконные -- 127|127 рублей/кв.метр
        # Термометры наружные спиртовые -- 6.5|8.15 рублей/штука
        # Термометры для паровых котлов -- 20|25 рублей/штука
        # Чашки ватерклозетные -- 6.6|8.3 рублей/штука
    # Инструменты
        # Наждак -- 244|305 рублей/тонна
        # Тиски стуловые 6" вес 20-25 фт. -- 708|885 рублей/тонна
        # Тиски стуловые 6" вес 61-80 фт. -- 537|671 рублей/тонна
        # Замки висячие -- 0.7|0.9 рублей/штука
        # Ножницы кровельные -- 6|7.5 рублей/штука
    # Машинные части и приспособления
        # Канаты стальные проволочные 5 мм -- 1159|1449 рублей/тонна
        # Канаты стальные проволочные 7 мм -- 1007|1260 рублей/тонна
        # Канаты стальные проволочные 8 мм -- 946|1183 рублей/тонна
        # Канаты стальные проволочные 12 мм -- 811|1116 рублей/тонна
        # Канаты стальные проволочные 16 мм -- 775|970 рублей/тонна
        # Канаты стальные проволочные 20 мм -- 750|939 рублей/тонна
        # Канаты стальные проволочные 24 мм -- 694|869 рублей/тонна
        # Канаты стальные проволочные 28 мм -- 714|817 рублей/тонна
        # Канаты стальные проволочные 34 мм -- 634|793 рублей/тонна
        # Шестерни цилиндрические делением 28.6 мм (45 кг/штука) -- 579|724 рублей/тонна
        # Цепи железные 5 мм -- 1232|1525 рублей/тонна
        # Цепи железные 25.4 мм -- 323|403 рублей/тонна
        # Часы контрольные -- 28|35 рублей/штука
        # Молотки пневматические -- 122|153 рублей/штука
    # Электрические материалы и принадлежности
        # Слюда -- 22 570|28 212 рублей/тонна
        # Миканит (изолятор из слюды) -- 7320|9150 рублей/тонна
        # Ленты из натуральной резины (каучук) -- 10 248|12 810 рублей/тонна
        # Лента изоляционная 10-40 мм для кабелей -- 2460|3075 рублей/тонна
        # Ленты изолировочные (изолента) -- 2318|2897 рублей/тонна
        # Трубки эбонитовые -- 1452|1818 рублей/тонна
        # Мастика каучуковая -- 500|625 рублей/тонна
        # Паяноль (паяльная паста?) -- 3324|3928 рублей/тонна
        # Проволока медная изолированная 0.75 мм -- 7612|9516 рублей/тонна
        # Проволока медная изолированная 0.8 мм -- 6692|8363 рублей/тонна
        # Проволока медная изолированная 1.0 мм -- 3544|4431 рублей/тонна
        # Проволока медная изолированная 1.25 мм -- 3105|6883 рублей/тонна
        # Проволока медная изолированная 1.55 мм -- 2849|3564 рублей/тонна
        # Проволока медная изолированная 2.1 мм -- 2068|2586 рублей/тонна
        # Проволока медная изолированная 3.2 мм -- 1775|2220 рублей/тонна
        # Проволока медная изолированная 5.4 мм -- 1482|1830 рублей/тонна
        # Проволока медная изолированная 7.15 мм -- 1610|2013 рублей/тонна
        # Кабель медный изолированный 15.75 мм -- 2068|2584 рублей/тонна
        # Кабель медный изолированный 70 мм -- 1787|2236 рублей/тонна
        # Абажуры железные -- 0.4|0.5 рублей/штука
        # Абажуры аллюминиевые -- 0.5|0.65 рублей/штука
        # Абажуры стеклянные молочные -- 0.3|0.4 рублей/штука
        # Абажуры стеклянные зелёные -- 0.7|0.9 рублей/штука
        # Абажуры стеклянные голубые -- 0.75|0.95 рублей/штука
        # Амперометры -- 22|27.5 рублей/штука
        # Аккумуляторы -- 25.2|31.6 рублей/штука
        # Громоотводы -- 15|18.75 рублей/штука
        # Звонки электрические -- 1|1.25 рублей/штука
        # Кнопки звонковые -- 0.35|0.45 рублей/штука
        # Лампы накаливания угольные 16 свечей, 250 вольт -- 0.4|0.5 рублей/штука
        # Лампы накаливания угольные 50 свечей, 135 вольт -- 0.8|1 рублей/штука
        # Лампы накаливания угольные 100 свечей, 135 вольт -- 1.6|2 рублей/штука
        # Лампы электрические Осрам 1000 свечей, ??? вольт -- 17.5|21.6 рублей/штука
        # Микрофоны -- 3.3|4.1 рублей/штука
        # Микротелефоны -- 18.5|22.6 рублей/штука
        # Телефоны настольные -- 35|44 рублей/штука
        # Телефоны стенные -- 23|28.5 рублей/штука
        # Шайбы слюдочные (20 грамм/штука?) -- 0.5|0.6 рублей/100_штук
        # Пробки предохранительные -- 0.1|0.1 рублей/штука
        # Розетки штепсельные -- 0.2|0.25 рублей/штука
    # Химическо-Москательные материалы
        # Аммиак 25% -- 300|350 рублей/тонна
        # Ацетилен -- 3|3.75 рублей/кубометр
        # Ацетон -- 976|1220 рублей/тонна
        # Бензол -- 641|799 рублей/тонна
        # Бура, порошок -- 354|455 рублей/тонна
        # Бисульфит натрия -- 73.2|91.5 рублей/тонна
        # Водород -- 2|2.5 рублей/кубометр
        # Воск -- 1952|2440 рублей/тонна
        # Гипосульфит -- 137|171 рублей/тонна
        # Глицерин химически чистый -- 1220|1525 рублей/тонна
        # Глицерин обыкновенный -- 900|1126 рублей/тонна
        # Графит сухой -- 146|183 рублей/тонна
        # Жир рыбий -- 345|430 рублей/тонна
        # Кислота серная обыкновенная -- 36.6|45.8 рублей/тонна
        # Кислота серная химически чистая -- 91.5|116 рублей/тонна
        # Кислота соляная обыкновенная -- 91.5|116 рублей/тонна
        # Кислота азотная обыкновенная -- 550|700 рублей/тонна (???)
        # Кислота азотная химически чистая -- 366|458 рублей/тонна
        # Кислота лимонная техническая -- 2050|2562 рублей/тонна
        # Кислота карболовая обыкновенная -- 140|177 рублей/тонна
        # Кислота олеиновая -- 6600|8200 рублей/тонна
        # Кислота уксусная -- 595|747 рублей/тонна
        # Кислота фосфорная -- 534|665 рублей/тонна
        # Кислота плавиковая 40% -- 732|915 рублей/тонна
        # Квасцы -- 122|153 рублей/тонна
        # Квасцы алюминиевые -- 98|122 рублей/тонна
        # Купорос железный -- 33.6|42.7 рублей/тонна
        # Карболиниум -- 317|397 рублей/тонна
        # Крахмал рисовый -- 390|488 рублей/тонна
        # Крахмал пшеничный -- 195|244 рублей/тонна
        # Купорос медный -- 397|494 рублей/тонна
        # Карбит -- 366|458 рублей/тонна
        # Канифоль -- 256|323 рублей/тонна
        # Клей столярный и малярный -- 403|500 рублей/тонна
        # Клей для ремней -- 1025|1281 рублей/тонна
        # Клей резиновый -- 2050|2562 рублей/тонна
        # Кислород -- 1.2|1.5 рублей/кубометр
        # Калибрусикум -- 1007|1257 рублей/тонна
        # Кислота мышьяковая химически чистая -- 1952|2440 рублей/тонна
        # Кислота Ангидрит. серная 100% -- 153|189 рублей/тонна
        # Кислота аккумуляторная 22 гр "Б" -- 36.6|45.8 рублей/тонна
        # Кислота Хлорсульфоновая -- 488|610 рублей/тонна
        # Кислота Масло-купоросная 92% -- 61|76 рублей/тонна
        # Калий хлористый -- 244|305 рублей/тонна
        # Калий серно кислый -- 61|76 рублей/тонна
        # Квасцы натровые -- 351|439 рублей/тонна
        # Каолин -- 61|76 рублей/тонна
        # Мыло зелёное -- 287|357 рублей/тонна
        # Мыло простое -- 232|256 рублей/тонна
        # Мыло каолиновое -- 171|214 рублей/тонна
        # Магний фосфористый -- 67|85 рублей/тонна
        # Марганец -- 79|104 рублей/тонна
        # Магний серно кислый -- 110|137 рублей/тонна
        # Магний хлористый технический -- 92|116 рублей/тонна
        # Магний угле-кислый -- 610|763 рублей/тонна
        # Марганец хлористый -- 976|1220 рублей/тонна
        # Маршалит -- 244|305 рублей/тонна
        # Нашатырь кусковой -- 580|723 рублей/тонна
        # Нашатырь в порошке -- 634|793 рублей/тонна
        # Нитрат калия -- 458|570 рублей/тонна
        # Нитрат натрия -- 403|509 рублей/тонна
        # Нафталин химически чистый -- 1800|2250 рублей/тонна
        # Нафталин обыкновенный -- 781|976 рублей/тонна
        # Поташ -- ???|189 рублей/тонна (???)
        # Поташ очищенный -- 397|494 рублей/тонна
        # Пемза кусковая -- 378|470 рублей/тонна
        # Пек (каменоугольная смола, битум) -- 48.8|61 рублей/тонна
        # Парафин -- 695|872 рублей/тонна
        # Ртуть -- 2745|3431 рублей/тонна
        # Салициловая кислота химически чистая -- 3700|4650 рублей/тонна
        # Смола газовая -- 70.2|85.4 рублей/тонна
        # Смола шевская -- 110|137 рублей/тонна
        # Сода очищенная (бикарбонат) -- 299|372 рублей/тонна
        # Сода кальцированная -- 61|76 рублей/тонна
        # Сода каустическая -- 201|290 рублей/тонна
        # Скипидар серный -- 415|519 рублей/тонна
        # Скипидар французский -- 299|372 рублей/тонна
        # Смола сосновая -- 366|458 рублей/тонна
        # Свинцовый глет -- 403|503 рублей/тонна
        # Сера горючая -- 159|198 рублей/тонна
        # Соль лимонная (Одесская) -- 30.5|36.6 рублей/тонна
        # Спирт денатурат -- 203|252 рублей/тонна
        # Спирт ректификат -- 1667|2081 рублей/тонна
        # Спирт сырец -- 1463|1829 рублей/тонна
        # Спирт нашатырный -- 305|381 рублей/тонна
        # Спирт древесный -- 1196|1495 рублей/тонна
        # Соль поваренная -- 18.3|24.4 рублей/тонна
        # Соль жёлтая кровяная -- 732|915 рублей/тонна
        # Соль красная -- 1159|1449 рублей/тонна
        # Соль анилиновая -- 732|915 рублей/тонна
        # Соль оловянная -- 1830|2288 рублей/тонна
        # Сурьма сернистая -- 195|244 рублей/тонна
        # Сера комковая -- 153|189 рублей/тонна
        # Слюда -- 4880|6100 рублей/тонна
        # Фенол химически чистый -- 2600|3150 рублей/тонна
        # Гарипиус Вологодский -- 171|214 рублей/тонна
        # Гарипиус Американский -- 183|229 рублей/тонна
        # Цемент железный -- 1891|2364 рублей/тонна
        # Эфир -- 720|891 рублей/тонна
        # Цинк хлористый -- 1488|1861 рублей/тонна
        # Шерлак -- 2318|2898 рублей/тонна
        # Щавелевая кислота химически чистая -- 2400|3000 рублей/тонна
        # Цинк хлористый -- 403|509 рублей/тонна
        # Церезин (искусственный воск) -- 366|458 рублей/тонна
        # Ультрамарин -- 641|799 рублей/тонна
        # Известь венская (полировочный материал) -- 732|915 рублей/тонна
        # Известь хлористая -- 104|128 рублей/тонна
    # Взрывчатые вещества
        # Охотничий порох (мякоть) -- 610|763 рублей/тонна
        # Студенистый динамит -- 1769|2196 рублей/тонна
        # Гремучий студень -- 2013|2516 рублей/тонна
        # Нитрожелатин -- 2135|2669 рублей/тонна
        # Гризутин -- 1830|2275 рублей/тонна
    # Краски, красители
        # Байц -- 732|915 рублей/тонна
        # Брауншвейг -- 903|1129 рублей/тонна
        # Бакан -- 1586|1983 рублей/тонна
        # Бакан зелёный -- 549|686 рублей/тонна
        # Белила свинцовые масляные -- 458|567 рублей/тонна
        # Белила свинцовые сухие -- 360|451 рублей/тонна
        # Белила масляные -- 702|878 рублей/тонна
        # Белила цинковые сухие -- 397|494 рублей/тонна
        # Зелень сухая -- 351|439 рублей/тонна
        # Зелень Французская -- 488|610 рублей/тонна
        # Крон зелёный -- 1708|2135 рублей/тонна
        # Кость слоновая масляная -- 641|799 рублей/тонна
        # Кость слоновая сухая -- 305|381 рублей/тонна
        # Киноварь искусственная масляная -- 1098|1373 рублей/тонна
        # Киноварь химически чистая -- 3294|4118 рублей/тонна
        # Капут Мортум -- 229|287 рублей/тонна
        # Краска эмалевая -- 2196|2745 рублей/тонна
        # Краска для литья -- 244|305 рублей/тонна
        # Краска для черепиц -- 329|415 рублей/тонна
        # Краска масляная -- 1708|2135 рублей/тонна
        # Краска панцирная -- 61|76.3 рублей/тонна
        # Краска сидоростен. -- 427|516 рублей/тонна
        # Лазурь Берлинская -- 1556|1952 рублей/тонна
        # Лак приготовительный №0 -- 1757|2135 рублей/тонна
        # Лак приготовительный №1 -- 1452|1806 рублей/тонна
        # Лак модельный -- 1086|1354 рублей/тонна
        # Лак подмазочный -- 659|824 рублей/тонна
        # Лак асфальтовый -- 1007|1257 рублей/тонна
        # Лак Японский -- 1452|1806 рублей/тонна
        # Лак локомотивный -- 2062|2577 рублей/тонна
        # Лак половой -- 1086|1357 рублей/тонна
        # Лак изоляционный -- 1281|1601 рублей/тонна
        # Лак масляный чёрный наружный -- 537|671 рублей/тонна
        # Лак масляный 2-го сорта красный -- 537|671 рублей/тонна
        # Лак спиртовый 1-го сорта (красный, чёрный, белый, оранжевый) -- 1086|1357 рублей/тонна
        # Медянка масляная русская -- 946|1177 рублей/тонна
        # Медянка сухая русская -- 915|1144 рублей/тонна
        # Мумиё масляное шведское -- 223|278 рублей/тонна
        # Мумиё сухое шведское -- 91.5|116 рублей/тонна
        # Масло варёное (олифа) -- 397|494 рублей/тонна
        # Масло подсолнечное -- 342|430 рублей/тонна
        # Охра масляная -- 290|360 рублей/тонна
        # Охра сухая -- 177|226 рублей/тонна
        # Политура спиртовая (оранжевая, белая, красная, чёрная) -- 903|1129 рублей/тонна
        # Серая масляная краска -- 354|442 рублей/тонна
        # Сурик жёлтый сухой -- 177|226 рублей/тонна
        # Сурик свинцовый масляный -- 275|342 рублей/тонна
        # Сурик свинцовый сухой -- 360|451 рублей/тонна
        # Сажа голландская масляная -- 354|442 рублей/тонна
        # Сажа сухая московская -- 305|381 рублей/тонна
        # Сикатив -- 1019|1275 рублей/тонна
        # Умбра жжённая масляная -- 336|418 рублей/тонна
        # Умбра жжённая сухая -- 171|214 рублей/тонна
        # Умбра нежжённая сухая -- 220|275 рублей/тонна
        # Ультрамарин -- 641|799 рублей/тонна
        # Экстракт кампешовый -- 1257|1510 рублей/тонна
        # Ярь -- 610|763 рублей/тонна
        # Тердесиен -- 1037|1373 рублей/тонна
    # Кожевенные материалы
        # Кожа Американская -- 4758|5948 рублей/тонна
        # Кожа манжетная -- 3660|4575 рублей/тонна
        # Кожа шагреневая -- 4636|5795 рублей/тонна
        # Кожа полувал -- 1708|2135 рублей/тонна
        # Кожа сыромятная -- 1891|2425 рублей/тонна
        # Кожа подошвенная -- 3294|4118 рублей/тонна
        # Кожа юфтовая -- 2196|2745 рублей/тонна
        # Обрезки кож -- 610|763 рублей/тонна
    # Текстильные материалы
        # Канат пеньковый -- 580|726 рублей/тонна
        # Канат пеньковый Манильский -- 732|915 рублей/тонна
        # Концы бумажные (обрезки хлопчато-бумажной ткани?) -- 262|326 рублей/тонна
        # Шпагат отбойка сахарная -- 464|580 рублей/тонна
        # Шпагат Английский Варкет -- 1037|1296 рублей/тонна
        # Бечева -- 732|915 рублей/тонна
        # Ветошь -- 366|458 рублей/тонна
        # Нитки суровые -- 1951|2439 рублей/тонна
        # Вата -- 650|790 рублей/тонна
        # Пряжа пеньковая -- 433|540 рублей/тонна
        # Пряжа хлопчато-бумажная -- 958|1197 рублей/тонна
        # Пряжа льняная -- 1708|2135 рублей/тонна
        # Пряжа шерстяная -- 1769|2211 рублей/тонна
        # Прядь пеньковая -- 427|534 рублей/тонна
        # Прядь льняная -- 714|891 рублей/тонна
        # Лён -- 442|552 рублей/тонна
        # Куделька (пенька подготовленная к пряже?) -- 171|214 рублей/тонна
        # Брезент (в кусках по 64 кв.метра) -- 1.33|1.66 рублей/кв.метр
        # Парусина брезентовая -- 0.9|1.1 рублей/кв.метр
        # Материя для кальсон -- 0.5|0.6 рублей/кв.метр
        # Холст мешковой -- 0.3|0.4 рублей/кв.метр
        # Чуни (галоши для рудников?) -- 0.35|0.45 рублей/пара
        # Костюмы непромокаемые -- 3.6|4.5 рублей/штука
    # Прокладочные материалы
        # Асбест в порошке -- 98|122 рублей/тонна
        # Асбестит -- 177|220 рублей/тонна
        # Картон простой -- 201|253 рублей/тонна
        # Картон асбестовый -- 223|278 рублей/тонна
        # Клингерит -- 6710|8388 рублей/тонна
        # Картон графитовый -- 1464|1830 рублей/тонна
        # Картон изоляционный -- 2586|3233 рублей/тонна
        # Картон леотодорит -- 3880|4789 рублей/тонна
        # Картон лионский -- 3721|4041 рублей/тонна
        # Картон манунит -- 2245|2806 рублей/тонна
        # Картон прешпан -- 3050|3813 рублей/тонна
        # Набивка графитовая -- 1915|2394 рублей/тонна
        # Набивка компенсирующая -- 2550|3187 рублей/тонна
        # Набивка льняная -- 634|793 рублей/тонна
        # Набивка тольковая -- 320|400 рублей/тонна
        # Фибра листовая -- 7320|7625 рублей/тонна
        # Моорит -- 2867|3584 рублей/тонна
    # Резиновые материалы
        # Резина круглая -- 4654|5819 рублей/тонна
        # Резина квадратная -- 3660|4575 рублей/тонна
        # Клапаны резиновые -- 5258|6555 рублей/тонна
        # Кольца резиновые -- 3965|4956 рублей/тонна
        # Полосы резиновые -- 3660|4575 рублей/тонна
        # Полотно резиновое -- 3660|4575 рублей/тонна
        # Полотно изоляционное -- 4880|6100 рублей/тонна
        # Трубки резиновые (каучуковые) -- 3172|4026 рублей/тонна
        # Флянцы резиновые -- 2928|3660 рублей/тонна
        # Резина старая -- 244|305 рублей/тонна
        # Брандспойты резиновые -- 6.45|8.5 рублей/штука
        # Коврики резиновые -- 2|2.5 рублей/штука
        # Перчатки резиновые -- 4|5 рублей/пара
        # Сапоги резиновые -- 7.5|9.4 рублей/пара
        # Клеёнка больничная -- 1.4|1.8 рублей/кв.метр
        # Клеёнка дверная -- 0.9|1.2 рублей/кв.метр
        # Клеёнка столовая -- 2.1|2.6 рублей/кв.метр
        # Рукава спиральные -- 3.6|4.5 рублей/кв.метр
        # Рукава бронированные для пневматики -- 5.6|7 рублей/кв.метр
        # Рукава пеньковые прорезиненые -- 2.2|2.8 рублей/кв.метр
        # Рукава резиновые 9.5 мм -- 1.4|1.8 рублей/кв.метр
        # Рукава резиновые 16 мм -- 1.9|2.2 рублей/кв.метр
        # Рукава резиновые 22 мм -- 2.7|3.4 рублей/кв.метр
        # Рукава резиновые гидравлические 25.4 мм -- 7|12.8 рублей/кв.метр
        # Рукава резиновые приёмные 76 мм -- 10.6|13.2 рублей/кв.метр
    # Скобяные материалы
        # Бидоны на 16.4 кг -- 1.5|1.9 рублей/штука
        # Бидоны на 8.2 кг -- 1|1.25 рублей/штука
        # Бидоны на 4.1 кг -- 0.6|0.75 рублей/штука
        # Бидоны на 2 кг -- 0.35|0.45 рублей/штука
    # Дверные приборы
        # Блоки дверные -- 0.2|0.25 рублей/штука
        # Ручки железные дверные -- 0.15|0.2 рублей/штука
        # Задвижки дверные -- 0.6|0.75 рублей/штука
        # Замки дверные -- 1.5|1.9 рублей/штука
        # Накладки дверные -- 0.4|0.5 рублей/штука
        # Предохранители дверные -- 0.5|0.65 рублей/штука
        # Пружины дверные Американские -- 1.0|1.25 рублей/штука
        # Шпингалеты дверные -- 0.9|1.1 рублей/штука
        # Щеколды дверные -- 0.35|0.45 рублей/штука
        # Кольца дверные -- 0.02|0.02 рублей/штука
        # Петли дверные -- 0.1|0.12 рублей/штука
    # Оконные приборы
        # Задвижки оконные -- 0.25|0.3 рублей/штука
        # Закладки оконные и форточные -- 0.05|0.05 рублей/штука
        # Крючки ветровые -- 0.2|0.25 рублей/штука
        # Навесы оконные от 3-5" -- 0.35|0.45 рублей/штука
        # Ручки оконные -- 0.3|0.4 рублей/штука
        # Шпингалеты оконные -- 0.4|0.5 рублей/штука
        # Угольники -- 0.02|0.025 рублей/штука
    # Печные приборы
        # Колосники печные -- 61|76.3 рублей/тонна
        # Вентиляторы (трубы) -- 0.35|0.45 рублей/штука
        # Душники медные -- 0.85|1.05 рублей/штука
        # Душники железные -- 0.25|0.35 рублей/штука
        # Дверки простые чугунные -- 1.5|1.9 рублей/штука
        # Дверки герметические чугунные вычистные -- 0.5|0.65 рублей/штука
        # Дверки для плиты -- 1.9|2.4 рублей/штука
        # Плиты чугунные -- 1.4|1.75 рублей/штука
        # Задвижки чугунные -- 0.35|0.45 рублей/штука
        # Вьюшки чугунные -- 0.5|0.6 рублей/штука
        # Короба духовые -- 2.1|2.6 рублей/штука
        # Котлы чугунные для плит (объём?) -- 2.0|2.5 рублей/штука
        # Решётки печные -- 0.15|0.2 рублей/штука
        # Поддувало -- 0.45|0.6 рублей/штука
        # Чистки печные -- 0.25|0.3 рублей/штука
        # Приборы вентиляционные 6x10" -- 5.1|6.5 рублей/штука
        # Приборы вентиляционные 4x6" -- 3.5|4.4 рублей/штука
        # Приборы вентиляционные 6x8" -- 4.6|5.75 рублей/штука
        # Приборы вентиляционные 8x8" -- 9.0|11.25 рублей/штука
        # Приборы вентиляционные 8x10" -- 12.5|15.65 рублей/штука
    # Шорные приборы
        # Щётки для лошадей -- 3.0|3.75 рублей/штука
        # Скребницы для лошадей -- 0.55|0.7 рублей/штука
        # Хомуты (чушь, цена завышена в 5 раз!) -- 11|13.75 рублей/штука
    # Замки
        # Замки висячие большие -- 1.15|1.45 рублей/штука
        # Замки висячие средние -- 0.6|0.75 рублей/штука
        # Замки висячие малые -- 0.25|0.3 рублей/штука
        # Замки висячие дверные -- 1.5|1.9 рублей/штука
    # Хозяйственные предметы и материалы
        # Целюлоид (пластмасса) -- 25 864|32 330 рублей/тонна
        # Волос конский -- 3050|3813 рублей/тонна
        # Вата гироскопическая -- 1452|1807 рублей/тонна
        # Фитиль восковой -- 1007|1278 рублей/тонна
        # Бумага обёрточная -- 183|229 рублей/тонна
        # Трава морская -- 122|153 рублей/тонна
        # Бочонки -- 1.0|1.25 рублей/штука
        # Вёдра оцинкованные -- 0.6|0.75 рублей/штука
        # Кружки эмалированные -- 0.4|0.5 рублей/штука
        # Кастрюли эмалированные -- 1|1.25 рублей/штука
        # Мётлы берёзовые -- 0.04|0.05 рублей/штука
        # Марля -- 0.12|0.16 рублей/кв.метр
        # Мыло душистое (кусок) -- 0.1|0.1 рублей/штука
        # Фонари железнодорожные -- 1.9|2.4 рублей/штука
        # Фонари керосиновые ручные -- 2.25|2.8 рублей/штука
        # Фонари столбовые -- 3.25|4.05 рублей/штука
        # Фонари стенные -- 6.25|7.8 рублей/штука
        # Лампы керосиновые висячие -- 4|5 рублей/штука
        # Лампы керосиновые ручные -- 0.85|1.05 рублей/штука
        # Лампы керосиновые столбовые -- 4|5 рублей/штука
        # Умывальники чугунные 36" (0.91 метра диаметр?) -- 30|37.5 рублей/штука
        # Умывальники чугунные 30" -- 24|30 рублей/штука
        # Умывальники фаянсовые 25" -- 14|17.5 рублей/штука
        # Кронштейны к умывальникам -- 2|2.5 рублей/штука
        # Лапти -- 0.65|0.8 рублей/пара
        # Печи чугунные -- 4|5 рублей/штука
        # Термометры -- 3.5|4.4 рублей/штука
        # Термометры больничные -- 1.1|1.4 рублей/штука
        # Полотенце -- 0.35|0.4 рублей/штука
        # Наволочки -- 0.4|0.5 рублей/штука
    # Шерсть, шкуры, сырьё
        # Шерсть русская рунная грязная -- 397|494 рублей/тонна
        # Шерсть русская рунная мытая -- 1037|1296 рублей/тонна
        # Шерсть испанская рунная грязная -- 732|915 рублей/тонна
        # Шерсть испанская рунная мытая -- 2745|3431 рублей/тонна
        # Поярок грязный для валянья -- 366|458 рублей/тонна
        # Щетина сырец -- 2440|3050 рублей/тонна
        # Пенька сырец -- 427|534 рублей/тонна
        # Копыта и рога -- 122|153 рублей/тонна
        # Шкуры рогатого скота свежие -- 244|305 рублей/тонна
        # Шкуры рогатого скота сухие -- 488|610 рублей/тонна
        # Мыло бельевое -- 244|305 рублей/тонна
        # Эссенция уксусная -- 683|854 рублей/тонна
    # Продукты продовольствия
        # Пшеница -- 73.2|91.5 рублей/тонна
        # Рожь -- 48.8|54.9 рублей/тонна
        # Овёс -- 36.6|45.75 рублей/тонна
        # Просо -- 45.75|54.9 рублей/тонна
        # Кукуруза -- 30.5|36.6 рублей/тонна
        # Ячмень -- 42.7|51.85 рублей/тонна
        # Мука ржаная -- 57.95|- рублей/тонна
        # Гречиха -- 48.8|61 рублей/тонна
        # Горох -- 67.1|82.35 рублей/тонна
    # Крупа разная
        # Манная -- 152.5|- рублей/тонна
        # Овсяная -- 103.7|- рублей/тонна
        # Пшено -- 79.3|- рублей/тонна
        # Ячневая -- 122|- рублей/тонна
        # Перловая -- 122|- рублей/тонна
        # Гречневая -- 91.5|- рублей/тонна
        # Отруби пшеничные -- 15.25|18.3 рублей/тонна
        # Отруби ржаные -- 9.15|12.2 рублей/тонна
    # Овощи сырые
        # Картофель -- 30.5|39.65 рублей/тонна
        # Капуста -- 50|62.5 рублей/тонна (0.1|0.125 рублей/качан)
        # Морковь -- 61|76.25 рублей/тонна
        # Бурак (свёкла) -- 61|76.25 рублей/тонна
        # Баклажаны -- 36.6|45.75 рублей/тонна
        # Лук -- 82.35|103.7 рублей/тонна
    # Сельско-хозяйственные продукты
        # Масло коровье 1-го сорта -- 976|1220 рублей/тонна
        # Масло коровье 2-го сорта -- 610|763 рублей/тонна
        # Масло подсолнечное -- 268|- рублей/тонна (???)
        # Сыр кавказский -- 610|763 рублей/тонна
        # Сыр брынза -- 366|458 рублей/тонна
        # Мёд пчелиный -- 488|610 рублей/тонна
        # Сало свиное -- 439|549 рублей/тонна
        # Яйцо -- 0.1|0.15 рублей/10_штук
    # Фрукты сушёные
        # Абрикосы -- 610|763 рублей/тонна
        # Чернослив -- 976|1220 рублей/тонна
        # Вишня -- 976|1220 рублей/тонна
        # Яблоко -- 488|610 рублей/тонна
        # Слива -- 488|610 рублей/тонна
    # Рыба, мясо
        # Судак сушёный -- 305|381 рублей/тонна
        # Сельди каспийские простые -- 305|381 рублей/тонна
        # Говядина -- 293|366 рублей/тонна
        # Баранина -- 275|342 рублей/тонна
        # Свинина -- 342|427 рублей/тонна
    # Бакалейные
        # Сахар рафинад -- 317|- рублей/тонна
        # Сахар песок -- 268|- рублей/тонна
        # Соль крупная -- 18.3|24.4 рублей/тонна
        # Соль молотая -- 21.35|24.4 рублей/тонна
    # Фураж
        # Солома ржаная -- 3.05|4.27 рублей/тонна
        # Вика -- 3.05|4.27 рублей/тонна
        # Жмых подсолнечный -- 39.65|48.8 рублей/тонна
        # Жмых льняной -- 51.85|64.05 рублей/тонна
    # Готовые изделия собственного производства (Харьков)
        # Чугун литейный №0 -- 47.6|- рублей/тонна
        # Чугун литейный №1 -- 46.4|- рублей/тонна
        # Чугун литейный №1 -- 45.1|- рублей/тонна
        # Чугун передельный -- 42.7|- рублей/тонна
        # Чугун зеркальный -- 73.2|- рублей/тонна
        # Болванки литые мартеновские -- 54.9|- рублей/тонна
        # Болванки литые бессемеровские -- 64.1|- рублей/тонна
        # Заготовки до 2.5" -- 70.2|- рублей/тонна
        # Сталь кованая фасонная -- 183|- рублей/тонна
        # Сортовое железо -- 91.5|- рублей/тонна
        # Рельсы Вильямса свыше 15 ф -- 76.3|- рублей/тонна
        # Рельсы Виньоля -- 79.3|- рублей/тонна
        # Рельсы трамвайные -- 85.4|- рублей/тонна
        # Рельсы рудничные -- 91.5|- рублей/тонна
        # Скрепления железнодорожные нормального типа -- 128|- рублей/тонна
        # Скрепления железнодорожные рудничные -- 122|- рублей/тонна
        # Ухваты трамвайные -- 122|- рублей/тонна
        # Бандажи вагонные, паровозные и тендерные -- 103.7|- рублей/тонна
        # Разводки бандажные -- 79.3|- рублей/тонна
        # Железо листовое -- 97.6|- рублей/тонна
        # Сталь универсальная -- 97.6|- рублей/тонна
        # Сутунки для кровельных листов -- 76.3|- рублей/тонна
        # Кровельное железо 11 ф. 1 сорт -- 146|- рублей/тонна
        # Кровельное железо 3 сорт -- 128|- рублей/тонна
        # Кровельное железо недокатанное -- 128|- рублей/тонна
        # Балки и швеллера -- 85.4|- рублей/тонна
        # Проволока от 5-6.4 мм -- 107|- рублей/тонна
        # Оси кованные вагонные -- 116|- рублей/тонна
        # Оси кованные паровозные -- 131|- рублей/тонна
        # Оси кованные тендерные -- 122|- рублей/тонна
        # Центров. колёсн. (???) -- 153|- рублей/тонна
        # Днища вагонов штампованные -- 366|- рублей/тонна
        # Сталь калиброванная -- 244|- рублей/тонна
        # Оси кованные для бричек -- 165|- рублей/тонна
        # Штанги буровые -- 110|- рублей/тонна
        # Трубы чугунные -- 85.4|- рублей/тонна
        # Литьё чугунное -- 183|- рублей/тонна
        # Котлы паровые -- 275|- рублей/тонна
        # Металлические конструкции клёпанные (фермы, мосты, стропила) -- 275|- рублей/тонна
        # Изделия механической обработки -- 305|- рублей/тонна
        # Трубы цельнотянутые -- 336|- рублей/тонна
        # Трубы сварочные мелкие -- 275|- рублей/тонна
        # Трубы сварочные диаметром 3" -- 244|- рублей/тонна
        # Фланцы для труб -- 107|- рублей/тонна
        # Фасонные части раструбов -- 171|- рублей/тонна
        # Фасонные части фланцев смешан. -- 220|- рублей/тонна
    # Мануфактура
        # Вата -- 976|1220 рублей/тонна
        # Бумазей -- 0.4|0.5 рублей/кв.метр
        # Ситец-бязь -- 0.5|0.6 рублей/кв.метр
        # Ткани белые -- 0.6|0.8 рублей/кв.метр
        # Ткани одежные хлопчато-бумажные -- 0.8|1 рублей/кв.метр
        # Бязь кубовая -- 0.6|0.7 рублей/кв.метр
        # Босфор чёрный -- 1.5|1.9 рублей/кв.метр
        # Грингсбон -- 0.6|0.8 рублей/кв.метр
        # Лама подкладочная -- 0.6|0.8 рублей/кв.метр
        # Миткаль и Ланкорт -- 0.4|0.5 рублей/кв.метр
        # Нанбук чёрный -- 0.8|1 рублей/кв.метр
        # Плотно хаки -- 0.7|0.9 рублей/кв.метр
        # Плотно славянское -- 0.4|0.5 рублей/кв.метр
        # Плотно финское -- 0.6|0.8 рублей/кв.метр
        # Сатин набивной разных цветов -- 0.6|0.8 рублей/кв.метр
        # Сатин трикотажный чёрный -- 1|1.3 рублей/кв.метр
        # Сукно вигоневое -- 1|1.3 рублей/кв.метр
        # Сукно Маренго -- 0.9|1.1 рублей/кв.метр
        # Тик набивной -- 0.7|0.9 рублей/кв.метр
        # Трикотаж Риш -- 1.1|1.3 рублей/кв.метр
        # Шведская материя цветная -- 0.9|1.1 рублей/кв.метр
        # Шевиот диагональный цветной -- 1.1|1.4 рублей/кв.метр
    # Спецодежда
        # Полотенца хлопчато-бумажные -- 0.2|0.25 рублей/штука
        # Простыни хлопчато-бумажные -- 2|2.5 рублей/штука
        # Скатерти хлопчато-бумажные -- 1.6|2 рублей/штука
        # Платки носовые -- 0.13|0.17 рублей/штука
        # Платки головные ситцевые набивные -- 0.3|0.38 рублей/штука
        # Платки шерстяные -- 3|3.75 рублей/штука
        # Платки вязанные -- 1.5|1.8 рублей/штука
        # Брюки хлопчато-бумажные -- 1.8|2.25 рублей/пара
        # Брюки рабочие -- 1.4|1.75 рублей/пара
        # Кальсоны хлопчато-бумажные -- 0.8|1 рублей/пара
        # Кальсоны вязанные -- 2.4|3 рублей/пара
        # Юбки -- 1.8|2.25 рублей/штука
        # Бушлаты -- 2.5|3.1 рублей/штука
        # Рубахи -- 1.2|1.5 рублей/штука
        # Блузки -- 1.4|1.75 рублей/штука
        # Сорочки-косоворотки -- 1.2|1.5 рублей/штука
        # Косоворотки -- 1.3|1.5 рублей/штука
        # Фартуки -- 0.5|0.65 рублей/штука
        # Гимнастёрки -- 2.5|3.1 рублей/штука
        # Пиджаки летние -- 2|2.5 рублей/штука
        # Кепи -- 1.2|1.5 рублей/штука
        # Фуражки суконные -- 2|2.5 рублей/штука
        # Фуражки парусиновые -- 1.2|1.5 рублей/штука
        # Шапки меховые -- 3|3.75 рублей/штука
        # Френчи суконные -- 4.5|5.5 рублей/штука
        # Фуфайки трикотажные -- 2|2.5 рублей/штука
        # Куртки хлопчато-бумажные -- 2.5|3.1 рублей/штука
        # Пальто мужское набивка вата -- 14|17.5 рублей/штука
        # Пальто дамское суконное -- 35|45 рублей/штука
    # Кожа и обувь
        # Пуговицы -- 1.2|1.5 рублей/1000_штук
        # Подошва весовая -- 1952|2440 рублей/тонна
        # Подошва середовая -- 0.8|1 рублей/пара
        # Чернила чёрные для обуви -- 325|407 рублей/тонна
        # Шпильки железные для обуви -- 183|229 рублей/тонна
        # Ботинки мужские хромовые -- 6.5|7.9 рублей/пара
        # Ботинки дамские хромовые -- 5.75|7.2 рублей/пара
        # Ботинки детские хромовые -- 3.75|4.7 рублей/пара
        # Ботинки дамские суконные -- 3.75|4.7 рублей/пара
        # Заготовки мужские хромовые -- 2.25|2.8 рублей/пара
        # Заготовки дамские хромовые -- 2.25|2.8 рублей/пара
        # Валенки -- 1.5|1.9 рублей/пара
        # Сандалии мужские -- 3.6|4.5 рублей/пара
        # Сандалии дамские -- 3|3.75 рублей/пара
        # Сандалии детские -- 2.5|3.1 рублей/пара
        # Галоши детские -- 1.2|1.5 рублей/пара
        # Руковицы кожаные -- 0.6|0.75 рублей/пара
    # Сельскохозяйственные машины, запчасти и орудия
        # Заклёпки для набора кос и пальцев -- 183|229 рублей/тонна
        # Запчасти чугунные, вес детали до 8.2 кг -- 122|153 рублей/тонна
        # Запчасти чугунные, вес детали свыше 8.2 кг -- 116|146 рублей/тонна
        # Сеялки разбросные 8-рядные -- 65|81 рублей/штука
        # Сеялки сошниковые 7-рядные -- 60|75 рублей/штука
        # Сеялки дисковые 8 дисков -- 140|175 рублей/штука
        # Сеялки кукурузные сошниковые однорядные -- 35|44 рублей/штука
        # Сеялки кукурузные сошниковые двурядные -- 105|126 рублей/штука
        # Сеялки кукурузные дисковые трёхрядные -- 150|188 рублей/штука
        # Сеялки свекловичные трёхрядные -- 90|113 рублей/штука
        # Сеялки свекловичные пятирядные -- 110|138 рублей/штука
        # Картофелесажалка однорядная -- 195|244 рублей/штука
        # Зернодробилки 6" -- 75|94 рублей/штука
        # Зернодробилки 8" -- 95|119 рублей/штука
        # Соломорезки -- 35|44 рублей/штука
        # Корнерезки -- 20|25 рублей/штука
        # Сортировки -- 100|125 рублей/штука
        # Триеры -- 100|125 рублей/штука
        # Змейки -- 15|19 рублей/штука
        # Куккулеотборники -- 200|250 рублей/штука
        # Аспираторы (Тарары) -- 220|275 рублей/штука
        # Дробильники для измельчения початков -- 100|125 рублей/штука
        # Дробилки для кукурузы -- 70|88 рублей/штука
        # Зерносушилки 2.6-4.4 тонн -- 223|276 рублей/штука
        # Молотилка -- 305|381 рублей/штука
        # Приводы конные -- 100|125 рублей/штука
        # Молотилки кукурузные малые -- 20|25 рублей/штука
        # Молотилки кукурузные средние -- 35|44 рублей/штука
        # Молотилки для подсолнечника с барабаном 0.836 метра -- 160|200 рублей/штука
        # Двигатель паровой (оценочно) -- 250|300 рублей/киловатт
        # Двигатель паровой 4.5 кВт -- 1200|1500 рублей/штука
        # Двигатель паровой 6 кВт  -- 1400|1750 рублей/штука
        # Плуги однолемешные -- 15|18.8 рублей/штука
        # Плуги 2-х лемешные -- 30|37.5 рублей/штука
        # Передки к плугам -- 7|8.75 рублей/штука
        # Дёрноснимы (дёрносниматели) -- 2.5|3.1 рублей/штука
        # Запашники 3 лемешные -- 45|56 рублей/штука
        # Запашники 4 лемешные -- 50|63 рублей/штука
        # Культиваторы 5 лапчатые -- 18|23 рублей/штука
        # Культиваторы 7 лапчатые -- 23|29 рублей/штука
        # Энспираторы 3-х угольные -- 10|12.5 рублей/штука
        # Коркорезы -- 15|18.75 рублей/штука
        # Окучники -- 10|12.5 рублей/штука
        # Распашники -- 12|15 рублей/штука
        # Подпочвенники -- 17|21.25 рублей/штука
        # Борона 8-дисковая -- 50|62.5 рублей/штука
        # Борона 12-дисковая -- 60|75 рублей/штука
        # Транспорта и передки к ним -- 10|12.5 рублей/штука
        # Бороны пружинные 7 зубов -- 10|12.5 рублей/штука
        # Бороны пружинные 12 зубов -- 20|25 рублей/штука
        # Бороны пружинные 15 зубов -- 23|28.75 рублей/штука
        # Бороны зубчатые в 2 звена -- 12|15 рублей/штука
        # Зигзаг 3-х звенный -- 17|21.5 рублей/штука
        # Бороны полевые -- 20|25 рублей/штука
        # Бороны луговые (за звено) -- 1|1.25 рублей/звено
        # Жатвенные приспособления -- 18|22.5 рублей/штука
        # Сноповязалки 6-футовые -- 270|337.5 рублей/штука
        # Самоскидки 5-футовые -- 120|150 рублей/штука
        # Сенокосилки 4.5-футовые -- 90|112.5 рублей/штука
        # Лобогрейки -- 90|112.5 рублей/штука
        # Транспорты к сноповязалке -- 15|18.75 рублей/штука
        # Передки к самокоскам и сенокосилкам -- 5|6.25 рублей/штука
        # Картофелекопатель -- 105|126.25 рублей/штука
        # Сеноворошилки -- 100|125 рублей/штука
        # Грабли конные 8-футовые -- 40|50 рублей/штука
        # Зебья грабельные -- 0.15|0.2 рублей/штука
        # Косы -- 0.65|0.9 рублей/штука
        # Косы, комплект -- 1.7|2.15 рублей/штука
        # Подкладки для кос -- 0.05|0.05 рублей/штука
        # Колёса ходовые -- 12|15 рублей/штука
        # Колёса передковые -- 0.9|1.15 рублей/штука
        # Подшипники малые -- 0.6|0.75 рублей/штука
        # Подшипники средние -- 0.75|0.95 рублей/штука
        # Подшипники большие -- 1|1.25 рублей/штука
        # Пружины для щелкунов русских жаток -- 0.015|0.02 рублей/штука
        # Пружины склонные -- 0.15|0.2 рублей/штука
        # Стойки к русским машинам -- 1.2|1.5 рублей/штука
        # Точила американской системы -- 8|10 рублей/штука
        # Шестерни ходовые к русским машинам -- 0.8|1 рублей/штука
        # Штыри для буксировки -- 0.3|0.35 рублей/штука
    # Телеги
        # Брички -- 80|100 рублей/штука
        # Колёсики к бричкам с рёбрами -- 3|3.75 рублей/штука
        # Ходы крестьянские -- 40|50 рублей/штука
        # Дроги крестьянские -- 30|37.5 рублей/штука
        # Дроги крестьянские рессорные -- 60|75 рублей/штука
        # Дроги крестьянские рессорные с задком и передком -- 80|100 рублей/штука
        # Арбы легкопарные -- 50|62.5 рублей/штука
        # Колёса (стан) -- 12|15 рублей/штука
        # Ободья (стан) -- 3|3.75 рублей/штука
        # Спицы (стан) -- 3|3.75 рублей/штука
        # Ступка (стан) -- 2|2.5 рублей/штука
        # Оглобли -- 0.5|0.65 рублей/штука
    # Шорные товары
        # Вожжи -- 1|1.25 рублей/пара
        # Гуж -- 0.6|0.75 рублей/штука
        # Дуги -- 0.7|0.9 рублей/штука
        # Железо для седелок -- 0.15|0.2 рублей/штука
        # Нашильники -- 0.7|0.9 рублей/штука
        # Недоузок -- 0.2|0.25 рублей/штука
        # Подпруги -- 0.15|0.20 рублей/штука
        # Пряжки -- 0.2|0.25 рублей/штука
        # Постромки -- 1.5|1.9 рублей/штука
        # Скребницы -- 0.15|0.2 рублей/штука
        # Супони -- 0.15|0.2 рублей/штука
        # Уздечки -- 0.4|0.5 рублей/штука
        # Хомут -- 2.5|3.1 рублей/штука
        # Шлея -- 1|1.25 рублей/штука
        # Черезседельник -- 0.3|0.4 рублей/штука
    # Писчебумажные и канцелярские принадлежности
        # Гумми-арабик (смола акации) в порошке -- 2683 рублей/тонна
        # Резина для карандашей -- 7073 рублей/тонна
        # Бумага белая гладкая №1-7 -- 322-511 рублей/тонна
        # Бумага рисовальная -- 439-466 рублей/тонна
        # Бумага бюварная -- 374-382 рублей/тонна
        # Блокноты от 1/12 до 1/4 листа -- 0.07-0.18 рублей/штука
        # Блокноты разные -- 0.125 рублей/штука
        # Конверты почтовые белые тонкие -- 1.2 рублей/1000_штук
        # Конверты почтовые белые средней толщины -- 1.55 рублей/1000_штук
        # Конверты почтовые белые плотные -- 1.85 рублей/1000_штук
        # Кисти для рисования односторонние -- 0.017 рублей/штука
        # Кисти для рисования двусторонние -- 0.054 рублей/штука
        # Карандаши Карнац чёрные круглые кедровые -- 0.011 рублей/штука
        # Карандаши Карнац чёрные лучший сорт -- 0.017 рублей/штука
        # Карандаши Карнац чёрные полированные -- 0.02 рублей/штука
        # Карандаши с резинкой чёрные -- 0.015 рублей/штука
        # Карандаши с резинкой чёрные лучший сорт -- 0.02 рублей/штука
        # Перья стальные -- 2.1-4.3 рублей/1000_штук
        # Ручки стальные, фарфоровые -- 15.3-40.3 рублей/1000_штук
        # Счёты простые 0.22-0.44 метра -- 0.12-0.19 рублей/штука
        # Счёты буковые 0.22-0.44 метра -- 0.25-0.83 рублей/штука
        # Счёты ореховые 0.22-0.44 метра -- 0.63-2.5 рублей/штука
        # Счёты чёрное дерево 0.22-0.44 метра -- 1.7-3.7 рублей/штука
        # Чернила русского производства (во флаконах по 100 грамм) -- 527 рублей/тонна
        # Чернильный порошок русский (в баночках по 0.41 кг) -- 6326 рублей/тонна
        # Чернильницы-непроливайки -- 0.023 рублей/штука
        # Чернильницы плоские без пружины -- 0.17 рублей/штука
        # Чернильницы плоские с пружиной -- 0.3 рублей/штука

#----
# Соотношение цен товаров (Российская Империя, 1838-1913 годы):
    # Дорожные тарифы, транспорт (1870 год):
        # - Железная дорога 1 класс грузов (чай) -- 5.4-11 коп/тонно-километр
        # - Железная дорога (каменный уголь) -- 1.4 коп/тонно-километр
        # - Гужевые перевозки (шоссе, Юг России) -- 11 коп/тонно-километр
        # - Гужевые перевозки (дорога, Сибирь) -- 5 коп/тонно-километр
        # - Речные пути (пароход, Волга) -- 1 коп/тонно-километр
    # Дорожные тарифы, транспорт (Волга, пароходы Зевеке, 1885-1890 годы):
        # - Пассажирский пароход (1 класс) -- 1.02 копейки/чел-километр
        # - Пассажирский пароход (2 класс) -- 0.71 копейки/чел-километр
        # - Пассажирский пароход (3 класс) -- 0.36 копейки/чел-километр
        # - Речные пути (пар, поезд барж, Самара-Рыбинск, 1-й рейс): -- 0.25 коп/тонно-километр
        # - Речные пути (пар, поезд барж, Самара-Рыбинск, 2-й рейс): -- 0.21 коп/тонно-километр
        # - Речные пути (пар, поезд барж, Самара-Рыбинск, 3-й рейс): -- 0.28 коп/тонно-километр
        # Первый рейс весенний, второй-третий летние, четвёртый осенний.
        # От Нижнего Новгорода до Астрахани 2250 км
        # https://ru.wikisource.org/wiki/ЭСБЕ/Волга
    # Дорожные тарифы, транспорт (железные дороги, 1913 год):
        # - Пассажирские перевозки, железная дорога (1 класса) -- 2.7-3.3 коп/чел-километр
        # - Пассажирские перевозки (2 класса) 16 чел/вагон, 6 м³/чел -- 1.6-1.9 коп/чел-километр
        # - Пассажирские перевозки (3 класса) 40 чел/вагон, 2 м³/чел. -- 1-1.3 коп/чел-километр
    # Цены топлива и основных ресурсов (Сибирь, 1901 год):
        # - дрова обжигательные (насыпью) -- 0.61-0.62 рубля/кубометр (1.5 рубля/тонна)
        # - дрова для дома (статистика, 1910 год) -- 0.3-0.5 рубля/кубометр (0.73-1.22 рубля/тонна)
        # - каменный уголь (статистика, 1910 год) -- 12-30 рублей/тонна
        # - кокс (статистика, 1910 год) -- 15-30 рублей/тонна
        # - торф (статистика, 1910 год) -- 9 рублей/тонна
        # - торф резной (себестоимость, ЭСБЕ) -- 1.83 рублей/тонна (энергия = дрова)
        # - торф мятый (себестоимость, ЭСБЕ) -- 3.1-3.7 рублей/тонна
        # - скипидар (Америка, 1898 год, 67 500 000 кг/год) -- 0.22 рубля/килограмм
        # https://ru.wikisource.org/wiki/ЭСБЕ/Угли_бурые_и_их_переработка
        # https://ru.wikisource.org/wiki/ЭСБЕ/Терпентинное_масло
    # Цены топлива (1920 год, доклад ГОЭЛРО):
        # Торф, себестоимость (в ценах 1913 года) -- 0.27 коп/кг условного топлива (29.3 МДж/кг)
        # Гидравлический способ добычи (размывание, перекачка, сушка), 1.6 тонн/трудодень, 164 т/год.
        # Условное топливо (уголь, 29.3 МДж) -- 0.73-0.92 копейки/килограмм
    # Цены удобрений (1897 год)
        # - суперфосфат (12% фосфорной кислоты, 0.3 тонны/гектар) -- 29.3 рублей/тонна
        # - фосфоритная мука (26% фосфорной кислоты, 0.5-0.8 тонны/гектар) -- 24.4 рублей/тонна
        # - сырой гипс (0.25-0.41 тонны/гектар) -- 18.3 рублей/тонна
        # - каинит (12% калия, 0.3 тонны/гектар) -- 45.8 рублей/тонна
        # - чилийская селитра (15% азота) -- 120 рублей/тонна
    # Цены, 1838-1856 годы
        # - мука ржаная -- 134 рублей/тонна
        # - пресноводная рыба -- 250-600 рублей/тонна
        # - говядина -- 400 рублей/тонна
        # - живой гусь -- 1.20 рубля
        # - живая курица -- 0.70 рубля
        # - яйцо -- 0.23 рубля/10_штук
        # - масло коровье или постное -- 1000 рублей/тонна
        # - мёд -- 1220 рублей/тонна
        # - мёд (деревня, Ярославская губерния, 1843 год) -- 366-610 рублей/тонна
        # - мыло - 1000 рублей/тонна
        # - свечи - 1100 рублей/тонна
        # - сено - 30.5 рублей/тонна (4 рубля за воз)
        # - солома - 15.25 рублей/тонна (1 рубль за воз)
        # - солома ржаная (1913 год, Киев) -- 12.2 рублей/тонна
        # - чай чёрный (опт, сухопутный путь, Кяхта) -- 2200 рублей/тонна
        # - чай чёрный (розница) -- 4900 рублей/тонна
        # - сахар (розница, Москва) -- 580 рублей/тонна
        # - Вино (Испания, Херес, 1856 год, "Корабль Ретвизан") -- 110 рублей/тонна
        # http://statehistory.ru/3506/TSeny-iz-memuarov-russkikh-krestyan-18-19-vv/
    # Цены 1863 год
        # - чай чёрный (розница, Кяхтинский) -- 2400-6300 рублей/тонна
        # - чай цветочный (розница, Кяхтинский) -- 4400-24 000 рублей/тонна
        # "Чай и чайная торговля в России и других государствах" А. П. Субботин 1892 год.
    # Цены, 1880 год (Москва)
        # - Ржаная мука -- 59 рублей/тонна
        # - Сахар -- 305 рублей/тонна
    # Цены 1888 год
        # Иностранные, без учёта таможенных пошлин:
        # - чай чёрный (опт, морем, Лондон) -- 620 рублей/тонна
        # - чай чёрный (опт, морем, Китай) -- 460 рублей/тонна
        # - чай зелёный (опт, морем, Китай) -- 590 рублей/тонна
    # Цены 1891 год
        # - чай (опт, Москва) -- 2200-4900 рублей/тонна
    # Цены 1900 год:
        # - картофель -- 120 рублей/тонна
        # - ржаная мука -- 60 рублей/тонна
        # - яйцо -- 0.3 рубля/10_штук
        # - телега -- 24 рубля
        # - сани -- 5-10 рублей
        # - олифа -- 0.98 рубля
        # - ухват (печной?) -- 0.25 рубля 
        # - расчётная книжка -- 5 копеек
        # - замок -- 0.5 рубля
        # - бутылка водки -- 0.52 рубля
        # - колёсная мазь -- 0.45 руб/коробка (5 фунтов?)
        # Южный Байкал, расходная книга:
        # http://clubklad.ru/blog/article/4561/
    # Цены продовольствия (1910 год):
        # Санкт-Петербург, весна:
        # - хлеб ржаной -- 7.3 копеек/кг
        # - хлеб пшеничный -- 12-16 копеек/кг
        # - мясо лучшего сорта -- 33-48 копеек/кг
        # - мясо худшего сорта -- 24-46 копеек/кг
        # - соль -- 2.4 копеек/фунт
        # - сахар -- 37 копеек/фунт
        # Центральный статистический комитет м. в. д. "Города россии в 1910 году"
    # Цены продовольствия (1920 год):
        # - рожь озимая -- 5.5 копеек/кг
        # - овёс -- 4.7 копеек/кг
        # - ячмень -- 4.8 копеек/кг
        # - пшеница -- 6.2 копеек/кг
        # Себестоимость зерна в ценах 1913 года (доклад ГОЭЛРО)
    # Жильё (1860 год)
        # - Изба (страховая выплата) -- 45.4 рублей
        # Страхование жилья 1860 год, Рязанская губерния:
        # 50 821 жилище на сумму 2 307 628 рублей
    # Жильё (1881 год)
        # - Квартира (Петербург, покупка) -- 90 рублей/кв.метр
        # Ссуда на 75%, на 37 лет, за 4.5% годовых (городское кредитное общество)
        # https://ru.wikisource.org/wiki/ЭСБЕ/Квартирный_вопрос
    # Жильё (1900 год)
        # - Двор -- 150 руб (компенсация 73 рубля)
        # Шингарев А.И. Вымирающая деревня:
        # Страхование жилья, 1900 год, Подгоренская волость Воронежского уезза.
    # Жильё (1910 год),
        # Санкт-Петербург:
        # - квартира большая 6+ комнат -- 118 рублей/месяц
        # - квартира средняя 4-6 комнат -- 39 рублей/месяц
        # - квартира малая, меньше 4 комнат -- 18 рублей/месяц
        # Уездные города;
        # - квартира большая 6+ комнат -- 50 рублей/месяц
        # - квартира средняя 4-6 комнат -- 33.3 рублей/месяц
        # - квартира малая, меньше 4 комнат -- 16.7 рублей/месяц
        # Строительство (уездные города):
        # - Деревянный дом (70 кв.м) с жестяной кровлей -- 600-700 рублей (9.3 руб/кв.метр)
        # - Кирпичный дом (150 кв.м) с полной отделкой -- 3000-4000 рублей (23.3 руб/кв.метр)
        # Стоимость деревянного дома -- 2.6 средней годовой зарплаты рабочего.
    # Жильё (1914 год),
        # С отоплением, освещением и обстановкой составлял в среднем:
        # - Койка — 4 руб. 33 коп. 
        # - Полукомната — 4 руб. 36 коп. 
        # - Комната — 8 руб. 45 коп. 
        # - 1-комнатная — 12 руб. 28 коп.
        # - 2-комнатная — 18 руб. 87 коп.
        # - 3-комнатная — 31 руб. 78 коп. 
        # - 4-комнатная — 49 руб. 85 коп.
        # - 5-комнатная — 59 руб. 90 коп.
        # В 1908 году в Киеве цены на квартиры были дешевле на 20-25%. 
        # https://russland.mirtesen.ru/blog/43550176068/TSENYI-I-ZARPLATYI-V-ROSSIYSKOY-IMPERII
    # Жильё (1913 год, Киев)
        # - "Гранд-Отель" — 1 руб. 50 коп. (в сут) 
        # - "Континенталь" — 1 руб. 75 коп. (в сут)
        # - Гранд-отель "Ланчия" — 1-10 руб. (в сут.)
        # - Гостиница "Европейская" — 1-12 руб. (в сут.)
        # - Гостиница Михельсона — 50 коп. — 3 руб. (в сут.) или 12-60 руб. (в мес.)
        # - Номера и меблированные комнаты в центре — 30-40 коп. (в сутки) или 9-12 руб. (в мес)
        # - Меблированные комнаты в частных домах с самоваром и прислугой — 15-20 руб. (в мес.),
            # - на окраинах — 5 руб/месяц
    # Бани (1913 год, Киев)
        # - "Караваевские" (угол пл. Льва Толстого и ул. Пушкинской) — 40 коп.
            # общая баня с мраморным бассейном для плавания
        # - Баня Бугаева (Подол, ул. Андреевская) -- общая — 6-25 коп. 
        # - Баня Бубнова на ул. Жилянской — 7-75 коп.
    # Услуги (1913 год, Киев)
        # - Посыльный — 10-50 коп.
        # - Носильщик — 50 коп.
        # - Трамвай — 3-5 коп.
        # - Газета — 3-5 коп.
        # - Синематограф (кино) — 30-100 коп.
        # - Билет в оперный театр — 20-1600 коп.
    # Транспорт, городской (1913 год, Киев):
        # - Извозчик (со станций железных дорог к центру города) — 25 коп.
        # - плата пароконному — 80-100 коп.
        # - такси (верста) — 30-40 коп/км.
    # Общепит и рестораны (1900 год, Киев)
        # - Стол средней буржуазии (Питербург, кухмистерская, 4 блюда) -- 1 рубль/обед
        # - Стол мелких чиновников и студентов (Петербург, 2 блюда) -- 0.3 рубля/обед
        # "Моя кухня и моё меню" -- Похлёбкин
        # https://flibusta.site/b/76513
    # Общепит и рестораны (1913 год, Киев)
        # - ресторан при гостинице — стоимость табльдота — полноценного обеда — 1 руб.
        # - обед в кухмистерской — 40 коп.
        # - обед в "Дешевых обедах" (благотворительность) из двух блюд — 15 коп.
    # Цены, Москва-Киев (1910-1913 годы):
        # - Батон чёрного черствого хлеба весом в 400 грамм – 3 копейки, (7.5 копеек/килограмм)
        # - Батон ржаного свежего хлеба весом в 400 грамм – 4 копейки, (10 копеек/килограмм)
        # - Батон белого сдобного хлеба весом в 300 грамм – 7 копеек, (23 копейки/килограмм)
        # - Картофель свежий урожай 1 килограмм - 15 копеек,
        # - Картофель старый урожай 1 килограмм - 5 копеек,
        # - Мука ржаная 1 килограмм - 6 копеек,
        # - Мука овсяная 1 килограмм - 10 копеек,
        # - Мука пшеничная высшего сорта 1 килограмм - 24 копейки,
        # - Мука картофельная 1 килограмм - 30 копеек,
        # - Фасоль отборная -- 18 копеек
        # - Макароны простые 1 килограмм - 20 копеек,
        # - Вермишель из муки высшего сорта 1 килограмм - 32 копейки,
        # - Сахарный песок второго сорта 1 килограмм – 25 копеек,
        # - Кусковой сахар рафинад отборный 1 килограмм - 60 копеек,
        # - Пряники тульские с вареньем 1 килограмм - 80 копеек,
        # - Конфеты шоколадные 1 килограмм – 3 рубля,
        # - Кофе в зернах 1 килограмм – 2 рубля,
        # - Чай листовой 1 килограмм – 3 рубля,
        # - Соль поваренная 1 килограмм - 3 копейки,
        # - Молоко свежее 1 литр – 14 копеек,
        # - Сливки жирные 1 литр – 60 копеек,
        # - Сметана 1 литр – 80 копеек,
        # - Творог 1 килограмм - 25 копеек,
        # - Сыр «Российский» 1 килограмм - 70 копеек,
        # - Сыр по иностранной технологии «Швейцарский» 1 килограмм - 1 рубль 40 копеек
        # - Масло сливочное 1 килограмм – 1 рубль 20 копеек,
        # - Масло подсолнечное 1 литр – 40 копеек,
        # - Курица парная 1 килограмм – 80 копеек,
        # - Яйцо отборное десяток- 25 копеек,
        # - Мясо телятина парная вырезка 1 килограмм – 70 копеек,
        # - Мясо говядина лопатка 1 килограмм – 45 копеек,
        # - Мясо свинина шейка 1 килограмм – 30 копеек,
        # - Рыба свежая окунь речной 1 килограмм – 28 копеек,
        # - Рыба свежая судак речной 1 килограмм – 50 копеек,
        # - Рыба свежая сом 1 килограмм – 20 копеек,
        # - Рыба свежая лещ 1 килограмм – 24 копеек,
        # - Рыба мороженая горбуша 1 килограмм – 60 копеек,
        # - Рыба мороженая сёмга 1 килограмм – 80 копеек,
        # - Рыба мороженая осетр 1 килограмм – 90 копеек,
        # - Икра черная зернистая 1 килограмм – 3 рубля 20 копеек,
        # - Икра черная паюсная 1 сорта 1 килограмм – 1 рубль 80 копеек,
        # - Икра черная паюсная 2 сорта 1 килограмм – 1 рубль 20 копеек,
        # - Икра черная паюсная 3 сорта 1 килограмм – 80 копеек,
        # - Икра красная соленая 1 килограмм – 2 рубля 50 копеек,
        # - Овощи капуста свежая 1 килограмм – 10 копеек,
        # - Овощи капуста квашенная 1 килограмм – 20 копеек,
        # - Овощи лук репчатый 1 килограмм – 5 копеек,
        # - Овощи морковь 1 килограмм – 8 копеек,
        # - Овощи помидоры отборные 1 килограмм – 45 копеек.
        # - Овощи, свёкла (Киев 1913 год) -- 1.5 копеек
        # https://ru-history.livejournal.com/2535043.html
        # Рецепты блюд русской кухни от Елены Молоховец, 1901 г.
        # Таблица приблизительных цен различных продуктов.
        # http://www.molohovetc.ru/otdel_i_tablitsa_mery_i_vesa/2_tablitsa_priblizitelnykh_tsen_razlichnykh_produktov/
        # Цены в Киеве по данным Киевского исторического музея на 1913 год
        # https://russland.mirtesen.ru/blog/43550176068/TSENYI-I-ZARPLATYI-V-ROSSIYSKOY-IMPERII
    # Кондитерские, ЭСБЕ (1900 год)
        # Варенье (себестоимость) -- 29-34 копейки/кг
        # Варенье (рыночная цена) -- 73-110 копеек/кг (наценка 250-320%)
        # https://ru.wikisource.org/wiki/ЭСБЕ/Варенье
    # Кондитерские (1911 год, опт)
        # - халва ореховая -- 0.49 рубля/килограмм
        # - чернослив в шоколаде -- 1.13 рубля/килограмм
        # - мармелад фруктовый -- 0.65 рубля/килограмм
        # - пастила фруктовая -- 0.68 рубля/килограмм
        # - пастила банановая -- 0.97 рубля/килограмм
        # - фрукты в сиропе (в бочках) -- 1.2-1.8 рубля/килограмм
        # - кофе зерновой жареный -- 2-2.4 рубля/килограмм
        # - английские бисквиты -- 0.55-0.8 рублей/килограмм
        # - карамель леденцовая -- 0.5-0.6 рублей/килограмм
        # - шоколад весовой, в коробках по 5 фунтов (2 кг) -- 1.1-1.95 рубля/килограмм
            # | название                | штук/фунт | цена (пуд) | цена (кг)
            # | ----------------------- | --------- | ---------- | ---------
            # | Писатели                | 14-15     | 18.2       | 1.11
            # | Войско                  | 23-24     | 19.4       | 1.18
            # | Санте                   | 17-18     | 18.0       | 1.10
            # | Детский                 | 23-24     | 18.0       | 1.10
            # | Этнографический         | 14-15     | 19.2       | 1.17
            # | Виды Москвы             | 15-16     | 22         | 1.34
            # | Батоны Пралине          | 17-18     | 22         | 1.34
            # | Батоны Пралине          | 23-24     | 22         | 1.34
            # | Мексиканский            | 17-18     | 22         | 1.34
            # | Греческий               | 15-16     | 22         | 1.34
            # | Ямаровка                | 15-16     | 22         | 1.34
            # | С разными картинками    | 15        | 22         | 1.34
            # | Виды Киева              | 17-18     | 25         | 1.52
            # | Артисты                 | 30        | 32         | 1.95
            # | Неаполитанский          | 56        | 28         | 1.71
            # | Мелкий с картинками     | 56        | 28         | 1.71
            # | Таблетки сортированные  | 56        | 28         | 1.71
            # | Ист. памятники России   | 48        | 29.2       | 1.78
        # - Эссенции фруктовые и ягодные -- 7.3 рубля/кг
            # персиковая, померанцевая, рябиновая, черёмуховая
            # черносмородиновая, финь-шампань, фисташковая
            # шоколадная, яблочная
        # - Эссенции фруктовые и ягодные -- 8.5 рубля/кг
            # крем ваниль, индийская, бенедиктин
            # мандариновая, розовая, черносливовая
            # Шартрез, мараскинская, флер д'оранжевая
            # абрикотиновая, ванилевая, гелиотроп
        # Оптовый прейскурант. Товарищество А. И. Абрикосова сыновей в Москве. 1911 
        # https://humus.livejournal.com/3965423.html
    # Цены на спиртные напитки:
        # - бутылка казенной водки (600 мл) - 40 коп.
        # - водка двойной очистки (600 мл) - 60 коп.
        # - пиво кружками (600 мл) - 10 коп (16.7 коп/литр)
        # - дешевое разливное вино - 5-20 коп./литр
    # Цены косметики (1910 год)
        # - духи высшей концентрации разных запахов -- 1.8-5.8 рублей/флакон
        # - духи тройные разных запахов -- 3.0-5.4 рублей/флакон
        # - духи "Амбруази" (Essence "Ambroisie") -- 2.5 рублей/флакон (30 рублей/дюжина)
        # - духи "Колерет" (Essence "Collerette") -- 2.75 рублей/флакон (33 рублей/дюжина)
    # Цены военной экипировки:
        # - Сапоги парадные офицерские – 20 рублей,
        # - Мундир парадный офицерский – 70 рублей,
        # - Фуражка обер-офицерская – 3 рубля,
        # - Шапка уланская – 20 рублей,
        # - Шапка гусарская штабная – 12 рублей,
        # - Эполеты штаб-офицерские золочёные – 13 рублей,
        # - Шпоры – 14 рублей,
        # - Драгунские и казачьи сабли – 15 рублей,
        # - Офицерский ранец – 4 рубля.
    # Цены на одежду и обувь:
        # - Рубаха выходная – 3 рубля,
        # - Рубашка — 1 руб.
        # - Парусиновые брюки — 1 руб.
        # - Костюм деловой для приказчиков – 8 рублей,
        # - Костюм (пошив) — 16 руб. 75 коп.
        # - Пальто длинное – 15 рублей,
        # - Пальто демисезонное (пошив) — 19 руб. 50 коп.
        # - Сапоги яловые – 5 рублей,
        # - Сапоги — 4-10 руб.
        # - Ботинки летние- 2 рубля,
    # Цены на оружие (1910 год)
        # Револьверы бельгийских фабрик:
        # - револьвер системы "Бульдог" (калибры 320, 380, 440) -- 3, 3.65, 4.75 рубля
        # - револьверы Констабуляры чёрный или никелированный (320, 380, 440) -- 3.75, 4.45, 5.50 рубля
        # Винтовки:
        # - 20-зарядная винтовка "Savage Arms Company" (калибр .22) -- 17.5 рубля
        # Варшавское охотничье товарищество
    # Цены кухонной утвари (Санкт-Петербург, 1901 год):
        # - лопата, ухват, кочерга -- 0.45-0.75 рубля
        # - эмалированный жестяной котелок для супа (6-8 человек, 7.5 кг) -- 2 рубля (0.27 руб/кг)
        # - эмалированный чугунок для тушения (22.3 см диаметр, 11.1 см высота) -- от 0.8 рубля
        # - медная вылуженная сковорода -- 1-1.2 рубля
        # - глубокий противень (44.5×31.2×6.7 см, 3.8 кг) -- 6-7 рублей (1.7 рубля/кг)
        # - кострюльки эмалированные различной величины -- 0.25-2 рубля
        # - маленькая чугунная сковорода для блинов -- 0.1 рубль
        # - большая чугунная сковорода с длинной ручкой (21.1 см диметр) -- 0.3 рубля
        # - герметически закупориваемый оловянный котелок (на 0.82 кг содержимого) -- 3 рубля
        # - никелированный сотейник (20 см диаметр, 6.7 см высота) -- от 1.5 рубля
        # - вертел для жаренья -- 2-6 рубля
        # - рашпор белого железа для жарения, копчения -- 0.8-1.4 рубля
        # - вафельница -- 1.25-2.5 рубля
        # - форма для трубочек -- 1.25-2.5 рубля
        # - плоская жестяная шумовка -- 0.15-0.35 рубля
        # - кухонная суповая лопатка из кованной жести -- 0.15-0.35 рубля
        # - большая жестяная круглая дурхшлаговая ложка -- от 0.6 рубля
        # - жестяной кованый дуршлаг для макарон, риса -- 0.4-0.6 рубля
        # - жестяное сито с редкой проволочной сеткою (26.7 см диаметр) -- 0.35-0.6 рубля
        # - тазик из жёлтой меди для варений, соков, киселей -- 1.3-3.5 рубля
        # - три кухонных ножа и вилка -- 1.5-3 рубля
        # - жестяное ситечко с мелкой проволочной сеткой -- 0.4 рубля
        # - жестяной совок для муки -- 0.2 рубля
        # - медный рыбный котелок с решёткой -- от 1.3 рубля
        # - большая форма для желе с трубочкой -- от 0.4 рубля
        # - 6-12 маленьких формочек для желе, пирожных -- 5 коп/штука
        # - продолговатые формочки для маленьких заливных и пирожных -- 5-10 коп/штука
        # - форма из кованой жести с трубков в середине и крышкой, для пудингов -- 0.6-1 рубль
        # - жестяная форма без трубки для пудингов, запекаемых в печи -- 0.3-0.5 рубля
        # - раздвижная форма для паштетов -- 0.6-5 рубля
        # - ножик для чистки картофеля и яблок -- 0.25 рубля
        # - жестяная машинка для выдалбливания яблок и картофеля -- 0.25 рубля
        # - жестяныя формочки для вырезывания кореньев -- 0.75-1.25 рубля
        # - машинка-проволока для вытаскивания пробок, попавших в бутылку -- 0.2 рубля
        # - большое деревянное волосяное сито для муки -- 0.25 рубля
        # - маленькое деревянное волосяное ситечко для сахара -- 0.1 рубля
        # - деревянное большое решето для протирания, с пестиком -- 0.25 рубля
        # - жестяная лопаточка для сковороды -- 0.3 рубля
        # - кухонная вилка для опускания в кипящий фритюр -- 0.3-0.8 рубля
        # - резец для обрезывания теста для хвороста, вареников и пр. -- ???
        # - местяная форма без дна, для вырезывания теста для пирогов -- 0.3 рубля
        # - металлическая сбивалка белков, сливок, мусса -- 0.15-0.25 рублей
        # - фильтр тканевый для соков (диаметр 18 см), вешается на стену -- ???
        # - мельница для перца -- 0.4 рубля
        # - жаровня и мельница для кофе -- 1.2 рубля
        # - мясорубка, со станком для привинчивания к столу и 18 ножиками -- 4.25 рубля
        # - простая мороженица в ведре со льдом, осыпанным солью -- от 3.5 рубля
        # - тёрка для овощей -- 0.07-0.3 рубля
        # - мельница-тёрка из кованой жести для выжимания ягод, протирания пюре -- ???
        # - проволочное ситечко для варки порционного риса -- 0.45 рубля
        # - проволочная корзинка для варки цветной капусты, саго, риса -- 0.6 рубля
        # - мельница для миндаля -- 1 рубль
        # - машинка для чистки рыб -- 0.3 рубля
        # - деревянная вилка с ложкой для салатов -- 0.35 рубля
        # - деревянная глубокая чашка -- ???
        # - сечка (топорик) для рубки капусты -- ???
        # - деревянная дощечка для чистки -- 0.1 рубля
        # - деревянная дощечка побольше -- 0.2 рубля
        # - валик фаянсковый для теста и измельчения сухарей -- 1 рублья
        # - скалка деревянная -- 0.2 рубля
        # - большая деревянная доска для раскатывания теста -- 0.6-1.2 рубля
        # - пасочницы разной величины, деревянные -- 0.15 рубля
        # - пасочницы разной величины, жестяные -- 0.5 рубля
        # - металлическая шпиговка для шпигования жарких -- 0.1 рубля
        # - ступка медная -- 1.5 рубля
        # - воронка жестяная или стеклянная -- 0.1 рубля
        # - весы -- 5 рублей
        # - крошечный шкафчик для пряностей -- 1.5-2.8 рубля
        # - большой чайник для кипятка с краном -- от 6 рублей
        # - стеклянные мисочки разной величины -- от 0.2 рубля
        # - ковшики -- от 0.15 рубля
        # - чугун-тушилка для собирания угольев -- 0.5 рубля
        # - щипцы и железная лопаточка для выгребания угольев -- 0.15 рубля
        # - труба для самовара -- от 0.2 рубля
        # - мочалочная кисть -- ???
        # - мехи для раздувания угольев -- 0.6 рубля
        # - простые стенные кухонные часы -- 1.5 рубля
        # - жестяное ведро для мусора -- от 0.5 рубля
        # - железный струг с двумя ручками, для соскабливания грязи с кухоннаго стола -- от 0.5 рубля
        # - самовар-кухня, медный, лужёный изнутри (объём 3-9 стаканов) -- 7.5-10.5 рубля
        # - футляр для самовар-кухни в виде рюкзака -- 3.25-4 рубля
        # - никелированная подставка со спиртовкой для разогревания блюд -- 4 рубля
        # - никелированная подставка низкая -- 2 рубля
        # - плоская проволочная подставка -- 0.35-0.6 рубля
        # - никелированная высокая подставка, на мраморной доске для окороков -- 10 рублей
        # - кофейник медный лужёный (диаметр 13.4 см; высота 17.8 см) -- от 2 рублей
        # - Фаянсовая или деревянная с рисунками дощечка, на которой режут хлеб и булки -- 0.35-0.85 рублей
        # - серебряная или мельхиоровая лопаточка, чтобы брать с блюда сухое пирожное -- от 2 рублей
        # - Никелированныя ножницы для разрезывания веток винограда -- ???
        # - пилочка для лимона -- 2.5 рубля
        # - пробка с ключом для сбережений начатых бутылок с винами -- 0.15-0.4 рубля
        # - пробки с хрустальными и металлическими головками -- 0.15 рубля
        # - стеклянныя десертныя ложки для икры, варенья и пр -- от 0.15 рубля
        # - деревянныя формочки для сливочнаго масла -- от 0.5 рубля
        # - нож для откупоривания устриц -- 0.10 рубля
        # - вилка для устриц -- 1.2 рубля
        # - щипчики для обрезывания проволоки у бутылок с шампанским -- 3.5 рублей
        # - проволочная подставка под бутылки с круглым дном -- 0.15 рубля
        # - пробочники -- от 0.15 рубля
        # - круглыя фаянсовыя подставки для бутылок, кофейника, чайника -- 0.65-2 рубля
        # - стеклянныя или металлическия, маленькия подставки под ножи, вилки -- 0.25 рубля/штука
        # - вертящиеся на ножке подносы со вставленными 4-9 плоскими салатниками для закусок -- от 3.5 р
        # - подставки деревянные, резные с 12 ножичками для фруктов -- 6-15 рублей
        # - настольные красивые разрисованные горшки или вазы для цветов -- от 3 рублей
        # - музыкальныя кружки для пива и холодного питья вообще -- 3 рубля
        # - стеклянная мухоловка (сахар как приманка и липкая жидкость) -- 0.3 рубля
        # - шинковка для шинкования огурцов, капусты для салата, редьки и т.п. -- от 0.4 рубля
        # - большая шинковка для заготовки капусты -- 6 рублей.
        # - металлическое сито на ножках, на котором в сушильной печи сушат овощи, плоды, зелень -- ???
        # - маленькая, спиртовая канфорка -- 1 рубль
        # - бензинная, побольше спиртовой (5-10 минут вскипятить воду для чая) -- 1.25-2.5 рубля
        # - керосиновая кухня, еще большего размера -- 1.25-6 рублей
        # - керосиново-газовая кухня, горящая без фитиля (плавит олово) -- 8 рублей
        # Рецепты блюд русской кухни от Елены Молоховец, 1901 г.
        # Принадлежности кухни и кухонная посуда вообще.
        # http://www.molohovetc.ru/liv-ii/accessories/
        # http://www.molohovetc.ru/liv-ii/dinner_table/
    # Цены фабричных товаров (1910 год):
        # - клозетная бумага, туалетная бумага -- 0.5 рубля/рулон
        # - очки, пенсе с лучшими французскими стёклами, оправа из никеля -- 1.5 рубля
            # - оправа из золота 56 пробы на 15% толщины оправы -- 4.5 рубля
        # - очки с рукоятью, лорнет металлический золочёный -- 6.5 рубля
        # - Гармонь - 7.5 рублей
        # - Патефон - 40 рублей,
        # - Рояль известной марки - 200 рублей,
        # - Автомобиль без дополнительной оснастки – 2000 рублей,
            # 1905 год -- несколько сотен автомобилей в России
            # 1913 год -- 13-14 тысяч автомобилей (4-5 тыс. мотоциклов), 10-е место на мир.
        # - швейная машинка Зингер, Швеция -- 25 рублей
            # - ремонт швейной машинки -- 1 рубль
        # - граммофон -- 35 - 150 рублей
        # - спиртовой фонарь (250 свечей, 7.8 кг) -- 30 рублей
        # - часы наручные с кожаным браслетом -- 12-18 рублей
        # - часы карманные серебряные (84 пробы, гравированные) -- 13.5-19 рублей
        # - изоляционный сосуд "Янус" (термос) -- 2.25-5 рублей
        # - лампочки для домашнего освещения с винтом с угольной нитью -- 0.2 рубля
            # Лампы накаливания с потребленим 0.23-0.26 ватт/люмен самые востребованные
            # ватт/люмен | люмен/лампа  | 50% потеря свечения | долговечность
            # ---------- | ------------ | ------------------- | -------------
            # 0.14       | 263          | 110 часов           | 270 часов
            # 0.22       | 209          | 325                 | 390
            # 0.26       | 202          | 1050                | 1050
            # 1 candlepower equals 12.57 lumens
            # https://ru.wikisource.org/wiki/ЭСБЕ/Электрическое_освещение
            # https://ru.wikipedia.org/wiki/Свеча_Хефнера
            # https://en.wikipedia.org/wiki/Candlepower
        # - с металлической нитью (в 3 раза долговечнее, на 75% энерго-эффективней) -- 0.4 рубля
            # 2, 3, 4, 5, 6, 8, 10 вольт
        # - фонари шкафочные электрические (ореховое дерево) -- 2.25-3 рубля
            # состоят из футляра, батареи и надёжной угольной лампочки.
            # батарея на 4.5 вольта (65x62x21 мм)
                # на 3 часа -- 0.2 рубля/штука
                # "Экстра" на 6 часов (сохраняет энергию 6 месяцев) -- 0.275 рубля/штука
        # - спиртовой утюг (1.2-2.5 кг) -- 3-5 рублей
            # расход спирта -- 0.1 литра/час
            # спирт для утюга -- 10 копеек/литр
        # - барометр американский, никелированная оправа -- 2.5-4.5 рублей
        # - барометр с термометром (дерево, изящная работа) -- 6.5-9.25 рублей
        # - компас в медной оправе -- 0.4-0.75 рублей
        # - шагомер, указывающий количество пройденных шагов -- 6 рублей
        # - бинокль перламутровый с золотыми выдвижками, ахроматические стёкла -- 10.5-22.5 рублей
        # - бинокль в чёрной коже, ахроматические стёкла -- 4.75-12.5 рублей
        # - гирлянда из 10 лампочек -- 7.5 рублей
        # - фотоаппарат, складной карманный Кодак -- 38-47 рублей
            # снабжён апланатическим объективом с двойной комбинацией
            # автоматический затвор, автоматическая фокусная шкала, вращающийся видоискатель
            # алюминий, мелкозернистая кожа, никелированные части
            # размеры 19.5×11.5×4 сантиметра, вес 0.67 кг
            # заряжается на 12 съёмок, снимки 8x10.5 сантиметров
        # - фотографический аппарат (9/12 см) -- 5-9 рублей
        # - настольная лампа, с батареей и выключателем -- 3.5 рубля
        # - зажигалка, карманный закуриватель заграничной работы -- 0.85 рубля
        # - столовое огниво-закуриватель заграничной работы (бензин) -- 1.5 рубля
        # - электрический карманный фонарик с батареей и лампой -- 0.4-2 рубля
        # - электрический карманный фонарик в виде трубки -- 2.5-3 рубля
            # - батарея -- 0.5-0.75 рубля
        # - фонарь велосипедный -- 2-2.5 рубля
        # - термометр комнатный -- 0.25 рубля
        # - термометр наружный -- 0.5-1.25 рубля
    # Цены мебель (1910 год)
        # - Экспортная мебель (оптом) - 0.44-2 рубля/килограмм
            # 1905 год, газета  Русский листок
        # - биде фаянсовое английское -- 40-80 рублей
        # - унитазы фаянсовые -- 9-20 рублей
        # - сиденья для унитазов (американские, вишня) -- 3.75-7 рублей
        # - замок на дверь для клозета -- 3 рубля
        # - бумагодержатель -- 2.5 рубля
        # - держка (для смыва) -- 0.65-3.25 рублей
        # - раковины чугунные эмалированные (весьма изящные) -- 5-20 рублей
        # - корыто чугунное эмалированное (400 длина, 225 высота) -- 4 рубля
        # - писсуары чугунные эмалированные -- 2.4-6.5 рублей
        # - люки чугунные для канализации -- 2 рубля
        # - скобы железные для колодцев -- 0.3 рубля/кг
        # - колена чугунные эмалированные (100 мм) -- 3.4-4.2 рубля
        # - сифоны эмалированные (70 мм) -- 1.5 рубля
        # водопроводные краны и вентили:
        # - вентили кривые (10-25 мм, медь) -- 0.95-2.4 рубля
        # - вентили кривые (10-25 мм, бронза) -- 1.5-3.8 рубля
        # - краны кривые (6.25-25 мм, медь) -- 0.75-2.8 рубля
        # - краны самоприжимные (12.5-25 мм) -- 2.1-5.5 рубля
        # - пожарные кривые вентили (12.5-25) -- 2.4-5.25 рубля
        # водопроводные клапаны и краны:
        # - клапаны для воды с муфтами (9.4-25, медь) -- 0.9-2.3 рубля
        # - клапаны для воды с муфтами (9.4-25, бронза) -- 1.25-3.55 рубля
        # - фарфоровые ручки -- 0.6 рубля/пара
        # - медные ручки для кранов -- 0.4-1.4 рубля
        # - домофон (пара телефонов и звонок) -- 6 рублей
        # - фильтр для воды цинковый (6.5-24 литра) -- 6.5-12 рублей
        # - фильтр для воды с краном и медным резервуаром -- 8 рублей
            # Пропускная способность 1.2 литра/минуту
    # Цены промышленных товаров (1908 год)
        # - висячие замки (кустарь, 150 в год) -- 3 рубля/штука (10.7 нормо-часов)
        # - разные замки (2 кустаря, 500 в год) -- 1.6 рубля/штука (6.4 нормо-часа)
        # - самовары (опт) -- 6.7 руб (13.3 нормо-часа), 10 руб (13.6 н-час) 12 руб (9.3 н-час)
        # - гармони (опт) -- 1.42 руб (5.7 нормо-часа)
        # - валенки (опт) -- 1.67 руб/пара (2.7-3.4 нормо-часа), 5 руб/пара (3.2 н-час)
        # - краски разные (опт, 3 раб) -- 0.04 рубля/килограмм (0.0156 нормо-часа/килограмм)
        # - чулки (мелкий опт, 4 раб) -- 0.8 рубля/пара (6.4 нормо-часа)
        # - рукавицы кожаные (мелкий опт, 12 раб) -- 0.4 рубля/пара (0.4 нормо-часа)
        # - туфли (мелкий опт, 20 раб) -- 0.75 руб/пара (0.8 нормо-часа)
        # - стеариновые свечи (опт, 4 раб) -- 0.125 руб/пачка (0.046 нормо/часа)
        # - мыло для белья (опт, 4 раб) -- 0.24 руб/килограмм (0.016 нормо/часа)
        # - мыло простое и туалетное (опт, 41 раб) -- 0.4 руб/килограмм (0.4 нормо/часа)
        # - пиво (опт, 35 раб) -- 0.4 руб/литр (0.45 нормо-часа)
        # - велосипеды (опт, 50 раб) -- 114 руб/штука (229 нормо-часов)
        # - спички (опт, 55 раб) -- 0.8 руб/ящик (6.4 нормо-часа)
        # - канаты и верёвки (опт, 2000 раб) -- 0.37 руб/кг (0.78 нормо-часа)
        # - канаты и верёвки (опт, 550 раб) -- 0.38 руб/кг (0.67 нормо-часа)
        # - бумага (опт, 100 раб) -- 0.24 руб/кг (0.13 нормо-часа)
        # - табак (опт, 500 раб) -- 0.54 руб/кг (0.17 нормо-часа)
        # - ультрамарин (опт, 55 раб) -- 0.44 руб/кг (0.22 нормо-часа)
        # - платки шерстяные (опт, 250 раб) -- 1.25 руб/штука (1 нормо-час)
        # - мануфактура, ткани (опт, 1526 раб) -- 0.21 руб/метр (0.1 нормо-часа)
        # - масло льняное, олифа (опт, 30 раб) -- 0.3 руб/кг (0.073 нормо-часа)
        # - цинковое белило (опт, 20 раб) -- 0.022 руб/литр (0,0072 нормо-часа)
        # - перчатки (опт, 45 раб) -- 0.7 руб/пара (1.44 нормо-часа)
        # - фуражки (опт, 25 раб) -- 0,87 руб/штука (0.67 нормо-часа)
        # - воды фруктовые и содовые (опт, 24 раб) -- 1.6 руб/литр (0.13 нормо-часа) 
        # - масло подсолнечное (опт, 40 раб) -- 0.24 руб/кг (0.04 нормо-часа)
        # - табачный экстракт (опт, 5 раб) -- 0.3 руб/кг (0.24 нормо-часа)
        # - гвозди проволочные (опт, 40 раб) -- ??? руб/кг (0.04 нормо-часа/кг)
            # Производство гвоздей (Россия, 1892 год) -- 0.1 кг/человека
            # https://ru.wikisource.org/wiki/ЭСБЕ/Гвозди
        # - гвозди импортные (сапожные, обойные) -- 0.6 рубля/кг
        # - гвозди сапожные (шпильки из клёна) -- 0.17 рубля/кг
            # Брак 50-70%, производство 16 кг/станок-час, 1511 кг/рабочего-год.
        # - гвозди сапожные (импортные, 1890-й год) -- 0.29 рубля/кг
        # - алебастр молотый и колотый (опт, 80 раб) -- ??? руб/кг (0.016 нормо-часа/кг)
        # - конфеты (карамель?) (опт, 125 раб) -- 0.4 руб/кг (0.41 нормо-часа)
        # - бумага листовая (опт, 380 раб) -- 0.76 руб/кг (0.62 норма-часов)
        # - гильзы (опт, 50 раб) -- 4 руб/ящик (5.3 нормо-часа/ящик)
        # - плуги (опт, 715 раб) -- 20.4 руб/плуг (26.1-45.8 нормо-часов/плуг)
        # - однолемешковые плуги (опт, 300 раб) -- 12.5 руб/плуг (24 нормо-часа/плуг)
        # "Каталог 12-й осенней сельско-хозяйственной и промышленной выставки" Ростов на Дону
        # https://rusneb.ru/catalog/000199_000009_007860399/
        # в списке 1178 предприятий промышленных и кустарных:
        # В списке 102 завода сельско-хозяйственных машин и орудий.
        # * Рассчёт оптовых цен по годовому обороту и продукции фабрик.
        # * Нормо-часы по численности рабочих (8 часов/день, 200 дней/год) и годовой продукции.
    # Цены кустарных товаров (1913):
        # - Самовые кустарные простые -- 6 рублей, 20 нормо-часов
            # - Самовые кустарные фигурные -- 10 рублей, 40 нормо-часов
            # - Сборка самовара из деталей -- 4.2 нормо-часа/штука
            # https://art-samovar.ru/articles/38375/
        # - Стул простой -- 9 копеек
        # - Ковёр, 3x2 аршина (2.1x1.4 метра) -- 1.7-6.8 рублей/кв.метр
            # - 6 человеко-дней/ковёр, 88 кв.метров/год -- 16 нормо-часов/кв.метр 
            # - 3.5-5 рублей в Тюмени (1884 год)
            # - 18-20 рублей в Дубровке (1912 год)
            # - 12-20 рублей в Воронежской губернии
        # - соломенная шляпа -- 0.35 рубля
        # - крашенная соломенные шляпа -- 1.8 рубля/штука
        # - Гончарные изделия (скупщику) -- 15-20 рублей за 1000 штук (2 копейки/горшок)
            # Гончар делает 15 тыс. горшков/год, 140 горшков/день летом, 70 горшков/день зимой.
            # http://avtor-dona.ru/kazachij-kuren/kukhnya-kazakov/kukhonnaya-posuda-i-utvar
        # "Кустарная промышленность России" 1913
        # https://www.prlib.ru/item/425782
        # https://ru.wikisource.org/wiki/ЭСБЕ/Мебельное_производство
        # https://ru.wikisource.org/wiki/ЭСБЕ/Бязь
    # Цены сырья (розничные):
        # - хлопок (1900 год, Тифлис) -- 7-9 руб/пуд (0.43-0.55 рубля/кг)
        # - пряжа (1898 год, Москва, биржа) -- 15.7-16.5 руб/пуд (1 рубль/кг)
        # - ткань, бязь (1890 год, Тифлис) -- 11-12 коп/кв.аршин (0.06 руб/кв.метр)
            # 130-160 кв.аршинов/пуд хлопка, 3.96-4.87 кв.метров/килограмм хлопка-сырца.
            # Должно быть 205-252 грамма хлопка-сырца на кв.метр готовой ткани
            # Плотность ткани 120 грамм, потери 40-52%.
        # - пряжа окрашенная -- 20 руб/пуд (1.22 рубля/кг)
            # - Аниловые краски -- 4.3 грамма/кв.метр ковра
            # - Синий и зелёный купорос -- 5 коп/фунт (12 коп/кг)
            # - Марена красильная (ализарин) -- тёмно-красная краска
            # - Чёрная краска -- Кору ольхи залить водой, вскипятить воду, бросить купорос.
        # - льняное волокно -- 3-4 рубля/пуд (18-24 коп/кг)
        # - Овечья шерсть -- 5-8 рублей/пуд (0.3-0.5 руб/кг)
        # - Коровья шерсть -- 2-3 рубля/пуд (0.12-0.18 руб/кг)
        # - Яловая шерсть -- 4 рубля/пуд (0.24 руб/кг)
        # - Соломенная плетёнка для шляп -- 40-80 коп/65 аршин (1-2 копейки/метр)
            # - Плетение соломы -- 6.3 аршин/день (0.56 метра/нормо-час) -- 0.2 рубля/метр
            # Плотность плетёнки: 15 пудов соломы на 365 мотков (65 аршин/моток) -- 10 грамм/аршин
            # Плетёнка №0 (самая тонкая) -- 6 аршин/день от лучшего мастера
            # Плетёнка №5 (толстая) -- 25 аршин/день от неумехи
            # - Солома варшавская для шляп -- 12 руб/пуд (0.73 руб/кг)
        # Импорт жмыха в Англию:
            # https://ru.wikisource.org/wiki/ЭСБЕ/Жмыхи
            # 1878 год, 1 497 851 пудов, 1 312 264 рублей -- 5.3 коп/килограмм
            # 1880 год, 1 694 837 пудов, 1 761 085 рублей -- 6.3 коп/килограмм
            # 1889 год (подсолнечный), 2 434 000 пудов, 1 637 000 рублей -- 6.7 коп/килограмм
            # 1890 год (подсолнечный), 1962 354 пудов, 1 379 856 рублей 
            # 1892 год (подсолнечный), 1962 354 пудов, 1 379 856 рублей
            # 1891 год (подсолнечный), 2434 000 пудов, 1 637 000 рублей 
    # Услуги связи (1892-1910 годы):
        # - почтовая марка, самая распространённая (1896 год) -- 7 копеек/штука
        # - подписка на газету, журнал (1892 год) -- 0.5-3 рубля/год (или 10% с подписной цены)
        # - простое письмо, земская почта (1892 год) -- 1-5 копеек
        # - посылка, земская почта (1892 год) -- 10-12 копеек/килограмм
        # - послать письмо (1910 год) - 4 коп.
        # - отправить посылку весом менее 5 кг (1910 год) - 65 коп.
        # - телефонный звонок - 50 коп./минута
        # - телеграф - 5 коп./слово
        # - объявление в газете (строка) -- 10-25 коп
        # https://ru.wikisource.org/wiki/ЭСБЕ/Земская_почта
        # https://ru.wikisource.org/wiki/ЭСБЕ/Почтовые_знаки
        # https://ru.wikisource.org/wiki/ЭСБЕ/Россия/Экономический_отдел/Почта,_телеграф,_телефон
    # Услуги, культура (1915 год)
        # - Билеты в Большой театр --  30-60 коп (на галерке 3-5 руб, в партере, ложах -- до 30 руб)
        # - Билет в кино с пианино и скрипкой (театр-цирк братьев Никитиных) -- 15-70 коп
            # мировой боевик (sic!) "Белый против чёрного" с Альберто Капоцци
    # Услуги, образование (1895 год)
        # - Содержание земской школы (1903 г) -- 568 рублей/год (58 учеников/школа, 10 рублей/ученика)
        # - Наглядные пособия (азбука, картины, атлас, глобус, карты, счета, весы) -- 15-20 рублей/школа
        # - Средняя стоимость школьного здания -- 3215 рублей
        # Земские библиотеки, Новгородская губерния:
            # - Устройство земской библиотеки, 500 книг, 4500 жителей (1906 год) -- 130 рублей
            # - Имущество земской библиотеки (1912 год) -- 275 рублей
            # http://www.admin.novsu.ac.ru/domino/zemstvo.nsf/
    # Литература (1860 год):
        # https://www.prlib.ru/node/363491/source
        # - Худяков "Самоучитель для начинающих обучаться грамоте" -- 0.25 рубля серебром
        # - Бекетов "о земле и воде" -- 0.25 рубля серебром
        # - Бекетов "о живых тварях" -- 0.25 руб
        # - Бок "Будьте здоровы" -- 1.25 руб
        # - Бок "О больном и здоровом человеке" -- 2 руб
        # - Дейч "Гофъ-акушера. Советы матерям" -- 1.25 руб
        # - Худяков "Рассказы о старинных людях" (история) -- 0.6 руб
        # - Худяков "Русская книжка" (сказки) -- 0.3 руб
    # Литература (1894 год):
        # Беседы по вопросам земледелия -- 1894 год
        # - Журналики в 40 страниц на плохой бумаге -- 3-10 копеек
    # Школьные принадлежности для земских школ (1910 год):
        # - тетради №1, №2, №0 -- по 3-5 копеек
        # - начальная арифметика (богато иллюстрированная) -- 30 копеек
        # - практическая грамматика (112 стр) -- 20 копеек
        # - букварь (с рисунками) -- 8 копеек
        # - словарь (400 стр) -- 25 коп
        # - дневник -- 15-25 коп
        # - блокнот -- 40 коп
        # Н. П. Павлов, Нижегородская ярмарка
        # - монокли для рассматривания фотографических карточек -- 8-12 рублей
        # - стереоскопы открытые -- 1.25-2.5 рублей
        # - стереоскопы закрытые, красного дерева -- 3-7.5 рублей
        # - стереоскопические картины фотографические -- 0.1 рубля/штука
        # - лупа с ножками -- 0.75 рубля
        # - лупа складная карманная -- 0.5-3 рубля
        # - карманный микроскоп, ботаническая лупа, набор стёкол, деревянный ящик -- 3 рубля
        # - микроскоп 50x увеличение, объектив 1 линза -- 3.5 рубля
        # - микроскоп 100x увеличение, объектив 2 линзы -- 4.5 рубля
        # - микроскоп 150x увеличение, объектив 3 линзы -- 5.5 рубля
            # 50x линза для микроскопа -- 1 рубль/штука
        # - готовальня, лучшей швейцарской работы -- 3-8 рублей
        # - модель аэроплана (заводится шнурком) -- 1.75-3.5 рубля
        # - электромагнит -- 3 рубля
        # - динамо-машина 4 volt 1 amp -- 12 рублей
            # с ручным приводом -- 22 рубля
        # - Машина Виндгорста статическая электрическая (круг 18 см) -- 10 рублей
        # - Элемент Гренэ -- 2.5 рубля
        # - Спираль Румкорфа с конденсатором (длина искры 3-10 мм) -- 4-11 рублей
        # - Экспериментальный ящик для опытов с лучами Рентгена -- 20 рублей
        # - Экспериментальный ящик для опытов со статическим электричеством -- 15 рублей
        # - Экспериментальный ящик для опытов с динамическим и индуктивным эл. -- 8 рублей
        # - Экспериментальный ящик для опытов с магнитным и статическим эл. -- 12.5 рублей
        # - Индуктивная спираль с двумя проводниками и регулятором тока -- 2.5 рублей
        # - Гейслерова трубка для Румкорфовой спирали -- 0.3-0.75 рубля
        # - Гейслерова трубка наполненная жидкостью -- 0.4-0.75 рубля
    # Расходы на обучение, Киевский учебный округ (1911 год)
        # Траты на одного ученика (оклад учителя, помещение, учебники, тетради).
        # - начальные училища (земские школы) -- 11-18 руб/год
        # - городские училища -- 27-38 руб/год
        # - мужские гимназии -- 126 руб/год
        # - женские гимназии -- 76 руб/год
        # - реальные училища -- 133 руб/год
        # - ремесленные школы -- 142 руб/год
        # - средние технические училища -- 211 руб/год
    # Литература (1913 год):
        # Распределение книг, вышедших в 1913 г., по видам изданий и содержанию
        # | №   | содержание             | названий   | тираж      | цена тиража | цена книги | доля назван.
        # | --- | ---------------------- | ---------- | ---------- | ----------- | ---------  | ------------
        # |  1. | Учебные пособия        | 2761       | 22 556 928 | 9 768 063   | 0.433      | 0.084
        # |  2. | Народные издания       | 2506       | 21 625 709 |   936 573   | 0.043      | 0.076
        # |  3. | Отчёты                 | 2158       |  1 391 250 |     7 165   | 0.005      | 0.065
        # |  4. | Уставы                 | 2120       |  1 367 321 |     4 439   | 0.003      | 0.064
        # |  5. | Беллетристика          | 1878       |  7 659 723 | 2 707 662   | 0.353      | 0.056
        # |  6. | Земское и город. дело  | 1840       |    500 730 |    14 450   | 0.028      | 0.056
        # |  7. | Религия                | 1764       |  5 731 975 | 2 144 695   | 0.374      | 0.053
        # |  8. | Детские издания        | 1396       |  6 549 530 | 2 034 071   | 0.311      | 0.042
        # |  9. | Сельское хозяйство     | 1329       |  3 579 146 |   835 194   | 0.233      | 0.040
        # | 10. | Музыка, пение, сцена   | 1300       |  1 303 419 |   430 785   | 0.331      | 0.039
        # | 11. | Медицина, вет. гигиен. | 1007       |  1 942 176 | 1 009 614   | 0.520      | 0.031
        # | 12. | Путеводители           |  979       |  2 802 855 | 1 554 730   | 0.555      | 0.030
        # | 13. | Сборники               |  843       |  1 698 781 | 1 060 955   | 0.625      | 0.025
        # | 14. | Библиография           |  774       |  3 124 983 |   138 054   | 0.044      | 0.023
        # | 15. | Драма                  |  767       |  1 025 090 |   287 437   | 0.280      | 0.023
        # | 16. | Календари              |  676       | 13 703 665 | 2 287 886   | 0.167      | 0.021 
        # | 17. | Текущая жизнь          |  662       |  1 087 879 |    96 862   | 0.089      | 0.020 
        # | 18. | Программы, правила     |  615       |    641 545 |    92 575   | 0.144      | 0.019 
        # | 19. | Педагогика             |  581       |    834 531 |   425 246   | 0.510      | 0.018 
        # | 20. | Природоведение         |  577       |    867 161 |   671 037   | 0.774      | 0.018 
        # | 21. | Технология             |  552       |    639 063 |   593 849   | 0.929      | 0.017 
        # | 22. | Поэзия                 |  540       |    909 876 |   343 840   | 0.378      | 0.016 
        # | 23. | Военное и морское дело |  524       |  1 215 826 |   688 178   | 0.566      | 0.016 
        # | 24. | История                |  516       |    950 875 | 1 154 284   | 1.214      | 0.016 
        # | 25. | Статистика             |  412       |    292 810 |    31 435   | 0.107      | 0.013 
        # | 26. | Юбилея дома Романовых  |  402       |  4 100 670 |   854 202   | 0.208      | 0.012 
        # | 27. | Право                  |  385       |    997 266 | 1 493 537   | 1.498      | 0.012 
        # | 28. | Биографии              |  358       |    597 092 |   147 176   | 0.247      | 0.011 
        # | 29. | География, этнография  |  354       |    510 792 |   372 127   | 0.729      | 0.011 
        # | 30. | Социология             |  341       |    844 841 |   747 398   | 0.885      | 0.010 
        # | 31. | Собрания сочинений     |  290       |  1 215 887 | 1 942 544   | 1.598      | 0.009 
        # | 32. | Железнодорожное дело   |  269       |    245 497 |   106 655   | 0.434      | 0.008 
        # | 33. | Спорт                  |  247       |    247 775 |   120 407   | 0.486      | 0.008 
        # | 34. | Политическая экономия  |  235       |    297 876 |   151 797   | 0.510      | 0.007 
        # | 35. | Психология             |  157       |    343 457 |   252 767   | 0.736      | 0.005 
        # | 36. | Ремесло                |  156       |    455 110 |   320 760   | 0.705      | 0.005 
        # | 37. | Алкоголизм             |  141       |  1 180 485 |    35 573   | 0.030      | 0.004 
        # | 38. | Археология             |  131       |     83 498 |   113 500   | 1.359      | 0.004 
        # | 39. | Словари                |  176       |    984 748 | 1 084 798   | 1.102      | 0.005 
        # | 40. | Физика                 |  171       |    705 585 |   198 473   | 0.281      | 0.005 
        # | 41. | Философия              |  111       |    198 801 |   169 398   | 0.852      | 0.003 
        # Всего 33 000 названий (3546 книг/тираж)
        # Всего 37 430 191 рублей (1134 рубля/тираж)
        # Всего 117 006 227 книг (0.32 рубля/книга)
        # https://istmat.org/node/241
    # Цены строительных материалов (Москва, 1897-1906 годы):
        # "Описание сооружения нового Мытищинского водопровода (1897-1906 гг.)"
        # Составил учёный инженер-механик Н. П. Зимин
        # трубы:
        # - трубы от 8-дюймов до 4-дюймов -- 0.95 рубля/кг
        # - трубы диаметром 28-дюймов и 24-дюйма -- 0.1 рубля/кг
        # - фасонные части необработанные 4-10 дюймов -- 0.11 рубля/кг
        # - фасонные части обработанные 4-10 дюймов -- 0.13 рубля/кг
        # - железные болты с гайками -- 0.22-0.25 рублей/кг
        # - медное литьё -- 0.95 рублей/кг
        # - резиновые фланцевые кольца -- 2.9-3.1 рублей/кг
        # - предохранительные клапаны -- 7.60 рублей/штука
        # - пожарные гидранты (изготовление, 1832 шт) -- 39 рублей/штука
            # - изготовление гидрантов -- 8 рублей/штука
            # - материалы для гидрантов -- 32 рубля/штука
    # Цены строительных материалов (Сибирь, 1901 год):
        # Постройка и эксплуатация мартеновской фабрики в Лысьвенском заводе гр. П. П. Шувалова 1901 год
        # https://elis.psu.ru/node/490058
        # - кирпич красный -- 10.2-17 рублей/1000 штук
        # - кирпич полукруглый дырчатый (для дымовой трубы) -- 20 рублей/1000 штук
        # - известь -- 6.1-10.8 рублей/тонна
        # - цемент -- 41.86 рублей/тонна
        # - цемент -- 70 коп/пуд, 42 рубля/тонна
        # - алебастр -- 7.36 рублей/тонна
        # - песок речной -- 0.32-0.53 рубля/кубометр
        # - камень бутовый -- 1.2-1.4 рубля/кубометр
        # - стеариновые свечи (1910 год) -- 750 рублей/тонна
            # Кроме стеарина в свечах: 2-6% воска или до 20% парафина
            # Без воска/парафина стеарин становится хрупким при застывании.
        # - крепи (деревянные, для шахты) -- 5 копеек/штука
        # - фальцевая черепица, без доставки, 70 штук/кв.сажень (15 штук/кв.метр) -- 2.5 коп/штука
        # - коньковая черепица, без доставки, 7 штук/сажень, (3 штуки/метр) -- 5 коп/штука
        # - глиносоломенные ковры, пеньковая основа (1887 год) -- 100 аршин за 3 рубля (4 копейки/кв.метр)
        # - жерди прямые диаметром 40-мм для глиносоломенной кровли (1887 год) -- 100 штук за 1.25 рубля.
        # Керамические трубы 2-10 дюймовые, безнапорные, глазированные:
        # - 2 дюйма, 50.8 мм, 6.16 кг/метр -- 0.5 руб/метр
        # - 3 дюйма, 76.2 мм, 11.2 кг/метр -- 0.78 руб/метр
        # - 4 дюйма, 101.6 мм, 16.6 кг/метр -- 0.92 руб/метр
        # - 5 дюймов, 127 мм, 21.9 кг/метр -- 0.99 руб/метр
        # - 6 дюймов, 152.4 мм, 26.6 кг/метр -- 1.13 руб/метр
        # - 8 дюймов, 203.2 мм, 37 кг/метр -- 1.69 руб/метр
        # - 9 дюймов, 228.6 мм, 44.7 кг/метр -- 1.83 руб/метр
        # - 10 дюймов, 254 мм, 49.3 кг/метр -- 2.18 руб/метр
        # Для мартеновской печи:
        # - кирпич
        #     - белый явенский -- 71 рубль/1000 штук 
        #     - белый лысьвенский -- 46.4 рубля/1000 штук 
        #     - шамотный товарищества Штарк -- 95.61 рубля/1000 штук 
        #     - кварце-глинистый -- 82 рубля/1000 штук 
        #     - динас -- 143 рубля/1000 штук
        # - глина красная (подножная) -- 0.28 рубля/кубометр
        # - глина белая -- 12.3 рубля/тонну
        # - кварцевый теплогорский песок -- 4.67 рубля/кубометр
        # Металлические изделия, прокат:
        # - сталь (какая?) -- 400 рублей/тонна
        # - железо сортовое -- 71 рубль/тонна
        # - железо кровельное -- 108 рублей/тонна
        # - железо листовое -- 150 рублей/тонна
        # - чугунное литьё -- 78.6 рублей/тонна
        # - железные лестницы -- 215 рублей/тонна
        # - двутавроые балки -- 110 рублей/тонна
        # - железо котельное -- 153 рубля/тонна
        # - двутавровые балки и железо котельное -- 232 рубля/тонна
        # - стальные рельсы (7 килограмм/метр) -- 108 рублей/тонна
        # - накладки для шпал -- 239 рублей/тонна
        # - болты -- 344 рубля/тонна
        # - гвозди -- 200 рублей/тонна
        # - поворотные круги -- 68 рублей/тонна
        # Для окраски:
        # - масло -- 337 рублей/тонна
        # - масло постное -- 327-351 рублей/тонна
        # - масло льняное -- 362 рублей/тонна
        # - белила -- 232 рубля/тонна
        # - белильная известь (1888 год) -- 127 рублей/тонна
        # - сурик свинцовый -- 233 рубля/тонна
        # - сажа голландская -- 184 рубля/тонна
        # - мумиё -- 150 рубля/тонна
    # Смазочные материалы, 1900 год:
        # - колёсная мазь на деревянную ось -- 20 коп за 5 фунт ящик (97.6 рублей/тонна)
        # - колёсная мазь на железную ось -- 30 коп за 5 фунт ящик (146 рублей/тонна)
    # Цены промышленных товаров:
        # Постройка и эксплуатация мартеновской фабрики в Лысьвенском заводе гр. П. П. Шувалова 1901 год
        # https://elis.psu.ru/node/490058
        # - весы Роберваль (до 2 пудов) -- 15.3 рублей
        # - весы Фербэнкс (на 50 пудов) -- 80 рублей
        # - весы Фербэнкс (на 75 пудов) -- 125 рублей
        # - весы Фербэнкс (на 200 пудов) -- 500 рублей
        # - деревянный кран -- 425 рублей/тонна груза
        # - стальной кран -- 825 рублей/тонна груза
        # - два разгрузочных крана-бегуна весом по 12 тонн -- 8500 рублей (1700 рублей тонна/груза)
        # - Турбина 52 квт -- 2390 рублей (46 рублей/киловатт)
        # - молоток рессорный, 240 ударов/минуту, 30 кг молот, электромотор 2.2 кВт -- 2500 рублей
        # - железная тележка (320 килограмм) -- 106-123 рублей
        # - две наковальни -- 36 рублей
        # - меха кузнечные -- 17 рублей
        # - ручной насос -- 56 рублей
        # - керосиновый двигатель (одноцилиндровый, 2 лошад. силы, 300 оборотов/минуту) -- 460 рублей
        # - керосиновый двигатель (двухцилиндровый, 30 лошад. силы, 200 оборотов/минуту) -- 3450 рублей
    # Цены промышленных товаров (1910 год):
        # - Винтовой пресс для фальцевой черепицы -- 454-568 рублей
            # до 1500 черепиц/день, вес пресса 1.5 тонны.
        # - Ручной пресс универсальный (кирпичи, трубы, черепица, плитка) -- 200-300 рублей
            # деревянная форма для полых кирпичей, смачивание -- 15 рублей
            # железная форма для труб 6 дюймов -- 11 рублей
        # - Глиномялка с конным приводом (1 лошадиная сила) -- 181 рубль
            # на 5000 порций глины для кирпичей/сутки (5-6 кубометров), вес глиномялки 1 тонна.
            # http://www.arhplan.ru/materials/bricks/dobycha-i-podgotovka-gliny-dlya-kirpicha
        # - Ручной ткацкий станок для соломенных ковров (80-130 аршин/день) -- 8 рублей
        # - воздушный ассенизаторный насос (360 литров/минуту) -- 235-275 рублей
            # 20-мм цилиндр, 20 мм ход поршня
        # манометры и вакууметры:
        # - манометры (диаметр шкалы 7.5-45 см) -- 11-63 рублей
            # до 30 атмосфер
        # - вакууметры (диаметр шкалы 10-25 см) -- 13-26 рублей
            # до 30 дюймов
        # гидравлические насосы:
        # - насос с одинарным поршнем для давления до 30 атмосфер --  57 рублей
        # - насос с двойным бронзовым поршнем для давления до 75 атмосфер -- 120 рублей
        # насосы поршневые чугунные:
        # - насос всасывающий обыкновенный:
            # поршень 56 мм, 31 мм труба, 1200 литров/час -- 11 рублей
            # поршень 87 мм, 40 мм труба, 2400 литров/час -- 17 рублей
        # - насос всасывающий и нагнетающий:
            # поршень 56 мм, 31 мм труба, 1200 литров/час -- 25 рублей
            # поршень 87 мм, 40 мм труба, 2400 литров/час -- 38 рублей
        # аппараты для устройства аббисивных колодцев (для трубы 50 мм)
        # - треножник (выше человека) -- 40 рублей
        # - забивная баба -- 18.5 рублей
        # - зажим для трубы -- 10 рублей
            # - ключ -- 1.8 рублей
        # - земляные бурава (диаметр 7.5-25 см) -- 4.5-11 рублей
        # - ворот для прижимания трубы во время ввинчивания -- 6.75-10 рублей
        # - наконечники для вколачивания и ввинчивания
            # - без фильтра (35-50 мм) -- 7-11.5 рублей
            # - с фильтром (35-50 мм) -- 10.5-15 рублей
        # - домкраты бутылчатые:
            # | высота (мм) |  вес (кг) |  сила (кг) | цена (рублей)
            # | ----------- | --------- | ---------- | -------------
            # | 225         | 5.33      | 2050       | 7.9
            # | 300         | 6.97      | 2952       | 9.5
            # | 375         | 9.02      | 4100       | 12.25
            # | 450         | 13.12     | 5084       | 16
            # | 525         | 15.58     | 6150       | 20
            # | 600         | 19.68     | 8200       | 23
            # | 600         | 25.83     | 10 168     | 30
        # домкраты паровозные на салазках, с двумя трещётками, стальные
            # (поднимает и сдвигает в сторону)
            # | высота (мм) | сдвигает (мм) |  вес (кг) |  сила (кг) | цена (рублей)
            # | ----------- | ------------- | --------- | ---------- | -------------
            # | 500         | 175           | 31.98     | 8200       | 50
            # | 600         | 250           | 41.82     | 10 250     | 62
            # | 600         | 300           | 44.69     | 12 300     | 68
            # | 650         | 350           | 78.31     | 15 580     | 80
            # | 675         | 450           | 102.5     | 20 500     | 120
        # лебёдки в чугунной раме
            # подъём №1 -- подъём непосредственно от барабана
            # подъём №2 -- подъём с помощью 1-го и 2-х рол. блоков
            # подъём №1 (кг)  | подъём №2 (кг) |  цена    
            # --------------- | -------------- | ------
            # 410             | 2050           | 45
            # 575             | 3034           | 48
            # 820             | 4100           | 50-63
            # 1017            | 5084           | 63-73
            # 1312            | 6068           | 88
            # 1558            | 7134           | 100
            # 1804            | 8200           | 110
            # 2050            | 10 168         | 150
    # Столярные инструменты (1890):
        # Как делать простую мебель -- 1890 год, Вологда
        # Опыт ознакомления детей начальных школ со столярным ремеслом
        # - Верстак -- от 5 рублей
        # - Измерительные инструменты -- 1.5 рубля
            # Ресмус, наугольник, ерунок,
            # малка, кианка, складной аршин
        # - Рубанок, шерхебел, фуганок, шлифтик -- 2.5 рубля
        # - 6 разных пил -- 1.5 рубля
        # - Коловорот железный и 12 свёрл -- 2 рубля
        # - 12 разных стаместок и долот -- 3 рубля
        # - Молоток, циркуль (стальной), 2 отвёртки, 2 шила -- 1.5 рубля
        # - Винтельня для нарезки винтов по дереву -- 1.5 рубля
        # - 4 напилка и цикля -- 1.5 рубля
        # - Топорок, брусок, оселок -- 1 рубль
        # - Клещи и 2 щипцов -- 1 рубль
        # - Ковш для варения клея -- 0.5 рубля
    # Слесарные инструменты (1910 год):
        # - тачка багажная (из углового железа, два колеса) -- 11.25 рублей
        # - тележка багажная (дубовая, окована железом, три колеса) -- 55 рублей
        # - ножницы для вырезки кругов и колец из жести (станок) -- 70-135 рублей
        # - коловорот -- 2.4-3.0 рублей
        # - дрель ручная (8 свёрл) -- 4 рубля
        # - дрель для ажурных работ (2 сверла) -- 1.75 рубля
        # - древь грудная с универсальный матроном и ватерпасом -- 9 рублей
        # - клуппы американские (для нарезки резьбы в трубах) -- 23-100 рублей (завист от диаметра труб) 
        # - клещи цепные для газовых труб -- 2.15 - 16 рублей (зависит от диаметра труб)
        # - труборез с двумя направляющими роликами (25-75 мм) -- 5.6-14.5 рублей
        # - труборез с хомутом (от 50 мм до 100 мм) -- 22 рубля
        # - труборез с хомутом (от 50 мм до 200 мм) -- 30 рублей
        # - ключи гаечные (комплект, 5 переставых шестерень) -- 5 рублей 
        # - ключи гаечные с трещёткой штамованные -- 0.4-2.10 рублей (зависит от диаметра гаек)
        # - тиски привертные кованые, разных размеров (1.2-4.1 кг) -- 2.85-6.5 рублей
        # - тиски привертные стальные с наковальней (2-4.1) -- 6.5-14 рублей
        # - точильные камни английские (на станок) -- 0.85-5.20 рублей
        # - циркуль стальной с дугой -- 0.6-1 рублей
        # - кронциркуль стальной с дугой -- 0.95-1.7 рублей
        # - кронциркуль с делением (2.5-4.8 см) -- 1.5-4.4 рублей
        # - штангенциркули никелированные -- 3.25-4.25 рублей
        # - штангенциркули с винтом (15-30 см) -- 1.65-2.65 рублей
        # - аршины складные английские (пальмовое дерево, шарнир) -- 0.3-0.7 рубля
        # - рулетки в кожаных футлярах -- 2.5-3.5 рубля
        # - рулетки в стальных футлярах -- 1.25-9.5 рубля
        # - линейки стальные обыкновенные -- 1.65-4.5 рублей
        # - алмазы для резки стекла (металлическая оправа, костяная ручка) -- 1.5-5 рублей
        # - болторезный станок "Симплекс" (болты и газовые трубы) -- 105-120 рублей
        # - выжигательный аппарат со всеми принадлежностями -- 4.5-8 рублей
        # - паяльник домашний "Швейцер" (электрический) -- 2.25 рубля
        # - паяльник бензиновый -- 10 рублей
        # - паяльная лампа для водопроводчиков -- 4 рубля
        # - вертикальная маслёнка №8 -- 15 рублей
        # - лампа паяльная, бензиновая -- 12 рублей
        # - лампа паяльная керосиновая "Бартель" -- 17-22 рублей
        # - керосиновая лампочка для литейных -- 18 рублей
        # - лампа-факел №18 для употребления на открытом воздухе -- 3.75 рубля
        # - осветительный прибор №1 керосиновый, для рудников -- 115 рублей
            # 500 свечей, расход керосина 3 фунта/час (6 часов)
            # размер резервуара 40x25 сантиметров
            # вес при полном резервуаре -- 33 кг (16.4 пустой)
        # - вилы для кокса американские (8-12 зубьев) -- 4.5-6 рублей
        # - молоток английский с гвоздодёром, лакированная ручка -- 0.75-1.2 рубля
    # Сельскохозяйственные инструменты (1897 год):
        # Описанiе земледельческих орудiй, с рисунками и с показанiем продажных цен
        # https://rusneb.ru/catalog/000199_000009_003641803_100627/
        # - коса длиной 5 -- 40 коп
        # - серп кустаря -- 30 коп
        # - топор плотницкий -- 70 коп
        # - лопаты деревянные для глины -- 25 коп
        # - лопаты весовые -- 30-60 коп
        # - лопаты балластовые с ручками -- 1-1.4 рубля
        # - вилы навозные -- 20-80 коп
        # - грабли садовые, 10 зубцов -- 40 коп
    # Сельскохозяйственные орудия (1897 год):
        # - безпередковый плуг (без колёс, борозда 4.5x4.5 вершка, вес плуга 39 кг) -- 14.75-17.20 рубля
        # - оборотный плуг (без колёс, борозда 6.5 вершка, вес плуга 90 кг) -- 31.5 рубля
        # - однолемешный плуг (без колёс, борозда 4x3.5 вершка, вес 24 кг) -- 6.75 рублей
            # деревянный станок, стальной отвал, лемех и нож.
        # - однолемешный плуг (два колеса, борозда 6x5.5 вершка, вес 84 кг) -- 23-27 рублей
        # - двухлемешный плуг (два колеса, борозда 12.5x5.5 вершка, вес 140 кг, 2-3 лошади) -- 50 рублей
        # - трёхлемешный плуг (два колеса, борозда 15x2.5 вершка, вес 123 кг, 2-3 лошади) -- 42 рубля
        # - четырёхлемешный плуг (три колеса, борозда 16x2.5 вершков, вес 150 кг, 2-3 лошади) -- 48 рублей
        # - плуг окучник (направ. колесо, вес 41 кг) -- 15.5 рублей
        # - дисковая борона (12 дисков, ширина 40 вершков, 2 метра, вес 164 кг) -- 85 рублей
            # - стально тарелко-образный диск -- 3 рубля/штука
        # - борона зиг-заг (ширина 40 вершков, вес 86.4 кг) -- 27 рублей
        # - луговая составная борона (кованое железо, ширина 32 вершка, вес 68 кг) -- 28 рублей
        # - грабли упряжные (стальные зубцы, рабочая колея 0.73 метра) -- 60 рублей
            # Заменяют 20 рабочих
        # - картофелекопатель (вес 37 кг) -- 12.42 рубля
            # выглядит как плуг
    # Сельскохозяйственные механизмы (1897 год):
        # - ручная молотилка (кованое железо, две рукоятки, вес 220 кг) -- 62 рубля
        # - конная молотилка (две рукоятки, вес 220 кг) -- 114 рублей
            # - конный привод (24-48 оборотов штанги = 1 оборот коня, вес 420 кг, 2-4 лошади) -- 100 рублей
        # - паровая молотилка -- 760-1085 рублей
            # - локомобиль для молотилки (4 лошадиные силы) -- 1400 рублей (470 рублей/киловатт)
        # - ручная веялка (внтилятор, очистка зерна воздухом, вес 100 кг) -- 23 рубля
            # сито для веялки (кв.аршин) -- 40 коп
        # - ручная соломорезка -- 33 рубля
        # - ручная корнерезка (тёрки и механизм) -- 19-29 рублей
        # - ручная дробилка зерна (90 кг/час) -- 39-50 рублей
        # - пресс для сена (тюки 25.6x15.7x14.4 верш. 0.5 кубометра, 60-70 кг, пресс 615 кг) -- 142.6 рубля
            # плотность сена -- 130 кг/кубометр
            # 2 рабочих для пресса, 3 для прочих работ -- 75 тюков/день (5 тонн/день)
        # - пульверизатор для поливки садов -- 21 рубль
            # Воздух до 1 атмосферы, раствор до 3 атмосфер.
            # 3-6 атмосфер, механический насос, манометр.
        # - лебёдка "Метеор" №1 и №2 (№1 -- 200 кг груза, №2 -- 500 кг) -- 18.4 руб и 36.8 руб
            # барабан, 2 подшипника, шестерня, винт с рукояткой, тормоз.
            # спуск груза управляется тормозом, поднимая груз рукоять можно отпускать.
        # - маслоделка для небольших производство -- 8.74-13.70 рублей
        # - сушилка фруктов на угле (вес 311 килограмм) -- ???
            # Поверхность 11+8 кв.аршин, 10 кв.метров, 22 сушильные решётки.
            # Производительность 24 пудов/сутки, 400 кг/сутки
            # Каменного угля -- 37 кг/сутки
        # - ручная мельница для размола фруктов -- ???
            # Производительность 30-50 пудов/сутки, 500-820 кг
        # - ручной аппарат для пессования винограда -- 45 рублей
        # - ручной пресс для выдавливания сока (12 литров) -- 28 рублей
        # - хлебо-жатвенная машина -- (4 грабли, ширина 1.5 метра, вес 361 кг, 2 лошади) -- 230 рублей
        # - траво-косилка (2 скорости движения ножа, 2 лошади, вес 295 кг) -- 165 рублей
    # Сельскохозяйственные механизмы (1910 год):
        # - двойной аспиратор "Зиг-Заг" (очистка пшеницы от постороних зёрен, 377 кг) -- 450-500 рублей
        # - аспиратор "Тарар" -- 120-175 рублей
        # - магнитный аппарат (18x20x11 см, 16 кг, 3 магнита) -- 50 рублей
        # - магнитный аппарат (70x20x11 см, 37 кг, 20 магнитов) -- 200 рублей
            # чистит зерно от гвоздей, кусочков проволоки, жести и т.д.
        # - зерноочистительный аппарат "Двойная еврека с деташером" -- 400-500 рублей
            # 200x80 сантиметров, цилиндр 56 мм, 500 оборотов/минуту, вес машины 426-525 кг
            # деташер -- две чугунные рифлёные тарелки, между которыми проходит зерно
            # очищает зерно от земли и пыли.
        # - щёточная зерноочистительная машина -- 325-475 рублей
            # 120x120x157 сантиметров, 600 оборотов/минуту, вес машины -- 328-492 кг
        # - жатвенная машина, косилка (для хлеба, травы, льна) -- 150 рублей
            # ширина 2 аршина, 5.75 вершка, вес -- 492 кг
            # два шкифа и приводной ремень от ходового колеса
            # Упряжь -- пара лошадей.
            # Производительность: 8 десятин
    # Пчеловодство (1897 год):
        # - улей системы Бутлера -- 4.5 руб
        # - улей системы Дадана -- 6 руб
        # - шкаф для уборки сот -- 4 руб
    # Фабричное оборудование (1898 год):
        # - печь Гофмана (20 отделений, 10 000 кирпичей) -- 6 600 рублей
        # - печь Мендгейма (20 отделений, 10 000 кирпичей) -- 20 000 рублей
            # На 1000 кирпичей (4100 кг) -- 147 кг угля, или 410 кг дров.
    # Транспорт (1906 год):
        # Железнодорожные вагоны (госзаказ) -- 1150-1400 рублей/штука (длина 9.14 м)
        # Большие суда (построены на Волге) -- 4085 на 8.1 млн рублей (2226 рублей/судно)
        # Меньшие суда (строились на притоках) -- 39 862 на 32.3 млн рублей (809 рублей/судно)
        # бот речной (160-320 тонн, 1884 год) -- 833 рубля
        # Парусники речные (1879-1888 годы, Волга) -- 918 рублей/судно
        # Парусники речные (1879-1888 годы, прочие реки) -- 544 рублей/судно
        # Парусник речной -- 3085 рублей
        # Волжские пароходы (1886 год) -- 854 судна (52 кВт, 67 тонн, 18 человек, 46 300 рублей/судно)
        # Пароходы прочих рек (1886 год) -- 653 судна (40 кВт, 30 500 рублей/судно)
        # Пароходы военные (8k тонн, 5 МВт) -- 1.25-1.62 млн. руб
        # Пароход речной (35 кВт) -- 39 300 рублей/судно
        # https://ru.wikisource.org/wiki/ЭСБЕ/Волга
        # https://istmat.org/node/65
    # Цены строительных работ (1920 год, доклад ГОЭЛРО):
        # - расчистка и регулировка мелких речек для сплава дров (в ценах 1913 года) -- 50-70 руб/верста
        # - углубление реки Волга, участок Тверь-Рыбинск, 20 мелей (1864-1872 годы) -- 1.1 млн рублей
        # - устройство гавани Рыбинска на 20 пароходов, 40 больших барж, 60 мелких судов -- 0.5 млн рублей
    # Инфраструктура (1914-1917 год)
        # - Образцовое земледелие, капитал (169 га, Германия, 1900 год) -- 46 000 рублей (272 руб/гектар)
        # - Улучшение казённых дорог (Варшавский, Виленский, Киевский округа) -- 6 млн рублей (3 года работ)
        # - Замена деревянных мостов на железные на каменных опорах и железобетонные -- 18 млн руб (за 10 лет)
        # - Строительство и содержание грунтовых дорог (военные, 1915-1917 годы) -- 1700 рублей/километр
        # - Третий мытищинский водопровод (70 км магистралей, 18 500 м³/сутки) -- 5.5 млн рублей
        # - Гидроэлектростанции -- 0.7 млн. золотых рублей на мегаватт мощности.

#----
# Доля тары в весе товаров:
    # 6% — при упаковке гидравлического цемента, серы, сурьмы, соды и поташа;
    # 7% — соли, буры, винного камня, квасцов, жести, стали, меди, алюминия, никеля, кобальта, висмута и цинка;
    # 8% — сахара-сырца и рафинада, сыра, медного купороса, белил, сурика и свинца;
    # 9% — масла коровьего и кофе, если бочки для последнего хвойных пород;
    # 10% — риса, крахмала, какао, цикория, клея, дубильных и красильных растительных веществ,
        # асбеста, олова, селитры, уксусного порошка, хлорной извести, железного купороса,
        # берлинской лазури, парижской синьки, яри-медянки и разных полировочных веществ;
    # 12% — саго, сухих ягод и фруктов, хмеля и кофе (последний в дубовых бочках);
    # 14% — турецких рожков, орехов и миндаля;
    # 15% — гарпиуса и бумажной пряжи;
    # 16% — нюхательного табака;
    # 17% — дрожжей, рыбьего жира, асфальта, гудрона, оливок,
        # деревянного, рицинового, кокосового и пальмового масла, глицерина и лаков;
    # 18% — разных пряностей;
    # 20% — сажи, крапа и марены;
    # 21% — нефти и ее продуктов;
    # 30% — грецких губок, шерсти, гончарных и фаянсовых изделий;
    # 34% — стекла
    # 33%, 41% и 45% — разных сортов фарфоровых изделий.
    # https://ru.wikisource.org/wiki/ЭСБЕ/Бочка

#----
# Почта в мешках:

metadict_detail['|=Газеты (килограмм)'] = {
        '|=Газеты (литр)':1 / 0.2,
        '|==Почта (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка почты (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные мешки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Письма (килограмм)'] = {
        '|=Письма (литр)':1 / 0.2,
        '|==Почта (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка почты (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные мешки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Посылки (килограмм)'] = {
        '|=Посылки (литр)':1 / 0.2,
        '|==Почта (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка почты (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные мешки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Журналы (килограмм)'] = {
        '|=Журналы (литр)':1 / 0.2,
        '|==Почта (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка почты (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные мешки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Книги (килограмм)'] = {
        '|=Книги (литр)':1 / 0.2,
        '|==Почта (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка почты (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные мешки (килограмм)':(1 / (1 - 0.12) - 1),
        }

#----
# Канцелярские товары в мешках:

metadict_detail['|=Тетради (килограмм)'] = {
        '|=Тетради (литр)':1 / 0.2,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные мешки (килограмм)':(1 / (1 - 0.12) - 1),
        }

#----
# Перевозка в банках и ящиках:

metadict_detail['|=Банка лечо (килограмм)'] = {
        # TODO: Плохая идея, совмещать банки с ящиками.
            # И да, опять ты считаешь массу тары на глазок.
        # Пустая трёхлитровая банка -- килограмм (25% брутто)
        '|=Ящик лечо (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка тушёных шампиньонов (килограмм)'] = {
        '|=Ящик консервированных шампиньонов (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка соевого соуса (килограмм)'] = {
        '|=Ящик соевого соуса (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка соуса песто (килограмм)'] = {
        '|=Ящик соуса песто (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка томатного соуса (килограмм)'] = {
        '|=Ящик томатного соуса (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка томатной пасты (килограмм)'] = {
        '|=Ящик томатной пасты (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка лютеницы (килограмм)'] = {
        '|=Ящик лютеницы (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка баклажанного соуса (килограмм)'] = {
        '|=Ящик баклажанного соуса (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка джема из ревеня (килограмм)'] = {
        '|=Ящик джема из ревеня (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка яблочного джема (килограмм)'] = {
        '|=Ящик яблочного джема (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка грушевого джема (килограмм)'] = {
        '|=Ящик грушевого джема (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка айвового джема (килограмм)'] = {
        '|=Ящик айвового джема (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка виноградного джема (килограмм)'] = {
        '|=Ящик виноградного джема (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка земляничного варенья (килограмм)'] = {
        '|=Ящик земляничного варенья (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка одуванчикового варенья (килограмм)'] = {
        '|=Ящик одуванчикового варенья (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка рябинового варенья (килограмм)'] = {
        '|=Ящик рябинового варенья (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка вишнёвого варенья (килограмм)'] = {
        '|=Ящик вишнёвого варенья (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка клюквенного варенья (килограмм)'] = {
        '|=Ящик клюквенного варенья (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка смородинового варенья (килограмм)'] = {
        '|=Ящик смородинового варенья (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка лимонного сиропа (килограмм)'] = {
        '|=Ящик лимонного сиропа (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка клюквенного сиропа (килограмм)'] = {
        '|=Ящик клюквенного сиропа (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка яблочного сиропа (килограмм)'] = {
        '|=Ящик яблочного сиропа (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка горчицы (килограмм)'] = {
        '|=Ящик горчицы (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка чернил (килограмм)'] = {
        '|=Ящик чернил (литр)':1 / 1.5,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка клея (килограмм)'] = {
        '|=Ящик клея (литр)':1 / 1.5,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

#----
# Грузоперевозки (в бочках):

metadict_detail['|=Бочка арахисового масла (килограмм)'] = {
        # Формула Для вычисления веса брутто:
            # y = x / (1 - c)
                # Где:
                # y - вес брутто.
                # x - вес нетто (1 кг).
                # c - доля тары в весе брутто (0.06-0.45)
        # Для вычисления веса тары:
            # z = x / (1 - c) - x
        '|=Бочка арахисового масла (литр)':1 / 0.91,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка красного вина (килограмм)'] = {
        '|=Бочка красного вина (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка белого вина (килограмм)'] = {
        '|=Бочка белого вина (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Ящик фабричного пшеничного хлеба (килограмм)'] = {
        '|=Ящик пшеничного хлеба (литр)':1 / 0.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка скоропортящихся продуктов (брутто) (килограмм)':1 / (1 - 0.20),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Бочка ржаного кваса (килограмм)'] = {
        '|=Бочка ржаного кваса (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка скоропортящихся продуктов (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка ржаного имбирно-яблочного кваса (килограмм)'] = {
        '|=Бочка ржаного имбирно-яблочного кваса (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка скоропортящихся продуктов (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка ржано-гречневого кваса (килограмм)'] = {
        '|=Бочка ржано-гречневого кваса (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка скоропортящихся продуктов (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка имбирного эля (килограмм)'] = {
        '|=Бочка имбирного эля (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка скоропортящихся продуктов (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка ячменного пива (килограмм)'] = {
        '|=Бочка ячменного пива (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка медовухи вишнёвой (килограмм)'] = {
        '|=Бочка медовухи вишнёвой (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка кленового сиропа (килограмм)'] = {
        # http://www.novedu.ru/sprav/pl-sug.htm
        '|=Бочка кленового сиропа (литр)':1 / 1.3,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка конопляного масла (килограмм)'] = {
        '|=Бочка конопляного масла (литр)':1 / 0.93,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка льняного масла (килограмм)'] = {
        '|=Бочка льняного масла (литр)':1 / 0.94,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка горчичного масла (килограмм)'] = {
        '|=Бочка горчичного масла (литр)':1 / 0.93,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка хлопчатого масла (килограмм)'] = {
        '|=Бочка хлопчатого масла (литр)':1 / 0.93,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка кунжутного масла (килограмм)'] = {
        '|=Бочка кунжутного масла (литр)':1 / 0.94,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка мёда (килограмм)'] = {
        '|=Бочка мёда (литр)':1 / 1.4,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка оливкового масла (килограмм)'] = {
        '|=Бочка оливкового масла (литр)':1 / 0.92,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка подсолнечного масла (килограмм)'] = {
        '|=Бочка подсолнечного масла (литр)':1 / 0.92,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка соевого масла (килограмм)'] = {
        '|=Бочка соевого масла (литр)':1 / 0.92,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка соевого маргарина (килограмм)'] = {
        '|=Бочка соевого маргарина (литр)':1 / 0.96,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка соевого соуса (килограмм)'] = {
        '|=Бочка соевого соуса (литр)':1 / 0.92,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка темпе (килограмм)'] = {
        '|=Бочка темпе (литр)':1 / 0.92,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка масла какао (килограмм)'] = {
        '|=Бочка масла какао (литр)':1 / 0.96,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка яблочного сидра (килограмм)'] = {
        '|=Бочка яблочного сидра (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка скоропортящихся продуктов (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка грушевого сидра (килограмм)'] = {
        '|=Бочка грушевого сидра (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка скоропортящихся продуктов (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка яблочного уксуса (килограмм)'] = {
        '|=Бочка яблочного уксуса (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка виноградного уксуса (килограмм)'] = {
        '|=Бочка виноградного уксуса (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка квашеной капусты (килограмм)'] = {
        '|=Бочка квашеной капусты (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка маринованного фенхеля (килограмм)'] = {
        '|=Бочка маринованного фенхеля (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка маринованных боровиков (килограмм)'] = {
        '|=Бочка маринованных боровиков (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка солёных боровиков (килограмм)'] = {
        '|=Бочка солёных боровиков (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка квашеной свёклы (килограмм)'] = {
        '|=Бочка квашеной свёклы (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка квашеной репы (килограмм)'] = {
        '|=Бочка квашеной репы (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка солёных кабачков (килограмм)'] = {
        '|=Бочка солёных кабачков (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка маринованных оливок (килограмм)'] = {
        '|=Бочка маринованных оливок (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка маринованных каперсов (килограмм)'] = {
        '|=Бочка маринованных каперсов (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка солёных огурцов (килограмм)'] = {
        '|=Бочка солёных огурцов (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка солёных томатов (килограмм)'] = {
        '|=Бочка солёных томатов (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка мочёной вишни (килограмм)'] = {
        '|=Бочка мочёной вишни (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка мочёного крыжовника (килограмм)'] = {
        '|=Бочка мочёного крыжовника (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка мочёной сливы (килограмм)'] = {
        '|=Бочка мочёной сливы (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка мочёной морошки (килограмм)'] = {
        '|=Бочка мочёной морошки (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка мочёных груш (килограмм)'] = {
        '|=Бочка мочёных груш (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка мочёных яблок (килограмм)'] = {
        '|=Бочка мочёных яблок (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка изюма (килограмм)'] = {
        '|=Бочка изюма (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка овсяной муки (килограмм)'] = {
        '|=Бочка овсяной муки (литр)':1 / 0.432,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка овсяной крупы (килограмм)'] = {
        '|=Бочка овсяной крупы (литр)':1 / 0.3,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка арахиса (килограмм)'] = {
        '|=Бочка арахиса (литр)':1 / 0.65,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.14),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.14) - 1),
        }

metadict_detail['|=Бочка фисташек (килограмм)'] = {
        '|=Бочка фисташек (литр)':1 / 0.65,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.14),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.14) - 1),
        }

metadict_detail['|=Бочка ячневой крупы (килограмм)'] = {
        '|=Бочка ячневой крупы (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка перловой крупы (килограмм)'] = {
        '|=Бочка перловой крупы (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка пшённой крупы (килограмм)'] = {
        '|=Бочка пшённой крупы (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка гречневой крупы (килограмм)'] = {
        '|=Бочка гречневой крупы (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка риса шлифованного (килограмм)'] = {
        '|=Бочка риса шлифованного (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка картофельного крахмала (килограмм)'] = {
        '|=Бочка картофельного крахмала (литр)':1 / 0.6,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка агар-агара (килограмм)'] = {
        '|=Бочка агар-агара (литр)':1 / 0.6,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка кукурузной крупы (килограмм)'] = {
        '|=Бочка кукурузной крупы (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка кукурузной муки (килограмм)'] = {
        '|=Бочка кукурузной муки (литр)':1 / 0.59,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка гречневой муки (килограмм)'] = {
        '|=Бочка гречневой муки (литр)':1 / 0.59,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка ячменного солода (килограмм)'] = {
        '|=Бочка ячменного солода (литр)':1 / 0.34,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка ржаного солода (килограмм)'] = {
        '|=Бочка ржаного солода (литр)':1 / 0.34,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка ржаной муки (килограмм)'] = {
        '|=Бочка ржаной муки (литр)':1 / 0.59,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка рисовой муки (килограмм)'] = {
        '|=Бочка ржаной муки (литр)':1 / 0.59,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка ячменной муки (килограмм)'] = {
        '|=Бочка ячменной муки (литр)':1 / 0.59,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка гороховой муки (килограмм)'] = {
        '|=Бочка гороховой муки (литр)':1 / 0.59,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка чечевичной муки (килограмм)'] = {
        '|=Бочка чечевичной муки (литр)':1 / 0.59,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка пшеничного солода (килограмм)'] = {
        '|=Бочка пшеничного солода (литр)':1 / 0.34,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка пшеничной муки (килограмм)'] = {
        '|=Бочка пшеничной муки (литр)':1 / 0.59,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка соевой муки (килограмм)'] = {
        '|=Бочка соевой муки (литр)':1 / 0.59,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка льняной муки (килограмм)'] = {
        '|=Бочка льняной муки (литр)':1 / 0.59,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка соевых бобов (килограмм)'] = {
        '|=Бочка соевых бобов (литр)':1 / 0.75,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.14),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.14) - 1),
        }

metadict_detail['|=Бочка сухой горчицы (килограмм)'] = {
        '|=Бочка сухой горчицы (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.18),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.18) - 1),
        }

metadict_detail['|=Бочка сушёного хмеля (килограмм)'] = {
        '|=Бочка сушёного хмеля (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.18),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.18) - 1),
        }

metadict_detail['|=Бочка какао-порошка (килограмм)'] = {
        '|=Бочка какао-порошка (литр)':1 / 0.65,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка сухого гороха (килограмм)'] = {
        '|=Бочка сухого гороха (литр)':1 / 0.80,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.14),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.14) - 1),
        }

metadict_detail['|=Бочка сухого нута (килограмм)'] = {
        '|=Бочка сухого нута (литр)':1 / 0.80,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.14),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.14) - 1),
        }

metadict_detail['|=Бочка сухого урда (килограмм)'] = {
        '|=Бочка сухого урда (литр)':1 / 0.80,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.14),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.14) - 1),
        }

metadict_detail['|=Бочка сухой чечевицы (килограмм)'] = {
        '|=Бочка сухой чечевицы (литр)':1 / 0.80,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.14),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.14) - 1),
        }

metadict_detail['|=Бочка сухой фасоли (килограмм)'] = {
        '|=Бочка сухой фасоли (литр)':1 / 0.80,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.14),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.14) - 1),
        }

metadict_detail['|=Бочка сушёной морской капусты (килограмм)'] = {
        '|=Бочка сушёной морской капусты (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка сушёного шиповника (килограмм)'] = {
        '|=Бочка сушёного шиповника (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка сушёной клюквы (килограмм)'] = {
        '|=Бочка сушёной клюквы (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка сушёной рябины (килограмм)'] = {
        '|=Бочка сушёной рябины (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка сушёной малины (килограмм)'] = {
        '|=Бочка сушёной малины (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка сушёной смородины (килограмм)'] = {
        '|=Бочка сушёной смородины (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка сушёной черники (килограмм)'] = {
        '|=Бочка сушёной черники (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка сушёных белых грибов (килограмм)'] = {
        '|=Бочка сушёных белых грибов (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка сушёной вишни (килограмм)'] = {
        '|=Бочка сушёной вишни (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка сушёной груши (килограмм)'] = {
        '|=Бочка сушёной груши (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка сушёной хурмы (килограмм)'] = {
        '|=Бочка сушёной хурмы (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка сушёного абрикоса (килограмм)'] = {
        '|=Бочка сушёного абрикоса (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка сушёного инжира (килограмм)'] = {
        '|=Бочка сушёного инжира (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка фиников (килограмм)'] = {
        '|=Бочка фиников (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка сушёного персика (килограмм)'] = {
        '|=Бочка сушёного персика (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка сушёной сливы (килограмм)'] = {
        '|=Бочка сушёной сливы (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка сушёной алычи (килограмм)'] = {
        '|=Бочка сушёной алычи (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка сушёных томатов (килограмм)'] = {
        '|=Бочка сушёных томатов (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка вяленых томатов (килограмм)'] = {
        '|=Бочка вяленых томатов (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка сушёных трав (килограмм)'] = {
        # TODO: Бочка сушёных трав. Не используется. Под разные травы отдельные.
        '|=Бочка сушёных трав (литр)':1 / 0.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.18),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.18) - 1),
        }

metadict_detail['|=Бочка местных трав (килограмм)'] = {
        '|=Бочка местных трав (литр)':1 / 0.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.18),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.18) - 1),
        }

metadict_detail['|=Бочка местных пряностей (килограмм)'] = {
        '|=Бочка местных пряностей (литр)':1 / 0.43,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.16),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.16) - 1),
        }

metadict_detail['|=Бочка сушёных яблок (килограмм)'] = {
        '|=Бочка сушёных яблок (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка соли (килограмм)'] = {
        '|=Бочка соли (литр)':1 / 1.2,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.07),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.07) - 1),
        }

metadict_detail['|=Бочка едкого натра (килограмм)'] = {
        '|=Бочка едкого натра (литр)':1 / 1.2,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.07),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.07) - 1),
        }

metadict_detail['|=Бочка хлорки (килограмм)'] = {
        '|=Бочка хлорки (литр)':1 / 1.2,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.07),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.07) - 1),
        }

metadict_detail['|=Бочка серной кислоты (килограмм)'] = {
        # TODO: Бочка серной кислоты. В деревянных бочках точно перевозят?
        '|=Бочка серной кислоты (литр)':1 / 1.2,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.07),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.07) - 1),
        }

metadict_detail['|=Бочка серного эфира (килограмм)'] = {
        '|=Бочка серного эфира (литр)':1 / 1.2,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.07),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.07) - 1),
        }

metadict_detail['|=Бочка соды негашёной (килограмм)'] = {
        '|=Бочка соды негашёной (литр)':1 / 1.2,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.07),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.07) - 1),
        }

metadict_detail['|=Бочка соды пищевой (килограмм)'] = {
        '|=Бочка соды пищевой (литр)':1 / 1.2,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.07),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.07) - 1),
        }

metadict_detail['|=Бочка тростникового сахара (килограмм)'] = {
        # Сахар рафинируют в Эквестрии
        '|=Бочка тростникового сахара (литр)':1 / 0.85,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.08),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.08) - 1),
        }

metadict_detail['|=Бочка дёгтя (килограмм)'] = {
        '|=Бочка дёгтя (литр)':1 / 0.95,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка каменноугольной смолы (килограмм)'] = {
        '|=Бочка каменноугольной смолы (литр)':1 / 0.95,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка извести негашёной (килограмм)'] = {
        # TODO: Бочка извести негашёной. В отдельную категорию химического сырья.
        '|=Бочка извести негашёной (литр)':1 / 0.85,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка цемента М400 (килограмм)'] = {
        '|=Бочка цемента М400 (литр)':1 / 1.51,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.06),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.06) - 1),
        }

metadict_detail['|=Бочка жидкого стекла (килограмм)'] = {
        '|=Бочка жидкого стекла (литр)':1 / 1.5,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.06),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.06) - 1),
        }

metadict_detail['|=Бочка стеклянной глазури (килограмм)'] = {
        '|=Бочка стеклянной глазури (литр)':1 / 1.5,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.06),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.06) - 1),
        }

metadict_detail['|=Бочка асбеста (килограмм)'] = {
        '|=Бочка асбеста (литр)':1 / 0.52,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка мелового порошка (килограмм)'] = {
        '|=Бочка мелового порошка (литр)':1 / 0.52,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка дегтярного масла (килограмм)'] = {
        '|=Бочка дегтярного масла (литр)':1 / 0.91,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка масляных красок (килограмм)'] = {
        '|=Бочка масляных красок (литр)':1 / 0.91,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка аниловых красок (килограмм)'] = {
        '|=Бочка аниловых красок (литр)':1 / 0.91,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка клея обойного (килограмм)'] = {
        '|=Бочка клея обойного (литр)':1 / 0.91,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка олифы (килограмм)'] = {
        '|=Бочка олифы (литр)':1 / 0.91,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка хозяйственного мыла (килограмм)'] = {
        '|=Бочка хозяйственного мыла (литр)':1 / 0.91,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка машинного масла (килограмм)'] = {
        '|=Бочка машинного масла (литр)':1 / 0.91,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка колёсной мази (килограмм)'] = {
        '|=Бочка колёсной мази (литр)':1 / 0.91,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка пироксилина (килограмм)'] = {
        '|=Бочка пироксилина (литр)':1 / 0.91,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.45),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.45) - 1),
        }

#----
# Грузоперевозки (в горшках):

metadict_detail['|=Горшок маринованной моркови (килограмм)'] = {
        # Пифос, объём 100 литров, вес 43 кг.
            # https://en.wikipedia.org/wiki/Pithos#Weight_and_measures
        '|=Горшок маринованной моркови (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.30),
        '-Тарные горшки (килограмм)':(1 / (1 - 0.30) - 1),
        }

metadict_detail['|=Горшок квашеной капусты кимчи (килограмм)'] = {
        '|=Горшок квашеной капусты кимчи (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.30),
        '-Тарные горшки (килограмм)':(1 / (1 - 0.30) - 1),
        }

#----
# Импорт:

metadict_detail['|=Бочка тростникового сахара-сырца (килограмм)'] = {
        # Импорт из Эверглейдса
        '|=Бочка тростникового сахара-сырца (литр)':1 / 0.96,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия, импорт (Зебрика) (брутто) (килограмм)':1 / (1 - 0.08),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.08) - 1),
        }

metadict_detail['|=Бочка чёрной патоки (килограмм)'] = {
        '|=Бочка чёрной патоки (литр)':1 / 0.96,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия, импорт (Зебрика) (брутто) (килограмм)':1 / (1 - 0.08),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.08) - 1),
        }

metadict_detail['|=Бочка кофейных зёрен (килограмм)'] = {
        '|=Бочка кофейных зёрен (литр)':1 / 0.56,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия, импорт (Зебрика) (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка какао-бобов (килограмм)'] = {
        '|=Бочка какао-бобов (литр)':1 / 0.6,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия, импорт (Зебрика) (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка сушёных чайных листьев (килограмм)'] = {
        '|=Бочка сушёных чайных листьев (литр)':1 / 0.43,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия, импорт (Зебрика) (брутто) (килограмм)':1 / (1 - 0.16),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.16) - 1),
        }

metadict_detail['|=Бочка импортных пряностей (килограмм)'] = {
        '|=Бочка импортных пряностей (литр)':1 / 0.43,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия, импорт (Зебрика) (брутто) (килограмм)':1 / (1 - 0.16),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.16) - 1),
        }

metadict_detail['|=Бочка сухой ванили (килограмм)'] = {
        '|=Бочка сухой ванили (литр)':1 / 0.43,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия, импорт (Зебрика) (брутто) (килограмм)':1 / (1 - 0.18),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.18) - 1),
        }

metadict_detail['|=Бочка корицы (килограмм)'] = {
        '|=Бочка корицы (литр)':1 / 0.43,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия, импорт (Зебрика) (брутто) (килограмм)':1 / (1 - 0.18),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.18) - 1),
        }

metadict_detail['|=Бочка сушёного манго (килограмм)'] = {
        '|=Бочка сушёного манго (литр)':1 / 0.43,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия, импорт (Зебрика) (брутто) (килограмм)':1 / (1 - 0.16),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.16) - 1),
        }

metadict_detail['|=Бочка сушёных бананов (килограмм)'] = {
        '|=Бочка сушёных бананов (литр)':1 / 0.43,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия, импорт (Зебрика) (брутто) (килограмм)':1 / (1 - 0.16),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.16) - 1),
        }

#----
# Импорт (фрукты):

metadict_detail['|=Мешок импортных фруктов (килограмм)'] = {
        # Считаем как продовольствие, чтобы фрукты не дублировались
        '|=Мешок импортных фруктов (литр)':1 / 0.6,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов, импорт (Зебрика) (брутто) (килограмм)':1 / (1 - 0.04),
        '-Тарные мешки (килограмм)':(1 / (1 - 0.04) - 1),
        }

metadict_detail['|=Мешок импортных авокадо (килограмм)'] = {
        '|=Мешок импортных авокадо (литр)':1 / 0.6,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов, импорт (Зебрика) (брутто) (килограмм)':1 / (1 - 0.04),
        '-Тарные мешки (килограмм)':(1 / (1 - 0.04) - 1),
        }

metadict_detail['|=Мешок импортных бананов (килограмм)'] = {
        '|=Мешок импортных бананов (литр)':1 / 0.6,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов, импорт (Зебрика) (брутто) (килограмм)':1 / (1 - 0.04),
        '-Тарные мешки (килограмм)':(1 / (1 - 0.04) - 1),
        }

metadict_detail['|=Мешок импортных манго (килограмм)'] = {
        '|=Мешок импортных манго (литр)':1 / 0.6,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов, импорт (Зебрика) (брутто) (килограмм)':1 / (1 - 0.04),
        '-Тарные мешки (килограмм)':(1 / (1 - 0.04) - 1),
        }

metadict_detail['|=Мешок импортных апельсинов (килограмм)'] = {
        '|=Мешок импортных апельсинов (литр)':1 / 0.6,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов, импорт (Зебрика) (брутто) (килограмм)':1 / (1 - 0.04),
        '-Тарные мешки (килограмм)':(1 / (1 - 0.04) - 1),
        }

metadict_detail['|=Мешок импортных мандаринов (килограмм)'] = {
        '|=Мешок импортных мандаринов (литр)':1 / 0.6,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов, импорт (Зебрика) (брутто) (килограмм)':1 / (1 - 0.04),
        '-Тарные мешки (килограмм)':(1 / (1 - 0.04) - 1),
        }

metadict_detail['|=Мешок импортных лаймов (килограмм)'] = {
        '|=Мешок импортных лаймов (литр)':1 / 0.6,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов, импорт (Зебрика) (брутто) (килограмм)':1 / (1 - 0.04),
        '-Тарные мешки (килограмм)':(1 / (1 - 0.04) - 1),
        }

#----
# Местные перевозки, город-деревня:

metadict_detail['|=Бочка питьевой воды (килограмм)'] = {
        '|=Бочка питьевой воды (литр)':1,
        '|==Вода (тонн)':1 / 1000,
        'Доставка воды для хозяйства (брутто) (килограмм)':1 / (1 - 0.08),
        #'-Тарные бочки (килограмм)':(1 / (1 - 0.08) - 1),
        }

metadict_detail['|=Бочка хозяйственной воды (килограмм)'] = {
        '|=Бочка хозяйственной воды (литр)':1,
        '|==Вода (тонн)':1 / 1000,
        'Доставка воды для хозяйства (брутто) (килограмм)':1 / (1 - 0.08),
        #'-Тарные бочки (килограмм)':(1 / (1 - 0.08) - 1),
        }

metadict_detail['|=Бочка промышленной воды (килограмм)'] = {
        # TODO: Бочка промышленной воды. Пока что используется только для строительства.
        '|=Бочка промышленной воды (литр)':1,
        '|==Сырьё промышленное (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка воды для промышленности (брутто) (килограмм)':1 / (1 - 0.08),
        #'-Тарные бочки (килограмм)':(1 / (1 - 0.08) - 1),
        }

metadict_detail['|=Бочка кленового сока (килограмм)'] = {
        '|=Бочка кленового сока (литр)':1,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка грузов от ближайшего леса (брутто) (килограмм)':1 / (1 - 0.08),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.08) - 1),
        }

metadict_detail['|=Корзина дикорастущих растений (килограмм)'] = {
        '|=Корзина дикорастущих растений (литр)':1 / 0.42,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка грузов от ближайшего леса (брутто) (килограмм)':1 / (1 - 0.16),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.16) - 1),
        }

metadict_detail['|=Корзина красных водорослей (килограмм)'] = {
        '|=Корзина красных водорослей (литр)':1 / 0.42,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка грузов от ближайшего леса (брутто) (килограмм)':1 / (1 - 0.16),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.16) - 1),
        }

metadict_detail['|=Корзина морской капусты (килограмм)'] = {
        '|=Корзина морской капусты (литр)':1 / 0.42,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка грузов от ближайшего леса (брутто) (килограмм)':1 / (1 - 0.16),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.16) - 1),
        }

metadict_detail['|=Корзина батата (килограмм)'] = {
        '|=Корзина батата (литр)':1 / 0.64,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина топинамбура (килограмм)'] = {
        '|=Корзина топинамбура (литр)':1 / 0.64,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина арбуза (килограмм)'] = {
        '|=Корзина арбуза (литр)':1 / 0.64,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина дыни (килограмм)'] = {
        '|=Корзина дыни (литр)':1 / 0.64,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина винограда (килограмм)'] = {
        '|=Корзина винограда (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина вишни (килограмм)'] = {
        '|=Корзина вишни (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина черешни (килограмм)'] = {
        '|=Корзина черешни (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина рябины (килограмм)'] = {
        '|=Корзина рябины (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина сливы (килограмм)'] = {
        '|=Корзина сливы (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина алычи (килограмм)'] = {
        '|=Корзина алычи (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина инжира (килограмм)'] = {
        '|=Корзина инжира (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина граната (килограмм)'] = {
        '|=Корзина граната (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина бананов (килограмм)'] = {
        '|=Корзина бананов (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина манго (килограмм)'] = {
        '|=Корзина манго (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина авокадо (килограмм)'] = {
        '|=Корзина авокадо (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина апельсинов (килограмм)'] = {
        '|=Корзина апельсинов (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина мандаринов (килограмм)'] = {
        '|=Корзина мандаринов (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина лаймов (килограмм)'] = {
        '|=Корзина лаймов (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина фиников (килограмм)'] = {
        '|=Корзина фиников (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина персика (килограмм)'] = {
        '|=Корзина персика (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина абрикоса (килограмм)'] = {
        '|=Корзина абрикоса (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина груш (килограмм)'] = {
        '|=Корзина груш (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина хурмы (килограмм)'] = {
        '|=Корзина хурмы (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина айвы (килограмм)'] = {
        '|=Корзина айвы (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина кабачка (килограмм)'] = {
        '|=Корзина кабачка (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина баклажанов (килограмм)'] = {
        '|=Корзина баклажанов (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина капусты белокочанной (килограмм)'] = {
        '|=Корзина капусты белокочанной (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина картофеля (килограмм)'] = {
        '|=Корзина картофеля (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина красной фасоли в стручках (килограмм)'] = {
        '|=Корзина красной фасоли в стручках (литр)':1 / 0.6,
        '|==Зернобобовые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка зернобобовых (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина соевых бобов в стручках (килограмм)'] = {
        '|=Корзина соевых бобов в стручках (литр)':1 / 0.6,
        '|==Зернобобовые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка зернобобовых (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина лука репчатого (килограмм)'] = {
        '|=Корзина лука репчатого (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина чеснока (килограмм)'] = {
        '|=Корзина чеснока (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина моркови (килограмм)'] = {
        '|=Корзина моркови (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина огурцов (килограмм)'] = {
        '|=Корзина огурцов (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина перца сладкого (килограмм)'] = {
        '|=Корзина перца сладкого (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина зерна кукурузы (килограмм)'] = {
        '|=Корзина зерна кукурузы (литр)':1 / 0.6,
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка зерновых (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина початков кукурузы (килограмм)'] = {
        '|=Корзина початков кукурузы (литр)':1 / 0.72,
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина свёклы (килограмм)'] = {
        '|=Корзина свёклы (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина томатов (килограмм)'] = {
        '|=Корзина томатов (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина тыквы (килограмм)'] = {
        '|=Корзина тыквы (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина чайных листьев (килограмм)'] = {
        '|=Корзина чайных листьев (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (Зебрика) (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина листьев карри (килограмм)'] = {
        '|=Корзина листьев карри (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (Зебрика) (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина фруктов (килограмм)'] = {
        # TODO: Корзина фруктов. Не используется. Под разные фрукты отдельные.
        '|=Корзина фруктов (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина лимонов (килограмм)'] = {
        '|=Корзина лимонов (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина яблок (килограмм)'] = {
        '|=Корзина яблок (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина арахиса в шелухе (килограмм)'] = {
        '|=Корзина арахиса в шелухе (литр)':1 / 0.27,
        '|==Зернобобовые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка зернобобовых (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина фисташек в скорлупе (килограмм)'] = {
        '|=Корзина фисташек в скорлупе (литр)':1 / 0.27,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка орехов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина миндаля в скорлупе (килограмм)'] = {
        '|=Корзина миндаля в скорлупе (литр)':1 / 0.27,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка орехов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина зерна овса (килограмм)'] = {
        '|=Корзина зерна овса (литр)':1 / 0.43,
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка зерновых (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина оливок (килограмм)'] = {
        '|=Корзина оливок (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина зерна пшеницы (килограмм)'] = {
        '|=Корзина зерна пшеницы (литр)':1 / 0.78,
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка зерновых (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина семян горчицы (килограмм)'] = {
        '|=Корзина семян горчицы (литр)':1 / 0.72,
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина семян конопли (килограмм)'] = {
        '|=Корзина семян конопли (литр)':1 / 0.72,
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка масличного сырья (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина семян льна (килограмм)'] = {
        '|=Корзина семян льна (литр)':1 / 0.72,
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка масличного сырья (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина семян джута (килограмм)'] = {
        '|=Корзина семян джута (литр)':1 / 0.72,
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка масличного сырья (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина семян хлопка (килограмм)'] = {
        '|=Корзина семян хлопка (литр)':1 / 0.72,
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка масличного сырья (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина семян кунжута (килограмм)'] = {
        '|=Корзина семян кунжута (литр)':1 / 0.72,
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка масличного сырья (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина маковых головок (килограмм)'] = {
        '|=Корзина маковых головок (литр)':1 / 0.72,
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка масличного сырья (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина семян мака (килограмм)'] = {
        '|=Корзина семян мака (литр)':1 / 0.72,
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка масличного сырья (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина семян подсолнечника (килограмм)'] = {
        '|=Корзина семян подсолнечника (литр)':1 / 0.72,
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка масличного сырья (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина цветов подсолнечника (килограмм)'] = {
        '|=Корзина цветов подсолнечника (литр)':1 / 0.42,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.16),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.16) - 1),
        }

metadict_detail['|=Корзина коробочек кунжута (килограмм)'] = {
        '|=Корзина коробочек кунжута (литр)':1 / 0.42,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (Зебрика) (брутто) (килограмм)':1 / (1 - 0.16),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.16) - 1),
        }

metadict_detail['|=Корзина плодов какао (килограмм)'] = {
        '|=Корзина плодов какао (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (Зебрика) (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина плодов пименты (килограмм)'] = {
        '|=Корзина плодов пименты (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (Зебрика) (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина плодов кофейного дерева (килограмм)'] = {
        '|=Корзина плодов кофейного дерева (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (Зебрика) (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина стручков острого перца (килограмм)'] = {
        '|=Корзина стручков острого перца (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина стручков сладко-жгучего перца (килограмм)'] = {
        '|=Корзина стручков сладко-жгучего перца (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина стручков ванили (килограмм)'] = {
        '|=Корзина стручков ванили (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (Зебрика) (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Связка сахарного тростника (килограмм)'] = {
        '|=Связка сахарного тростника (литр)':1 / 0.27,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (Зебрика) (брутто) (килограмм)':1 / (1 - 0.02),
        #'-Тарные корзины (килограмм)':(1 / (1 - 0.02) - 1),
        }

metadict_detail['|=Корзина гвоздики (килограмм)'] = {
        '|=Корзина гвоздики (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (Зебрика) (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина цветов шафрана (килограмм)'] = {
        '|=Корзина цветов шафрана (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (Зебрика) (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина гороха в стручках (килограмм)'] = {
        '|=Корзина гороха в стручках (литр)':1 / 0.6,
        '|==Зернобобовые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка зернобобовых (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина нута бараньего в стручках (килограмм)'] = {
        '|=Корзина нута бараньего в стручках (литр)':1 / 0.6,
        '|==Зернобобовые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка зернобобовых (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина урда в стручках (килограмм)'] = {
        '|=Корзина урда в стручках (литр)':1 / 0.6,
        '|==Зернобобовые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка зернобобовых (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина чечевицы (килограмм)'] = {
        '|=Корзина чечевицы (литр)':1 / 0.6,
        '|==Зернобобовые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка зернобобовых (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина зерна гречихи (килограмм)'] = {
        '|=Корзина зерна гречихи (литр)':1 / 0.6,
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка зерновых (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина зерна риса посевного (килограмм)'] = {
        '|=Корзина зерна риса посевного (литр)':1 / 0.6,
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка зерновых (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина шампиньонов (килограмм)'] = {
        '|=Корзина шампиньонов (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина вёшенок (килограмм)'] = {
        '|=Корзина вёшенок (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина дикорастущих грибов (килограмм)'] = {
        '|=Корзина дикорастущих грибов (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка грузов от ближайшего леса (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина дикорастущих орехов (килограмм)'] = {
        '|=Корзина дикорастущих орехов (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка орехов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина дикорастущих ягод (килограмм)'] = {
        '|=Корзина дикорастущих ягод (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка грузов от ближайшего леса (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина зерна ржи (килограмм)'] = {
        '|=Корзина зерна ржи (литр)':1 / 0.43,
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка зерновых (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина зерна ячменя (килограмм)'] = {
        '|=Корзина зерна ячменя (литр)':1 / 0.43,
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка зерновых (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина зерна просо (килограмм)'] = {
        '|=Корзина зерна просо (литр)':1 / 0.43,
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка зерновых (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина корнеплодов (килограмм)'] = {
        # TODO: Корзина корнеплодов. Не используется. Под разные корнеплоды отдельные.
        '|=Корзина корнеплодов (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина имбиря (килограмм)'] = {
        '|=Корзина имбиря (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина корней фенхеля (килограмм)'] = {
        '|=Корзина корней фенхеля (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина листьев фенхеля (килограмм)'] = {
        '|=Корзина листьев фенхеля (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина овощей (килограмм)'] = {
        # TODO: Корзина овощей. Не используется. Под разные овощи отдельные.
        '|=Корзина овощей (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина брокколи (килограмм)'] = {
        '|=Корзина брокколи (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина артишоков (килограмм)'] = {
        '|=Корзина артишоков (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина огородных растений (килограмм)'] = {
        # TODO: Корзина огородных растений. Не используется. Под разные овощи отдельные.
        '|=Корзина огородных растений (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина хмеля (килограмм)'] = {
        '|=Корзина хмеля (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина мяты (килограмм)'] = {
        '|=Корзина мяты (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина кориандра (килограмм)'] = {
        '|=Корзина кориандра (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина хрена (килограмм)'] = {
        '|=Корзина хрена (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина петрушки (килограмм)'] = {
        '|=Корзина петрушки (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина шпината (килограмм)'] = {
        '|=Корзина шпината (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина плодов чёрного перца (килограмм)'] = {
        '|=Корзина плодов чёрного перца (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (Зебрика) (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина ревеня (килограмм)'] = {
        '|=Корзина ревеня (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина репы (килограмм)'] = {
        '|=Корзина репы (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина редьки (килограмм)'] = {
        '|=Корзина редьки (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина редиса (килограмм)'] = {
        '|=Корзина редиса (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина брюквы (килограмм)'] = {
        '|=Корзина брюквы (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина турнепса (килограмм)'] = {
        '|=Корзина турнепса (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина латука посевного (килограмм)'] = {
        '|=Корзина латука посевного (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина сельдерея (килограмм)'] = {
        '|=Корзина сельдерея (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина пастернака (килограмм)'] = {
        '|=Корзина пастернака (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина спаржи (килограмм)'] = {
        '|=Корзина спаржи (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина кресс-салата (килограмм)'] = {
        '|=Корзина кресс-салата (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина укропа (килограмм)'] = {
        '|=Корзина укропа (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина лука зелёного (килограмм)'] = {
        '|=Корзина лука зелёного (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Сноп фенхеля (килограмм)'] = {
        '|=Сноп фенхеля (литр)':1 / 0.05,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.02),
        }

metadict_detail['|=Сноп овса (килограмм)'] = {
        # Плотность сена, соломы -- 50 кг/кубометр
        '|=Сноп овса (литр)':1 / 0.05,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.02),
        }

metadict_detail['|=Сноп овсяной соломы (килограмм)'] = {
        '|=Сноп овсяной соломы (литр)':1 / 0.05,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.02),
        }

metadict_detail['|=Сноп гречихи посевной (килограмм)'] = {
        '|=Сноп гречихи посевной (литр)':1 / 0.05,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.02),
        }

metadict_detail['|=Сноп гречишной соломы (килограмм)'] = {
        '|=Сноп гречишной соломы (литр)':1 / 0.05,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.02),
        }

metadict_detail['|=Сноп пшеницы (килограмм)'] = {
        '|=Сноп пшеницы (литр)':1 / 0.05,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.02),
        }

metadict_detail['|=Сноп пшеничной соломы (килограмм)'] = {
        '|=Сноп пшеничной соломы (литр)':1 / 0.05,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.02),
        }

metadict_detail['|=Сноп ржи (килограмм)'] = {
        '|=Сноп ржи (литр)':1 / 0.05,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.02),
        }

metadict_detail['|=Сноп ржаной соломы (килограмм)'] = {
        '|=Сноп ржаной соломы (литр)':1 / 0.05,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.02),
        }

metadict_detail['|=Сноп ячменя (килограмм)'] = {
        '|=Сноп ячменя (литр)':1 / 0.05,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.02),
        }

metadict_detail['|=Сноп ячменной соломы (килограмм)'] = {
        '|=Сноп ячменной соломы (литр)':1 / 0.05,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.02),
        }

metadict_detail['|=Сноп просо (килограмм)'] = {
        '|=Сноп просо (литр)':1 / 0.05,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.02),
        }

metadict_detail['|=Сноп просяной соломы (килограмм)'] = {
        '|=Сноп просяной соломы (литр)':1 / 0.05,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.02),
        }

metadict_detail['|=Сноп риса посевного (килограмм)'] = {
        '|=Сноп риса посевного (литр)':1 / 0.05,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.02),
        }

metadict_detail['|=Сноп рисовой соломы (килограмм)'] = {
        '|=Сноп рисовой соломы (литр)':1 / 0.05,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.02),
        }

metadict_detail['|=Сноп горчицы (килограмм)'] = {
        '|=Сноп горчицы (литр)':1 / 0.05,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.02),
        }

metadict_detail['|=Сноп конопли (килограмм)'] = {
        '|=Сноп конопли (литр)':1 / 0.05,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.02),
        }

metadict_detail['|=Сноп льна (килограмм)'] = {
        '|=Сноп льна (литр)':1 / 0.05,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.02),
        }

metadict_detail['|=Сноп джута (килограмм)'] = {
        '|=Сноп джута (литр)':1 / 0.05,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.02),
        }

#----
# Канализация и вывоз мусора:

metadict_detail['|=Корзина пищевых отходов (килограмм)'] = {
        '|=Корзина пищевых отходов (литр)':1 / 0.6,
        'Вывоз мусора, твёрдого (тонн)':1 / 1000,
        #'-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка пищевых отходов (килограмм)'] = {
        '|=Бочка пищевых отходов (литр)':1 / 0.9,
        'Вывоз мусора, жидкого (тонн)':1 / 1000,
        #'-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

#----
# Трубопроводы:

metadict_detail['|=Трубопроводный транспорт воды (килограмм)'] = {
        # TODO: Трубопроводы так-то тоже следует учесть в грузообороте.
        '|==Вода (тонн)':1 / 1000,
        'Доставка воды для хозяйства, трубопровод (нетто) (килограмм)':1,
        'Слив жидких отходов, трубопровод (нетто) (килограмм)':1,
        }

#----
# Перевозка без тары:
    # Погрузочный объём:
    # http://www.libussr.ru/doc_ussr/usr_14950.htm

metadict_detail['|=Кирпич (тонн)'] = {
        '|=Кирпич (кубометр)':1 / 2.12,
        '|==Стройматериалы (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка стройматериалов (тонн)':1,
        }

metadict_detail['|=Черепица (тонн)'] = {
        '|=Черепица (кубометр)':1 / 2.12,
        '|==Стройматериалы (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка стройматериалов (тонн)':1,
        }

metadict_detail['|=Кафель (тонн)'] = {
        '|=Кафель (кубометр)':1 / 2.12,
        '|==Стройматериалы (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка стройматериалов (тонн)':1,
        }

metadict_detail['|=Стекло листовое (килограмм)'] = {
        '|=Стекло листовое (кубометр)':2 / 1000,
        '|==Стройматериалы (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка стройматериалов (тонн)':1 / 1000,
        }

metadict_detail['|=Пиломатериалы свежие (тонн)'] = {
        '|=Пиломатериалы свежие (кубометр)':1.5,
        '|==Стройматериалы (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка стройматериалов (тонн)':1,
        }

metadict_detail['|=Доски паркетные (тонн)'] = {
        '|=Доски паркетные (кубометр)':1.5,
        '|==Стройматериалы (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка стройматериалов (тонн)':1,
        }

metadict_detail['|=Кирпич опилкобетонный лёгкий (тонн)'] = {
        '|=Кирпич опилкобетонный лёгкий (кубометр)':1 / 0.5,
        '|==Стройматериалы (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка стройматериалов (тонн)':1,
        }

metadict_detail['|=Кирпич саманный лёгкий (тонн)'] = {
        '|=Кирпич саманный лёгкий (кубометр)':1 / 0.5,
        '|==Стройматериалы (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка строительного сырья (тонн)':1,
        }

metadict_detail['|=Глина (тонн)'] = {
        '|=Глина (кубометр)':1,
        '|==Стройматериалы (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка строительного сырья (тонн)':1,
        }

metadict_detail['|=Лес круглый (тонн)'] = {
        '|=Лес круглый (кубометр)':2,
        '|==Сырьё промышленное (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка строительного сырья (тонн)':1,
        }

metadict_detail['|=Брикеты прессованного жмыха (тонн)'] = {
        # TODO: Переименуй. Доставка дров --> доставка топлива.
        '|=Брикеты прессованного жмыха (кубометр)':5,
        '|==Сырьё промышленное (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка дров (тонн)':1,
        }

metadict_detail['|=Брикеты прессованных отрубей (тонн)'] = {
        '|=Брикеты прессованных отрубей (кубометр)':5,
        '|==Сырьё промышленное (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка дров (тонн)':1,
        }

metadict_detail['|=Торф прессованный (тонн)'] = {
        # Плотность сухого торфа -- 150-250 кг/кубометр
        # Плотность прессованного -- 460 кг/кубометр
        '|=Торф прессованный (кубометр)':1 / (460 / 1000),
        '|==Сырьё промышленное (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка дров (тонн)':1,
        }

metadict_detail['|=Дрова (тонн)'] = {
        # Кубическая сажень дров (9.67 кубометров) = 4 тонны
        # 1 тонна дрова = 2.42 кубометра поленницы
        '|=Дрова (кубометр)':2.42,
        '|==Сырьё промышленное (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка дров (тонн)':1,
        }

metadict_detail['|=Дрова (Зебрика) (тонн)'] = {
        '|=Дрова (Зебрика) (кубометр)':2,
        '|==Сырьё промышленное (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка дров (Зебрика) (тонн)':1,
        }

metadict_detail['|=Валежник (тонн)'] = {
        '|=Валежник (кубометр)':4,
        '|==Сырьё промышленное (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка дров (тонн)':1,
        }

metadict_detail['|=Уголь древесный (тонн)'] = {
        '|=Уголь древесный (кубометр)':2,
        '|==Сырьё промышленное (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка угля (тонн)':1,
        }

metadict_detail['|=Грунт (тонн)'] = {
        '|=Грунт (кубометр)':1 / 1.6,
        #'|==Сырьё промышленное (тонн)':1,
        'Вывоз мусора, строительного (тонн)':1,
        }

metadict_detail['|=Опилки древесные (тонн)'] = {
        '|=Опилки древесные (кубометр)':4,
        '|==Сырьё промышленное (тонн)':1,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка строительного сырья (тонн)':1,
        }

metadict_detail['|=Сноп сухой соломы (тонн)'] = {
        '|=Сноп сухой соломы (кубометр)':6,
        '|==Сырьё промышленное (тонн)':1,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка строительного сырья (тонн)':1,
        }

metadict_detail['|=Тюк прессованной соломы (тонн)'] = {
        '|=Тюк прессованной соломы (кубометр)':10,
        '|==Сырьё промышленное (тонн)':1,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка строительного сырья (тонн)':1,
        }

metadict_detail['|=Связка ивовых прутьев, очищенных (килограмм)'] = {
        '|=Связка ивовых прутьев, очищенных (литр)':1 / 0.27,
        '|==Сырьё промышленное (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленного сырья (тонн)':1 / 1000,
        }

metadict_detail['|=Связка ивовых прутьев, сырых (килограмм)'] = {
        # Для грубых корзин, щитков для полей, оград, плетней.
        '|=Связка ивовых прутьев, сырых (литр)':1 / 0.27,
        '|==Сырьё промышленное (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка строительного сырья (тонн)':1 / 1000,
        }

metadict_detail['|=Тюк пакли (килограмм)'] = {
        '|=Тюк пакли (кубометр)':6 / 1000,
        '|==Сырьё промышленное (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка строительного сырья (тонн)':1 / 1000,
        }

metadict_detail['|=Тюк пеньки (килограмм)'] = {
        '|=Тюк пеньки (кубометр)':6 / 1000,
        '|==Сырьё промышленное (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленного сырья (тонн)':1 / 1000,
        }

metadict_detail['|=Тюк джута-сырца (килограмм)'] = {
        '|=Тюк джута-сырца (кубометр)':6 / 1000,
        '|==Сырьё промышленное (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленного сырья (тонн)':1 / 1000,
        }

metadict_detail['|=Тюк льна-сырца (килограмм)'] = {
        '|=Тюк льна-сырца (кубометр)':6 / 1000,
        '|==Сырьё промышленное (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленного сырья (тонн)':1 / 1000,
        }

metadict_detail['|=Тюк хлопка-сырца (килограмм)'] = {
        '|=Тюк хлопка-сырца (кубометр)':6 / 1000,
        '|==Сырьё промышленное (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленного сырья (тонн)':1 / 1000,
        }

metadict_detail['|=Тюк хлопчатой ваты (килограмм)'] = {
        '|=Тюк хлопчатой ваты (кубометр)':10 / 1000,
        '|==Сырьё промышленное (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Тюк джутовой пряжи (килограмм)'] = {
        '|=Тюк джутовой пряжи (кубометр)':10 / 1000,
        '|==Сырьё промышленное (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Тюк льняной пряжи (килограмм)'] = {
        '|=Тюк льняной пряжи (кубометр)':10 / 1000,
        '|==Сырьё промышленное (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Тюк пеньковой пряжи (килограмм)'] = {
        '|=Тюк пеньковой пряжи (кубометр)':10 / 1000,
        '|==Сырьё промышленное (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Тюк хлопчатой пряжи (килограмм)'] = {
        '|=Тюк хлопчатой пряжи (кубометр)':10 / 1000,
        '|==Сырьё промышленное (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

#metadict_detail['|=Рулон глиносоломенного ковра (тонн)'] = {
#        '|=Рулон глиносоломенного ковра (кубометр)':2,
#        '|==Стройматериалы (тонн)':1,
#        'Доставка строительного сырья (тонн)':1,
#        }

metadict_detail['|=Рулон смоляной пакли (килограмм)'] = {
        '|=Рулон смоляной пакли (кубометр)':3.4 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон хлопчатого ковра (килограмм)'] = {
        '|=Рулон хлопчатого ковра (кубометр)':6 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон джутового ковра (килограмм)'] = {
        '|=Рулон джутового ковра (кубометр)':6 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон соломенного ковра (килограмм)'] = {
        '|=Рулон соломенного ковра (кубометр)':6 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка стройматериалов (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон соломенной ткани (килограмм)'] = {
        '|=Рулон соломенной ткани (кубометр)':6 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон толя (килограмм)'] = {
        '|=Рулон толя (кубометр)':2 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон обоев (килограмм)'] = {
        '|=Рулон обоев (кубометр)':4 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон бумаги (килограмм)'] = {
        '|=Рулон бумаги (кубометр)':4 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон бархата (килограмм)'] = {
        '|=Рулон бархата (кубометр)':4 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон брезента (килограмм)'] = {
        '|=Рулон брезента (кубометр)':2 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон бязи (килограмм)'] = {
        '|=Рулон бязи (кубометр)':4 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон джутовой ткани (килограмм)'] = {
        '|=Рулон джутовой ткани (кубометр)':2 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон замши (килограмм)'] = {
        '|=Рулон замши (кубометр)':4 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон кирзовой ткани (килограмм)'] = {
        '|=Рулон кирзовой ткани (кубометр)':2 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон льняной ткани (килограмм)'] = {
        '|=Рулон льняной ткани (кубометр)':4 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон парусины (килограмм)'] = {
        '|=Рулон парусины (кубометр)':4 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон сатина (килограмм)'] = {
        '|=Рулон сатина (кубометр)':4 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон мешковины (килограмм)'] = {
        '|=Рулон мешковины (кубометр)':4 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон вафельной ткани (килограмм)'] = {
        '|=Рулон вафельной ткани (кубометр)':4 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон махровой ткани (килограмм)'] = {
        '|=Рулон махровой ткани (кубометр)':4 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон фланели (килограмм)'] = {
        '|=Рулон фланели (кубометр)':4 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Катушка джутовой нити (килограмм)'] = {
        # TODO: Катушка джутовой нити. Учти катушки.
        '|=Катушка джутовой нити (кубометр)':4 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Катушка льняной нити (килограмм)'] = {
        '|=Катушка льняной нити (кубометр)':4 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Катушка пеньковой бечевы (килограмм)'] = {
        '|=Катушка пеньковой бечевы (кубометр)':4 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Катушка пеньковой нити (килограмм)'] = {
        '|=Катушка пеньковой нити (кубометр)':4 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Катушка хлопчатой нити (килограмм)'] = {
        '|=Катушка хлопчатой нити (кубометр)':4 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон резины (килограмм)'] = {
        '|=Рулон резины (кубометр)':2 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Песок (тонн)'] = {
        '|=Песок (кубометр)':0.6,
        '|==Сырьё промышленное (тонн)':1,
        'Доставка строительного сырья (тонн)':1,
        }

metadict_detail['|=Щебень (тонн)'] = {
        '|=Щебень (кубометр)':0.55,
        '|==Сырьё промышленное (тонн)':1,
        'Доставка строительного сырья (тонн)':1,
        }

metadict_detail['|=Известняк (тонн)'] = {
        '|=Известняк (кубометр)':0.55,
        '|==Сырьё промышленное (тонн)':1,
        'Доставка строительного сырья (тонн)':1,
        }

metadict_detail['|=Гравий (тонн)'] = {
        '|=Гравий (кубометр)':1 / 1.6,
        '|==Сырьё промышленное (тонн)':1,
        'Доставка строительного сырья (тонн)':1,
        }

metadict_detail['|=Бутовый камень (тонн)'] = {
        '|=Бутовый камень (кубометр)':1 / 1.6,
        '|==Сырьё промышленное (тонн)':1,
        'Доставка строительного сырья (тонн)':1,
        }

metadict_detail['|=Смоляк (тонн)'] = {
        '|=Смоляк (кубометр)':2,
        '|==Сырьё промышленное (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка промышленного сырья (тонн)':1,
        }

metadict_detail['|=Литьё чугунное (килограмм)'] = {
        # TODO: Литьё чугунное. Уточнить грузовой объём (прежде всего труб)
        '|=Литьё чугунное (кубометр)':1 / 1600,
        '|==Сырьё промышленное (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Литьё стальное (килограмм)'] = {
        '|=Литьё стальное (кубометр)':1 / 1600,
        '|==Сырьё промышленное (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Прокат стальной (килограмм)'] = {
        '|=Прокат стальной (кубометр)':1 / 1600,
        '|==Сырьё промышленное (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Прокат железный (килограмм)'] = {
        '|=Прокат железный (кубометр)':1 / 1600,
        '|==Сырьё промышленное (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Литьё железное (килограмм)'] = {
        '|=Литьё железное (кубометр)':1 / 1600,
        '|==Сырьё промышленное (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }
