#----
# Изысканный рацион:

metadict_detail['Изысканный рацион (пони/год)'] = {
        # Объединение всех городских и сельских рационов.
        'Изысканный весенний рацион (пони/день)':90,
        'Изысканный летний рацион (пони/день)':90,
        'Изысканный осенний рацион (пони/день)':90,
        'Изысканный зимний рацион (пони/день)':90,
        }

#----
# Изысканный рацион (времена года):

metadict_detail['Изысканный весенний рацион (пони/день)'] = {
        # TODO: Это ресторанное питание и заказ готовой еды.
            # Следовательно, нужно учесть доставку.
        'Североморский весенний повседневный рацион (пони/день)':1 / 8,
        'Североморский весенний праздничный рацион (пони/день)':1 / 8,
        'Среднеземный весенний повседневный рацион (пони/день)':1 / 8,
        'Среднеземный весенний праздничный рацион (пони/день)':1 / 8,
        'Южноморский весенний повседневный рацион (пони/день)':1 / 8,
        'Южноморский весенний праздничный рацион (пони/день)':1 / 8,
        'Городской весенний повседневный рацион (пони/день)':1 / 8,
        'Городской весенний праздничный рацион (пони/день)':1 / 8,
        }

metadict_detail['Изысканный летний рацион (пони/день)'] = {
        'Североморский летний повседневный рацион (пони/день)':1 / 8,
        'Североморский летний праздничный рацион (пони/день)':1 / 8,
        'Среднеземный летний повседневный рацион (пони/день)':1 / 8,
        'Среднеземный летний праздничный рацион (пони/день)':1 / 8,
        'Южноморский летний повседневный рацион (пони/день)':1 / 8,
        'Южноморский летний праздничный рацион (пони/день)':1 / 8,
        'Городской летний повседневный рацион (пони/день)':1 / 8,
        'Городской летний праздничный рацион (пони/день)':1 / 8,
        }

metadict_detail['Изысканный осенний рацион (пони/день)'] = {
        'Североморский осенний повседневный рацион (пони/день)':1 / 8,
        'Североморский осенний праздничный рацион (пони/день)':1 / 8,
        'Среднеземный осенний повседневный рацион (пони/день)':1 / 8,
        'Среднеземный осенний праздничный рацион (пони/день)':1 / 8,
        'Южноморский осенний повседневный рацион (пони/день)':1 / 8,
        'Южноморский осенний праздничный рацион (пони/день)':1 / 8,
        'Городской осенний повседневный рацион (пони/день)':1 / 8,
        'Городской осенний праздничный рацион (пони/день)':1 / 8,
        }

metadict_detail['Изысканный зимний рацион (пони/день)'] = {
        'Североморский зимний повседневный рацион (пони/день)':1 / 8,
        'Североморский зимний праздничный рацион (пони/день)':1 / 8,
        'Среднеземный зимний повседневный рацион (пони/день)':1 / 8,
        'Среднеземный зимний праздничный рацион (пони/день)':1 / 8,
        'Южноморский зимний повседневный рацион (пони/день)':1 / 8,
        'Южноморский зимний праздничный рацион (пони/день)':1 / 8,
        'Городской зимний повседневный рацион (пони/день)':1 / 8,
        'Городской зимний праздничный рацион (пони/день)':1 / 8,
        }
