#----
# Фильтрация, брожение, ферментация -- процессы уменьшающие калорийность пищи.
# Процессы (грамм --> 100 грамм):

metadict_detail['_~Сахар-сырец тростниковый (рафинирование/грамм)'] = {
        '_~Сахар-сырец тростниковый (рафинирование/100 грамм)':1 / 100,
        }

metadict_detail['_~Сусло соевое (фильтрация/грамм)'] = {
        '_~Сусло соевое (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Сусло соевое (брожение/грамм)'] = {
        '_~Сусло соевое (брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Яблоко чищеное (фильтрация/грамм)'] = {
        '_~Яблоко чищеное (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Корень имбиря (фильтрация/грамм)'] = {
        '_~Корень имбиря (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Лимон отборный (фильтрация/грамм)'] = {
        '_~Лимон отборный (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Вишня отборная (фильтрация/грамм)'] = {
        '_~Вишня отборная (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Клюква отборная (фильтрация/грамм)'] = {
        '_~Клюква отборная (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Виноград отборный (фильтрация/грамм)'] = {
        '_~Виноград отборный (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Ревень отборный (фильтрация/грамм)'] = {
        '_~Ревень отборный (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Томаты отборные (фильтрация/грамм)'] = {
        '_~Томаты отборные (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Картофель чищеный (крахмализация/грамм)'] = {
        '_~Картофель чищеный (крахмализация/100 грамм)':1 / 100,
        }

metadict_detail['_~Орех карии чищенный (фильтрация/грамм)'] = {
        '_~Орех карии чищенный (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Сухари ржаные (осаждение/грамм)'] = {
        '_~Сухари ржаные (осаждение/100 грамм)':1 / 100,
        }

metadict_detail['_~Опара овсяная (фильтрация/грамм)'] = {
        '_~Опара овсяная (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Рис замоченный (фильтрация/грамм)'] = {
        '_~Рис замоченный (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Миндаль замоченный (фильтрация/грамм)'] = {
        '_~Миндаль замоченный (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Мука миндальная (фильтрация/грамм)'] = {
        '_~Мука миндальная (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Сахар-песок (брожение/грамм)'] = {
        '_~Сахар-песок (брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Солод ржаной (брожение/грамм)'] = {
        '_~Солод ржаной (брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Солод ржаной (фильтрация/грамм)'] = {
        '_~Солод ржаной (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Солод ржаной (осаждение/грамм)'] = {
        '_~Солод ржаной (осаждение/100 грамм)':1 / 100,
        }

metadict_detail['_~Солод пшеничный (брожение/грамм)'] = {
        '_~Солод пшеничный (брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Солод пшеничный (осаждение/грамм)'] = {
        '_~Солод пшеничный (осаждение/100 грамм)':1 / 100,
        }

metadict_detail['_~Мука гречневая (осаждение/грамм)'] = {
        '_~Мука гречневая (осаждение/100 грамм)':1 / 100,
        }

metadict_detail['_~Мука ржаная (брожение/грамм)'] = {
        '_~Мука ржаная (брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Мука ржаная (осаждение/грамм)'] = {
        '_~Мука ржаная (осаждение/100 грамм)':1 / 100,
        }

metadict_detail['_~Капуста (брожение/грамм)'] = {
        '_~Капуста (брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Кабачок (брожение/грамм)'] = {
        '_~Кабачок (брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Огурцы (брожение/грамм)'] = {
        '_~Огурцы (брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Боровики (брожение/грамм)'] = {
        '_~Боровики (брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Томаты (брожение/грамм)'] = {
        '_~Томаты (брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Свёкла (брожение/грамм)'] = {
        '_~Свёкла (брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Свёкла (фильтрация/грамм)'] = {
        '_~Свёкла (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Репа (брожение/грамм)'] = {
        '_~Репа (брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Яблоко отборное (брожение/грамм)'] = {
        '_~Яблоко отборное (брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Сидр яблочный (окисление/грамм)'] = {
        '_~Сидр яблочный (окисление/100 грамм)':1 / 100,
        }

metadict_detail['_~Сусло яблочное (спиртовое брожение/грамм)'] = {
        '_~Сусло яблочное (спиртовое брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Сусло яблочное (фильтрация/грамм)'] = {
        '_~Сусло яблочное (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Сусло виноградное (спиртовое брожение/грамм)'] = {
        '_~Сусло виноградное (спиртовое брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Сусло виноградное (фильтрация/грамм)'] = {
        '_~Сусло виноградное (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Мёд луговой (брожение/грамм)'] = {
        '_~Мёд луговой (брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Вино красное сухое (окисление/грамм)'] = {
        '_~Вино красное сухое (окисление/100 грамм)':1 / 100,
        }

metadict_detail['_~Сусло грушевое (брожение/грамм)'] = {
        '_~Сусло грушевое (брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Сусло грушевое (фильтрация/грамм)'] = {
        '_~Сусло грушевое (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['_~Груша (брожение/грамм)'] = {
        '_~Груша (брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Слива (брожение/грамм)'] = {
        '_~Слива (брожение/100 грамм)':1 / 100,
        }

metadict_detail['_~Морошка (брожение/грамм)'] = {
        '_~Морошка (брожение/100 грамм)':1 / 100,
        }

#----
# Процессы (100 грамм --> килограмм):

metadict_detail['_~Сахар-сырец тростниковый (рафинирование/100 грамм)'] = {
        '-Белки (грамм)':0.0 * -1,
        '-Жиры (грамм)':0.0 * -1,
        '-Углеводы (грамм)':100 * -0.1,
        }

metadict_detail['_~Сусло соевое (фильтрация/100 грамм)'] = {
        '-Белки (грамм)':9.1 * -0.6,
        '-Жиры (грамм)':3.7 * -0.6,
        '-Углеводы (грамм)':16.7 * -0.6,
        }

metadict_detail['_~Сусло соевое (брожение/100 грамм)'] = {
        '-Белки (грамм)':9.1 * 0.5,
        '-Жиры (грамм)':3.7 * -0.4,
        '-Углеводы (грамм)':16.7 * -0.2,
        }

metadict_detail['_~Яблоко чищеное (фильтрация/100 грамм)'] = {
        '-Белки (грамм)':0.3 * -0.6,
        '-Жиры (грамм)':0.0 * -0.6,
        '-Углеводы (грамм)':11.5 * -0.6,
        }

metadict_detail['_~Корень имбиря (фильтрация/100 грамм)'] = {
        '-Белки (грамм)':1.8 * -0.6,
        '-Жиры (грамм)':0.8 * -0.6,
        '-Углеводы (грамм)':15.8 * -0.6,
        }

metadict_detail['_~Лимон отборный (фильтрация/100 грамм)'] = {
        '-Белки (грамм)':0.9 * -0.5,
        '-Жиры (грамм)':0.1 * -0.5,
        '-Углеводы (грамм)':3.0 * -0.5,
        }

metadict_detail['_~Виноград отборный (фильтрация/100 грамм)'] = {
        '-Белки (грамм)':0.6 * -0.5,
        '-Жиры (грамм)':0.2 * -0.5,
        '-Углеводы (грамм)':16.8 * -0.5,
        }

metadict_detail['_~Вишня отборная (фильтрация/100 грамм)'] = {
        '-Белки (грамм)':0.8 * -0.5,
        '-Жиры (грамм)':0.5 * -0.5,
        '-Углеводы (грамм)':11.3 * -0.5,
        }

metadict_detail['_~Клюква отборная (фильтрация/100 грамм)'] = {
        '-Белки (грамм)':0.5 * -0.5,
        '-Жиры (грамм)':0.0 * -0.5,
        '-Углеводы (грамм)':6.8 * -0.5,
        }

metadict_detail['_~Ревень отборный (фильтрация/100 грамм)'] = {
        '-Белки (грамм)':0.7 * -0.5,
        '-Жиры (грамм)':0.1 * -0.5,
        '-Углеводы (грамм)':2.5 * -0.5,
        }

metadict_detail['_~Томаты отборные (фильтрация/100 грамм)'] = {
        '-Белки (грамм)':1.1 * -0.3,
        '-Жиры (грамм)':0.2 * -0.3,
        '-Углеводы (грамм)':3.7 * -0.3,
        }

metadict_detail['_~Картофель чищеный (крахмализация/100 грамм)'] = {
        '-Белки (грамм)':2.0 * -1,
        '-Жиры (грамм)':0.4 * -1,
        '-Углеводы (грамм)':16.1 * -0.76,
        }

metadict_detail['_~Орех карии чищенный (фильтрация/100 грамм)'] = {
        # Из напитка отфильтровывается 50% ореха, калорийность падает.
        '-Белки (грамм)':12.7 * -0.5,
        '-Жиры (грамм)':64.2 * -0.5,
        '-Углеводы (грамм)':18.3 * -0.5,
        }

metadict_detail['_~Сухари ржаные (осаждение/100 грамм)'] = {
        '-Белки (грамм)':9.7 * -0.5,
        '-Жиры (грамм)':1.0 * -0.5,
        '-Углеводы (грамм)':71.9 * -0.5,
        }

metadict_detail['_~Опара овсяная (фильтрация/100 грамм)'] = {
        '-Белки (грамм)':4.3 * -0.5,
        '-Жиры (грамм)':2.1 * -0.5,
        '-Углеводы (грамм)':20.1 * -0.5,
        }

metadict_detail['_~Рис замоченный (фильтрация/100 грамм)'] = {
        '-Белки (грамм)':3.4 * -0.5,
        '-Жиры (грамм)':0.4 * -0.5,
        '-Углеводы (грамм)':39.4 * -0.5,
        }

metadict_detail['_~Миндаль замоченный (фильтрация/100 грамм)'] = {
        '-Белки (грамм)':9.3 * -0.5,
        '-Жиры (грамм)':28.9 * -0.5,
        '-Углеводы (грамм)':8.1 * -0.5,
        }

metadict_detail['_~Мука миндальная (фильтрация/100 грамм)'] = {
        '-Белки (грамм)':18.6 * -0.5,
        '-Жиры (грамм)':57.7 * -0.5,
        '-Углеводы (грамм)':16.2 * -0.5,
        }

metadict_detail['_~Сахар-песок (брожение/100 грамм)'] = {
        # Глюкоза превращается в этиловый спир, выделяется углекислый газ:
        # https://alcodistillers.ru/distill3.html
        '-Углеводы (грамм)':99.4 * -1,
        '-Этанол (грамм)':99.4 * 1 * 0.511 * 0.9,
        }

metadict_detail['_~Солод пшеничный (брожение/100 грамм)'] = {
        # Исправить
            # Уточнить содержание сахара
        '-Углеводы (грамм)':64.9 * -0.50,
        '-Этанол (грамм)':64.9 * 0.50 * 0.511 * 0.9,
        }

metadict_detail['_~Солод пшеничный (осаждение/100 грамм)'] = {
        '-Белки (грамм)':19.2 * -0.5,
        '-Жиры (грамм)':1.2 * -0.5,
        '-Углеводы (грамм)':64.9 * -0.5,
        }

metadict_detail['_~Солод ржаной (брожение/100 грамм)'] = {
        # Исправить
            # Уточнить содержание сахара в солоде
        '-Углеводы (грамм)':61.8 * -0.50,
        '-Этанол (грамм)':61.8 * 0.50 * 0.511 * 0.9,
        }

metadict_detail['_~Солод ржаной (фильтрация/100 грамм)'] = {
        # Сливаем рассол
        '-Белки (грамм)':19.0 * -1,
        '-Жиры (грамм)':1.0 * -1,
        '-Углеводы (грамм)':61.8 * -0.75,
        }

metadict_detail['_~Солод ржаной (осаждение/100 грамм)'] = {
        # Удаляем квасной осадок
        '-Белки (грамм)':19.0 * -0.5,
        '-Жиры (грамм)':1.0 * -0.5,
        '-Углеводы (грамм)':61.8 * -0.5,
        }

metadict_detail['_~Мука гречневая (осаждение/100 грамм)'] = {
        '-Белки (грамм)':12.6 * -0.5,
        '-Жиры (грамм)':3.3 * -0.5,
        '-Углеводы (грамм)':62.1 * -0.5,
        }

metadict_detail['_~Мука ржаная (брожение/100 грамм)'] = {
        '-Углеводы (грамм)':73.0 * -0.33,
        '-Этанол (грамм)':73.0 * 0.15 * 0.9,
        }

metadict_detail['_~Мука ржаная (осаждение/100 грамм)'] = {
        '-Белки (грамм)':9.0 * -0.5,
        '-Жиры (грамм)':1.0 * -0.5,
        '-Углеводы (грамм)':73.0 * -0.5,
        }

metadict_detail['_~Капуста (брожение/100 грамм)'] = {
        # Длительное молочно-кислое брожение, потеря 50% питательных веществ.
        # https://znaytovar.ru/s/Kvashenaya-kapusta.html
        '-Белки (грамм)':1.8 * -0.5,
        '-Жиры (грамм)':0.1 * -0.5,
        '-Углеводы (грамм)':4.7 * -0.5,
        }

metadict_detail['_~Кабачок (брожение/100 грамм)'] = {
        '-Белки (грамм)':1.5 * -0.5,
        '-Жиры (грамм)':0.2 * -0.5,
        '-Углеводы (грамм)':3.0 * -0.5,
        }

metadict_detail['_~Огурцы (брожение/100 грамм)'] = {
        '-Белки (грамм)':0.8 * -0.5,
        '-Жиры (грамм)':0.1 * -0.5,
        '-Углеводы (грамм)':2.8 * -0.5,
        }

metadict_detail['_~Боровики (брожение/100 грамм)'] = {
        '-Белки (грамм)':3.7 * -0.5,
        '-Жиры (грамм)':1.7 * -0.5,
        '-Углеводы (грамм)':1.1 * -0.5,
        }

metadict_detail['_~Томаты (брожение/100 грамм)'] = {
        '-Белки (грамм)':1.1 * -0.5,
        '-Жиры (грамм)':0.2 * -0.5,
        '-Углеводы (грамм)':3.7 * -0.5,
        }

metadict_detail['_~Репа (брожение/100 грамм)'] = {
        '-Белки (грамм)':1.1 * -0.5,
        '-Жиры (грамм)':0.1 * -0.5,
        '-Углеводы (грамм)':6.2 * -0.5,
        }

metadict_detail['_~Свёкла (брожение/100 грамм)'] = {
        '-Белки (грамм)':1.8 * -0.5,
        '-Жиры (грамм)':0.0 * -0.5,
        '-Углеводы (грамм)':10.8 * -0.5,
        }

metadict_detail['_~Свёкла (фильтрация/100 грамм)'] = {
        '-Белки (грамм)':1.8 * -0.5,
        '-Жиры (грамм)':0.0 * -0.5,
        '-Углеводы (грамм)':10.8 * -0.5,
        }

metadict_detail['_~Яблоко отборное (брожение/100 грамм)'] = {
        # Молочно-кислое брожение
        '-Белки (грамм)':0.3 * -0.5,
        '-Жиры (грамм)':0.0 * -0.5,
        '-Углеводы (грамм)':11.5 * -0.5,
        }

metadict_detail['_~Мёд луговой (брожение/100 грамм)'] = {
        '-Углеводы (грамм)':81.6 * -0.9,
        '-Этанол (грамм)':81.6 * 0.9 * 0.511 * 0.9,
        }

metadict_detail['_~Сусло яблочное (спиртовое брожение/100 грамм)'] = {
        '-Углеводы (грамм)':11.5 * -0.5,
        '-Этанол (грамм)':11.5 * 0.5 * 0.511 * 0.8,
        }

metadict_detail['_~Сусло яблочное (фильтрация/100 грамм)'] = {
        '-Белки (грамм)':0.3 * -0.5,
        '-Жиры (грамм)':0.0 * -0.5,
        '-Углеводы (грамм)':11.5 * -0.5,
        }

metadict_detail['_~Сидр яблочный (окисление/100 грамм)'] = {
        # Уксуснокислое брожение
        '-Этанол (грамм)':11.5 * 0.511 * 0.8 * -1,
        '-Уксусная кислота (грамм)':11.5 * 0.511 * 0.8,
        }

metadict_detail['_~Сусло виноградное (спиртовое брожение/100 грамм)'] = {
        '-Углеводы (грамм)':16.8 * -0.5,
        '-Этанол (грамм)':16.8 * 0.5 * 0.511 * 0.8,
        }

metadict_detail['_~Сусло виноградное (фильтрация/100 грамм)'] = {
        '-Белки (грамм)':0.6 * -0.5,
        '-Жиры (грамм)':0.2 * -0.5,
        '-Углеводы (грамм)':16.8 * -0.5,
        }

metadict_detail['_~Вино красное сухое (окисление/100 грамм)'] = {
        '-Этанол (грамм)':16.8 * 0.511 * 0.8 * -1,
        '-Уксусная кислота (грамм)':16.8 * 0.511 * 0.8,
        }

metadict_detail['_~Груша (брожение/100 грамм)'] = {
        '-Белки (грамм)':0.4 * -0.5,
        '-Жиры (грамм)':0.3 * -0.5,
        '-Углеводы (грамм)':10.9 * -0.5,
        }

metadict_detail['_~Сусло грушевое (брожение/100 грамм)'] = {
        '-Углеводы (грамм)':10.9 * -0.5,
        '-Этанол (грамм)':10.9 * 0.5 * 0.511 * 0.8,
        }

metadict_detail['_~Сусло грушевое (фильтрация/100 грамм)'] = {
        '-Белки (грамм)':0.4 * -0.5,
        '-Жиры (грамм)':0.3 * -0.5,
        '-Углеводы (грамм)':10.9 * -0.5,
        }

metadict_detail['_~Слива (брожение/100 грамм)'] = {
        '-Белки (грамм)':0.8 * -0.5,
        '-Жиры (грамм)':0.3 * -0.5,
        '-Углеводы (грамм)':9.6 * -0.5,
        }

metadict_detail['_~Морошка (брожение/100 грамм)'] = {
        '-Белки (грамм)':0.8 * -0.5,
        '-Жиры (грамм)':0.0 * -0.5,
        '-Углеводы (грамм)':9.8 * -0.5,
        }
