#----
# Североморский рацион:
    # МР 2.3.1.2432-08 Нормы физиологических потребностей в энергии и пищевых веществах
        # http://rospotrebnadzor.ru/documents/details.php?ELEMENT_ID=4583
        # http://files.stroyinf.ru/Data2/1/4293756/4293756229.pdf
    # Климат на параллели Сталлионград-Мэйнхеттен подобен канадскому Онтарио
        # https://ru.wikipedia.org/wiki/Влажный_континентальный_климат
    # Typical Crop Availability - When to Pick in Ontario, Canada
        # http://www.pickyourown.org/CAONharvestcalendar.htm
    # Питание колхозников Свердловской области в 1946,1947 гг. (сезонность фруктов/овощей)
        # http://istmat.info/node/22066
    # Питание русских крестьян Верхнего Приобья (конец XIX — первая треть XX вв.)
        # http://zaimka.ru/mainicheva-russians/
    # Питание переселенцев из Белоруссии в Сибири (конец XIX — первая треть XX вв.)
        # http://zaimka.ru/mainicheva-belorussians/

metadict_detail['Североморский рацион (пони/год)'] = {
        'Североморский весенний рацион (пони/день)':90,
        'Североморский летний рацион (пони/день)':90,
        'Североморский осенний рацион (пони/день)':90,
        'Североморский зимний рацион (пони/день)':90,
        }

#----
# Североморский рацион (времена года):

metadict_detail['Североморский весенний рацион (пони/день)'] = {
        # В эквестрийской неделе -- 6 дней
        'Североморский весенний повседневный рацион (пони/день)':5 / 6,
        'Североморский весенний праздничный рацион (пони/день)':1 / 6,
        }

metadict_detail['Североморский летний рацион (пони/день)'] = {
        'Североморский летний повседневный рацион (пони/день)':5 / 6,
        'Североморский летний праздничный рацион (пони/день)':1 / 6,
        }

metadict_detail['Североморский зимний рацион (пони/день)'] = {
        'Североморский зимний повседневный рацион (пони/день)':5 / 6,
        'Североморский зимний праздничный рацион (пони/день)':1 / 6,
        }

metadict_detail['Североморский осенний рацион (пони/день)'] = {
        'Североморский осенний повседневный рацион (пони/день)':5 / 6,
        'Североморский осенний праздничный рацион (пони/день)':1 / 6,
        }

#----
# Североморский рацион (дни недели):

metadict_detail['Североморский весенний повседневный рацион (пони/день)'] = {
        'Североморский весенний повседневный завтрак':1,
        'Североморский весенний повседневный обед':1,
        'Североморский весенний повседневный ужин':1,
        'Североморское весеннее повседневное питьё v1':3 / 3,
        'Североморское весеннее повседневное питьё v2':3 / 3,
        'Североморское весеннее повседневное питьё v3':3 / 3,
        }

metadict_detail['Североморский весенний праздничный рацион (пони/день)'] = {
        'Североморский весенний праздничный завтрак':1,
        'Североморский весенний праздничный обед':1,
        'Североморский весенний праздничный ужин':1,
        'Североморское весеннее праздничное питьё v1':3 / 3,
        'Североморское весеннее праздничное питьё v2':3 / 3,
        'Североморское весеннее праздничное питьё v3':3 / 3,
        }

metadict_detail['Североморский зимний повседневный рацион (пони/день)'] = {
        'Североморский зимний повседневный завтрак':1,
        'Североморский зимний повседневный обед':1,
        'Североморский зимний повседневный ужин':1,
        'Североморское зимнее повседневное питьё v1':3 / 3,
        'Североморское зимнее повседневное питьё v2':3 / 3,
        'Североморское зимнее повседневное питьё v3':3 / 3,
        }

metadict_detail['Североморский зимний праздничный рацион (пони/день)'] = {
        'Североморский зимний праздничный завтрак':1,
        'Североморский зимний праздничный обед':1,
        'Североморский зимний праздничный ужин':1,
        'Североморское зимнее праздничное питьё v1':3 / 3,
        'Североморское зимнее праздничное питьё v2':3 / 3,
        'Североморское зимнее праздничное питьё v3':3 / 3,
        }

metadict_detail['Североморский летний повседневный рацион (пони/день)'] = {
        'Североморский летний повседневный завтрак':1,
        'Североморский летний повседневный обед':1,
        'Североморский летний повседневный ужин':1,
        'Североморское летнее повседневное питьё v1':3 / 3,
        'Североморское летнее повседневное питьё v2':3 / 3,
        'Североморское летнее повседневное питьё v3':3 / 3,
        }

metadict_detail['Североморский летний праздничный рацион (пони/день)'] = {
        'Североморский летний праздничный завтрак':1,
        'Североморский летний праздничный обед':1,
        'Североморский летний праздничный ужин':1,
        'Североморское летнее праздничное питьё v1':3 / 3,
        'Североморское летнее праздничное питьё v2':3 / 3,
        'Североморское летнее праздничное питьё v3':3 / 3,
        }

metadict_detail['Североморский осенний повседневный рацион (пони/день)'] = {
        'Североморский осенний повседневный завтрак':1,
        'Североморский осенний повседневный обед':1,
        'Североморский осенний повседневный ужин':1,
        'Североморское осеннее повседневное питьё v1':3 / 3,
        'Североморское осеннее повседневное питьё v2':3 / 3,
        'Североморское осеннее повседневное питьё v3':3 / 3,
        }

metadict_detail['Североморский осенний праздничный рацион (пони/день)'] = {
        'Североморский осенний праздничный завтрак':1,
        'Североморский осенний праздничный обед':1,
        'Североморский осенний праздничный ужин':1,
        'Североморское осеннее праздничное питьё v1':3 / 3,
        'Североморское осеннее праздничное питьё v2':3 / 3,
        'Североморское осеннее праздничное питьё v3':3 / 3,
        }

#----
# Североморский рацион (весна):
    # Март, апрель, май

metadict_detail['Североморский весенний повседневный завтрак'] = {
        'Хлеб ячменный домашний (грамм)':25 * 4,
        'Тюря с хреном (грамм)':250,
        'Каша фасолевая (грамм)':250,
        'Пюре картофельное (грамм)':125,
        }

metadict_detail['Североморский весенний повседневный обед'] = {
        'Хлеб ржаной домашний (грамм)':25 * 8,
        'Похлёбка чечевичная (грамм)':250,
        'Топинамбур жареный с чесноком (грамм)':250,
        'Салат свекольный со спаржей (грамм)':125,
        }

metadict_detail['Североморский весенний повседневный ужин'] = {
        'Блины ржаные (грамм)':25 * 4,
        'Каша овсяная с кленовым сиропом (грамм)':250,
        'Яблоко мочёное (грамм)':125,
        }

metadict_detail['Североморское весеннее повседневное питьё v1'] = {
        'Чай одуванчиковый с кленовым сиропом (грамм)':250 * 2,
        'Пирожки с картофелем и спаржей (грамм)':50 * 2,
        }

metadict_detail['Североморское весеннее повседневное питьё v2'] = {
        'Квас ржаной солодовый (грамм)':250 * 2,
        'Пирожки морковные (грамм)':50,
        }

metadict_detail['Североморское весеннее повседневное питьё v3'] = {
        'Напиток овсяной (грамм)':250,
        'Орешки кедровые (грамм)':10,
        }

metadict_detail['Североморский весенний праздничный завтрак'] = {
        'Блины пшенично-гречневые (грамм)':25 * 4,
        'Похлёбка репяная (грамм)':250,
        'Фасоль запечённая с луком (грамм)':250,
        'Винегрет овощной (грамм)':250,
        }

metadict_detail['Североморский весенний праздничный обед'] = {
        'Оладьи гречневые (грамм)':25 * 4,
        'Щи из квашеной капусты с грибами (грамм)':250,
        'Картофель тушёный со спаржей (грамм)':250,
        'Сморчки тушёные (грамм)':250,
        'Слива мочёная (грамм)':125,
        }

metadict_detail['Североморский весенний праздничный ужин'] = {
        'Хлеб пшеничный домашний (грамм)':25 * 4,
        'Каша горохово-гречневая (грамм)':250,
        'Одуванчики обжаренные (грамм)':125,
        }

metadict_detail['Североморское весеннее праздничное питьё v1'] = {
        'Чай одуванчиковый (грамм)':250 * 2,
        'Оладьи овсяные с кленовым сиропом (грамм)':50 * 2,
        }

metadict_detail['Североморское весеннее праздничное питьё v2'] = {
        'Чай из листьев смородины (грамм)':250 * 2,
        'Оладьи овсяные с одуванчиковым вареньем (грамм)':50 * 2,
        }

metadict_detail['Североморское весеннее праздничное питьё v3'] = {
        'Медовуха вишнёвая (грамм)':250,
        'Пастила сливовая (грамм)':10 * 2,
        }

#----
# Североморский рацион (лето):
    # Июнь, июль, август

metadict_detail['Североморский летний повседневный завтрак'] = {
        'Хлеб ячменный домашний (грамм)':25 * 4,
        'Окрошка с варёными грибами (грамм)':250,
        'Каша чечевичная (грамм)':250,
        'Брокколи тушёные (грамм)':125,
        }

metadict_detail['Североморский летний повседневный обед'] = {
        'Хлеб ржаной домашний (грамм)':25 * 8,
        'Похлёбка гороховая (грамм)':250,
        'Картофель печёный (грамм)':250,
        'Салат свекольный с ягодами (грамм)':125,
        }

metadict_detail['Североморский летний повседневный ужин'] = {
        'Оладьи кабачковые (грамм)':25 * 4,
        'Каша ячнево-гороховая (грамм)':250,
        'Североморские летние фрукты (грамм)':250,
        }

metadict_detail['Североморское летнее повседневное питьё v1'] = {
        'Чай травяной (грамм)':250 * 2,
        'Пирожки с ревенем (грамм)':50 * 2,
        }

metadict_detail['Североморское летнее повседневное питьё v2'] = {
        'Квас ржаной солодовый (грамм)':250 * 2,
        'Пирожки черничные (грамм)':50,
        }

metadict_detail['Североморское летнее повседневное питьё v3'] = {
        'Напиток овсяной (грамм)':250,
        'Орешки кедровые (грамм)':10,
        }

metadict_detail['Североморский летний праздничный завтрак'] = {
        'Блины пшенично-гречневые (грамм)':25 * 4,
        'Ботвинья-свекольник (грамм)':250,
        'Лечо со сладким перцем (грамм)':250,
        'Салат зелёный с томатами (грамм)':250,
        }

metadict_detail['Североморский летний праздничный обед'] = {
        'Пирожки с боровиками (грамм)':50 * 4,
        'Щи зелёные с гречкой (грамм)':250,
        'Картофель тушёный с яблоками (грамм)':250,
        'Перец фаршированный овощами (грамм)':250,
        'Смородина отборная (грамм)':125,
        }

metadict_detail['Североморский летний праздничный ужин'] = {
        'Хлеб пшеничный домашний (грамм)':25 * 4,
        'Каша гречневая с грибами (грамм)':250,
        'Брокколи обжаренные (грамм)':250,
        }

metadict_detail['Североморское летнее праздничное питьё v1'] = {
        'Чай травяной с кленовым сиропом (грамм)':250 * 2,
        'Оладьи овсяные со смородиновым вареньем (грамм)':50 * 2,
        }

metadict_detail['Североморское летнее праздничное питьё v2'] = {
        'Кисель из ревеня (грамм)':250,
        'Пирожки земляничные (грамм)':50,
        }

metadict_detail['Североморское летнее праздничное питьё v3'] = {
        'Чай одуванчиковый (грамм)':250 * 2,
        'Суп хлебный с земляникой (грамм)':125,
        }


#----
# Североморский рацион (осень):
    # Сентябрь, октябрь, ноябрь

metadict_detail['Североморский осенний повседневный завтрак'] = {
        'Хлеб ячменный домашний (грамм)':25 * 4,
        'Тюря томатная (грамм)':250,
        'Топинамбур тушёный с фасолью (грамм)':250,
        'Капуста тушёная (грамм)':125,
        }

metadict_detail['Североморский осенний повседневный обед'] = {
        'Хлеб ржаной домашний (грамм)':25 * 8,
        'Борщ с фасолью и томатами (грамм)':250,
        'Тыква фаршированная лечо и чечевицей (грамм)':250,
        'Салат брюквенный с кедровыми орешками (грамм)':125,
        }

metadict_detail['Североморский осенний повседневный ужин'] = {
        'Оладьи картофельные (грамм)':25 * 4,
        'Каша овсяная с мёдом (грамм)':250,
        'Североморские осенние фрукты (грамм)':250,
        }

metadict_detail['Североморское осеннее повседневное питьё v1'] = {
        'Чай травяной с мёдом (грамм)':250 * 2,
        'Пирожки с капустой (грамм)':50 * 2,
        }

metadict_detail['Североморское осеннее повседневное питьё v2'] = {
        'Чай из листьев смородины (грамм)':250,
        'Напиток из орехов карии с мёдом (грамм)':250,
        'Пирожки яблочные (грамм)':50,
        }

metadict_detail['Североморское осеннее повседневное питьё v3'] = {
        'Сок яблочный (грамм)':250,
        'Пирожки с грушей (грамм)':50 * 2,
        }

metadict_detail['Североморский осенний праздничный завтрак'] = {
        'Оладьи овсяные с яблочным сиропом (грамм)':50 * 2,
        'Похлёбка картофельная (грамм)':250,
        'Артишоки тушёные с сельдереем (грамм)':250,
        'Салат томатный со сладким перцем (грамм)':250,
        }

metadict_detail['Североморский осенний праздничный обед'] = {
        'Оладьи гречневые (грамм)':25 * 4,
        'Окрошка с солёными грибами (грамм)':250,
        'Суфле картофельно-тыквенное (грамм)':250,
        'Голубцы фаршированные овощами (грамм)':250,
        'Морошка отборная (грамм)':125,
        }

metadict_detail['Североморский осенний праздничный ужин'] = {
        'Хлеб пшеничный домашний (грамм)':25 * 4,
        'Каша горохово-гречневая (грамм)':250,
        'Яблоко печёное с мёдом (грамм)':250,
        }

metadict_detail['Североморское осеннее праздничное питьё v1'] = {
        'Чай из листьев смородины (грамм)':250 * 2,
        'Оладьи овсяные с рябиновым вареньем (грамм)':50 * 2,
        }

metadict_detail['Североморское осеннее праздничное питьё v2'] = {
        # Исправить
            # Коврижка вместо пряников медовых
        'Компот черничный (грамм)':250,
        'Пряники медовые (грамм)':25,
        }

metadict_detail['Североморское осеннее праздничное питьё v3'] = {
        'Квас ржаной имбирно-яблочный (грамм)':250 * 2,
        'Пастила сливовая (грамм)':10 * 2,
        }

#----
# Североморский рацион (зима):
    # Декабрь, январь, февраль

metadict_detail['Североморский зимний повседневный завтрак'] = {
        'Хлеб ячменный домашний (грамм)':25 * 4,
        'Тюря с редькой (грамм)':250,
        'Каша гороховая (грамм)':250,
        'Пюре брюквенно-морковное (грамм)':125,
        }

metadict_detail['Североморский зимний повседневный обед'] = {
        'Хлеб ржаной домашний (грамм)':25 * 8,
        'Щи из квашеной капусты (грамм)':250 * 2,
        'Репа фаршированная горохом (грамм)':250,
        'Свёкла печёная с сухофруктами (грамм)':125,
        }

metadict_detail['Североморский зимний повседневный ужин'] = {
        # Исправить
            # А как же морошка, груши, томаты, кабачки?
            # Сделай "североморские соления"
        'Оладьи картофельные (грамм)':25 * 4,
        'Каша ячневая (грамм)':250,
        'Груша мочёная (грамм)':125,
        }

metadict_detail['Североморское зимнее повседневное питьё v1'] = {
        'Чай травяной с мёдом (грамм)':250 * 2,
        'Пирожки с картофелем (грамм)':50 * 2,
        }

metadict_detail['Североморское зимнее повседневное питьё v2'] = {
        'Чай из листьев смородины (грамм)':250,
        'Напиток из орехов карии с мёдом (грамм)':250,
        'Пастила яблочная (грамм)':10 * 2,
        }

metadict_detail['Североморское зимнее повседневное питьё v3'] = {
        'Чай травяной (грамм)':250 * 2,
        'Пирожки тыквенные (грамм)':50 * 2,
        }

metadict_detail['Североморский зимний праздничный завтрак'] = {
        'Оладьи овсяные с мёдом (грамм)':50 * 2,
        'Похлёбка луковая (грамм)':250,
        'Картофель тушёный с грибами (грамм)':250,
        'Винегрет фруктово-овощной (грамм)':250,
        }

metadict_detail['Североморский зимний праздничный обед'] = {
        'Пирожки гороховые (грамм)':50 * 2,
        'Щи из квашеной репы (грамм)':250,
        'Суфле картофельно-морковное (грамм)':250,
        'Голубцы с гречкой и луком (грамм)':250,
        'Слива мочёная (грамм)':125,
        }

metadict_detail['Североморский зимний праздничный ужин'] = {
        'Хлеб пшеничный домашний (грамм)':25 * 4,
        'Каша гречневая с грибами (грамм)':250,
        'Морковь в медовой глазури (грамм)':125,
        }

metadict_detail['Североморское зимнее праздничное питьё v1'] = {
        'Чай травяной с мёдом (грамм)':250 * 2,
        'Пудинг смородиновый (грамм)':50 * 2,
        }

metadict_detail['Североморское зимнее праздничное питьё v2'] = {
        'Чай из листьев смородины (грамм)':250,
        'Мусс из орехов карии с мёдом (грамм)':250,
        }

metadict_detail['Североморское зимнее праздничное питьё v3'] = {
        'Чай из листьев смородины (грамм)':250 * 2,
        'Пряники медовые (грамм)':25 * 2,
        }
