#----
# Заметки:
# Добыча угля (Британия, 1913 год, 42 млн):
    # 292 Мт угля (первичная энергия 167 ГДж/человека-год)
    # 1.2 млн рабочих в угольной сфере (7% трудовой силы, 243 тонны/рабочего-год)
# Добыча угля (Китай, 1980-2024) -- 4 млрд тонн/год (50% мировой добычи)
    # 1980 -- 288 метров
    # 1995 -- 428 метров
    # 2000 -- 500 метров
    # 2010 -- 700 метров
    # 2020 -- 1200 метров средние шахты
# Добыча угля (Донбасс, 1913-1968) -- 8 млрд тонн добыто (90-141 млрд тонн запас)
    # 1913 -- 110 метров
    # 1956 -- 292 метров
    # 1968 -- 437 метров средние шахты
    # Уголь (1967 год) -- 2.32 тонн/нормо-час (0.43 нормо-часа/тонна)
    # Карьерные эксковаторы (1999 год) -- 8м³ вскрышной горной массы на 1м³ угля.
# Ouput of Iron Ore Mines (1 longton = 1.016 тонны)
    # Год  | карьер                  | шахта
    # ---- | ----------------------- | ----------------------
    # 1915 | 1.121 тонн/нормо-час    | 0.389 тонн/нормо-час
    # 1916 | 1.104                   | 0.369
    # 1917 | 0.912                   | 0.347
    # 1918 | 0.832                   | 0.321
    # 1919 | 1.062                   | 0.313
    # 1920 | 0.966                   | 0.351
    # 1921 | 0.762                   | 0.364
    # 1922 | 1.087                   | 0.395
    # 1923 | 1.171                   | 0.408
    # 1924 | 0.989                   | 0.438
    # 1925 | 1.393                   | 0.493
    # 1926 | 1.784                   | 0.510
    # 1927 | 1.591                   | 0.493
    # 1928 | 1.815                   | 0.548
    # 1929 | 1.837                   | 0.589
    # 1930 | 1.496                   | 0.563
    # 1931 | 1.212                   | 0.583
    # 1932 | 0.913                   | 0.503
    # 1933 | 1.993                   | 0.508
    # 1934 | 1.791                   | 0.598
    # 1935 | 2.470                   | 0.663
    # 1936 | 2.655                   | 0.701
    # 1937 | 3.005                   | 0.692
    # 1938 | 1.795                   | 0.642
    # http://www.stardestroyer.net/Armour/ShepStuff/Website/EconomicStats.htm
    # https://web.archive.org/web/20200226005924/http://astr23.narod.ru/so1.htm
# Железо (Урал, Решетский рудник, 1913 год)
    # Просеянная железная руда (45% железа) -- 1.25-1.56 рубля/кубометр
    # Добыча железной руды кирками -- 0.8 тонны/человеко-день (0.1 тонны/нормо-час)
# Литий (Шевченковское месторождение, Украина, 1982 год)
    # Размеры месторождения 1100×220 метров, перекрывающие породы 70-130 м (шахтный способ), глубина 500 метров
    # 97 млн кубометров руды, 13.8 млн тонн лития (0.142 тонны/кубометр)
# Золото (Берёзовские промыслы, 1906 год)
    # - подённые работы, рассыпное золото -- 0.5-9.95 рублей/день (среднее 1.3 рубля/день)
    # - сдача рассыпного и рудного золота -- 640-680 рублей/килограмм (1.47-1.56 грамм/рубль)
    # Добыча золота -- 508 дней (4000 нормо-часов/килограмм, 4 нормо-часа/грамм)
    # 1 кг золота = 1292 золотых рубля (1 золотой рубль = 3.15 нормо-часа)
    # https://zolotodb.ru/article/11637/
# Рудник Тетюхе, Сихоте-Алинь, свинцово-цинковые руды, 1914 год
    # Ресурсы (~8 млн кубометров руды) -- 131 000 тонн свинца, 250 000 тонн меди, 268 тонн серебра
        # Экспорт:
        # - Цинковые руды, галмея (обжиг, 55% цинка) -- 44.3 рубля/тонна
        # - Серебро-свинцовые руды (концентрат, 71% свинца, 4.5% цинк, 1.1 кг серебра) -- 1068 рублей/тонна
        # Себестоимость:
        # - Оплата труда к добытой руде -- 11 рублей/тонна
        # - Себестоимость руды -- 22.18 рублей (64% транспортировка)
        # 42 км узкоколейная железная дорога до бухты, конные дрезины
    # Посёлок (1912 год) 120 дворов, 1072 жителей, 641 временных работника
        # Владения АГОТ с рудниками -- 145 000 гектаров
        # Акционерное общество Тетюхе (АГОТ, 1909 год) -- 1 млн рублей (4 тысячи акций)
        # 37 домов (84 квартиры, 103 комнаты) -- 52 кубометра/комната, 15 кв.метров/комната
        # 43 казармы (по 15-30 рабочих) -- 423 кубометра/казарма, 61 кв.метр/казарма
        # Рудообогатительная фабрика -- 80 тонн сырой руды за 10-часовую смену (8 тонн/час)
        # Три паровых котла на 237 м² нагрева; паровая машина с 250 л холодильником; динамо-машина на 37 кВт
        # Зарплаты шахтёров (38% оборота) -- 95 рублей/год-рабочего (считая сезонных)
        # Зарплаты шахтёров (12 часов смена) -- 1.26-2.86 руб/день, 21-31 рублей/месяц
        # 75% рабочих -- китайцы
    # Добыча (1914 год) -- 4 рудника 32 штольни
        # - Пройдено 465 000 кубометров/год
        # - цинковых руд (галмея) -- 20 300 тонн (0.9 млн рублей)
        # - серебро-свинцовых руд -- 13 800 тонн (14.7 млн рублей, 0.84 руб серебра)
        # Руда сортировалась вручную. 33% худшей сразу в отвалы.
        # Сортированная руда -- 17.9% цинка, 12.78% свинца, 0.025% серебра
        # После обжига руда теряла 30% пустого веса (вода и углекислота)
        # http://www.bryners.ru/content.php?material=38
        # https://ru.wikisource.org/wiki/ЭСБЕ/Серебро,_в_металлургии
        # https://ru.wikisource.org/wiki/ЭСБЕ/Серебро,_в_экономическом_отношении

#----
# Добыча открытым способом (мелкие карьеры)
    # ЭКСКАВАЦИЯ И ТРАНСПОРТИРОВАНИЕ ГОРНОЙ МАССЫ АВТОСАМОСВАЛАМИ
        # http://www.libussr.ru/doc_ussr/usr_14571.htm
    # ОБ УТВЕРЖДЕНИИ ЕДИНЫХ НОРМ ВЫРАБОТКИ И ВРЕМЕНИ НА ПРОИЗВОДСТВО ЩЕБНЯ
        # http://www.libussr.ru/doc_ussr/usr_15964.htm
    # Доклад ГОЭЛРО, 1920 год
        # Гидравлический способ добычи торфа (размывание, перекачка, сушка), 1.6 тонн/трудодень, 164 т/год.

metadict_detail['_Добыча торфа с прессованием (кубометр)'] = {
        # Артель (2 резчика, 2 с подводами, 2 кладчика) -- 12 000 плиток/день (до 200 метров отвоза)
            # Производительность -- 9.2 кубометров/день-рабочего (4 кубометра сухого, 848 кг/день)
            # Трудозатраты -- 0.012-0.014 нормо-часа/кг (при 10-12 часах работы в день)
            # https://ru.wikisource.org/wiki/ЭСБЕ/Угли_бурые_и_их_переработка
        # За лето снимают слой 0.133 метра (один ряд плиток) -- 1330 кубов сырого торфа
            # 1330 кубометров сырого торфа = 580 кубометров сухого (124 тонны, 4% запаса)
            # 580 кубометров сухого торфа = 265 кубометров прессованного
            # https://ru.wikisource.org/wiki/ЭСБЕ/Торфяная_культура
            # https://ru.wikisource.org/wiki/ЭСБЕ/Болота
        'Участок торфяника под добычу (гектар)':1 / 265,
        '_-Резка торфа упряжными скреперами (кубометр)':1 / ((265 / 580) * (580 / 1330)),
        '_-Сушка торфа на подготовленном поле (кубометр)':1 / ((265 / 580) * (580 / 1330)),
        '_-Прессование торфа на мобильном прессе (кубометр)':1 / (265 / 580),
        '_Артель добычи торфа (годовой оборот)':1 / (265 * 10),
        }

metadict_model['_Добыча глины (кубометр)'] = {
        # Местечковые карьеры. Есть почти в каждом кантоне.
        # Мощность пласта -- 1-3 метра, глубина -- 2-4 метра
        '_-Котлован (кубометр)':2 / 2,
        '_-Разработка грунта упряжными скреперами, с помощью Mold_Earth (кубометр)':1,
        '_Карьер, глина (годовой оборот)':1 / 5000,
        }

metadict_model['_Добыча песка (кубометр)'] = {
        '_-Котлован (кубометр)':1,
        '_-Разработка грунта упряжными скреперами, с помощью Mold_Earth (кубометр)':1,
        '_Карьер, песок (годовой оборот)':1 / 5000,
        }

metadict_model['_Добыча гравия (кубометр)'] = {
        # Это обкатанные водой камешки, добывают на берегах рек.
        '_-Котлован (кубометр)':1,
        '_-Разработка щебня упряжными скреперами, с помощью Mold_Earth (кубометр)':1,
        '_Карьер, гравий (годовой оборот)':1 / 5000,
        }

#----
# Фабрики (солеварение)
    # ПОДЗЕМНОЙ ДОБЫЧЕЙ СОЛИ
    # http://www.libussr.ru/doc_ussr/usr_13671.htm
    # ПЕРЕРАБОТКИ ПОВАРЕННОЙ СОЛИ
    # http://www.libussr.ru/doc_ussr/usr_13672.htm

metadict_detail['_Добыча соли, карьер (килограмм)'] = {
        # Баскучанские озёра, 1888 год, 100 км от Волги
            # Соледобыча: 304 857 тонн (30% по России), 5527 рабочих (52-56 тонн/год-рабочего)
            # Соледобыча: 10k мешков по 3 пуда 30 фунтов, 6 рабочих за год (102 тонны/год-рабочего)
            # Видимо, они добывали соль без очистки. Полный техпроцесс таков:
            # 1) Раздробить соляной пласт
            # 2) Вычерпать/всосать солепульпу
            # 3) Обезвожить и перемолоть на мельнице
            # 4) Промыть рассолом для устранения примесей
            # https://rus-turk.livejournal.com/734777.html
            # https://ru.wikisource.org/wiki/ЭСБЕ/Астрахань,_уезд_и_губерния
        # Плотность каменной соли -- 2100-2200 кг/кубометр
        # amber -sm добыча соли -n '(175055775/4)' -E @
        '_-Котлован (кубометр)':(1 / 0.7) / 1000,
        '_-Подрывные работы (кубометр)':(1 / 0.7) / 1000,
        '_-Разработка руды упряжными скреперами, с помощью Mold_Earth (кубометр)':(1 / 0.7) / 1000,
        '_-Дробление руды в дробилке (кубометр)':(1 / 0.7) / 1000,
        '_-Промывание руды с помощью Shape_Water (кубометр)':(1 / 0.7) / 1000,
        '_-Помол руды на шаровой мельнице (тонн)':(1 / 0.9) / 1000,
        '_Карьер, соль (годовой оборот)':1 / 50000000,
        }

metadict_detail['_Добыча соли, выпаривание (килограмм)'] = {
        # TODO: Не используется. Солеварение не выгодно, 100 ГДж/тонна.
        # Солеварение:
            # Возможно только с уймой леса/торфа.
            # https://ru.m.wikipedia.org/wiki/Градирня#История
            # https://ru.wikisource.org/wiki/ЭСБЕ/Соль_поваренная
            # http://historic.ru/books/item/f00/s00/z0000171/st011.shtml
        # Соликамск 1742 года (sic!), "Путешествие в Сибирь" Гмелина:
            # Сковорода 7.9x7.7x0.36 -- 61 кв.метр, 21 кубометр (46 000 МДж при 100% КПД)
            # 21 кубометр рассола = 28 мешков соли (4 пуда/мешок, 65 кг/мешок, 1800 кг всего)
            # 1800 кг соли за 67 кубометра дров (37 тонн, 15 МДж/кг, 555 000 МДж всего, 8% КПД)
            # 1 кг соли за 40 кг дров (Sieferle 2001)
            # Металлические листы менять раз в неделю-другую из-за прогорания. 
            # https://uraloved.ru/starosti/gmelin-puteshestvie-v-sibir
        # Производство: 1.8 тонны/сутки, 360 тонн/год (снабжение округа)
        # 12 литров рассола на килограмм соли. Выпаривают 24 часа.
        'Солевой раствор 9% природный (литр)':12,
        '_-Выпаривание воды из рассола (килограмм)':12,
        '_Солеварня (годовой оборот)':1 / 360000,
        }

#----
# Добыча открытым способом (крупные карьеры)

metadict_detail['_Добыча железной руды (тонн)'] = {
        # Руды на производство чугуна:
            # - Красный железняк. Содержание оксида железа Fe2O3 от 60% до 70%
            # - Магнитный железняк. Содержание оксида железа Fe3O4 от 55% до 60%.
            # Более 70% железной руды в России добывается открытым способом.
            # В открытых карьерах железную руду добывают взрывным способом,
            # https://ru.wikisource.org/wiki/ЭСБЕ/Руды_и_их_обработка
        # Обогащение.
            # Богатые руды с более 50% железа не требуют обогащения.
            # Измельчают, на грохоте руду разделяют на крупную и мелкую фракции
            # Электромагнитное обогащение руды (60% --> 85%). Магнитная сепарация.
        '+Щебень из руды после обогащения (доступно/килограмм)':0.4 * 1000,
        '_-Котлован (кубометр)':1 / 0.5,
        '_-Подрывные работы (кубометр)':1 / 0.5,
        '_-Разработка руды упряжными скреперами, с помощью Mold_Earth (кубометр)':1 / 0.5,
        '_-Дробление руды в дробилке (тонн)':1 / 0.5,
        '_-Электромагнитное обогащение железняка (тонн)':1 / 0.7,
        '_Карьер, магнитный железняк (годовой оборот)':1 / 50000,
        }

metadict_detail['_Добыча щебня (кубометр)'] = {
        # Месторождение бутового камня взрывают. Затем дробят на дробилках "грохотах" -- 30% потерь.
        # Каменоломни Европейской России (1895 год?) -- 3.2 млн.кубов, 50 000 кубометров/карьер.
        '_-Котлован (кубометр)':1 / 0.7,
        '_-Подрывные работы (кубометр)':1 / 0.7,
        '_-Разработка щебня упряжными скреперами, с помощью Mold_Earth (кубометр)':1 / 0.7,
        '_-Дробление щебня в дробилке (кубометр)':1 / 0.7,
        '_Карьер, щебень (годовой оборот)':1 / 50000,
        }

metadict_detail['_Добыча известняка (кубометр)'] = {
        # Тот же щебень.
        '_-Котлован (кубометр)':1 / 0.7,
        '_-Подрывные работы (кубометр)':1 / 0.7,
        '_-Разработка щебня упряжными скреперами, с помощью Mold_Earth (кубометр)':1 / 0.7,
        '_-Дробление известняка в дробилке (кубометр)':1 / 0.7,
        '_Карьер, известняк (годовой оборот)':1 / 50000,
        }

metadict_detail['_Добыча бутового камня (кубометр)'] = {
        # Это камни ~50 кг весом. Подрыв неэффективен, булыжники раскалывают расширением льда.
        '_-Котлован (кубометр)':1 / 0.9,
        '_-Ударно-вращательное бурение скважин (кубометр)':1 / 0.9,
        '_-Разработка бутового камня гидродинамическая, с помощью Shape_Water (кубометр)':1 / 0.9,
        '_Карьер, бутовый камень (годовой оборот)':1 / 50000,
        }

metadict_detail['_Добыча асбестовой руды (кубометр)'] = {
        # В карьерах, открытым способом. Не сложнее добычи щебня.
        '_-Котлован (кубометр)':1 / 0.9,
        '_-Подрывные работы (кубометр)':1 / 0.9,
        '_-Разработка руды упряжными скреперами, с помощью Mold_Earth (кубометр)':1 / 0.9,
        '_Карьер, асбестовая руда (годовой оборот)':1 / 50000,
        }

#----
# Производства (строительные материалы)

metadict_detail['_Производство глины мятой (кубометр)'] = {
        # Плотность обычной глины -- 1.9 тонны/кубометр; а мятой -- 2.6 тонны/кубометр
            # https://ru.wikisource.org/wiki/ЭСБЕ/Глина,_в_технике
            # https://ru.wikisource.org/wiki/ЭСБЕ/Глиномятка
        '_-Замачивание глины (кубометр)':1 / (1.9 / 2.6),
        '_-Уплотнение глины (кубометр)':1 / (1.9 / 2.6),
        'Глина необработанная (кубометр)':1 / (1.9 / 2.6),
        '_Производство глины мятой (годовой оборот)':1 / 5000,
        }

metadict_detail['_Производство извести негашёной (тонн)'] = {
        # 1) Раздробить.
        # 2) Обжечь.
        # 3) Размолоть.
        # Плотность известняка -- 1.6 тонны/кубометр
        'Известняк (килограмм)':1000 / 0.9,
        '_-Дробление известняка в дробилке (кубометр)':(1 / 0.9) / 1.6,
        '_-Обжиг известняка в шахтной печи (тонн)':1 / 0.9,
        '_-Помол известняка на шаровой мельнице (тонн)':1 / 0.9,
        '_-Процеживание извести на проволочном сите (тонн)':1 / 0.9,
        '_Производство извести негашёной (годовой оборот)':1 / 5000,
        }

metadict_detail['_Производство мелового порошка (тонн)'] = {
        # Мел, это известняк.
        # 1) Раздробить с водой (чтобы вымыть примеси)
        # 2) Высушить
        # 3) Размолоть.
        # Насыпная плотность мелового порошка -- 1100 кг/кубометр
        # Плотность известняка -- 1.6 тонны/кубометр
        'Известняк (килограмм)':1000 / 0.9,
        '_-Дробление известняка в дробилке (кубометр)':(1 / 0.9) / 1.6,
        '_-Помол известняка на шаровой мельнице (тонн)':1 / 0.9,
        '_Производство мелового порошка (годовой оборот)':1 / 5000,
        }

metadict_detail['_Производство асбеста (тонн)'] = {
        # Сортировочная фабрика
            # 1) Сушка руды во вращающихся печах
            # 2) Дробление руды на грохоте (предварительное)
            # 3) Сортировка руды на вращающихся барабанах
            # 4) Дробление на шаровой мельнице (низкие сорта в пыль)
            # 5) Провеивание пыли вентиляторами (отделяем пустую породу)
            # - Вентиляторное отделение --> упаковочное отделение (не более 3% примесей)
            # - Пустая порода --> отвал
            # https://istmat.org/node/59230
        # Выход асбеста (1918-1929 годы, Канада) -- 53-57 кг/тонну руды
        # Содержание волокон асбеста в руде 5-9%, влажность ~5%
            # Влажность руды, это проблема грунтовых вод Баженовского месторождения.
            # https://ru.m.wikipedia.org/wiki/Баженовское_месторождение
        # Плотность асбестовой руды 2.5 тонны/кубометр
        'Асбестовая руда (килограмм)':1000 / 0.05,
        '_-Сушка асбестовой руды в шахтной печи, 5% влажность (кубометр)':1 / 0.05 / 2.5,
        '_-Дробление руды в дробилке (кубометр)':1 / (0.05 / 0.95) / 2.5,
        # Далее в тоннах руды (0.05 асбеста)
        '_-Сортировка руды на сетчатом барабане (тонн)':1 / (0.05 / 0.95),
        '_-Помол руды на шаровой мельнице (тонн)':1 / (0.05 / 0.8),
        '_-Провеивание руды на сетчатом барабане с вентилятором (тонн)':1 / (0.05 / 0.8),
        # Высшие сорта асбеста отделяют сортировкой (мельница их испортит):
        '_Обогатительный комбинат, асбест (годовой оборот)':1 / 20000,
        '+Асбест-сырец высшего сорта (доступно/килограмм)':50,
        }

metadict_detail['_Производство цемента (тонн)'] = {
        # TODO: Провеивание цемента. Гашение извести -- 20 дней
        # Технологическая карта:
            # 1) Гашёную известь и сухую глину в мелкий порошок.
            # 2) Порошок спрессовать в куски.
            # 3) Куски смеси обжечь.
            # 4) Раздробить в мелкий порошок.
            # https://istmat.org/node/27439
            # https://ru.wikisource.org/wiki/ЭСБЕ/Цементы
        # Современный способ:
            # Сырьё:
            # - Кальций и оксиды -- известняк
            # - Кремний, алюминий и железо -- глина, сланцы или отходы
            # 1. Измельчить 1.8 тонны сырья (25-35 кВт*ч/т; 90-126 МДж/тонна)
            # 2. Нагреть до 1450°C (2.9-4 ГДж/тонна)
            # 3. Измельчить снова (32-37 кВт*ч/т; 115-133 МДж/тонна)
            # 4. Добавить золу и шлак из доменных печей (снижают расходы)
            # Цилиндрические вращающиеся печи -- 120-230 м длина 6-8 м диаметр 1-3 оборота/минута
            # Выход:
            # - Белит (Ca2SiO4) -- 15% клинкера
            # - Алит (Ca3O∙SiO4) -- 65% клинкера
            # "Создание современного мира. Материалы и дематериализация." Вацлав Смил
        # Цементные заводы (Дисдорф, 1895 год, 150 рабочих, 410 кВт) -- 25 500 тонн/год
            # 170 тонн/рабочего, 9.4 нормо-часа/тонна
            # Шаровая мельница для цемента (17 кВт) -- 1062 тонн/год (~3.54 тонны/день, ~0.22 тонны/час)
        # Цементные заводы (Манингейм, 1895 год, 900 рабочих, 850 кВт) -- 51 000 тонн/год
            # 56 тонн/рабочего, 28.6 нормо-часа/тонна
        # Состав:
            # 80% -- углекислой извести.
            # 20% -- глины.
            # 45% воды в тесте, 2-3 недели перемешивания и перетирания в мельницах.
        'Известняк (килограмм)':800 / 0.9,
        'Глина мятая (килограмм)':200 / 0.9,
        'Вода для промышленности (литр)':500 / 0.9,
        '_-Помол известняка на шаровой мельнице (тонн)':0.8 / 0.9,
        '_-Помол глины мятой на шаровой мельнице (тонн)':0.2 / 0.9,
        '_-Процеживание глино-известнякового теста на проволочном сите (тонн)':1.5 / 0.9,
        '_-Формирование глино-известнякового теста для обжига (тонн)':1.5 / 0.9,
        '_-Обжиг глино-известнякового теста в шахтной печи (тонн)':1.5 / 0.9,
        '_-Дробление цемента в дробилке (тонн)':1 / 0.9,
        '_-Помол цемента на шаровой мельнице (тонн)':1 / 0.9,
        '_-Процеживание цемента на проволочном сите (тонн)':1 / 0.9,
        '_-Уплотнение цемента (тонн)':1,
        '_Производство цемента (годовой оборот)':1 / 20000,
        }

#----
# Производства (капитализация)
    # В добыче минералов 40% капитальных вложений в инфраструктуру (из них 80% на железные дороги, 2020 год)
    # https://ru.wikisource.org/wiki/ЭСБЕ/Горное_дело

metadict_detail['_Карьер, глина (годовой оборот)'] = {
        #'Карьер, глина (капитализация)':1/10,
        #'Наёмные рабочие (карьер)':5,
        }

metadict_detail['_Карьер, гравий (годовой оборот)'] = {
        #'Карьер, гравий (капитализация)':1/10,
        #'Наёмные рабочие (карьер)':5,
        }

metadict_detail['_Карьер, песок (годовой оборот)'] = {
        #'Карьер, песок (капитализация)':1/10,
        #'Наёмные рабочие (карьер)':5,
        }

metadict_detail['_Производство глины мятой (годовой оборот)'] = {
        #'Цементная фабрика (капитализация)':1/10,
        #'Наёмные рабочие (цементная фабрика)':5,
        }

metadict_detail['_Производство мелового порошка (годовой оборот)'] = {
        #'Цементная фабрика (капитализация)':1/10,
        #'Наёмные рабочие (цементная фабрика)':5,
        }

metadict_detail['_Производство извести негашёной (годовой оборот)'] = {
        #'Цементная фабрика (капитализация)':1/10,
        #'Наёмные рабочие (цементная фабрика)':30,
        }

metadict_detail['_Производство цемента (годовой оборот)'] = {
        #'Цементная фабрика (капитализация)':1/10,
        #'Наёмные рабочие (цементная фабрика)':200,
        }

metadict_detail['_Обогатительный комбинат, асбест (годовой оборот)'] = {
        #'Карьер, щебень (капитализация)':1/10,
        #'Наёмные рабочие (карьер)':400,
        }

metadict_detail['_Карьер, бутовый камень (годовой оборот)'] = {
        #'Карьер, бутовый камень (капитализация)':1/10,
        #'Наёмные рабочие (карьер)':150,
        }

metadict_detail['_Карьер, магнитный железняк (годовой оборот)'] = {
        #'Карьер, магнитный железняк (капитализация)':1/10,
        #'Наёмные рабочие (карьер)':100,
        }

metadict_detail['_Карьер, известняк (годовой оборот)'] = {
        #'Карьер, известняк (капитализация)':1/10,
        #'Наёмные рабочие (карьер)':50,
        }

metadict_detail['_Карьер, щебень (годовой оборот)'] = {
        #'Карьер, щебень (капитализация)':1/10,
        #'Наёмные рабочие (карьер)':50,
        }

metadict_detail['_Карьер, асбестовая руда (годовой оборот)'] = {
        #'Карьер, щебень (капитализация)':1/10,
        #'Наёмные рабочие (карьер)':50,
        }

metadict_detail['_Карьер, соль (годовой оборот)'] = {
        #'Карьер, соль (капитализация)':1/10,
        #'Наёмные рабочие (карьер)':100,
        }

metadict_detail['_Артель добычи торфа (годовой оборот)'] = {
        #'Артель добычи торфа (капитализация)':1/2,
        #'Наёмные рабочие (торф)':10,
        }
