#----
# Изысканный рацион:

metadict_detail['Изысканный рацион (пони/год)'] = {
        # Объединение всех повседневных и праздничных рационов.
        'Изысканный весенний рацион (пони/день)':90,
        'Изысканный летний рацион (пони/день)':90,
        'Изысканный осенний рацион (пони/день)':90,
        'Изысканный зимний рацион (пони/день)':90,
        }

#----
# Изысканный рацион (времена года):

metadict_detail['Изысканный весенний рацион (пони/день)'] = {
        # Рестораны и доставка горячей пищи. В factories_food
        # Там костыль, меняющий домашнюю готовку в выводе на работу повара.
        # amber -sm "Изысканный весенний рацион" -n 360
        # +-| Энергия затраченная (МДж)............... | 42,358
        # +-| Энергия полезная (МДж).................. | 16,491
        # --| Энергия на готовку (МДж)................ | 8,270
        # -|$ Продукция, стоимость (бит).............. | 59
        # -|$ Продукция, стоимость (бит/пони)......... | 59
        # -|- Трудозатраты (нормо-часов).............. | 236
        # -|- Трудозатраты, дом (нормо-часов)......... | 327
        # -|1 Полевые работы (нормо-часов)............ | 177
        # -|2 Хозяйственные работы (нормо-часов)...... | 13
        # -|2 Хозяйственные работы, дом (нормо-часов). | 41
        # -|3 Обработка пищи (нормо-часов)............ | 9
        # -|3 Обработка пищи, дом (нормо-часов)....... | 105
        # -|4 Приготовление пищи, дом (нормо-часов)... | 181
        # -|5 Транспортировка (нормо-часов)........... | 36
        '_Изысканный рацион, общественное питание (пони/день)':1,
        'Североморский весенний повседневный рацион (пони/день)':1 / 6,
        'Североморский весенний праздничный рацион (пони/день)':1 / 6,
        'Среднеземный весенний повседневный рацион (пони/день)':1 / 6,
        'Среднеземный весенний праздничный рацион (пони/день)':1 / 6,
        'Южноморский весенний повседневный рацион (пони/день)':1 / 6,
        'Южноморский весенний праздничный рацион (пони/день)':1 / 6,
        #'Городской весенний повседневный рацион (пони/день)':1 / 6,
        #'Городской весенний праздничный рацион (пони/день)':1 / 6,
        }

metadict_detail['Изысканный летний рацион (пони/день)'] = {
        # +-| Энергия затраченная (МДж)............... | 25,268
        # +-| Энергия полезная (МДж).................. | 10,159
        # --| Энергия на готовку (МДж)................ | 6,501
        # -|$ Продукция, стоимость (бит).............. | 51
        # -|$ Продукция, стоимость (бит/пони)......... | 51
        # -|- Трудозатраты (нормо-часов).............. | 216
        # -|- Трудозатраты, дом (нормо-часов)......... | 287
        # -|1 Полевые работы (нормо-часов)............ | 171
        # -|2 Хозяйственные работы (нормо-часов)...... | 7
        # -|2 Хозяйственные работы, дом (нормо-часов). | 34
        # -|3 Обработка пищи (нормо-часов)............ | 9
        # -|3 Обработка пищи, дом (нормо-часов)....... | 73
        # -|4 Приготовление пищи, дом (нормо-часов)... | 180
        # -|5 Транспортировка (нормо-часов)........... | 30
        '_Изысканный рацион, общественное питание (пони/день)':1,
        'Североморский летний повседневный рацион (пони/день)':1 / 6,
        'Североморский летний праздничный рацион (пони/день)':1 / 6,
        'Среднеземный летний повседневный рацион (пони/день)':1 / 6,
        'Среднеземный летний праздничный рацион (пони/день)':1 / 6,
        'Южноморский летний повседневный рацион (пони/день)':1 / 6,
        'Южноморский летний праздничный рацион (пони/день)':1 / 6,
        #'Городской летний повседневный рацион (пони/день)':1 / 6,
        #'Городской летний праздничный рацион (пони/день)':1 / 6,
        }

metadict_detail['Изысканный осенний рацион (пони/день)'] = {
        # +-| Энергия затраченная (МДж)............... | 24,646
        # +-| Энергия полезная (МДж).................. | 9,563
        # --| Энергия на готовку (МДж)................ | 6,597
        # -|$ Продукция, стоимость (бит).............. | 61
        # -|$ Продукция, стоимость (бит/пони)......... | 61
        # -|- Трудозатраты (нормо-часов).............. | 246
        # -|- Трудозатраты, дом (нормо-часов)......... | 319
        # -|1 Полевые работы (нормо-часов)............ | 199
        # -|2 Хозяйственные работы (нормо-часов)...... | 7
        # -|2 Хозяйственные работы, дом (нормо-часов). | 39
        # -|3 Обработка пищи (нормо-часов)............ | 9
        # -|3 Обработка пищи, дом (нормо-часов)....... | 61
        # -|4 Приготовление пищи, дом (нормо-часов)... | 219
        # -|5 Транспортировка (нормо-часов)........... | 31
        '_Изысканный рацион, общественное питание (пони/день)':1,
        'Североморский осенний повседневный рацион (пони/день)':1 / 6,
        'Североморский осенний праздничный рацион (пони/день)':1 / 6,
        'Среднеземный осенний повседневный рацион (пони/день)':1 / 6,
        'Среднеземный осенний праздничный рацион (пони/день)':1 / 6,
        'Южноморский осенний повседневный рацион (пони/день)':1 / 6,
        'Южноморский осенний праздничный рацион (пони/день)':1 / 6,
        #'Городской осенний повседневный рацион (пони/день)':1 / 6,
        #'Городской осенний праздничный рацион (пони/день)':1 / 6,
        }

metadict_detail['Изысканный зимний рацион (пони/день)'] = {
        # +-| Энергия затраченная (МДж)............... | 28,753
        # +-| Энергия полезная (МДж).................. | 10,249
        # --| Энергия на готовку (МДж)................ | 6,664
        # -|$ Продукция, стоимость (бит).............. | 57
        # -|$ Продукция, стоимость (бит/пони)......... | 57
        # -|- Трудозатраты (нормо-часов).............. | 218
        # -|- Трудозатраты, дом (нормо-часов)......... | 284
        # -|1 Полевые работы (нормо-часов)............ | 169
        # -|2 Хозяйственные работы (нормо-часов)...... | 9
        # -|2 Хозяйственные работы, дом (нормо-часов). | 41
        # -|3 Обработка пищи (нормо-часов)............ | 8
        # -|3 Обработка пищи, дом (нормо-часов)....... | 53
        # -|4 Приготовление пищи, дом (нормо-часов)... | 190
        # -|5 Транспортировка (нормо-часов)........... | 32
        '_Изысканный рацион, общественное питание (пони/день)':1,
        'Североморский зимний повседневный рацион (пони/день)':1 / 6,
        'Североморский зимний праздничный рацион (пони/день)':1 / 6,
        'Среднеземный зимний повседневный рацион (пони/день)':1 / 6,
        'Среднеземный зимний праздничный рацион (пони/день)':1 / 6,
        'Южноморский зимний повседневный рацион (пони/день)':1 / 6,
        'Южноморский зимний праздничный рацион (пони/день)':1 / 6,
        #'Городской зимний повседневный рацион (пони/день)':1 / 6,
        #'Городской зимний праздничный рацион (пони/день)':1 / 6,
        }
