#----
# Ингредиенты (пряности, специи):

metadict_detail['Пряности пряничные (килограмм)'] = {
        # 2-4 грамма на килограмм пряничного теста
        'Корица молотая (грамм)':370,
        'Бадьян сушёный (грамм)':200,
        'Гвоздика сушёная (грамм)':50,
        'Орех мускатный (грамм)':50,
        'Семена кардамона (грамм)':50,
        'Цедра лимонная (грамм)':70,
        'Семена аниса (грамм)':140,
        'Корень имбиря (грамм)':70,
        }

metadict_detail['Пряности кондитерские (килограмм)'] = {
        'Корица молотая (грамм)':250,
        'Перец душистый сушёный (грамм)':250,
        'Гвоздика сушёная (грамм)':200,
        'Семена кориандра (грамм)':200,
        'Корень имбиря (грамм)':50,
        'Орех мускатный (грамм)':50,
        }

metadict_detail['Пряности для тыквы (килограмм)'] = {
        'Корица молотая (грамм)':500,
        'Корень имбиря (грамм)':350,
        'Гвоздика сушёная (грамм)':100,
        'Орех мускатный (грамм)':50,
        }

metadict_detail['Пряности для овощей из трёх растений (килограмм)'] = {
        'Зелень укропа сушёная (грамм)':350,
        'Чеснок чищеный (грамм)':550,
        'Перец чёрный сушёный (грамм)':100,
        }

metadict_detail['Пряности для овощей из пяти растений (килограмм)'] = {
        # Румынская кухня
        'Зелень укропа сушёная (грамм)':250,
        'Чеснок чищеный (грамм)':450,
        'Лист хрена (грамм)':100,
        'Зелень сельдерея (грамм)':100,
        'Перец чёрный сушёный (грамм)':100,
        }

metadict_detail['Пряности для овощей из восьми растений (килограмм)'] = {
        # Исправить
            # Уточни пропорции. Что-то здесь не так.
        'Зелень укропа сушёная (грамм)':250,
        'Чеснок чищеный (грамм)':450,
        'Зелень петрушки сушёная (грамм)':70,
        'Лист хрена (грамм)':70,
        'Зелень сельдерея (грамм)':70,
        'Лавровый лист сушёный (грамм)':10,
        'Перец красный сушёный (грамм)':20,
        'Перец чёрный сушёный (грамм)':60,
        }

metadict_detail['Пряности для щей (килограмм)'] = {
        'Корень петрушки чищеный (грамм)':240,
        'Корень сельдерея (грамм)':240,
        'Чеснок чищеный (грамм)':240,
        'Зелень укропа сушёная (грамм)':240,
        'Перец чёрный сушёный (грамм)':25,
        'Лавровый лист сушёный (грамм)':15,
        }

metadict_detail['Пряности букета гарни с петрушкой (килограмм)'] = {
        # Средиземноморские травы (4 грамма/литр)
            # https://en.wikipedia.org/wiki/Bouquet_garni
        'Зелень петрушки сушёная (грамм)':280,
        'Зелень сельдерея сушёная (грамм)':70,
        'Майоран сушёный (грамм)':150,
        'Базилик сушёный (грамм)':70,
        'Тимьян сушёный (грамм)':280,
        'Чабер сушёный (грамм)':150,
        }

metadict_detail['Пряности букета гарни с розмарином (килограмм)'] = {
        'Розмарин сушёный (грамм)':200,
        'Майоран сушёный (грамм)':250,
        'Тимьян сушёный (грамм)':200,
        'Шалфей сушёный (грамм)':150,
        'Чабер сушёный (грамм)':150,
        'Мята сушёная (грамм)':50,
        }

metadict_detail['Пряности прованские (килограмм)'] = {
        'Тимьян сушёный (грамм)':210,
        'Майоран сушёный (грамм)':170,
        'Базилик сушёный (грамм)':125,
        'Розмарин сушёный (грамм)':125,
        'Эстрагон сушёный (грамм)':125,
        'Чабрец сушёный (грамм)':125,
        'Лаванда сушёная (грамм)':80,
        'Фенхель сушёный (грамм)':40,
        }

metadict_detail['Пряности для бобовых v1 (килограмм)'] = {
        # Восточноевропейские
        # 8 грамм/килограмм бобовых, после кипения.
        'Чеснок чищеный (грамм)':720,
        'Чабер сушёный (грамм)':70,
        'Мята сушёная (грамм)':40,
        'Зелень укропа сушёная (грамм)':100,
        'Семена кориандра (грамм)':15,
        'Лавровый лист сушёный (грамм)':5,
        'Перец красный сушёный (грамм)':50,
        }

metadict_detail['Пряности для бобовых v2 (килограмм)'] = {
        # Хм, балканские?
        'Чеснок чищеный (грамм)':700,
        'Тимьян сушёный (грамм)':100,
        'Корень имбиря (грамм)':70,
        'Перец чёрный сушёный (грамм)':40,
        'Шафран сушёный (грамм)':40,
        'Мята сушёная (грамм)':40,
        'Орех мускатный (грамм)':10,
        }

metadict_detail['Пряности для фруктового маринада (килограмм)'] = {
        # 9 грамм на литр воды.
        'Корица молотая (грамм)':920,
        'Гвоздика сушёная (грамм)':40,
        'Перец душистый сушёный (грамм)':40,
        }

metadict_detail['Пряности для овощного маринада с тмином (килограмм)'] = {
        'Пряности для овощного маринада (грамм)':700,
        'Семена тмина (грамм)':300,
        }

metadict_detail['Пряности для овощного маринада (килограмм)'] = {
        # К этой смеси в маринад добавляют (варианты):
            # 1) 60-80 стеблей зелёного укропа (с зонтиком)
            # 2) 400 грамм семян укропа
            # 3) 400 грамм семян тмина
        'Перец душистый сушёный (грамм)':150,
        'Лавровый лист сушёный (грамм)':50,
        'Семена кардамона (грамм)':50,
        'Корица молотая (грамм)':150,
        'Перец красный сушёный (грамм)':50,
        'Семена кориандра (грамм)':200,
        'Гвоздика сушёная (грамм)':50,
        'Корень имбиря (грамм)':50,
        'Орех мускатный (грамм)':50,
        'Семена горчицы белой (грамм)':100,
        'Перец чёрный сушёный (грамм)':100,
        }

metadict_detail['Пряности нежного карри (килограмм)'] = {
        # Западноевропейский.
        'Корень куркумы (грамм)':300,
        'Семена кориандра (грамм)':200,
        'Семена фенугрека (грамм)':100,
        'Перец красный сушёный (грамм)':50,
        'Корень имбиря (грамм)':200,
        'Перец чёрный сушёный (грамм)':50,
        'Корица молотая (грамм)':50,
        'Гвоздика сушёная (грамм)':50,
        }

metadict_detail['Пряности гарам масала (килограмм)'] = {
        # Исправить
            # Кажется, гвоздики маловато. И аниса с бадьяном не хватает.
        'Семена зиры (грамм)':190,
        'Семена кориандра (грамм)':190,
        'Перец чёрный сушёный (грамм)':190,
        'Семена кардамона (грамм)':190,
        'Корица молотая (грамм)':180,
        'Гвоздика сушёная (грамм)':25,
        'Орех мускатный (грамм)':25,
        'Шафран сушёный (грамм)':10,
        }

metadict_detail['Пряности хмели-сунели (килограмм)'] = {
        'Лист кориандра сушёный (грамм)':250,
        'Базилик сушёный (грамм)':250,
        'Майоран сушёный (грамм)':250,
        'Зелень укропа сушёная (грамм)':250,
        'Перец красный сушёный (грамм)':10,
        'Шафран сушёный (грамм)':1,
        }

