#----
# Заметки:
    # Российские города в 1910 г. Хозяйство и благоустройство
    # http://www.mysteriouscountry.ru/wiki/index.php/Россия_1913_год_(Статистико-документальный_справочник)/Российские_города_в_1910_г._Хозяйство_и_благоустройство
    # http://www.mysteriouscountry.ru/wiki/index.php/Россия_1913_год_(Статистико-документальный_справочник)/Территория_и_население_России

#----
# Тесты:

metadict_army['Эквестрийские пони'] = {
        'Эквестрия':1 / 10065575,
        }

metadict_army['Тестовое хозяйство'] = {
        # Одна земнопонь-фермерская семья может обеспечить три городских.
        # Но это максимум -- 400 нормо-дней в страду.
        'Эквестрия':10 / 10065575,
        }

#----
# Географические регионы:

metadict_army['Эквестрия'] = {
        # https://ru.wikipedia.org/wiki/Классификация_климатов_Кёппена
        # https://vignette.wikia.nocookie.net/mlp/images/c/cb/Map_of_Equestria_April_2013.jpg
        # https://upload.wikimedia.org/wikipedia/commons/b/bc/Illustrated_map_of_European_Russia_(1903).jpeg
        'Балтимэрский регион':1,
        'Кантерлотский регион':1,
        'Мэйнхеттенский регион':1,
        'Филлидельфийский регион':1,
        'Ванхуверский регион':1,
        'Эпплузский регион':1,
        }

#----
# Округа, области, губерни:

metadict_army['Балтимэрский регион'] = {
        'Балтимэрский округ':1,
        'Троттингемский округ':1,
        'Юго-восточный прибрежный округ':10,
        'Юго-восточный речной округ':5,
        }

metadict_army['Кантерлотский регион'] = {
        'Кантерлотский округ':1,
        'Клаудсдэйлский округ':1,
        'Понивильский округ':1,
        'Среднеземный речной округ':7,
        'Среднеземный лесной округ':3,
        }

metadict_army['Мэйнхеттенский регион'] = {
        'Мэйнхеттенский округ':1,
        'Северо-восточный прибрежный округ':12,
        'Северо-восточный горный округ':6,
        }

metadict_army['Филлидельфийский регион'] = {
        'Филлидельфийский округ':1,
        'Хуффингтонский округ':1,
        'Средне-восточный прибрежный округ':10,
        'Средне-восточный речной округ':6,
        }

metadict_army['Ванхуверский регион'] = {
        'Ванхуверский округ':1,
        'Сталлионградский округ':1,
        'Северо-западный речной округ':5,
        'Северо-западный горный округ':4,
        }

metadict_army['Эпплузский регион'] = {
        'Эпплузский округ':1,
        'Доджтаунский округ':1,
        'Среднеземный степной округ':5,
        }

#----
# Районные центры, кантоны, уезды:

metadict_army['Балтимэрский округ'] = {
        'Балтимэр':1,
        'Юго-восточный прибрежный кантон':6,
        '-----Округа':1,
        }

metadict_army['Троттингемский округ'] = {
        'Троттингем':1,
        'Юго-восточный речной кантон':11,
        '-----Округа':1,
        }

metadict_army['Юго-восточный прибрежный округ'] = {
        'Юго-восточный прибрежный районный центр':1,
        'Юго-восточный прибрежный кантон':6,
        '-----Округа':1,
        }

metadict_army['Юго-восточный речной округ'] = {
        'Юго-восточный речной районный центр':1,
        'Юго-восточный речной кантон':6,
        '-----Округа':1,
        }

metadict_army['Кантерлотский округ'] = {
        'Кантерлот':1,
        'Среднеземный речной кантон':12,
        '-----Округа':1,
        }

metadict_army['Клаудсдэйлский округ'] = {
        'Клаудсдэйл':1,
        'Северо-западный речной кантон':9,
        '-----Округа':1,
        }

metadict_army['Понивильский округ'] = {
        'Понивиль':1,
        'Северо-западный речной кантон':6,
        '-----Округа':1,
        }

metadict_army['Среднеземный речной округ'] = {
        'Среднеземный речной районный центр':1,
        'Среднеземный речной кантон':6,
        '-----Округа':1,
        }

metadict_army['Ванхуверский округ'] = {
        'Ванхувер':1,
        'Северо-западный речной кантон':6,
        '-----Округа':1,
        }

metadict_army['Сталлионградский округ'] = {
        'Сталлионград':1,
        'Северо-западный горный кантон':3,
        '-----Округа':1,
        }

metadict_army['Северо-западный горный округ'] = {
        'Северо-западный горный районный центр':1,
        'Северо-западный горный кантон':6,
        '-----Округа':1,
        }

metadict_army['Северо-западный речной округ'] = {
        'Северо-западный речной районный центр':1,
        'Северо-западный речной кантон':6,
        '-----Округа':1,
        }

metadict_army['Доджтаунский округ'] = {
        'Доджтаун':1,
        'Среднеземный степной кантон':6,
        '-----Округа':1,
        }

metadict_army['Эпплузский округ'] = {
        'Эпплуза':1,
        'Среднеземный степной кантон':6,
        '-----Округа':1,
        }

metadict_army['Среднеземный степной округ'] = {
        'Среднеземный степной районный центр':1,
        'Среднеземный степной кантон':6,
        '-----Округа':1,
        }

metadict_army['Мэйнхеттенский округ'] = {
        'Мэйнхеттен':1,
        'Северо-восточный прибрежный кантон':11,
        '-----Округа':1,
        }

metadict_army['Северо-восточный горный округ'] = {
        'Северо-восточный горный районный центр':1,
        'Северо-восточный горный кантон':6,
        '-----Округа':1,
        }

metadict_army['Северо-восточный прибрежный округ'] = {
        'Северо-восточный прибрежный районный центр':1,
        'Северо-восточный прибрежный кантон':6,
        '-----Округа':1,
        }

metadict_army['Северо-восточный речной округ'] = {
        'Северо-восточный речной районный центр':1,
        'Северо-восточный речной кантон':6,
        '-----Округа':1,
        }

metadict_army['Средне-восточный прибрежный округ'] = {
        'Среднеземный прибрежный районный центр':1,
        'Среднеземный прибрежный кантон':6,
        '-----Округа':1,
        }

metadict_army['Средне-восточный речной округ'] = {
        'Среднеземный речной районный центр':1,
        'Среднеземный речной кантон':6,
        '-----Округа':1,
        }

metadict_army['Филлидельфийский округ'] = {
        'Филлидельфия':1,
        'Среднеземный речной кантон':12,
        '-----Округа':1,
        }

metadict_army['Хуффингтонский округ'] = {
        'Хуффингтон':1,
        'Северо-восточный речной кантон':12,
        '-----Округа':1,
        }

metadict_army['Среднеземный лесной округ'] = {
        'Среднеземный лесной районный центр':1,
        'Среднеземный лесной кантон':6,
        '-----Округа':1,
        }

metadict_army['Среднеземный речной округ'] = {
        'Среднеземный речной районный центр':1,
        'Среднеземный речной кантон':6,
        '-----Округа':1,
        }

#----
# Кантоны:

metadict_army['Северо-восточный горный кантон'] = {
        'Северо-восточный горный городок':1,
        'Северо-восточное горное селение':3,
        'Северо-восточная горная деревня':15,
        '----Кантоны':1,
        }

metadict_army['Северо-восточный прибрежный кантон'] = {
        'Северо-восточный прибрежный городок':1,
        'Северо-восточное прибрежное селение':5,
        'Северо-восточная прибрежная деревня':25,
        'Северо-восточная прибрежная ферма':125,
        '----Кантоны':1,
        }

metadict_army['Северо-восточный речной кантон'] = {
        'Северо-восточный речной городок':1,
        'Северо-восточное речное селение':5,
        'Северо-восточная речная деревня':25,
        'Северо-восточная речная ферма':125,
        '----Кантоны':1,
        }

metadict_army['Северо-западный горный кантон'] = {
        'Северо-западный горный городок':1,
        'Северо-западное горное селение':5,
        'Северо-западная горная деревня':7,
        '----Кантоны':1,
        }

metadict_army['Северо-западный речной кантон'] = {
        'Северо-западный речной городок':1,
        'Северо-западное речное селение':5,
        'Северо-западная речная деревня':15,
        'Северо-западная речная ферма':75,
        '----Кантоны':1,
        }

metadict_army['Среднеземный лесной кантон'] = {
        'Среднеземный лесной городок':1,
        'Среднеземное лесное селение':5,
        'Среднеземная лесная деревня':15,
        'Среднеземная лесная ферма':75,
        '----Кантоны':1,
        }

metadict_army['Среднеземный речной кантон'] = {
        'Среднеземный речной городок':1,
        'Среднеземное речное селение':5,
        'Среднеземная речная деревня':25,
        'Среднеземная речная ферма':125,
        '----Кантоны':1,
        }

metadict_army['Среднеземный прибрежный кантон'] = {
        'Среднеземный прибрежный городок':1,
        'Среднеземное прибрежное селение':5,
        'Среднеземная прибрежная деревня':25,
        'Среднеземная прибрежная ферма':125,
        '----Кантоны':1,
        }

metadict_army['Юго-восточный прибрежный кантон'] = {
        'Юго-восточный прибрежный городок':1,
        'Юго-восточное прибрежное селение':10,
        'Юго-восточная прибрежная деревня':50,
        'Юго-восточная прибрежная ферма':125,
        '----Кантоны':1,
        }

metadict_army['Юго-восточный речной кантон'] = {
        'Юго-восточный речной городок':1,
        'Юго-восточное речное селение':10,
        'Юго-восточная речная деревня':50,
        'Юго-восточная речная ферма':125,
        '----Кантоны':1,
        }

metadict_army['Среднеземный степной кантон'] = {
        'Среднеземный степной городок':1,
        'Среднеземное степное селение':5,
        'Среднеземная степная деревня':25,
        'Среднеземная степная ферма':250,
        '----Кантоны':1,
        }

#----
# Исторически-значимые города:

metadict_army['Мэйнхеттен'] = {
        'Мэйнхеттенская городская семья':600000 / 5,
        '-----Мегаполисы':1,
        }

metadict_army['Филлидельфия'] = {
        'Филлидельфийская городская семья':400000 / 5,
        '-----Мегаполисы':1,
        }

metadict_army['Балтимэр'] = {
        'Балтимэрская городская семья':350000 / 5,
        '-----Мегаполисы':1,
        }

metadict_army['Кантерлот'] = {
        'Кантерлотская городская семья':250000 / 5,
        '-----Мегаполисы':1,
        }

metadict_army['Троттингем'] = {
        'Троттингемская городская семья':200000 / 5,
        '-----Мегаполисы':1,
        }

metadict_army['Клаудсдэйл'] = {
        'Клаудсдэйлская городская семья':150000 / 5,
        '-----Мегаполисы':1,
        }

metadict_army['Хуффингтон'] = {
        'Хуффингтоская городская семья':130000 / 5,
        '-----Мегаполисы':1,
        }

metadict_army['Ванхувер'] = {
        'Ванхуверская городская семья':100000 / 5,
        '-----Мегаполисы':1,
        }

metadict_army['Сталлионград'] = {
        'Сталлионградская городская семья':90000 / 5,
        '-----Мегаполисы':1,
        }

metadict_army['Понивиль'] = {
        'Понивильская городская семья':3700 / 5,
        '---Городки':1,
        }

metadict_army['Доджтаун'] = {
        'Доджтаунская городская семья':3000 / 5,
        '---Городки':1,
        }

metadict_army['Эпплуза'] = {
        'Эпплузская городская семья':3000 / 5,
        '---Городки':1,
        }

#----
# Районные центры:

metadict_army['Северо-восточный горный районный центр'] = {
        'Северо-восточная городская семья':15000 / 5,
        '---Города':1,
        }

metadict_army['Северо-восточный прибрежный районный центр'] = {
        'Северо-восточная городская семья':15000 / 5,
        '---Города':1,
        }

metadict_army['Северо-восточный речной районный центр'] = {
        'Северо-восточная городская семья':15000 / 5,
        '---Города':1,
        }

metadict_army['Северо-западный горный районный центр'] = {
        'Северо-западная городская семья':15000 / 5,
        '---Города':1,
        }

metadict_army['Северо-западный речной районный центр'] = {
        'Северо-западная городская семья':15000 / 5,
        '---Города':1,
        }

metadict_army['Среднеземный лесной районный центр'] = {
        'Среднеземная городская семья':15000 / 5,
        '---Города':1,
        }

metadict_army['Среднеземный речной районный центр'] = {
        'Среднеземная городская семья':15000 / 5,
        '---Города':1,
        }

metadict_army['Среднеземный степной районный центр'] = {
        'Среднеземная городская семья':15000 / 5,
        '---Города':1,
        }

metadict_army['Среднеземный прибрежный районный центр'] = {
        'Среднеземная городская семья':15000 / 5,
        '---Города':1,
        }

metadict_army['Юго-восточный прибрежный районный центр'] = {
        'Юго-восточная городская семья':15000 / 5,
        '---Города':1,
        }

metadict_army['Юго-восточный речной районный центр'] = {
        'Юго-восточная городская семья':15000 / 5,
        '---Города':1,
        }

#----
# Городки:

metadict_army['Северо-восточный горный городок'] = {
        'Северо-восточная городская семья':3000 / 5,
        '---Городки':1,
        }

metadict_army['Северо-восточный прибрежный городок'] = {
        'Северо-восточная городская семья':3000 / 5,
        '---Городки':1,
        }

metadict_army['Северо-восточный речной городок'] = {
        'Северо-восточная городская семья':3000 / 5,
        '---Городки':1,
        }

metadict_army['Северо-западный горный городок'] = {
        'Северо-западная городская семья':3000 / 5,
        '---Городки':1,
        }

metadict_army['Северо-западный речной городок'] = {
        'Северо-западная городская семья':3000 / 5,
        '---Городки':1,
        }

metadict_army['Среднеземный лесной городок'] = {
        'Среднеземная городская семья':3000 / 5,
        '---Городки':1,
        }

metadict_army['Среднеземный речной городок'] = {
        'Среднеземная городская семья':3000 / 5,
        '---Городки':1,
        }

metadict_army['Среднеземный прибрежный городок'] = {
        'Среднеземная городская семья':3000 / 5,
        '---Городки':1,
        }

metadict_army['Среднеземный степной городок'] = {
        'Среднеземная городская семья':3000 / 5,
        '---Городки':1,
        }

metadict_army['Юго-восточный прибрежный городок'] = {
        'Юго-восточная городская семья':3000 / 5,
        '---Городки':1,
        }

metadict_army['Юго-восточный речной городок'] = {
        'Юго-восточная городская семья':3000 / 5,
        '---Городки':1,
        }

metadict_army['Юго-восточный степной городок'] = {
        'Юго-восточная городская семья':3000 / 5,
        '---Городки':1,
        }

#----
# Селения:

metadict_army['Северо-восточное горное селение'] = {
        'Северо-восточная сельская семья':625 / 5,
        '--Селения':1,
        }

metadict_army['Северо-восточное прибрежное селение'] = {
        'Северо-восточная сельская семья':625 / 5,
        '--Селения':1,
        }

metadict_army['Северо-восточное речное селение'] = {
        'Северо-восточная сельская семья':625 / 5,
        '--Селения':1,
        }

metadict_army['Северо-западное горное селение'] = {
        'Северо-западная сельская семья':625 / 5,
        '--Селения':1,
        }

metadict_army['Северо-западное речное селение'] = {
        'Северо-западная сельская семья':625 / 5,
        '--Селения':1,
        }

metadict_army['Среднеземное лесное селение'] = {
        'Среднеземная сельская семья':625 / 5,
        '--Селения':1,
        }

metadict_army['Среднеземное речное селение'] = {
        'Среднеземная сельская семья':625 / 5,
        '--Селения':1,
        }

metadict_army['Среднеземное прибрежное селение'] = {
        'Среднеземная сельская семья':625 / 5,
        '--Селения':1,
        }

metadict_army['Среднеземное степное селение'] = {
        'Среднеземная сельская семья':625 / 5,
        '--Селения':1,
        }

metadict_army['Юго-восточное прибрежное селение'] = {
        'Юго-восточная сельская семья':625 / 5,
        '--Селения':1,
        }

metadict_army['Юго-восточное речное селение'] = {
        'Юго-восточная сельская семья':625 / 5,
        '--Селения':1,
        }

metadict_army['Юго-восточное степное селение'] = {
        'Юго-восточная сельская семья':625 / 5,
        '--Селения':1,
        }

#----
# Деревни:

metadict_army['Северо-восточная горная деревня'] = {
        'Северо-восточная сельская семья':125 / 5,
        '--Деревни':1,
        }

metadict_army['Северо-восточная прибрежная деревня'] = {
        'Северо-восточная сельская семья':125 / 5,
        '--Деревни':1,
        }

metadict_army['Северо-восточная речная деревня'] = {
        'Северо-восточная сельская семья':125 / 5,
        '--Деревни':1,
        }

metadict_army['Северо-западная горная деревня'] = {
        'Северо-западная сельская семья':125 / 5,
        '--Деревни':1,
        }

metadict_army['Северо-западная речная деревня'] = {
        'Северо-западная сельская семья':125 / 5,
        '--Деревни':1,
        }

metadict_army['Среднеземная лесная деревня'] = {
        'Среднеземная сельская семья':125 / 5,
        '--Деревни':1,
        }

metadict_army['Среднеземная степная деревня'] = {
        'Среднеземная сельская семья':125 / 5,
        '--Деревни':1,
        }

metadict_army['Среднеземная речная деревня'] = {
        'Среднеземная сельская семья':125 / 5,
        '--Деревни':1,
        }

metadict_army['Среднеземная прибрежная деревня'] = {
        'Среднеземная сельская семья':125 / 5,
        '--Деревни':1,
        }

metadict_army['Юго-восточная прибрежная деревня'] = {
        'Юго-восточная сельская семья':125 / 5,
        '--Деревни':1,
        }

metadict_army['Юго-восточная речная деревня'] = {
        'Юго-восточная сельская семья':125 / 5,
        '--Деревни':1,
        }

metadict_army['Юго-восточная степная деревня'] = {
        'Юго-восточная сельская семья':125 / 5,
        '--Деревни':1,
        }

#----
# Фермы:

metadict_army['Северо-восточная прибрежная ферма'] = {
        'Северо-восточная сельская семья':25 / 5,
        '--Фермы':1,
        }

metadict_army['Северо-восточная речная ферма'] = {
        'Северо-восточная сельская семья':25 / 5,
        '--Фермы':1,
        }

metadict_army['Северо-западная речная ферма'] = {
        'Северо-западная сельская семья':25 / 5,
        '--Фермы':1,
        }

metadict_army['Среднеземная лесная ферма'] = {
        'Среднеземная сельская семья':25 / 5,
        '--Фермы':1,
        }

metadict_army['Среднеземная речная ферма'] = {
        'Среднеземная сельская семья':25 / 5,
        '--Фермы':1,
        }

metadict_army['Среднеземная прибрежная ферма'] = {
        'Среднеземная сельская семья':25 / 5,
        '--Фермы':1,
        }

metadict_army['Среднеземная степная ферма'] = {
        'Среднеземная сельская семья':25 / 5,
        '--Фермы':1,
        }

metadict_army['Юго-восточная прибрежная ферма'] = {
        'Юго-восточная сельская семья':25 / 5,
        '--Фермы':1,
        }

metadict_army['Юго-восточная речная ферма'] = {
        'Юго-восточная сельская семья':25 / 5,
        '--Фермы':1,
        }

metadict_army['Юго-восточная степная ферма'] = {
        'Юго-восточная сельская семья':25 / 5,
        '--Фермы':1,
        }

#----
# Городские семьи:

metadict_army['Балтимэрская городская семья'] = {
        'Балтимэрские городские пони':5,
        #'-Семьи':1,
        }

metadict_army['Ванхуверская городская семья'] = {
        'Ванхуверские городские пони':5,
        #'-Семьи':1,
        }

metadict_army['Доджтаунская городская семья'] = {
        'Доджтаунские городские пони':5,
        #'-Семьи':1,
        }

metadict_army['Кантерлотская городская семья'] = {
        'Кантерлотские городские пони':5,
        #'-Семьи':1,
        }

metadict_army['Клаудсдэйлская городская семья'] = {
        'Клаудсдэйлские городские пони':5,
        #'-Семьи':1,
        }

metadict_army['Мэйнхеттенская городская семья'] = {
        'Мэйнхеттенские городские пони':5,
        #'-Семьи':1,
        }

metadict_army['Понивильская городская семья'] = {
        'Понивильские городские пони':5,
        #'-Семьи':1,
        }

metadict_army['Сталлионградская городская семья'] = {
        'Сталлионградские городские пони':5,
        #'-Семьи':1,
        }

metadict_army['Троттингемская городская семья'] = {
        'Троттингемские городские пони':5,
        #'-Семьи':1,
        }

metadict_army['Филлидельфийская городская семья'] = {
        'Филлидельфийские городские пони':5,
        #'-Семьи':1,
        }

metadict_army['Хуффингтоская городская семья'] = {
        'Хуффингтоские городские пони':5,
        #'-Семьи':1,
        }

metadict_army['Эпплузская городская семья'] = {
        'Эпплузские городские пони':5,
        #'-Семьи':1,
        }

metadict_army['Северо-восточная городская семья'] = {
        'Северо-восточные городские пони':5,
        #'-Семьи':1,
        }

metadict_army['Северо-западная городская семья'] = {
        'Северо-западные городские пони':5,
        #'-Семьи':1,
        }

metadict_army['Среднеземная городская семья'] = {
        'Среднеземные городские пони':5,
        #'-Семьи':1,
        }

metadict_army['Юго-восточная городская семья'] = {
        'Юго-восточные городские пони':5,
        #'-Семьи':1,
        }

#----
# Сельские семьи:
# Модель жизненного цикла крестьянского дворохозяйства (2002)
# http://vln.by/node/117

metadict_army['Северо-восточная сельская семья'] = {
        'Северо-восточные сельские пони':5,
        #'-Семьи':1,
        }

metadict_army['Северо-западная сельская семья'] = {
        'Северо-западные сельские пони':5,
        #'-Семьи':1,
        }

metadict_army['Среднеземная сельская семья'] = {
        'Среднеземные сельские пони':5,
        #'-Семьи':1,
        }

metadict_army['Юго-восточная сельская семья'] = {
        'Юго-восточные сельские пони':5,
        #'-Семьи':1,
        }
