#----
# Заметки:
    # Российские города в 1910 г. Хозяйство и благоустройство
    # https://istmat.org/node/242
    # Бюджеты городов по сметным данным на 1913 год (в тыс. руб.)
    # https://www.gumer.info/bibliotek_Buks/History/Stat/32.php
    # Глава 12. К характеристике социально-профессионального состава населения крупных городов капиталистической России
    # https://istmat.org/node/49
    # Удвоение население города даёт 130% к экономической продуктивности на душу населения.
    # "Bettencourt and West" 2010

#----
# Города:
    # Процент населения городов >10k жителей к населению стран Европы (1500-1800):
        # Страна             | 1500 | 1550 | 1600 | 1650 | 1700 | 1750 | 1800
        # ------------------ | ---- | ---- | ---- | ---- | ---- | ---- | ----
        # Скандинавия        | 0.9  | 0.8  | 1.4  | 2.4  | 4.0  | 4.6  | 4.6
        # Англия и Уэльс     | 3.1  | 3.5  | 5.8  | 8.8  | 13.3 | 16.7 | 20.3
        # Шотландия          | 1.6  | 1.4  | 3.0  | 3.5  | 5.3  | 9.2  | 17.3
        # Ирландия           | 0    | 0    | 0    | 0.9  | 3.4  | 5.0  | 7.0
        # Голландия          | 15.8 | 15.3 | 24.3 | 31.7 | 33.6 | 30.5 | 28.8
        # Бельгия            | 21.1 | 22.7 | 18.8 | 20.8 | 23.9 | 19.6 | 18.9
        # Германия           | 3.2  | 3.8  | 4.1  | 4.4  | 4.8  | 5.6  | 5.5
        # Франция            | 4.2  | 4.3  | 5.9  | 7.2  | 9.2  | 9.1  | 8.8
        # Швейцария          | 1.5  | 1.5  | 2.5  | 2.2  | 3.3  | 4.6  | 3.7
        # Северная Италия    | -    | 15.1 | 16.6 | 14.3 | 13.6 | 14.2 | 14.3
        # Центральная Италия | 12.4 | 11.4 | 12.5 | 14.2 | 14.3 | 14.5 | 13.6
        # Южная Италия       | -    | 11.9 | 14.9 | 13.5 | 12.2 | 13.8 | 15.3
        # Испания            | 6.1  | 8.6  | 11.4 | 9.5  | 9.0  | 8.6  | 11.1
        # Португалия         | 3.0  | 11.5 | 14.1 | 16.6 | 11.5 | 9.1  | 8.7
        # Австрия-Богемия    | 1.7  | 1.9  | 2.1  | 2.4  | 3.9  | 5.2  | 5.2
        # Польша             | 0    | 0.3  | 0.4  | 0.7  | 0.5  | 1.0  | 2.5
        # Европа             | 5.6  | 6.3  | 7.6  | 8.3  | 9.2  | 9.5  | 10.0
        # De Vries J., European Urbanization, 1500–1800, Harvard University Press, Cambridge (Mass.), 1984.
        # "Демографическая история Европы" Массимо Ливи Баччи
        # http://flibustaongezhld6dibs2dps6vm4nvqg2kp7vgowbu76tzopgnhazqd.onion/b/266343/read
    # Доля жителей 50-тысячных городов:
        # Страна      | Год   | Население  | >50k города | % жителей
        # ----------- | ----- | ---------- | ----------- | ---------
        # США         | 1900  | 76 млн     | 77          | 22.3
        # Швейцария   | 1904  | 3.4        | 6           | 17.7
        # Франция     | 1901  | 39         | 37          | 17.6
        # Япония      | 1898  | 44         | 21          |  9.8
        # Россия      | 1897  | 129        | 57          |  6.3
        # Европа      | 1800  | 189        | 33          |  2.1
        # https://ru.wikisource.org/wiki/ЭСБЕ/Франция
        # https://ru.wikisource.org/wiki/ЭСБЕ/Швейцария
        # https://ru.wikisource.org/wiki/ЭСБЕ/Северо-Американские_Соединенные_Штаты
        # https://ru.wikisource.org/wiki/ЭСБЕ/Россия/Население/Статистика_населения
        # https://ru.wikisource.org/wiki/ЭСБЕ/Япония/Население
        # https://en.m.wikipedia.org/wiki/1900_United_States_census
        # https://w3.unece.org/PXWeb/ru/Table?IndicatorCode=22
        # http://www.warconflict.ru/rus/statistika/?action=shwprd&id=1509
    # Плотность населения городов:
        # - Многоэтажная застройка пятиэтажками (теор. 100% площади) -- 5-9k жителей/гектар
        # - Многоэтажная застройка (до 85%, Москва 1913 год) -- 4.3-7.7k жителей/гектар
        # - Многоэтажная застройка (17-27%, Москва 2024 год) -- 0.9-2.5k жителей/гектар
        # - 4-8 этажная застройка (<17%, Россия, 2024 год) -- 400-800 жителей/гектар
        # - Деревянная застройка (до 60%, Токио, 1945 год) -- 70 домов/га (350 жителей/га)
        # - Пригороды, селения -- 20-30 домов/гектар (100-150 жителей/гектар)
        # - Предместья, деревни -- 5-10 домов/гектар (25-50 жителей/гектар)
        # https://www.rpglibrary.org/utils/meddemog/
        # https://en.wikipedia.org/wiki/Urban_sprawl
        # https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Petrol_use_urban_density.svg/1000px-Petrol_use_urban_density.svg.png
        # https://upload.wikimedia.org/wikipedia/commons/b/bc/Famous-Places-of-Edo-1803-Kuwagata-Shoshin.jpg
        # https://upload.wikimedia.org/wikipedia/commons/1/10/Edo_Panorama_old_Tokyo_color_photochrom.jpg
    # Российский город 1825 года -- 5 тысяч жителей, 583 дома (9% каменных):
        # - 51 маленький магазинчик (1/10 семей торгуют?)
        # - 14—15 питейных домов 
        # - 5—6 церквей,
        # - 1-2 учебных заведения,
        # - 3 трактира,
        # - 2 благотворительных заведения,
        # - 1 общественная баня,
    # Российский город 1910 года -- 25 тысяч жителей, 2310 домов (20% каменных):
        # - 35—36 трактиров,
        # - 18—19 «пивных лавок и винниц»,
        # - 13 учебных,
        # - 12 церквей,
        # - 1 благотворительное заведение,
        # - 1 больница,
        # - 1 аптека,
        # - 0.6 типография,
        # - 0.5 клуб,
        # - 0.49 библиотека,
        # - 0.33 театр,
        # - 0.10 музей,
        # - 0.045 трамвай,
        # - 0.026 телеграф,
        # - 0.267 телефон,
        # Борис Миронов "Город из деревни: четыреста лет российской урбанизации":
        # http://www.intelros.ru/readroom/otechestvennye-zapiski/c3-2012/16011-gorod-iz-derevni-chetyresta-let-rossiyskoy-urbanizacii.html
    # Распределение владений (Петербург, 1780-е годы)
        # 324 торговца, 1204 лавки:
        # - главкабан -- 91 лавка (7.56%)
        # - 3.4% купцов -- 21 лавка/купца (1.74%)
        # - 10.7% купцов -- 10 лавок/купца (0.83%)
        # - 63.6% купцов -- 1.3 лавки/купца (0.11%)
        # 42% магазинов ткани и одежда, 11.5% продовольствие
    # Жильё (1882 год)
        # Москва -- 753 469 жителей, Петербург -- ???
        # -           | Москва       | Петербург 
        # ----------- | ------------ | ---------
        # Квартир     | 89 765       | 142 526   
        # Домов       | 32 214       | 22 234    
        # 1 этаж      | 54,3%        | 19%
        # 2 этажа     | 41,2%        | 42%
        # 3 этажа     | 4,1%         | 21.5%
        # 4 этажа     | 0,4%         | 14%
        # 5+ этажей   | 0,0%         | 3.5%
        # На 10k жит. | 1187 квартир | -         
        # На 10k жит. |  427 домов   | -         
        # - Квартира (Петербург, покупка) -- 90 рублей/кв.метр
        # Ссуда на 75%, на 37 лет, за 4.5% годовых (городское кредитное общество)
        # https://ru.wikisource.org/wiki/ЭСБЕ/Квартирный_вопрос
        # https://ru.wikisource.org/wiki/ЭСБЕ/Россия/Население/Статистика_населения
    # Демографический состав (современность, мегаполис, рождаемость 2.1):
        # Одиночки            15%
        # Семьи из 2 ч        30%
        # Семьи из 3 ч        30%
        # Семьи из 4-5 ч      20%
        # Семьи из 6 и более   5% 
    # Демографический состав (селяне России, 1913 год):
        # Семьи из 1-3        16.8%
        # Семьи из 4-6        22.8%
        # Семьи из 7-9        32.7%
        # Семьи из 10-12      15.8%
        # Семьи из 13-15       8.9%
        # Семьи из 16 и более  3%
        # https://istmat.org/node/21873
    # Баланс территории микрорайона:
        # - Площадь под жилой застройкой            17.2%   5,88 м²/человека
        # - Площадь под общественными зданиями      12.76%  4.36 м²/человека
        # - Зеленые насаждения                      37.18%  12.72 м²/человека
        # - Площадь гаражей и стоянок               4.55%   1.55 м²/человека
        # - Проезды, тротуары, пешеходные дорожки   12.55%  4.19 м²/человека
        # Плотность населения при пятиэтажной застройке -- 6-9 тысяч/гектар
        # Нежилые здания -- 20% от строительства (2023 год, Россия, +35.7 млн. м²)
        # http://www.vashdom.ru/snip/20701-89/
        # http://www.erudition.ru/referat/printref/id.14183_1.html
        # http://baza-referat.ru/Планировка_и_застройка_микрорайона

#----
# Мегаполисы:
    # Мегаполисы 18 века:
        # Первичная энергия: 20 ГДж/чел-год, 634 ватт/чел, 20-30 ватт/кв.метр
        # 50-100 га дровяного леса на гектар города (400 жителей/гектар)
        # Рост леса в пересчёте на древесный уголь -- 1-2 кВт/гектар
        # Рост леса в пересчёте на дрова -- 3-6 кВт/гектар
        # "Энергия и цивилизация" Вацлав Смил
    # Москва 1840-х годов:
        # Окружность 42.7 км, радиус 7 км, площадь 146 кв.км
        # Население 350 тысяч (24 чел/гектар, 417 кв.м/жителя, 29 жителей/дом)
        # Первичная энергия: 30 ГДж/чел-год, 950 ватт/чел, 2-3 ватт/кв.метр
    # Города России 1897 года >50 тысяч населения:
        # Город              | Население
        # ------------------ | -----------
        # Петербург          | 1 265 тысяч
        # Москва             | 1 039
        # Варшава            | 683
        # Одесса             | 404
        # Лодз               | 314
        # Рига               | 282
        # Киев               | 248
        # Харьков            | 174
        # Тифлис             | 160
        # Ташкент            | 156
        # Вильна             | 155
        # Саратов            | 137
        # Казань             | 130
        # Ростов на Дону     | 119
        # Тула               | 115
        # Астрахань          | 113
        # Екатеринбург       | 113
        # Баку               | 112
        # Кишинёв            | 108
        # Гельсингф          | 101
        # Николаев           | 92
        # Минск              | 91
        # Нижний Новгород    | 90
        # Самара             | 90
        # Коканд             | 81
        # Воронеж            | 81
        # Курск              | 76
        # Оренбург           | 72
        # Ярославль          | 72
        # Ковна              | 71
        # Орёл               | 70
        # Двинск             | 70
        # Белосток           | 66
        # Житомир            | 66
        # Витебск            | 66
        # Екатеринодар       | 66
        # Ревель             | 65
        # Либава             | 64
        # Елизаветоград      | 61
        # Пенза              | 60
        # Кронштат           | 60
        # Херсон             | 59
        # Царицин            | 55
        # Самарканд          | 55
        # Иваново-Вознесенск | 54
        # Полтава            | 54
        # Севастополь        | 54
        # Тверь              | 54
        # Бердячев           | 53
        # Томск              | 52
        # Новочеркасск       | 52
        # Иркутск            | 51
        # Таганрог           | 51
        # Люблин             | 50
        # Калуга             | 50
        # Всего 57 городов   | 8.136 млн
    # Мегаполисы античности:
        # 3300 год до н.э. Урук. 40k жителей, >200 гектар, 200 жителей/гектар
        # 2700 год до н.э. Урук. 50-150k жителей, 9 км стены, 4.5 кв.км, 110-330 чел/га
        # 2000 год до н.э. Ур. 250k жителей, 300 гектар, 833 жителей/гектар
        # 20 век до н.э. Вавилон. 350k жителей, 88 км стены, 484 кв.км (Геродот)
        # 15 век до н.э. Паталипутра. 500k жителей
        # 8 век до н.э. Ниневия. 170k жителей, 150 км границ, 1800 кв.км
        # 5 век до н.э. Карфаген. 300-700k жителей, 20 кв.км, 250 жителей/гектар (Геродот)
        # 5 век до н.э. Афины. 100k жителей
        # 1 век н.э. Александрия. 700k жителей
        # 2 век н.э. Рим. 0.5-1.5 млн жителей
        # 6 век н.э. Теотиуакан. 250k жителей
        # 9 век н.э. Багдад. 700k жителей
        # 9 век н.э. Чанъань. 800k жителей
        # 14 век н.э. Теночтитлан. 250k жителей
        # 14 век н.э. Тикаль. 100k жителей
        # 14 век н.э. Куско. 200k жителей
        # 1611 год н.э. Потоси. 150k жителей
        # 17 век н.э. Лима. >100k жителей
        # 16 век н.э. Нанкин. >1 млн жителей
        # 18 век н.э. Пекин. 1-3 млн жителей
        # 18 век н.э. Рио-де-Жанейро. 100k жителей
        # Плотность городов Древней руси -- 110 человек/гектар
        # Плотность населения городов 13 века -- 100-160 человек/гектар
        # "Крупные города прединдустриальной эры" Zdzisław Sirojć
        # https://ru.wikipedia.org/wiki/Население_Древней_Руси

#----
# Железнодорожные здания (оборудование):
    # Норильская железная дорога (2006 год)
        # 333 километра – развернутой длины путей;
        # 83 локомотивные секции серии 2ТЭ 116, ТЭМ-7А, ТЭМ-2, ТЭМ-15, ТЭМ-18;
        # 2.5 тысячи вагонов различной спецификации;
        # 15 единиц путевых машин;
        # 5 кранов на ж.д. ходу;
        # 16 дрезин и мотовозов;
        # 7 снегоочистителей, в том числе 3 снегоочистителя «Байльхак», не имеющих аналогов в России;  
        # 9 подразделений, с общей численностью 1918 человек (5.8 рабочих/километр, 0.23 нормо-часа/ткм)
        # 198 производственных зданий, общей площадью 6500 м² (33 м²/здание, 20 м²/км, 3.4 м²/рабочий);
        # семь служб и цехов (цех подвижного состава, Дудинский железнодорожный цех, службы эксплуатации, движения, пути, сигнализации и связи, энергосилового хозяйства).
        # https://ljsear.ch/savedcopy?post=549209620
        # https://taimyr.livejournal.com/21654.html

metadict_detail['Железнодорожный вокзал (эксплуатация)'] = {
        # TODO: Железнодорожный вокзал. Допиливай.
        # Вокзалы и депо в мегаполисах и окружных городах.
        #
        'Городское жильё, общежитие, железнодорожное (квадратный метр)':1200,
        }

metadict_detail['Железнодорожная станция (эксплуатация)'] = {
        # TODO: Железнодорожная станция. Допиливай.
        # 15-30 километров пути -- 36 путевых смотрителей (3 поста) + ремонтники и работники станции. 
        # Железнодорожный околоток. Мастерская, депо.
        # https://ru.wikisource.org/wiki/ЭСБЕ/Депо,_на_железной_дороге
        # https://ru.wikisource.org/wiki/ЭСБЕ/Дистанция,_участок_пути
        'Городское жильё, общежитие, железнодорожное (квадратный метр)':600,
        }

metadict_detail['Железнодорожный пост (эксплуатация)'] = {
        # TODO: Железнодорожный пост. Допиливай.
        # 5-10 километров пути -- 12 путевых смотрителей.
        }

#----
# Железнодорожные здания (строительство):

metadict_model['Железнодорожный вокзал (строительство)'] = {
        # TODO: Железнодорожный вокзал. Допиливай.
            # Хватит заглушек, допиливай!
            # Пили устройство, пили оборудование.
        # Участки под станции приблизительно имеют площадь:
            # I класса — 22 гектара,
            # II класса — 20 га
            # III класса — 17 га
            # IV класса — 13 га
        # Длина станционных площадок на прямых частях пути должна быть не менее:
            # в местности ровной
            # — 850 до 1100 метров для станций I и II классов,
            # - 640 метров для станций III и IV классов
            # - 430 метров для полустанций;
            # В местности трудной:
            # - 640 метров для станций I и II классов, 
            # - 320 метров для станций III класса
            # - 210 метров для станций IV класса
        # Внутренние помещения для пассажирского здания:
            # I класса — 680 м²
            # II класса — 450 м²
            # III класса — 250 м²
            # IV класса — 200 м²
            # полустанции — 135 м²
            # Половина этих помещений -- для пассажиров
        # Товарные платформы:
            # Товарные платформы вдоль ж.д. пути, ширина -- 7.5 метров, деревянный пол или мостовая.
            # Пакгауз (крытая товарная платформа) -- 1 кв.метр на каждые 40 000 кг/год хлебных грузов.
            # https://ru.wikisource.org/wiki/ЭСБЕ/Станции_железных_дорог
            # https://ru.wikisource.org/wiki/ЭСБЕ/Мастерские_железнодорожные
        }

metadict_model['Железнодорожная станция (строительство)'] = {
        # TODO: Железнодорожная станция. Допиливай.
        }

metadict_model['Железнодорожный пост (строительство)'] = {
        # TODO: Железнодорожный пост. Допиливай.
        }

#----
# Почта:

metadict_detail['Почтовые помещения, приёмная (квадратный метр)'] = {
        # TODO: Почта. Допиливай помещения.
        }

#----
# Библиотеки:

metadict_detail['Библиотечные помещения, приёмная (квадратный метр)'] = {
        # TODO: Библиотека. Допиливай помещения.
        }

#----
# Общежития (обобщение):

metadict_model['Городское жильё, общежитие, школьное (квадратный метр)'] = {
        'Городское жильё, общежитие (квадратный метр)':1,
        }

metadict_model['Городское жильё, общежитие, железнодорожное (квадратный метр)'] = {
        'Городское жильё, общежитие (квадратный метр)':1,
        }

metadict_model['Городское жильё, общежитие, туристическое (квадратный метр)'] = {
        'Городское жильё, общежитие (квадратный метр)':1,
        }

#----
# Общежития:

metadict_model['Городское жильё, общежитие (квадратный метр)'] = {
        'Городское жильё, общежитие (эксплуатация) (квадратный метр)':1,
        'Городское жильё, общежитие (строительство) (квадратный метр)':1 / 50,
        }

metadict_army['Городское жильё, общежитие (эксплуатация) (квадратный метр)'] = {
        'Городской двор, общежитие (эксплуатация)':1 / 600,
        '+Городское жильё, общежитие (доступно/квадратный метр)':1,
        }

metadict_army['Городское жильё, общежитие (строительство) (квадратный метр)'] = {
        'Городской двор, общежитие (строительство)':1 / 600,
        '-Жильё (строительство) (квадратный метр)':1,
        }

metadict_model['Городской двор, общежитие (эксплуатация)'] = {
        # TODO: Городской двор. Здесь можно присобачить уборку.
        'Отделка трёхэтажного общежития':1,
        '+Площадь приусадебного участка, город (квадратный метр)':40 * 40,
        }

metadict_model['Городской двор, общежитие (строительство)'] = {
        'Трёхэтажное общежитие (смета)':1,
        }

#----
# Школы (упрощение):

metadict_army['Школьное помещение, класс, начальная школа (квадратный метр)'] = {
        'Школьное помещение, класс (квадратный метр)':1,
        }

metadict_army['Школьное помещение, аудитория, средняя школа (квадратный метр)'] = {
        'Школьное помещение, аудитория (квадратный метр)':1,
        }

metadict_army['Школьное помещение, аудитория, профессиональная школа (квадратный метр)'] = {
        'Школьное помещение, аудитория (квадратный метр)':1,
        }

metadict_army['Школьное помещение, аудитория, университет (квадратный метр)'] = {
        'Школьное помещение, аудитория (квадратный метр)':1,
        }

#----
# Школы (начальные):

metadict_model['Школьное помещение, класс (квадратный метр)'] = {
        'Школьное помещение, класс (эксплуатация) (квадратный метр)':1,
        'Школьное помещение, класс (строительство) (квадратный метр)':1 / 30,
        }

metadict_army['Школьное помещение, класс (эксплуатация) (квадратный метр)'] = {
        'Сельский двор, школа (эксплуатация)':1 / 80,
        }

metadict_army['Школьное помещение, класс (строительство) (квадратный метр)'] = {
        'Сельский двор, школа (строительство)':1 / 80,
        }

metadict_model['Сельский двор, школа (эксплуатация)'] = {
        'Отделка одноэтажной школы':1,
        'Отделка дощатого сарая':1,
        'Отделка дощатой уборной':1,
        '+Площадь приусадебного участка, село (квадратный метр)':40 * 50,
        }

metadict_model['Сельский двор, школа (строительство)'] = {
        'Одноэтажная школа (смета)':1,
        'Дощатый сарай (смета)':1,
        'Дощатая уборная (смета)':1,
        }

#----
# Школы (городские):

metadict_model['Школьное помещение, аудитория (квадратный метр)'] = {
        'Школьное помещение, аудитория (эксплуатация) (квадратный метр)':1,
        'Школьное помещение, аудитория (строительство) (квадратный метр)':1 / 50,
        }

metadict_army['Школьное помещение, аудитория (эксплуатация) (квадратный метр)'] = {
        'Городской двор, школа (эксплуатация)':1 / 600,
        }

metadict_army['Школьное помещение, аудитория (строительство) (квадратный метр)'] = {
        'Городской двор, школа (строительство)':1 / 600,
        }

metadict_model['Городской двор, школа (эксплуатация)'] = {
        'Отделка трёхэтажной школы':1,
        '+Площадь приусадебного участка, город (квадратный метр)':40 * 100,
        }

metadict_model['Городской двор, школа (строительство)'] = {
        'Трёхэтажная школа (смета)':1,
        }

#----
# Амбулатории:

metadict_model['Больничное помещение, кабинет (квадратный метр)'] = {
        'Больничное помещение, кабинет (эксплуатация) (квадратный метр)':1,
        'Больничное помещение, кабинет (строительство) (квадратный метр)':1 / 50,
        }

metadict_army['Больничное помещение, кабинет (эксплуатация) (квадратный метр)'] = {
        'Городской двор, больница (эксплуатация)':1 / 600,
        }

metadict_army['Больничное помещение, кабинет (строительство) (квадратный метр)'] = {
        'Городской двор, больница (строительство)':1 / 600,
        }

#----
# Больницы:

metadict_model['Больничное помещение, палаты (квадратный метр)'] = {
        'Больничное помещение, палаты (эксплуатация) (квадратный метр)':1,
        'Больничное помещение, палаты (строительство) (квадратный метр)':1 / 50,
        }

metadict_army['Больничное помещение, палаты (эксплуатация) (квадратный метр)'] = {
        'Городской двор, больница (эксплуатация)':1 / 600,
        }

metadict_army['Больничное помещение, палаты (строительство) (квадратный метр)'] = {
        'Городской двор, больница (строительство)':1 / 600,
        }

metadict_model['Городской двор, больница (эксплуатация)'] = {
        # Длинное здание 40x10 метров, 120 больничных коек.
            # Взлётная полоса для планёров и подъездная дорога.
            # Сад 3000 кв.метров (25 кв.метров на больного)
        'Отделка трёхэтажной больницы':1,
        '+Площадь приусадебного участка, город (квадратный метр)':40 * 100,
        }

metadict_model['Городской двор, больница (строительство)'] = {
        'Трёхэтажная больница (смета)':1,
        }

#----
# Городской двор (богатый):

metadict_model['Городское жильё, особняк (квадратный метр)'] = {
        # Городские дома обновляются с периодом в 50 лет:
        'Городское жильё, особняк (эксплуатация) (квадратный метр)':1,
        'Городское жильё, особняк (строительство) (квадратный метр)':1 / 50,
        }

metadict_army['Городское жильё, особняк (эксплуатация) (квадратный метр)'] = {
        'Городской двор, особняк (эксплуатация)':1 / 400,
        }

metadict_army['Городское жильё, особняк (строительство) (квадратный метр)'] = {
        'Городской двор, особняк (строительство)':1 / 400,
        '-Жильё (строительство) (квадратный метр)':1,
        }

metadict_model['Городской двор, особняк (эксплуатация)'] = {
        'Отделка двухэтажного особняка':1,
        '+Площадь приусадебного участка, город (квадратный метр)':40 * 100,
        }

metadict_model['Городской двор, особняк (строительство)'] = {
        # Стоимость строительства:
            # Участок земли -- x10 от площади основания дома.
            # Фундамент -- 20-40% стоимости
            # Полы, стены, потолок -- 30-40% стоимости (крыша -- 20% стоимости коробки)
            # Канализация, водопровод, отопление -- 35-40% стоимости (75% стоимость труб)
            # Фундамент — 8%
            # http://mainstro.ru/smeta-na-stroitelstvo-doma-prostoj-primer/
        # Стоимость строительства (Украина 2013 год):
            # Материалы — 4.65%
            # СТЕНЫ, ПЕРЕКРЫТИЯ, ПЕРЕГОРОДКИ, КРОВЛЯ — 27.5%
            # Материалы — 33.2%
            # РАСХОДЫ НА ИНЖЕНЕРНЫЕ СИСТЕМЫ — 7.2%
            # Материалы — 6.36%
            # РАСХОДЫ НА ОТДЕЛОЧНЫЕ РАБОТЫ — 5.64%
            # Материалы — 7.36%
            # Все работы — 48%
            # Все материалы — 52%
            # https://ibud.ua/ru/statya/smeta-na-stroitelstvo-doma-4080#Смета%20на%20строительство%20дома%20площадью%20порядка%20100%20м2
        'Двухэтажный особняк (смета)':1,
        }

#----
# Городской двор (средний класс):

metadict_model['Городское жильё, квартира (квадратный метр)'] = {
        # Городские дома обновляются с периодом в 50 лет:
        'Городское жильё, квартира (эксплуатация) (квадратный метр)':1,
        'Городское жильё, квартира (строительство) (квадратный метр)':1 / 50,
        }

metadict_model['Городское жильё, квартира (эксплуатация) (квадратный метр)'] = {
        # О жилищном строительстве в 2016 году
        # http://www.gks.ru/bgd/free/B04_03/IssWWW.exe/Stg/d01/21.htm
        'Городской двор, трёхэтажный кирпичный дом (эксплуатация)':1 / 165,
        }

metadict_model['Городское жильё, квартира (строительство) (квадратный метр)'] = {
        'Городской двор, трёхэтажный кирпичный дом (строительство)':1 / 165,
        '-Жильё (строительство) (квадратный метр)':1,
        }

metadict_model['Городской двор, трёхэтажный кирпичный дом (эксплуатация)'] = {
        # Субурдия. 100 кв.метров дом, 300 м² участок, 25 домов/гектар (125 жителей/га)
        'Отделка трёхэтажного дома':1,
        '+Площадь приусадебного участка, город (квадратный метр)':20 * 20,
        }

metadict_model['Городской двор, трёхэтажный кирпичный дом (строительство)'] = {
        'Трёхэтажный кирпичный дом (смета)':1,
        }

#----
# Городской двор (бедный):

metadict_army['Городское жильё, фахверк (квадратный метр)'] = {
        # https://ru.wikisource.org/wiki/ЭСБЕ/Жилища_рабочих
        'Городское жильё, фахверк (эксплуатация) (квадратный метр)':1,
        'Городское жильё, фахверк (строительство) (квадратный метр)':1 / 30,
        }

metadict_model['Городское жильё, фахверк (квадратный метр)'] = {
        'Городское жильё, фахверк (эксплуатация) (квадратный метр)':1,
        'Городское жильё, фахверк (строительство) (квадратный метр)':1 / 30,
        }

metadict_model['Городское жильё, фахверк (эксплуатация) (квадратный метр)'] = {
        'Городской двор, двухэтажный фахверк (эксплуатация)':1 / 114,
        }

metadict_model['Городское жильё, фахверк (строительство) (квадратный метр)'] = {
        'Городской двор, двухэтажный фахверк (строительство)':1 / 114,
        '-Жильё (строительство) (квадратный метр)':1,
        }

metadict_model['Городской двор, двухэтажный фахверк (эксплуатация)'] = {
        'Отделка двухэтажного фахверка':1,
        '+Площадь приусадебного участка, город (квадратный метр)':20 * 20,
        }

metadict_model['Городской двор, двухэтажный фахверк (строительство)'] = {
        'Двухэтажный фахверк (смета)':1,
        }

#----
# Сельский двор (богатый):

metadict_model['Сельское жильё, усадьба (квадратный метр)'] = {
        # The vernacular architecture of France
        # https://www.pierreseche.com/VAFranceEnglish.html
        'Сельское жильё, усадьба (эксплуатация) (квадратный метр)':1,
        'Сельское жильё, усадьба (строительство) (квадратный метр)':1 / 50,
        }

metadict_model['Сельское жильё, усадьба (эксплуатация) (квадратный метр)'] = {
        'Сельский двор, усадьба (эксплуатация)':1 / 400,
        }

metadict_model['Сельское жильё, усадьба (строительство) (квадратный метр)'] = {
        'Сельский двор, усадьба (строительство)':1 / 400,
        '-Жильё (строительство) (квадратный метр)':1,
        }

metadict_model['Сельский двор, усадьба (эксплуатация)'] = {
        'Отделка двухэтажной усадьбы':1,
        'Отделка дощатого амбара':1,
        'Отделка погреба ледника':1,
        'Отделка погреба овощного':2,
        'Отделка дощатого сарая':2,
        '+Площадь приусадебного участка, село (квадратный метр)':40 * 100,
        }

metadict_model['Сельский двор, усадьба (строительство)'] = {
        'Двухэтажная усадьба (смета)':1,
        'Дощатый амбар (смета)':1,
        'Погреб ледник (смета)':1,
        'Погреб овощной (смета)':2,
        'Дощатый сарай (смета)':2,
        }

#----
# Сельский двор (средний класс):

metadict_army['Сельское жильё, фахверк (квадратный метр)'] = {
        'Сельское жильё, фахверк (эксплуатация) (квадратный метр)':1,
        'Сельское жильё, фахверк (строительство) (квадратный метр)':1 / 30,
        }

metadict_model['Сельское жильё, фахверк (квадратный метр)'] = {
        'Сельское жильё, фахверк (эксплуатация) (квадратный метр)':1,
        'Сельское жильё, фахверк (строительство) (квадратный метр)':1 / 30,
        }

metadict_model['Сельское жильё, фахверк (эксплуатация) (квадратный метр)'] = {
        'Сельский двор, двухэтажный фахверк (эксплуатация)':1 / 114,
        }

metadict_model['Сельское жильё, фахверк (строительство) (квадратный метр)'] = {
        'Сельский двор, двухэтажный фахверк (строительство)':1 / 114,
        '-Жильё (строительство) (квадратный метр)':1,
        }

metadict_model['Сельский двор, двухэтажный фахверк (эксплуатация)'] = {
        'Отделка двухэтажного фахверка':1,
        'Отделка брусчатой бани':1 / 5,
        'Отделка дощатого амбара':1 / 5,
        'Отделка погреба ледника':1 / 5,
        'Отделка погреба овощного':1,
        'Отделка дощатого сарая':1,
        '+Площадь приусадебного участка, село (квадратный метр)':40 * 50,
        }

metadict_model['Сельский двор, двухэтажный фахверк (строительство)'] = {
        'Двухэтажный фахверк (смета)':1,
        'Брусчатая баня (смета)':1 / 5,
        'Дощатый амбар (смета)':1 / 5,
        'Погреб ледник (смета)':1 / 5,
        'Погреб овощной (смета)':1,
        'Дощатый сарай (смета)':1,
        }

#----
# Сельский двор (среднеземный):
    # Убрав подвал и заменив фундамент на столбчатый мы сократили расходы на 35%:
    # 1342 - 886 = 456 бит
    # Внешние постройки (сарай, погреб, 1/5 ледника):
    # 147 + 120 + 32 = 299 (выгода 157 бит)

metadict_model['Сельское жильё, каркасный дом (квадратный метр)'] = {
        # Стоимость дома (США, 2024 год): 10% строительство, 25% материалы, ~25% земля, 40% налоги и профит.
        # 98 man hours per 100 square feet of construction (10.5 нормо-часов/кв.метр)
        # amber строительство -S -E "_--"
        # Выбрано: Сельское жильё, каркасный дом (строительство) (квадратный метр) 1
        # -|- Трудозатраты (нормо-часов)............... | 60
        # _--Строительство (нормо-часов)............... | 23
        # _--Транспортировка (нормо-часов)............. | 15
        # _--Земледелие (нормо-часов).................. | 7
        # _--Текстильная промышленность (нормо-часов).. | 4
        # _--Лесная промышленность (нормо-часов)....... | 3
        # _--Химическая промышленность (нормо-часов)... | 3
        # _--Производство стройматериалов (нормо-часов) | 3
        # _--Управление (нормо-часов).................. | 2
        # https://fraser.stlouisfed.org/files/docs/publications/bls/bls_1755_1972.pdf
        # Сельские дома обновляются раз в 30 лет:
        'Сельское жильё, каркасный дом (эксплуатация) (квадратный метр)':1,
        'Сельское жильё, каркасный дом (строительство) (квадратный метр)':1 / 30,
        }

metadict_model['Сельское жильё, каркасный дом (эксплуатация) (квадратный метр)'] = {
        # Учитываются только жилые комнаты:
        'Сельский двор, каркасный дом (эксплуатация)':1 / 92,
        }

metadict_model['Сельское жильё, каркасный дом (строительство) (квадратный метр)'] = {
        'Сельский двор, каркасный дом (строительство)':1 / 92,
        '-Жильё (строительство) (квадратный метр)':1,
        }

metadict_model['Сельский двор, каркасный дом (эксплуатация)'] = {
        'Отделка одноэтажного дома':1,
        'Отделка брусчатой бани':1 / 5,
        'Отделка дощатого амбара':1 / 5,
        'Отделка погреба ледника':1 / 5,
        'Отделка погреба овощного':1,
        'Отделка дощатого сарая':1,
        'Отделка дощатой уборной':1,
        '+Площадь приусадебного участка, село (квадратный метр)':40 * 50,
        }

metadict_model['Сельский двор, каркасный дом (строительство)'] = {
        # TODO: ветряки, маховики и водонапорные башни для ферм.
            # Ветряк (1/5 хозяйств) --> маховик --> насос, лебёдка, молотилка
            # Ветряк, 3.3 кВт, 3 м ротор, 6 м мачта, 500 кг сталь, 50 МДж маховик = 200 бит
            # 3.3 кВт, 5% КПД (5-7 часов 7-10 м/с) = 14 МДж/день = 5.2 ГДж/год
            # 5.2 ГДж/год = 20-30 бит 15-кВт пегас (54 МДж/час, 0.2-0.3 бит/час)
            # 5.2 ГДж/год = 10 бит/год (окупаемость за 20 лет)
            # 14 МДж/день = 210 тонн на 6 метров подъёма
            # 14 МДж/день = 5.2 коне-часов (0.75 кВт*час)
            # (14 MJ * 90%) / (10 * 1000 N) / 6 meter = 210 тонн
            # 1 Дж = 1 Н × м (10 Ньютонов ускорение свободного падения)
            # Вместо маховика можно использовать сжатый воздух. Ветряк крутит компрессор.
            # 10 метров трубы от водопровода, выдерживает десятки атмосфер
            # Чугунная труба 150-мм = 18 литров/метр = 40 кг/метр
            # - 500 Атмосфер, 50 МПа/литр = 50 килоджоулей/литр (1 кг хорошего баллона)
            # - 50 Атмосфер, 5 МПа/литр = 5 килоджоулей/литр (в 1000 раз хуже маховика)
            # - 5 Атмосфер, 0.5 МПа/литр = 0.5 килоджоулей/литр (труба обмотана изолентой)
            # Чугунная труба 10×0.150 метров 400 кг = 0.18 м³ при 5 МПа = 0.9 МДж (хрень)
            # Баллон сжатого воздуха 200 кг = 0.2 м³ при 50 МПа = 9 МДж (дорогая хрень)
        'Каркасный дом (смета)':1,
        'Брусчатая баня (смета)':1 / 5,
        'Дощатый амбар (смета)':1 / 5,
        'Погреб ледник (смета)':1 / 5,
        'Погреб овощной (смета)':1,
        'Дощатый сарай (смета)':1,
        'Дощатая уборная (смета)':1,
        }

#----
# Сельский двор (североморский):
    # Крестьянская усадьба
    # - двор -- примыкает к дому, огорожен с 3 остальных сторон. Иногда двор -- крытая пристройка к дому. Иногда двухэтажная (въезд на второй этаж по полозьям, для телеги), где наверху сельскохозяйственный инвентарь и корм, а внизу пристройка для скота. Обычно двор мостился. Передние ворота на улицу, задние на усадьбу.
    # - кладовая (клеть) -- для наиболее ценного имущества. Срубное, неотапливаемое помещение. Под одной крышей с избой. Вход в сенях, напротив входа в избу. У бедных крестьян клеть заменяли амбары.
    # - выход (кладовая перед домом) -- полуземлянка наподобие погреба, перед домом. Основание 10 м² сруб, на 1/3 опущенный в землю. Иногда заменяли клеть.
    # - камора (кладовая отдельным срубом) -- на невысоких столбиках, с соломенной крышей. Навес перед входом.
    # - амбар (житница) -- зерно. Сруб из прочных брёвен, на столбах, иногда в два этажа. Наверху ценное семенное зерно и пшеница. Амбар запирался прочным замком. В отдалении от жилища, чтобы защитить от пожаров. Улицы для амбаров в отдельных деревнях. На 142 дома 56 амбаров.
    # - сарай -- для сена и упряжи. Для соломы, мякины, земледельческих орудий и хозяйственного инвентаря. Второй этаж двора часто заменял сарай. Стены из хвороста, крыт соломой. Иногда просто навес.
    # - овин -- сушка снопов хлеба. В северных губерниях, где естественная сушка затруднена. Из-за пожаров овины строили за деревней.
    # - рига -- сушка снопов. Постройка с печью.
    # - гумно -- участок усадьбы для обмолота зерна. Иногда крытый. На севере (Архангельская губерния) не успевали обмолачивать хлеб из-за короткого лета, оставляли в стогах.
    # - баня -- небольшой сруб, крытый тёсом, чаще соломой. Иногда в землянке. Предбанник из досок, плетня, тонких жердей. Печь из камня, топили по-чёрному. Бани вместе с овинами выносились за деревню, отдельной улицей.
    # - колодец -- трудоёмкое дело, яма до уровня грунтовых вод, стенки укреплены срубом. Для неглубоких колодцев труба из ствола дерева. Один-два колодца на деревню при глубоком водоносном слое, в каждом дворе при неглубоком. Колодцы с журавлём (противовес поднимает ведро). Для глубоких вод колодцы с воротом и колесом.
    # - изгородь -- огораживает усадьбу от скота.
    # народы-общество/хозяйство-и-быт-русских-крестьян-1959.pdf
    # стр. 148 хозяйственные постройки

metadict_model['Сельское жильё, изба (квадратный метр)'] = {
        # Сельские дома обновляются раз в 30 лет:
        'Сельское жильё, изба (эксплуатация) (квадратный метр)':1,
        'Сельское жильё, изба (строительство) (квадратный метр)':1 / 30,
        }

metadict_model['Сельское жильё, изба (эксплуатация) (квадратный метр)'] = {
        'Сельский двор, изба (эксплуатация)':1 / 105,
        }

metadict_model['Сельское жильё, изба (строительство) (квадратный метр)'] = {
        'Сельский двор, изба (строительство)':1 / 105,
        '-Жильё (строительство) (квадратный метр)':1,
        }

metadict_model['Сельский двор, изба (эксплуатация)'] = {
        'Отделка глинобитной хаты':1,
        'Отделка брусчатой бани':1 / 2,
        'Отделка дощатого амбара':1 / 5,
        'Отделка погреба ледника':1 / 5,
        'Отделка погреба овощного':1,
        'Отделка дощатого сарая':1,
        'Отделка дощатой уборной':1,
        '+Площадь приусадебного участка, село (квадратный метр)':40 * 50,
        }

metadict_model['Сельский двор, изба (строительство)'] = {
        # Типы дворовых усадеб и связей жилых и хозяйственных построек (19 век)
            # https://www.gumer.info/bibliotek_Buks/History/milov/01_9_clip_image006_0000.gif
            # https://www.gumer.info/bibliotek_Buks/History/milov/01_9_clip_image009.gif
        'Брусчатый дом (смета)':1,
        'Брусчатая баня (смета)':1 / 2,
        'Дощатый амбар (смета)':1 / 5,
        'Погреб ледник (смета)':1 / 5,
        'Погреб овощной (смета)':1,
        'Дощатый сарай (смета)':1,
        'Дощатая уборная (смета)':1,
        }

#----
# Сельский двор (южноморский):

metadict_model['Сельское жильё, хата (квадратный метр)'] = {
        'Сельское жильё, хата (эксплуатация) (квадратный метр)':1,
        'Сельское жильё, хата (строительство) (квадратный метр)':1 / 30,
        }

metadict_model['Сельское жильё, хата (эксплуатация) (квадратный метр)'] = {
        'Сельский двор, хата (эксплуатация)':1 / 105,
        }

metadict_model['Сельское жильё, хата (строительство) (квадратный метр)'] = {
        'Сельский двор, хата (строительство)':1 / 105,
        '-Жильё (строительство) (квадратный метр)':1,
        }

metadict_model['Сельский двор, хата (эксплуатация)'] = {
        'Отделка глинобитной хаты':1,
        'Отделка брусчатой бани':1 / 2,
        'Отделка дощатого амбара':1 / 5,
        'Отделка погреба ледника':1 / 5,
        'Отделка погреба овощного':1,
        'Отделка дощатого сарая':1,
        'Отделка дощатой уборной':1,
        '+Площадь приусадебного участка, село (квадратный метр)':40 * 50,
        }

metadict_model['Сельский двор, хата (строительство)'] = {
        'Глинобитная хата (смета)':1,
        'Брусчатая баня (смета)':1 / 5,
        'Дощатый амбар (смета)':1 / 5,
        'Погреб ледник (смета)':1 / 5,
        'Погреб овощной (смета)':1,
        'Дощатый сарай (смета)':1,
        'Дощатая уборная (смета)':1,
        }

#----
# Обслуживание жилых помещений.
# model_buildning_cities --> эксплуатация --> Отделка --> model_buildning --> Площадь

#----
# Дома (склады)

metadict_detail['+Площадь сарая (квадратный метр)'] = {
        '++Площадь помещений, внутренних (квадратный метр)':1,
        '++Площадь складских помещений (квадратный метр)':1,
        }

metadict_detail['+Площадь амбара (квадратный метр)'] = {
        '++Площадь помещений, внутренних (квадратный метр)':1,
        '++Площадь складских помещений (квадратный метр)':1,
        }

metadict_detail['+Площадь полуподвала (квадратный метр)'] = {
        '++Площадь помещений, подземных (квадратный метр)':1,
        '++Площадь складских помещений (квадратный метр)':1,
        }

metadict_detail['+Площадь погреба (квадратный метр)'] = {
        '++Площадь помещений, подземных (квадратный метр)':1,
        '++Площадь складских помещений (квадратный метр)':1,
        }

metadict_detail['+Площадь ледника (квадратный метр)'] = {
        '++Площадь помещений, подземных (квадратный метр)':1,
        '++Площадь складских помещений (квадратный метр)':1,
        }

metadict_detail['+Площадь чердака (квадратный метр)'] = {
        '++Площадь помещений, внутренних (квадратный метр)':1,
        '++Площадь складских помещений (квадратный метр)':1,
        }

#----
# Дома (жилища)

metadict_detail['+Площадь жилых помещений (квадратный метр)'] = {
        # Уборка: 12 раз в год, каждый месяц. 60 раз в год, каждую неделю.
        # Генеральная уборка (spring cleaning) -- если зимой отапливали углём.
        '_-Влажная уборка жилых помещений (квадратный метр)':12,
        '_-Сухая уборка жилых помещений (квадратный метр)':60,
        '-Освещение помещений, жилых (требуется/квадратный метр)':1,
        '++Площадь помещений, внутренних (квадратный метр)':1,
        }

metadict_detail['+Площадь хозяйственных помещений (квадратный метр)'] = {
        # Кухни, душевые, уборные частных домов.
        '_-Влажная уборка хозяйственных помещений (квадратный метр)':12,
        '_-Сухая уборка хозяйственных помещений (квадратный метр)':60,
        '-Освещение помещений, хозяйственных (требуется/квадратный метр)':1,
        '++Площадь помещений, внутренних (квадратный метр)':1,
        }

metadict_detail['+Площадь общественных помещений (квадратный метр)'] = {
        # Коридоры, столовые, школьные классы, общественные бани.
        '_-Влажная уборка общественных помещений (квадратный метр)':60,
        '_-Сухая уборка общественных помещений (квадратный метр)':360,
        '-Освещение помещений, общественных (требуется/квадратный метр)':1,
        '++Площадь помещений, внутренних (квадратный метр)':1,
        }

#----
# Дома (склады)

metadict_detail['++Площадь складских помещений (квадратный метр)'] = {
        '_-Сухая уборка складских помещений (квадратный метр)':12,
        '-Освещение помещений, складских (требуется/квадратный метр)':1,
        }

#----
# Дома (усадьба)

metadict_detail['+Площадь приусадебного участка, город (квадратный метр)'] = {
        # TODO: Площадь приусадебного участка. Здесь можно учесть улицы, площади, много всего.
            # Отсюда идём в генеральные планы городов.
            # Кварталы селений и городов. Их обслуживание.
        '|-Усадьба, город (квадратный метр)':1,
        }

metadict_detail['+Площадь приусадебного участка, село (квадратный метр)'] = {
        '|-Усадьба, село (квадратный метр)':1,
        }

#----
# Дороги (building_roads)

metadict_detail['+Площадь грунтовой дороги (квадратный метр)'] = {
        '|-Дороги (квадратный метр)':1,
        }

metadict_detail['+Площадь железной дороги (квадратный метр)'] = {
        '|-Дороги (квадратный метр)':1,
        }

metadict_detail['+Площадь шоссейной дороги (квадратный метр)'] = {
        '|-Дороги (квадратный метр)':1,
        }

#----
# Площадь поселений:

metadict_detail['|-Усадьба, село (квадратный метр)'] = {
        '|----Заселённые земли, село (гектар)':1 / 10000,
        '|--Усадьбы (гектар)':1 / 10000,
        }

metadict_detail['|-Усадьба, город (квадратный метр)'] = {
        '|----Заселённые земли, город (гектар)':1 / 10000,
        '|--Усадьбы (гектар)':1 / 10000,
        }

metadict_detail['|-Дороги (квадратный метр)'] = {
        '|----Заселённые земли, село (гектар)':1 / 10000,
        '|--Дороги (гектар)':1 / 10000,
        }

#----
# Планировка городов (генеральные планы):
# TODO: Планировка городов. усадьба --> квартал --> городской план
# . - поля (50x50 метров, 1/4 гектара)
# ---- - грунтовки (шириной 5-15 метров)
# ==== - шоссе, мостовые (шириной 15-30 метров)
# hhhh - пригороды (700 000 кв.метров, 1200 домов)
# HHHH - кварталы (600 000 кв.метров, до 3000 домов)
# mmmm - рынки, ярмарочные площади (40 000 кв.метров)
# MMMM - магазины, торговые ряды (10 000 кв.метров)
# !!!! - центральная площадь (15 000 кв.метров)
# CCCC - культурные здания (25 000 кв.метров)
# FFFF - фабрики, мануфактуры (80 000 кв.метров)
# pppp - пристани, пирсы, порты (500 метров, до 20 барж)
# ssss - амбары, элеваторы, овощехранилища (100 000 кв.метров)
# SSSS - товарные склады, промышленные склады (100 000 кв.метров)
# &1 - водопровод (водозаборная станция)
# &2 - водопровод (водоочистная станция)
# &3 - водопровод (водонапорная станция)
# &4 - канализация (стокоподъёмная станция)
# &5 - канализация (оросительные каналы)
# ^^^ - станционные пути, вагонная станция
# ^ - железная дорога (Филлидельфия-Мэйнхеттен)
# # - взлётная полоса (для пегасьих планёров)
# R - водохранилище, река (водосбор 10 000 км², 800 мм/год, коэффициент стока 0.25 -- 64 м³/секунду)
# ]&- плотина с ГЭС (высота сброса -- 5 метров, механическая энергия: 2.2 МВт)
# http://wikimapia.org/#lang=ru&lat=54.434140&lon=21.012661&z=17&m=bs&show=/14801861/ru/Правдинская-ГЭС-3
# RRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRR]...^...........
# RRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRR]RRR^RRRRRRRRRRR
# .&1.RRRRRRRRRRRRRRppppRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRpppppp]&..^........&4.
# ===============================================================^===========
# |hhhhhhhhhh|hhhhhhssmm=HHHH=HHHH=HHHH=HHHH=HHHH=HHHH=FFFF=FFFFF^^^SSSSS.hh|
# |..........|......ssmm=H,,H=H,,H=HHHH=HHHH=HHHH=HHHH=FFFF=FFFFF^^^SSSSS...|
# |..........|......ssmm=H,,H=H,,H=HHHH=HHHH=HHHH=HHHH=FFFF=FFFFF^^^SSSSS...|
# |hhhhhhhhhh|hhhhhhssmm=HHHH=HHHH=HHHH=HHHH=MMMM=HHHH=FFFF=FFFFF^^^SSSSS.hh|
# ----------------------=========================================^^^---------
# |hhhhhhhhhh|hhhhhhhhhh=HHHH=HHHH=CCCC=HHHH=HHHH=HHHH=ssss=#####^^^hhhhhhhh|
# |..........|.........h=H,,H=H,,H=C!!C=HHHH=HHHH=HHHH=ssss=h...#^^^........|
# |..........|.........h=H,,H=H,,H=C!!C=HHHH=HHHH=HHHH=ssss=h...#^^^........|
# |hhhhhhhhhh|hhhhhhhhhh=HHHH=HHHH=C!!C=HHHH=HHHH=HHHH=ssss=hhh.#^^^hhhhhhhh|
# ----------------------====================================----#^^^---------
# |hhhhhhhhhh|hhhhhhhhhh=HHHH=HHHH=HHHH=HHHH=HHHH=HHHH=mmss=hhh.#^^^hhhhhhhh|
# |..........|.........h=H,,H=H,,H=H,,H=H,,H=H,,H=H,,H=mmss=h...#^^^........|
# |..........|.........h=H,,H=H,,H=H,,H=H,,H=H,,H=H,,H=mmss=h...#^^^........|
# |hhhhhhhhhh|hhhhhhhhhh=HHHH=HHHH=HHHH=HHHH=HHHH=HHHH=mmss=hhh.#^^^hhhhhhhh|
# ----------------------====================================----#^----------|
# |hhhhhhhhhh|hhhhhhhhhh=hhhhhhhhh|hhhhhhhhh|hhhhhhhhh=hhhhhhhh.#^.hhhhhhhhh|
# |..........|.........h=.........|.........|.........=.........#^..........|
# |&&2.......|.........h=.........|.........|.........=.........#^..........|
# |&&2..hhhhh|hhhhhhhhhh=&3..hhhhh|hhhhhhhhh|hhhhhhhhh=hhhhhhhh.#^.hhhhh..&5|
# ----------------------=-----------------------------=----------^-----------

#metadict_model['-Жилой квартал 50x200 метров'] = {
#        # На карте города:
#        # HHHH
#        # ====
#        # План квартала:
#        # ----------------------
#        # |HHHHHHHHHHHHHHHHHHHH|
#        # |....................|
#        # |====================|
#        # |....................|
#        # |HHHHHHHHHHHHHHHHHHHH|
#        # ======================
#        # H - сплошная застройка 3-этажками (40 домов)
#        # = - взлётная полоса для планёров (огорожена)
#        # https://en.m.wikipedia.org/wiki/Terraced_house
#        # https://upload.wikimedia.org/wikipedia/commons/7/72/Bath%2C_Somerset_Panorama_-_April_2011.jpg
#        # https://upload.wikimedia.org/wikipedia/commons/9/91/Bathwick_Hill%2C_Bath%2C_Somerset%2C_UK_-_Diliff.jpg
#        'Городской двор (строительство)':40,
#        'Городская мостовая (метр)':(50 + 200) * 2,
#        'Взлётная полоса для лёгких планёров (метр)':200,
#        }
