#----
# Заметки:
    # Постройка и эксплуатация мартеновской фабрики в Лысьвенском заводе гр. П. П. Шувалова 1901 год
    # https://elis.psu.ru/node/490058
    # https://ru.m.wikipedia.org/wiki/Лысьвенский_металлургический_завод
    # https://ru.m.wikipedia.org/wiki/Шувалов,_Павел_Петрович
    # "Народное хозяйство СССР в 1960 году (Статистический ежегодник)"
    # https://istmat.org/node/389
    # https://su90.ru/steel.html
    # https://ru.wikisource.org/wiki/ЭСБЕ/Закаливание
    # Струмилин С. Г. История черной металлургии в СССР
    # http://historic.ru/books/item/f00/s00/z0000171/st022.shtml

#----
# Фабрики (цветная металлургия)
    # Плавка свинца из руды -- английский процесс, 50-80% угля к весу руды, 5-9 часов, 4500 кг руды в сутки.
    # Для цветных металлов годится кокс с содержанием серы >20%, негодный для чёрной металлургии.
    # Амальгамация -- извлечение цветных металлов растворением руд в ртути.
    # https://ru.wikisource.org/wiki/ЭСБЕ/Свинец,_в_металлургии
    # https://ru.wikisource.org/wiki/ЭСБЕ/Свинец,_механическая_его_обработка
    # https://ru.wikisource.org/wiki/ЭСБЕ/Свинец,_как_предмет_международной_торговли
    # https://ru.wikisource.org/wiki/ЭСБЕ/Свинцовая_пайка
    # https://ru.wikisource.org/wiki/ЭСБЕ/Накладное_серебро_и_золото

#----
# Фабрики (чёрная металлургия)
    # Чугун (95-97% железо, 1.8-4% углерод и 0.5-3% кремний)
        # Углеродистая сталь (углерод 0.3-0.95%) -- 90% мирового производства
        # Нержавеющая сталь (18% хром, 8% никель) -- дороже чёрной в 3.6 раза
    # Детали техпроцессов:
        # Известняк во флюсе избавляет от серы. Сера портит стальной прокат.
        # Ферромарганец (сплав марганца и железа) в шихте решает проблему фосфора.
        # Кокс нужен для восстановления железа и как структура шихты для выдувания.
        # Содержание серы в коксе до 7-15% (>20% непригоден), влажность до 2-3%
        # 10% зольность -- 0.5-0.55 тонны кокса на тонну чугуна
        # 20% зольность -- 0.8-0.9 тонна кокса на тонну чугуна
    # Затраты кокса на производство стали:
        # 1900 год -- 1000-1500 кг/тонну стали (750 кг, Иллинойс, 60% руда)
        # 2010 год -- 340-370 кг/тонну
    # Трудозатраты и энергозатраты на производство стали:
        # Железо и медь (Рим, 285 год) -- ~450 ГДж первичной энергии (60 кг дерева на 2 кг металлов)
        # Чугун (Англия, 1720 год) -- ~600 ГДж первичной энергии (40 кг дерева --> 10 кг угля --> 1 кг чугуна)
        # Сталь (Япония, 1800 год) -- ~385 ГДж первичной энергии (20 кг дерева --> 5 кг угля --> 1 кг стали)
        # Чугун (США, 1820 год) -- ~300 ГДж первичной энергии (20 кг дерева --> 5 кг угля --> 1 кг чугуна)
        # Чугун (США, 1910 год) -- ~72 ГДж первичной энергии (5 кг дерева --> 1.2 кг угля --> 1 кг чугуна)
        # Сталь (США, 1900 год) -- 70 нормо-часов, ??? ГДж первичной энергии
        # Сталь (США, 1929 год) -- 13 нормо-часов, ??? ГДж первичной энергии
        # Сталь (США, 1982 год) -- 11.5 нормо-часов, 30 ГДж первичной энергии
        # Сталь (США, 1996 год) -- 2.5 нормо-часов, 20 ГДж первичной энергии
        # Сталь (Россия, 1999 год) -- 38 нормо-часов, 30.6-31.4 ГДж первичной энергии
        # Чугун (Украина, 2011 год) -- 52.8 нормо-часов, 24.6 ГДж (554.3 кг кокса)
        # Сталь (Россия, 2017 год) -- 29.3 нормо-часов, 23.53 ГДж первичной энергии
        # "Time Magazine, 1932"
        # "Энергия и цивилизация" Вацлав Смил
    # Металлофонд (масса металла в хозяйстве)
        # - Российская империя (1911 год, 115.5 млн) -- 35 млн тонн, 0.3 тонн/чел
        # - СССР (1924 год, 140.0 млн) -- 42 млн тонн, 0.3 тонн/чел
        # - СССР (1932 год, 162.9 млн) -- 55-60 млн тонн, 0.34-0.37 тонн/чел
        # - СССР (1941 год, 209.3 млн) -- 118-124 млн тонн, 0.56-0.59 тонн/чел
        # - СССР (1959 год, 209 млн) -- 177-186 млн тонн, 0.85-0.89 тонн/чел
        # - СССР (1973 год, 250 млн) -- 1 млрд тонн, 4 тонн/чел (96% чёрные металлы)
        # - РСФСР (1989 год) -- 1200 млн тонн, 8 тонн/человека.
        # - Россия (2016 год) -- 1.689 млрд тонн, 10.6 тонн/чел
        # - Россия (2020 год) -- 1.7 млрд тонн, 11.3 тонн/чел
        # - Россия (2023 год) -- 1.9 млрд тонн, 12.7 тонн/чел
        # - Украина (1989 год) -- 800 млн тонн, 16 тонн/человека.
        # - Украина (2013 год) -- 556 млн тонн, ?? тонн/человека (3.6% автомобили)
        # - Украина (2019 год) -- 452 млн тонн, ?? тонн/человека.
        # - США (1970 год, 203 млн) -- 2.2 млрд тонн, 10.8 тонн/чел 
        # - США (2000 год, 282 млн) -- 4 млрд тонн, 14.1 тонн/чел (5% автомобили)
        # - Китай (1990 год, 1133 млн) -- 0.68 млрд тонн, 0.6 тонн/чел
        # - Китай (2005 год, 1303 млн) -- 2.3 млрд тонн, 1.8 тонн/чел
        # - Китай (2024 год, 1425 млн) -- <16.8 млрд тонн, <11.8 тонн/чел
        # - Мир (1975 год, 4.07 млрд) -- 5.5 млрд тонн, 1.35 тонн/чел
        # - Мир (2012 год, 7.1 млрд) -- 17.3 млрд тонн, 2.44 тонн/чел
        # 37% здания, 26% инженерные сооружения, 10% автомобили и станки
        # Срок обновления металлофонда -- 35-50 лет (1.5-3% в год)
    # Металлоинвестиции (современность)
        # +1 тонна в производстве стали = 100 тонн металлофонда инфраструктуры
        # 1 км автомобильной дороги (2014 год) -- 200 тонн стали
        # 1 кв.метр жилья (2014 год) -- 0.1 тонны стали
        # 1 кубометр бетона, моноблок (0.4-0.6 кубометра/кв.метр) -- 100 кг арматуры
        # 1 кубометр бетона, железобетонные плиты (0.6-0.7 кубометра/кв.метр) -- 24-32 кг арматуры
        # 1 кубометр бетона (2013 год, Россия) -- 44.5 кг арматуры
        # 1 кубометр бетона (2013 год, Евросоюз) -- 32 кг арматуры
        # 1 кубометр бетона (2013 год, США) -- 26.6 кг арматуры
        # https://ljsear.ch/savedcopy?post=532581694
    # Металлоинвестиции (индустриализация СССР)
        # 1 тонна сортового железа = 50 тысяч тонно-километров грузооборота железной дороги
        # 1 млн. рублей сельскохозяйственной продукции -- 9 416 рублей сортового железа (100 тонн)
        # 1 млн. рублей промышленной продукции -- 17 286 рублей (200 тонн)
        # 1 млн. рублей продукции металлообработки (11k тонн) -- 269 000 рублей (3000 тонн)
        # 1 млрд. пудоверст грузоборота железных дорог -- 27 500 рублей (300 тонн, 1 тонна на 51k ткм)
        # https://ljsear.ch/savedcopy?post=654941654
        # http://history-russia.livejournal.com/3617.html
    # Утилизация стального лома (современность):
        # 90% -- автомобили
        # 90% -- стальные балки и пластины
        # 65% -- арматуры из железобетона
        # 65% -- консервные банки и жесть
        # Лом -- 1.5-3% от металлофонда в год (коэф. извлечения 0.85)
    # Минимально эффективный оборот домны:
        # 1850-е -- 5000 тонн (рынок США 0.8 млн тонн, 35 кг/чел, 160 домн)
        # 1900-е -- 20-30k тонн (рынок США 20 млн тонн, 262 кг/чел, ??? домн)
        # 1950-е -- 1 млн тонн (рынок США 140 млн тонн, 927 кг/чел, ??? домн)
        # https://upload.wikimedia.org/wikipedia/commons/8/89/USGS_Iron-Steel_1900-2014.png

metadict_detail['_Выплавка стали из скрапа и чугуна (килограмм)'] = {
        # TODO: 80% железа превращается в сталь в мартеновской печи. Но остальное плавят снова.
        # скрап-процесс, шихта состоит из стального лома и 25-45% чушкового передельного чугуна.
        # скрап-рудный процесс, шихта состоит из жидкого чугуна (55-75%), скрапа и железной руды.
        # https://ru.wikipedia.org/wiki/Мартеновская_печь
        # https://ru.wikipedia.org/wiki/Томасовский_процесс
        'Слитки чугуна (килограмм)':(0.93 * 0.30) / 0.95,
        'Лом стальной (килограмм)':(0.93 * 0.40) / 0.95,
        'Лом чугунный (килограмм)':(0.93 * 0.30) / 0.95,
        'Кокс торфяный (килограмм)':0.5 / 0.95,
        'Известняк (килограмм)':0.08 / 0.95,
        'Глина мятая (килограмм)':0.03 / 0.95,
        'Вода для промышленности (литр)':0.5,
        '+Шлаки металлургические (доступно/килограмм)':0.32,
        '_-Помол шихты на шаровой мельнице (тонн)':(0.93 + 0.08 + 0.5 + 0.5) / 0.95 / 1000,
        '_-Выплавка шихты в мартеновской печи (тонн)':(0.93 + 0.08 + 0.5) / 1000,
        '_-Разливка металла в формы рельсовыми ковшами (тонн)':1 / 1000,
        '_Мартеновская фабрика (годовой оборот)':1 / ((1000 * 50 * 260) * 2),
        }

metadict_detail['_Выплавка чугуна из руды (килограмм)'] = {
        # Мартеновская фабрика в Лысьвенском заводе
            # Две печи, два газовых и два воздушных регенератора.
            # Две печи производят по 50 тонн/сутки, 250 дней/год:
        # Одна печь: 46.5 тонн/сутки, 263 дня/год
            # - из руды восстановилось 60% имеющегося в ней железа
            # - тонна слитков -- 1.88 кубометра дров.
            # - тонна слитков -- 28.4 нормо-часов.
        # Состав шихты:
            # Компонент шихты | пудов  | тонн    | массовая доля
            # --------------- | ------ | ------- | -------------
            # руды в сумме    | 10 260 | 168.264 | 62.2%
            # флюса           | 810    | 13.284  | 4.9
            # угля древесного | 5400   | 88.56   | 0.33
            # Отношение веса шлаков к весу чугуна -- 0.32
            # https://ru.wikisource.org/wiki/ЭСБЕ/Шихта
        # На выплавку 1 кг чугуна нужно заложить 1.5 кг шихты:
            # - 0.93 кг руды (магнитного железняка с 85% Fe3O4)
            # - 0.08 кг флюса (известняка)
            # - 0.5 кг кокса / древесного угля (зольность 10%)
            # - 0.5 вода (для помола)
            # - 0.03 формы (глина мятая)
            # Останется: 0.32 кг шлаков.
        'Магнитный железняк, 85% Fe3O4 (килограмм)':0.93 / 0.95,
        'Кокс торфяный (килограмм)':0.5 / 0.95,
        'Известняк (килограмм)':0.08 / 0.95,
        'Глина мятая (килограмм)':0.03 / 0.95,
        'Вода для промышленности (литр)':0.5,
        '+Шлаки металлургические (доступно/килограмм)':0.32,
        '_-Помол шихты на шаровой мельнице (тонн)':(0.93 + 0.08 + 0.5 + 0.5) / 0.95 / 1000,
        '_-Выплавка шихты в мартеновской печи (тонн)':(0.93 + 0.08 + 0.5) / 1000,
        '_-Разливка металла в формы рельсовыми ковшами (тонн)':1 / 1000,
        '_Мартеновская фабрика (годовой оборот)':1 / ((1000 * 50 * 260) * 2),
        }

metadict_detail['_Выплавка железа из руды (килограмм)'] = {
        # TODO: уточни состав шихты и энергию для плавки на железо.
        'Магнитный железняк, 85% Fe3O4 (килограмм)':0.93 / 0.95,
        'Кокс торфяный (килограмм)':0.5 / 0.95,
        'Известняк (килограмм)':0.08 / 0.95,
        'Глина мятая (килограмм)':0.03 / 0.95,
        'Вода для промышленности (литр)':0.5,
        '+Шлаки металлургические (доступно/килограмм)':0.32,
        '_-Помол шихты на шаровой мельнице (тонн)':(0.93 + 0.08 + 0.5 + 0.5) / 0.95 / 1000,
        '_-Выплавка шихты в мартеновской печи (тонн)':(0.93 + 0.08 + 0.5) / 1000,
        '_-Разливка металла в формы рельсовыми ковшами (тонн)':1 / 1000,
        '_Мартеновская фабрика (годовой оборот)':1 / ((1000 * 50 * 260) * 2),
        }

#----
# Фабрики (капитализация)
# Строительство мартеновской фабрики:
    # Мартеновская фабрика с двумя печами (здание было рассчитано на три печи).
        # - Размеры фабрики 81×36.3 метров
        # - площадь -- около 3000 кв. метров
    # Место -- дровяная площадь в восточной части завода.
        # - грунт -- плотная красная глина.
        # - высота -- 5.3 метра над площадью завода, 
        # - высота -- 6.4 метра над горизонтом водоотводных канав.
        # - удобный наклон для подвоза дров
    # Фабрика строилась три года:
        # 1897 год:
            # - Июль -- планировка площадки
            # - 11 августа -- земляные работы, устройство фундамента под фермы.
            # - 28 сентября -- сложен последний фундамент
            # - 17 февраля -- прибыл первый вагон с частями каркаса
            # - 9 марта -- прибыли (котельщики?) для сборки и постановки ферм
            # - 15 марта -- началась работа по сборке ферм
            # - 30 марта -- поднята первая промежуточная ферма (с южного конца фабрики)
        # 1898 год:
            # - 1 июня -- готов каркас здения (с опозданием на 8 месяцев)
            # - к зиме -- закончена обшивка и окраска здания
            # - к сентябрю -- готов верхний пол (железный, на балках)
            # - зимой -- сделаны котлованы под 2 дымовые трубы
            # - 23 ноября -- начата открытая канава перед штольней для дренажа
            # - 12 декабря -- начали подземную работу по водоотводной штольне
        # 1899 год:
            # - 11 января  -- прошли 32 сажени (68 метров) от устья штольни (1/3 длины)
            # - 19 февраля -- дошли до поворота штольни
            # - весна -- готовы фундаменты под дымовые трубы
            # - 30 июня -- дошли до второго поворота, зайдя штреком к генераторам
            # - 25 июля -- наконец, подошли к зданию
            # - лето -- получены первые кирпичи от кирпичного завода в Лысьвено
            # - осень -- подняты и футлерованы обе дымовые трубы
        # 1899 год:
            # - 17 января -- печь №1 окончательно построена, начата сушка дровами
            # - 8 марта -- в печь пущен газ
            # - 11 марта -- пущена первая печь
            # - 13 мая -- пущена вторая печь
    # Планировка площадки:
        # - стоимость работ 3918 рублей (27 копеек/кубометр)
        # - вывезено 14 600 кубометров навала, мусора, шепья (5 кубометров на кв.метр площадки)
    # Фундамент:
        # - глубина фундамента -- 2.13 метра.
            # клались фундаменты на известковом растворе с прибавление портландского цемента.
            # к зиме фундаменты засыпали соломой, чтобы защитить от промерзания. Почвенная вода мешала.
    # Каркас:
        # - Стоимость -- 36 575 рублей (5.7 рубля/кв.метр здания)
        # - Вес каркаса -- 147 тонн (249 руб/тонна)
        # - 13 трёхшарнирных промежуточных ферм, на расстоянии 19 футов одна от другой (5.8 метра)
        # - поднимали каждую ферму с помощью четырёх воротов, через блоки (20-30 минут/ферма)
        # - гужевая перевозка за 25.6 км от станции Лысьва до завода.
            # Здание должно быть поставлено через 5 месяцев после заказа.
            # но только через 7 месяцев прибыл первый вагон с частями здания.
            # прибыли котельщики, инженер, техник, опытный монтёр.
            # Перед подъёмомо обе половины ферм соединялись средним шарнирным болтом.
            # Против проекта фирмы добавлена диагональная связь в плоскости крыши.
            # Соседние фермы соединялись балками.
            # После подъёма первой фермы инженер уехал, оставив только техника.
            # К концу рабочего дня все десять ферм упали.
                # Фермы лишь погнулись, исправляли домкратами.
                # расходы фирмы-установщика 2000 рублей.
                # Каркас здания от фирмы Бари:
                # http://moskva-yug.ucoz.ru/publ/2-1-0-82
    # Фасады
        # - 6 колонн.
    # Крыша:
        # - Кровельное железо -- 15.8 тонн, 5 кг/кв.метр
    # Обшивка стен:
        # - Квадратные бруски (111×111-мм) между фермами. Такие же поперечины и раскосы.
        # - Всё это зашито изнутри кровельным железом.
    # Окна:
        # - С одной стороны фабрики сплошная панель стеклянных рам.
        # - Со стороны печей такая же панель (но в два света)
        # - В концевых фасадах по 7 отдельных окон.
    # Пол:
        # - верхний жёсткий (железный) пол. Стоил 0.21 рубля/килограмм
            # кроме стоимости привоза из Нижнего Новгорода
        # - железные прокатные двутавровые балки (380 мм вышиной)
            # проложены в три ряда вдоль печей, на чугунные колонки.
        # - чугунные колонки крестообразного сечения (358.6 кг/штука стоят на 5.7 одна от другой)
            # стоят на чугунных плитках, уложенных на каменных столбах.
        # - поперечные двутавровые баки (200 мм вышиной) через 0.914 метра одна от другой.
            # опираются одними концами на продольные стенки регенераторов
        # - листы котельного железа, толщина 4.76 мм
            # швы листов укреплены снизу планками
            # зацеп потайной, пол ровный
    # Окраска:
        # - металлические части здания выкрашены суриком свинцовым за 2 раза.
        # - деревянные бруски (и трубы) выкрашеным мумией
        # - листы обшивки выкрашены сажей
    # Фундамент печей:
        # - печь и генераторы опущены на 3.2 метра в землю.
            # заключение печей в бетонный ящик -- дорого и не вполне надёжно
            # почвенные воды опасны, поэтому делали дренаж.
    # Водоотвод, дренаж:
        # - устройство дренажной канавы и штолен -- 2100 рублей
        # - фабрика оружена с трёх сторон (150+ метров длины)
        # - подземной штольней ниже основания печей (3.2+ метра)
        # - высота штольни 1.6 метра ширина 1.4 метра
            # уклон 2 тысячных (0.057 градуса)
            # работа шла непрерывно, в три смены
            # с 12 декабря по 23 июля (около 200 дней)
        # - от печи №1 спущена по канаве дренажная труба (старый кипятильник)
            # - диаметром 330 мм, длина 5.1 метра из 16 мм железа.
                # Трубу со штольней соединили за 6 дней.
                # работал подросток, выбирая землю,
                # трубу заточили и забивали вперёд.
        # - штольню решили заложить крупными кусками мартеновского шлака с промежутками для пропуска воды
        # - было несколько обвалов боков и потолка штольни
            # - поначалу крепи ставили на расстоянии 6 вершков (0.267 метра)
            # - этого оказалось недостатовно. Промежутки забили досками и вели уже сплошную крепь.
        # - дренаж даёт в устье около 6 вёдер/минуту (72 литра/минуту, 1.2 литра/секунду)
            # - дренаж работал отлично
    # Рельсовые пути:
        # - 1071 метра рельсов. 7 килограмм/метр (0.11 рубля/кг)
            # Стрелки американские. Поворотные круги чугунные, местной работы.
        # - краны передвигаются по рельсам 24 килограмма/метр
            # - шпалы длиной 2.84 метра
            # - балластный слой 0.36 метра
                # подбивают балласт не чаще раза в два месяца работы
        # - ковши двигались по рельсам 32 килограмма/метр
            # - рельсы уложены на чугунные башмаки
    # Прочие здания:
    # Кирпичная конторка в два этажа
        # - Размеры 6.4×5.3 метра (34 кв.метра)
        # верхняя комната для технического персонала (выход на верхний железный пол, к печам)
        # нижняя комната для отдыха и приёма пищи рабочими фабрики. плита для разогрева еды
    # Помещение для надзирателя и его помощника.
        # - столбы, зашитые с обеих сторон тёсом 
        # - в промежутке пильная мука (опилки) с алебастром
        # - весы на 200 пудов (3.26 тонны) для взвешивания слитков
    # Фабрика для измельчения материалов
        # - две пары бегунов на солидных каменных фундаментах, сложенных из цемента
        # - крытый коридор к печам, рельсовый путь для вагонеток (60 метров пути)
        # - деревянные стойки, поперечины и раскосы. каркас обшит кровельным тёсом
        # - в промежутке пильная мука (опилки) с алебастром

#----
# Оборудование мартеновской фабрики:
    # Две 12-тонные печи
        # - длина пода -- 6.4 метра
        # - ширина пода -- 2.6 метра
        # - высота свода над подом -- 1.8 метра
        # - свод печи опирается на чугунные пяты подвешенные на наружной арматуре
        # - с двух сторон печей подвешены чугунные шлаковые желоба
        # - выпускной желоб (для шлака) железный, клёпаный.
        # - над каждой печью подвешен зонт из кровельного железа
            # для предохранения ферм здания от нагревания
        # - для загрузки и заправки печей имеются с одной стороны три окна
    # Два газовых и два воздушных регенератора под 2 печами
        # - объём одного воздушного регенератора -- 50 кубометров
        # - объём одного газового регенератора -- 43 кубометра
            # - 40 000 кирпичей на насадку 4 регенераторов
                # верхние 10 рядов (0.6 метра?) -- динас
                # остальное -- кварце-глинистый киприч
            # между каждой парой регенераторов солидные по размеру шлаковики
            # дымовой канал разделён вертикальной стеной пополам
    # Две группы газогенераторов (по 4 на каждую печь)
        # - внутренний объём группы генераторов (для одной печи) -- 39 кубометров
            # - генераторы на 3.2 метра опущены в землю
            # - до 2/3 снизу они обложены внутри местным кирпичём из белой глины
            # - загрузные коробки частью железные, частью чугунные -- достаточно герметичны
            # - над каждой группой генераторов сделана крыша-колпак из железного каркаса и кровли
            # - у зольников устроена каменная опорная стенка и такая же лестница из цемента
            # - кладка армирована горизонтальными железными полосами
            # - снаружи генераторы ничем не облицованы
        # Расход дров на производство горючего газа:
            # - расход дров на группу -- 68 кубометров
            # - дрова еловые и пихтовые 1 метр длиной
            # - дрова остаются в генераторах до 14 часов
            # Чтобы газ не охлаждался весь газовый боров помещается под землёй
            # Газ не предполагается конденсировать. Генераторы стоят как можно ближе к печам
        # Технические проблемы:
            # Генераторы забиваются смолой из-за близости к печам.
            # Выжигание смолы зависит от сухости дров, каждые 2-3 недели
            # для выжигания накопившейся смолы сделана вытяжная труба
            # из железа, 3.175 мм толщиной (жестяной воздуховод).
    # Две дымовые трубы -- 22 тонны (6000 рублей):
        # - стоимость труб -- 0.26 рубля/килограмм
        # - железные, свободно стоящие (без растяжных цепей)
        # - внешний диаметр 1.525 метра
            # - внутри футлеровки 1.22 метра
        # - высота каждой 33 метра
            # - нижние 6.1 метра склёпаны из железа 9.5 миллиметра
            # - следующие 11.6 метра из железа 6.4 мм
            # - дальше 9.2 метра из железа 4.8 мм
            # - посление 9.2 метра из железа 3.2 мм
        # - трубы прислали склёпанными звеньями длиной по 3.3 метра.
            # котельщики обе трубы склепали на земле
            # поднимали трубы целиком
        # - вес каждой трубы вместе с четыремя нижники угольниками -- 11.1 тонн
            # Завод Добровых и Набгольц -- поставляли шестерни и трубы для нашей фабрики
            # http://mirznanii.com/a/284402/dobrov-i-nabgolts
            # https://ru.m.wikipedia.org/wiki/ЛГМ_(компания)
        # Фундамент под трубы:
            # - фундаментные плиты местного отлива
            # - основание заложено прямо на грунт
            # - нижний слой из мелкого бута
            # - полит раствором портландского цемента
        # футлеровка труб:
            # - кладка в пол-кирпича -- 133.35 мм
            # - выложены красным лекальным кирпичём до самого верха,
            # - на обе трубы потребовалось 14 000 штук кирпича (по 7000 на трубу)
    # Газораспределительное оборудование:
        # - воздухораспределительный аппарат -- обыкновенный Сименса
        # - газовый распределительный аппара -- колокольный, упрощённой системы
    # Два разгрузочных крана-бегуна весом по 12 тонн (17 000 рублей)
        # - для подъёма шихты на верхний уровень печи (147 тонн/сутки)
            # https://ru.m.wikipedia.org/wiki/Шихта
        # - стоимость каждого крана -- 8500 рублей (1700 рублей/тонну грузоподъёмности)
            # - грузоподъёмность каждого -- 5 тонн
            # - вылет стрелы -- 4.6 метра
            # - наибольшая высота подъёма -- 3.7 метра
            # - скорость подъёма груза в 5 тонн -- 0.061 метра/секунду
            # - скорость подъёма груза в 1 тонну -- 0.305 метра/секунду
            # - скорость вращения крана -- 0.9 метра/секунду
            # - скорость передвижения крана по рельсам -- 0.381 метра/секунду
        # - два электромотора на основной раме:
            # - первый 6.6 кВт, 800 оборотов/минуту
                # поднимает груз, передачи оборотов через зубчатки
                # зубчатки служат хорошо, через 12 месяцев работы большого износа не замечено
                # все зубчатки подъёмного механизма стальные
            # - второй 2.2 кВт, 900 оборотов/минуту
                # поворачивает кран и двигает по рельсам
                # муфты для переключения движения/поворота
        # - аппараты управления -- два реостата с рукоятками, по одному для каждого мотора
        # - оборудование: вольтметр, амперметр, предохранитель, выключатель
        # - расход энергии
            # - при грузе 5 тонн кран берёт -- 45 ампер
            # - поворачивание и движение крана -- 20-25 амепер
    # Два ковша и тележки -- 26 тонн (12 000 рублей)
        # - ковши обошлись по 0.42 рубля/килограмм
        # - один ковш (без электромотора) стоил -- 5600 рублей
        # - ковш и тележка склёпаны из котельного железа толщина 12.7 мм
            # - весит со всеми зубчатками (но без мотора) -- 13 тонн
        # - максимальная скорость 0.5 метра/секунду
            # четыре стальных колеса, рельсовый путь
        # - на тележке ковша электромотор, 13.23 кВт при 1100 оборотах/минуту
            # мотор закрыт железным кожухом
            # служат исключительно для передвижения тележек вдоль фабрики
            # опрокидывание ковша делает штурвалом, одним человеком
        # - электроника: аппарат для маневрирования
            # - коммутатор с реостатом
            # - два реле для переднего и заднего хода
            # - приборы: вольтметр, амперметр, предохранитель, выключатель
        # - самая серьёзная часть мартеноских ковшей, это кольцо с цапфами
            # - весит такое кольцо 2.6 тонны. выдерживает нагрузку в 49 тонн
        # - ковши внутри футлерованы кварцеглинистым кирпичём на ребро, толщиной 114 миллиметров.
            # футлеровка выдерживает 85 плавок, страдает то место, куда бьёт струя металла
        # - на ковш установлены два штопора, один запасной
        # - диаметр отверстия стакана (струи металла) -- 44.5 мм
        # - расход энергии
            # - наполненный сталью -- 125 ампер
            # - пустой ковш -- 50 амепер
            # - при трогании с места -- 30 амепер
        # - разливка 1.63 тонны металла -- 7-10 минут
            # считается от вытекания металла из печи в ковш
    # Два подъёма с противовесами -- 13 тонн (2730 рублей)
        # - оба подъёма были собраны и склёпаны по 0.21 рубля/килограмм
        # - на верхний железный под установлено 2 подъёма
            # - вес двух подъёмов с противовесами -- 13 тонн
            # - наибольший груз -- 3.26 тонны
        # - скорость подъёма -- 0.061 метра/секунду
        # - наверху подъёма электрическая лебёдка
            # - электромотор, зубчатка, бесконечный винт, магнитный тормоз
            # - клеть висит на калибровочной цепи толщиной 17.5 миллиметров
            # - на другой стороне цепи противовес (вес клети и половины груза)
        # - аппаратура управления:
            # - коммутаторы с электромагнитным реле
            # - три кнопки: подъём, спуск, остановка
        # - приборы: амперметр, вольтметр, выключатель двойной, и предохранитель
        # - расход энергии на подъём максимального груза (3.26 тонны) -- 40 ампер
    # Молоток рессорный, 240 ударов/минуту -- 2500 рублей
        # - для расковки мартеновских проб и различных кузнечных работ
        # - шунтовый электромотор на 3 силы (2.2 кВт) 780 оборотов/минуту
        # - вес бьющей части -- 30 килограмм
    # Фабрика для измельчения материалов заправки печей:
        # - две пары бегунов
        # - электрические краны-бегуны
            # - вес каждого колеса с бандажом -- 3.26 тонны
            # - делают по 15 оборотов/минуту
        # - Шунцевый электромотор мощностью в 9.6 кВт, 1200 оборотов в минуту
            # - ременная передача
            # - двигатель за глухой стеной (чем защищён от пыли)
            # - для пуска жидкий реостат
        # - приборы: амперметр, вольтметр, выключатель двойной, и предохранитель
        # - расход энергии -- 75 ампер
        # - к печам материалы поступают на вагонетках по наклонному крытому коридору
    # Освещение
        # - 3 фонаря внутри и 3 снаружи фабрики -- сила каждого 5 ампер
        # - дуговые фонари с продолжительностью горения 150 часов без перемены углей
        # - на каждом герметически заркытый выключатель с предохранителем
        # - 30 лампочек накаливания силой 16-50 свечей каждая
        # - 6 штепсельных переносных ручных лампочек
    # Прочие Механические приспособления:
        # - весы на 200 пудов (3.26 тонны) для взвешивания шихты
    # Центральная электрическая станция:
        # - на расстоянии 181 метра от мартеновских печей (то есть снаружи здания)
        # - гидравлический (рядом река?) и паровой двигатели
        # - турбина
            # - стоимость -- 2390 рублей (46 рублей/киловатт)
            # - наружный диаметр рабочих колёс -- 26 дюймов (0.66 метра)
            # - при 230 оборотах и напоре 7.32 метра -- 52 кВт
            # - фундамент -- свайное основание
        # - с водяным деревянным ларем связана железной водопроводной трубой
            # - длиной 7.6 метров; диаметр 1 метр; толщина 4.76 мм
            # - диаметр диффузера тоже 1 метр
        # - динамо-машина четырёхполюсная
            # - 650 оборотов/минуту, 120 вольт, 45 киловатт (86.5% КПД)
                # невысокое напряжение для безопасности рабочих
            # - ременная передача к динамо-машине. ширина 0.37 метра
            # - обмотка -- компаунд с угольными щетками и с диаметральным их положением
            # - фундамент -- свайное основание
        # - запасная динамо-машина с паровой машиной
        # - паровая машина (древняя) мощностью 147 киловатт
            # - обороты машины -- 75 в минуту
            # - пришлось ввести пару зубчаток с отношением 3 для передачи в 650 оборотов/минуту
        # - распределительная доска
            # - стоимость доски и приборов -- 900 рублей
            # - три амперметра на 400 Ампер для трёх динамо-машин
            # - два вольтметра, из них одина апериодический
            # - девять однополюсных отскакивающих рубильников
                # - девять двуполюсных предохранителей для них
            # - три двуполюсных магистральных рубильника на 400 Ампер каждый для трёх динамо-машин
                # - три двуполюсных предохранителя для них
            # - размеры доски 1.42×1.42 метра
                # светло-серого полированного мрамора в дубовой раме, позолота
        # - около доски помещены 2 шунтовых реостата для регулирования напряжения
            # - полное сопротивление каждого -- 28 Ом
        # - кабель от динамо-машины к распределительной доске -- 204 квадратных миллиметра
        # - из распределительной станции на фабрику идут 7 пар проводов.
            # - для двух подъёмников -- сечение кабеля 40 кв. миллиметров
            # - для двух кранов -- сечение кабеля 84 кв. миллиметров
                # - две проволоки диаметром 8-мм из кремниевой бронзы
            # - для двух ковшей -- сечение кабеля 78 кв. миллиметров
            # - для молотка -- сечение кабеля 15 кв. миллиметров
            # - для бегунов -- сечение кабеля 60 кв. миллиметров
            # - для дуговых фанарей -- сечение кабеля 12.56 кв. миллиметров
            # - для ламп накаливания -- сечение кабеля 12.56 кв. миллиметров
            # - провода внутри здания двойной-тройной изолировки, снаружи голые
            # - помещены на деревянных столбах, на обыкновенных телеграфных изоляторах

#----
# Расход материалов:
    # Две мартеновские печи:
        # Фундамент:
            # - камня бутового -- 364 кубометра
            # - песка речного -- 97 кубометров
            # - извести -- 33 тонны
        # Кладка:
            # - кирпича
                # - красного -- 233 887 штук
                # - белого Яйвенского -- 757 штук
                # - белого Лысьвенского -- 43 300 штук
                # - шамотного товарищества Штарк -- 26 388 штук
                # - кварце-глинистого -- 162 229 штук
                # - динас -- 129 063 штуки
            # - массы
                # - шамотной -- 10.7 тонн
                # - кварце-глинистой -- 21 тонна
                # - динасовой (толчёный кварц) -- 20 тонн
        # Дополнительно:
            # - красной глины -- 238 кубометров
            # - белой глины -- 8 кубометров
            # - кварцевого теплогорского песка -- 34 кубометра
            # - камня бутового -- 72.5 кубометра
            # - песка речного -- 20.5 кубометров
            # - извести -- 10.5 тонн
            # - чугунного литья -- 9 тонн
            # - хромистого железняка -- 145 тонн
                # под печей, задняя стенка и часть передней сложены
                # из кусков хромистого железняка
                # на хромистом же цементе с известью
    # Две группы газогенераторов (по 4 на каждую печь):
        # Фундамент:
            # - камня бутового -- 295 кубометров
            # - песка речного -- 98 кубометров
            # - цемента -- 0.86 тонны
            # - извести -- 42.5 тонны
        # Кладка:
            # - кирпича красного -- 136 562 штук
            # - кирпича белого Яйвенского -- 14 299 штук
            # - кирпича белого Лысьвенского -- 12 100 штук
            # - глина красная -- 106.3 кубометров
            # - глина белая -- 2 тонны
            # - кварцевого теплогорского песка -- 10.3 тонны
            # - цемента -- 0.54 тонны
            # - чугунного литья -- 3.5 тонны
            # - железа сортового -- 9.5 тонн? (оценка по стоимости)
                # кладка армирована горизонтальными железными полосами
        # Устройство коробок, клапанов и заслонок
            # - загрузочные коробки -- 12.2 тонны
            # - чугунного литья -- 17.9 тонн
            # - железа сортового -- до 2 тонн
    # Две дымовые трубы:
        # Фундамент:
            # - камня бутового -- 314 кубометров
            # - кирпича красного -- 15 358 штук
            # - песка речного и глины -- 90 кубометров
            # - извести -- 42.5 тонны
            # - цемента -- 3.66 тонны
            # - чугунного литья -- 0.342 тонны
        # Установка поддонов:
            # - чугунного литья -- 18 тонн
        # футлеровка труб:
            # - кирпича красного -- 15 115 штук
            # - глины красной -- 9.7 кубометра

#----
# Стоимость материалов:
    # Кирпич:
        # всякий переделаный (под мартеновский процесс) завод на Урале имеет свою кирпичную фабрику
        # производство огнеупорного кирпича -- несложный процесс
        # кирпич покупали в Лысово (кирпичный завод на 3 млн. штук в год)
    # Местный кирпич (фабричный) 9x4.5x2.25 дюймов (228x114x57.15 мм)
        # из Кунгурской белой глины и Теплогорского кварцевого песка (почти чистый кременезём)
        # из этого кирпича сдела футлеровка генераторов и регенераторов печей на 10 футов (3 метра)
        # стоил 40 000 рублей (какой объём?)
    # Подозрительно высокие цены (в 1890-е обычный кирпич стоил 11-15 рублей):
        # - кирпич-динас (покупаемый фабрикой) -- 145 руб/1000 штук (размеры 240x120x60 мм)
        # - кирпич-динас (огнеупорный) -- 100 руб/1000 штук (размеры 220x110x55 мм)
        # - кирпич кварце-глинистый -- 85 руб/1000 штук
        # - стаканы и пробки для мартеновских ковшей -- 50 копеек за пару
        # - масса для кладки шамотного кирпича (раствор?) -- 21.5 рублей/тонна
        # - масса для кладки кварце-глинистого кирпича -- 18.4 рублей/тонна
        # - масса для кладки динаса (толчёный кварц) -- 15.4 рублей/тонна
    # Цены:
    # Строительные материалы
        # - кирпич красный -- 10.2-17 рублей/1000 штук
        # - известь -- 6.1-10.8 рублей/тонна
        # - цемент -- 41.86 рублей/тонна
        # - алебастр -- 7.36 рублей/тонна
        # - песок речной -- 0.32-0.53 рубля/кубометр
        # - камень бутовый -- 1.2-1.4 рубля/кубометр
        # - дрова обжигательные (насыпью) -- 0.61-0.62 рубля/кубометр
    # Материалы для мартеновских печей
        # - кирпич
            # - белый явенский -- 71 рубль/1000 штук 
            # - белый лысьвенский -- 46.4 рубля/1000 штук 
            # - шамотный товарищества Штарк -- 95.61 рубля/1000 штук 
            # - кварце-глинистый -- 82 рубля/1000 штук 
            # - динас -- 143 рубля/1000 штук
        # - глина красная (подножная) -- 0.28 рубля/кубометр
        # - глина белая -- 12.3 рубля/тонну
        # - кварцевый теплогорский песок -- 4.67 рубля/кубометр
    # Металлические изделия:
        # - сталь (какая?) -- 400 рублей/тонна
        # - железо сортовое -- 71 рубль/тонна
        # - железо кровельное -- 108 рублей/тонна
        # - железо листовое -- 150 рублей/тонна
        # - чугунное литьё -- 78.6 рублей/тонна
        # - железные лестницы -- 215 рублей/тонна
        # - двутавроые балки -- 110 рублей/тонна
        # - железо котельное -- 153 рубля/тонна
        # - двутавровые балки и железо котельное -- 232 рубля/тонна
        # - стальные рельсы (7 килограмм/метр) -- 108 рублей/тонна
        # - накладки для шпал -- 239 рублей/тонна
        # - болты -- 344 рубля/тонна
        # - гвозди -- 200 рублей/тонна
        # - поворотные круги -- 68 рублей/тонна
    # Для окраски:
        # - масло -- 337 рублей/тонна
        # - масло постное -- 327-351 рублей/тонна
        # - масло льняное -- 362 рублей/тонна
        # - белила -- 232 рубля/тонна
        # - сурик свинцовый -- 233 рубля/тонна
        # - сажа голландская -- 184 рубля/тонна
        # - мумиё -- 150 рубля/тонна
    # Штучные:
        # - весы Фербэнкс (на 50 пудов) -- 80 рублей
        # - весы Фербэнкс (на 75 пудов) -- 125 рублей
        # - весы Фербэнкс (на 200 пудов) -- 500 рублей
        # - железная тележка (320 килограмм) -- 106-123 рублей
        # - две наковальни -- 36 рублей
        # - меха кузнечные -- 17 рублей
        # - ручной насос -- 56 рублей
        # - крепи (деревянные, для шахты) -- 0.05 рубля/штука

#----
# Рабочие:
    # Продолжительность плавки -- 8 часов, 29 минут (2.7 плавки/сутки):
        # - заправка -- 1 час, 43 минуты
        # - посадка -- 2 часа, 50 минут
        # - расплавление -- 2 часа, 38 минут
        # - кипение -- 1 часа, 06 минут
        # - отливка -- 11 минут
    # Рабочие (12-часовая смена) -- 55 человек (две смены 110 человек):
        # - средняя плата на рабочего -- 3 рубля/сутки (1.5 рубля/смена, 45 рублей/месяц)
        # - На генераторах -- 4 человека
        # - У печей -- 12 человек
            # - старший - 1*2
            # - подручные -- 2*2
            # - рабочие -- 2*2
            # - подросток-заслонщик -- 1*2
        # - У литейной канавы (на сборке и разгрузке изложниц) -- 7 человек
            # - старший -- 1
            # - рабочие -- 6
        # - При ковшах и желобах -- 2 человека
            # - каменщик -- 1
            # - подручные -- 1
        # - На приёме шихты -- 9 человек (работают только днём)
            # - старший -- 1
            # - рабочих -- 8
        # - Обслуживающий персонал -- 6 человек
            # - слесарь (печей, ковшей, молотков) -- 1
            # - монтёр (наблюдение за механизмами, освещением) - 1
            # - кузнец (починка инструментов, взятие проб) -- 1
            # - помощник кузнеца, молотобоец -- 1
            # - машинист (на кране) -- 1
            # - заведующий цехом (управляющий) -- 1
        # - Техническое наблюдение за ходом плавки -- 3 человека
            # - мастер -- 3
        # - Толчение хромистой массы под бегунами -- 3 человека:
            # - машинист (при фабрике бегунов) -- 1
            # - рабочие -- 2
            # - на 1000 слитков (196 тонн) 85 копеек -- 0.43 копейки/тонну
        # Электрическая станция -- 2 человека:
            # - машинист -- 1
            # - подросток-подручный -- 1

metadict_detail['_Мартеновская фабрика (годовой оборот)'] = {
        # Сталелитейные заводы (Иллинойс, 1890 год) -- 68 тонн/год-рабочего (5000 бит/рабочего капитал)
        # Оборот менее 1.35-1.5 млн бит при цене стали в 52-57 бит/тонна
        #'Мартеновская фабрика (капитализация)':1/20,
        #'Фабричные рабочие':100,
        }
