#----
# Домашние заготовки в кадках и бочках:

metadict_detail['|=Кадка квашеной капусты (килограмм)'] = {
        # TODO:
            # Хм, переводим килограммы в литры как 1:1
            # Это кадки с рассолом и овощами, плотность почти как у воды, но всё же.
        # Для каждого соления своя собственная кадка. И только одна.
        'Использование кадки для хранения солений (часов/литр)':24 * 360,
        '|=Склад солений в кадках (кубометр)':1 / 1000,
        }

metadict_detail['|=Кадка квашеной репы (килограмм)'] = {
        'Использование кадки для хранения солений (часов/литр)':24 * 360,
        '|=Склад солений в кадках (кубометр)':1 / 1000,
        }

metadict_detail['|=Кадка квашеной свёклы (килограмм)'] = {
        'Использование кадки для хранения солений (часов/литр)':24 * 360,
        '|=Склад солений в кадках (кубометр)':1 / 1000,
        }

metadict_detail['|=Кадка мочёной морошки (килограмм)'] = {
        'Использование кадки для хранения солений (часов/литр)':24 * 360,
        '|=Склад солений в кадках (кубометр)':1 / 1000,
        }

metadict_detail['|=Кадка мочёной сливы (килограмм)'] = {
        'Использование кадки для хранения солений (часов/литр)':24 * 360,
        '|=Склад солений в кадках (кубометр)':1 / 1000,
        }

metadict_detail['|=Кадка мочёной вишни (килограмм)'] = {
        'Использование кадки для хранения солений (часов/литр)':24 * 360,
        '|=Склад солений в кадках (кубометр)':1 / 1000,
        }

metadict_detail['|=Кадка мочёного крыжовника (килограмм)'] = {
        'Использование кадки для хранения солений (часов/литр)':24 * 360,
        '|=Склад солений в кадках (кубометр)':1 / 1000,
        }

metadict_detail['|=Кадка мочёных груш (килограмм)'] = {
        'Использование кадки для хранения солений (часов/литр)':24 * 360,
        '|=Склад солений в кадках (кубометр)':1 / 1000,
        }

metadict_detail['|=Кадка мочёных яблок (килограмм)'] = {
        'Использование кадки для хранения солений (часов/литр)':24 * 360,
        '|=Склад солений в кадках (кубометр)':1 / 1000,
        }

#----
# Домашние заготовки в горшках:

metadict_detail['|=Горшок маринованной моркови (литр)'] = {
        'Использование горшка для хранения солений (часов/литр)':24 * 360,
        '|=Склад солений в кадках (кубометр)':1 / 1000,
        }

metadict_detail['|=Горшок квашеной капусты кимчи (литр)'] = {
        'Использование горшка для хранения солений (часов/литр)':24 * 360,
        '|=Склад солений в кадках (кубометр)':1 / 1000,
        }

#----
# Товары в банках и ящиках:

metadict_detail['|=Ящик лечо (литр)'] = {
        'Использование ящика для хранения продовольствия (часов/литр)':24*30*3,
        '|=Склад консервов в банках и ящиках (кубометр)':1 / 1000,
        }

metadict_detail['|=Ящик консервированных шампиньонов (литр)'] = {
        'Использование ящика для хранения продовольствия (часов/литр)':24*30*3,
        '|=Склад консервов в банках и ящиках (кубометр)':1 / 1000,
        }

metadict_detail['|=Ящик соуса песто (литр)'] = {
        'Использование ящика для хранения продовольствия (часов/литр)':24*30*3,
        '|=Склад консервов в банках и ящиках (кубометр)':1 / 1000,
        }

metadict_detail['|=Ящик соевого соуса (литр)'] = {
        'Использование ящика для хранения продовольствия (часов/литр)':24*30*3,
        '|=Склад консервов в банках и ящиках (кубометр)':1 / 1000,
        }

metadict_detail['|=Ящик томатного соуса (литр)'] = {
        'Использование ящика для хранения продовольствия (часов/литр)':24*30*3,
        '|=Склад консервов в банках и ящиках (кубометр)':1 / 1000,
        }

metadict_detail['|=Ящик томатной пасты (литр)'] = {
        'Использование ящика для хранения продовольствия (часов/литр)':24*30*3,
        '|=Склад консервов в банках и ящиках (кубометр)':1 / 1000,
        }

metadict_detail['|=Ящик лютеницы (литр)'] = {
        'Использование ящика для хранения продовольствия (часов/литр)':24*30*3,
        '|=Склад консервов в банках и ящиках (кубометр)':1 / 1000,
        }

metadict_detail['|=Ящик баклажанного соуса (литр)'] = {
        'Использование ящика для хранения продовольствия (часов/литр)':24*30*3,
        '|=Склад консервов в банках и ящиках (кубометр)':1 / 1000,
        }

metadict_detail['|=Ящик джема из ревеня (литр)'] = {
        'Использование ящика для хранения продовольствия (часов/литр)':24*30*3,
        '|=Склад консервов в банках и ящиках (кубометр)':1 / 1000,
        }

metadict_detail['|=Ящик яблочного джема (литр)'] = {
        'Использование ящика для хранения продовольствия (часов/литр)':24*30*3,
        '|=Склад консервов в банках и ящиках (кубометр)':1 / 1000,
        }

metadict_detail['|=Ящик грушевого джема (литр)'] = {
        'Использование ящика для хранения продовольствия (часов/литр)':24*30*3,
        '|=Склад консервов в банках и ящиках (кубометр)':1 / 1000,
        }

metadict_detail['|=Ящик айвового джема (литр)'] = {
        'Использование ящика для хранения продовольствия (часов/литр)':24*30*3,
        '|=Склад консервов в банках и ящиках (кубометр)':1 / 1000,
        }

metadict_detail['|=Ящик виноградного джема (литр)'] = {
        'Использование ящика для хранения продовольствия (часов/литр)':24*30*3,
        '|=Склад консервов в банках и ящиках (кубометр)':1 / 1000,
        }

metadict_detail['|=Ящик земляничного варенья (литр)'] = {
        'Использование ящика для хранения продовольствия (часов/литр)':24*30*3,
        '|=Склад консервов в банках и ящиках (кубометр)':1 / 1000,
        }

metadict_detail['|=Ящик одуванчикового варенья (литр)'] = {
        'Использование ящика для хранения продовольствия (часов/литр)':24*30*3,
        '|=Склад консервов в банках и ящиках (кубометр)':1 / 1000,
        }

metadict_detail['|=Ящик смородинового варенья (литр)'] = {
        'Использование ящика для хранения продовольствия (часов/литр)':24*30*3,
        '|=Склад консервов в банках и ящиках (кубометр)':1 / 1000,
        }

metadict_detail['|=Ящик рябинового варенья (литр)'] = {
        'Использование ящика для хранения продовольствия (часов/литр)':24*30*3,
        '|=Склад консервов в банках и ящиках (кубометр)':1 / 1000,
        }

metadict_detail['|=Ящик вишнёвого варенья (литр)'] = {
        'Использование ящика для хранения продовольствия (часов/литр)':24*30*3,
        '|=Склад консервов в банках и ящиках (кубометр)':1 / 1000,
        }

metadict_detail['|=Ящик клюквенного варенья (литр)'] = {
        'Использование ящика для хранения продовольствия (часов/литр)':24*30*3,
        '|=Склад консервов в банках и ящиках (кубометр)':1 / 1000,
        }

metadict_detail['|=Ящик яблочного сиропа (литр)'] = {
        'Использование ящика для хранения продовольствия (часов/литр)':24*30*3,
        '|=Склад консервов в банках и ящиках (кубометр)':1 / 1000,
        }

metadict_detail['|=Ящик лимонного сиропа (литр)'] = {
        'Использование ящика для хранения продовольствия (часов/литр)':24*30*3,
        '|=Склад консервов в банках и ящиках (кубометр)':1 / 1000,
        }

metadict_detail['|=Ящик клюквенного сиропа (литр)'] = {
        'Использование ящика для хранения продовольствия (часов/литр)':24*30*3,
        '|=Склад консервов в банках и ящиках (кубометр)':1 / 1000,
        }

metadict_detail['|=Ящик горчицы (литр)'] = {
        'Использование ящика для хранения продовольствия (часов/литр)':24*30*3,
        '|=Склад консервов в банках и ящиках (кубометр)':1 / 1000,
        }

metadict_detail['|=Ящик чернил (литр)'] = {
        'Использование ящика для хранения промышленных товаров (часов/литр)':24*30*3,
        '|===Склад товарный (кубометр)':1/1000,
        }

metadict_detail['|=Ящик клея (литр)'] = {
        'Использование ящика для хранения промышленных товаров (часов/литр)':24*30*3,
        '|===Склад товарный (кубометр)':1/1000,
        }

#----
# Товары в бочках:

metadict_detail['|=Бочка хозяйственной воды (литр)'] = {
        # TODO:
            # Вода хранится в бочке не больше суток.
            # А с чего бы? Это, получается, сутки из года.
            # Слушай, я запуталась. Может полностью переделать эту чась?
        'Использование бочки для хранения воды (часов/литр)':24,
        }

metadict_detail['|=Бочка питьевой воды (литр)'] = {
        'Использование бочки для хранения воды (часов/литр)':24,
        }

metadict_detail['|=Бочка промышленной воды (литр)'] = {
        'Использование бочки для хранения воды (часов/литр)':24,
        }

metadict_detail['|=Бочка кленового сока (литр)'] = {
        # Вываривают в тот же день.
        'Использование бочки для хранения воды (часов/литр)':24,
        }

metadict_detail['|=Бочка арахисового масла (литр)'] = {
        # TODO:
            # Тащемта, объём самой бочки тоже нужно учитывать.
            # Можно просто взять коэффициент для усреднённых бочек.
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка квашеной капусты (литр)'] = {
        # Квашеные/мочёные/солёные овощи хранят в кадках, а в бочки перекладывают на продажу.
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка кленового сиропа (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка мёда (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка квашеной свёклы (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка квашеной репы (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка солёных кабачков (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка маринованного фенхеля (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка маринованных оливок (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка маринованных каперсов (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка солёных огурцов (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка солёных томатов (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка конопляного масла (литр)'] = {
        # Масло производят по мере необходимости и меньше чем за месяц продают.
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка льняного масла (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка горчичного масла (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка кунжутного масла (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка мочёной сливы (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка мочёной вишни (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка мочёного крыжовника (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка мочёной морошки (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка мочёных груш (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка мочёных яблок (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка оливкового масла (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка подсолнечного масла (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка соевого масла (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка масла какао (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка яблочного сидра (литр)'] = {
        # TODO:
            # Бочка и так используется для брожения
            # Но не в бутылках же перевозить!
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка грушевого сидра (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка красного вина (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка белого вина (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка имбирного эля (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка ячменного пива (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Ящик пшеничного хлеба (литр)'] = {
        'Использование ящика для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в ящиках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка ржаного кваса (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*7,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка ржаного имбирно-яблочного кваса (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*7,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка ржано-гречневого кваса (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*7,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка медовухи вишнёвой (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Ведро кленового сока (литр)'] = {
        # TODO:
            # Вёдра уже учтены как инструменты для сбора сока.
        # Сок хранится 5 дней весны. Собирают его в вёдра.
        #'Использование ведра для хранения кленового сока (часов/литр)':24*5,
        }

metadict_detail['|=Бочка арахиса (литр)'] = {
        # Бочка оборачивается каждый месяц, 12 раз в год. То есть хранится в нём еда 30 суток.
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка фисташек (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка картофельного крахмала (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка агар-агара (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка кукурузной крупы (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка кукурузной муки (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка гречневой муки (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка овсяной муки (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка овсяной крупы (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка пшеничного солода (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка пшеничной муки (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка соевой муки (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка соевых бобов (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка соли (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка соды пищевой (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сушёной морской капусты (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сушёного хмеля (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сухой горчицы (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка корицы (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка кофейных зёрен (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сухой ванили (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сухой фасоли (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сушёной вишни (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сушёной рябины (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сушёной малины (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сушёной груши (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сушёной хурмы (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сушёного абрикоса (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сушёного персика (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сушёного инжира (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сушёной сливы (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сушёной алычи (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка изюма (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка фиников (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сушёных трав (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сушёных чайных листьев (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сушёного манго (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сушёных бананов (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сушёных яблок (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка тростникового сахара (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка тростникового сахара-сырца (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка чёрной патоки (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка какао-порошка (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка какао-бобов (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка гречневой крупы (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка риса шлифованного (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка импортных пряностей (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка маринованных боровиков (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка солёных боровиков (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка льняной муки (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка местных пряностей (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка местных трав (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка ячменного солода (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка ржаного солода (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка ржаной муки (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка ячменной муки (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка рисовой муки (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка гороховой муки (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка соевого маргарина (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка соевого соуса (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка темпе (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сухого гороха (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сухого нута (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сухого урда (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сухой чечевицы (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сушёной клюквы (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сушёного шиповника (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сушёной смородины (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сушёной черники (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сушёных белых грибов (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сушёных томатов (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка вяленых томатов (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка яблочного уксуса (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка виноградного уксуса (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка ячневой крупы (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка перловой крупы (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка пшённой крупы (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

#----
# Сельскохозяйственное сырьё:
# Сроки хранения на сырьевой площадке отдельных видов плодов и ягод (не более):
    # абрикосов, вишен и винограда..........................12 часов 
    # персиков, слив, черешен, кинканов, 
    # фейхоа, черной смородины, крыжовника, 
    # кизила и орехов ......................................24 часа
    # летних и осенних сортов груш и яблок .................48 часов
    # мандаринов ...........................................5 суток
    # зимних сортов груш и яблок............................7 суток
    # клубники, земляники, малины...........................8 часов

metadict_detail['|=Корзина арахиса в шелухе (литр)'] = {
        # TODO:
            # Предполагается, что 6 дней сырьё хранится в корзинах. Так себе приближение.
        # Объём корзины -- 0.1 кубометра, размеры 0.5x0.5x0.4; площадка -- 0.25 кв.метра
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина фисташек в скорлупе (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина миндаля в скорлупе (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина батата (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина топинамбура (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина арбуза (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина дыни (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина винограда (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина вишни (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина черешни (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина рябины (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина абрикоса (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина инжира (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина граната (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина бананов (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина манго (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина авокадо (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина апельсинов (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина мандаринов (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина лаймов (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина фиников (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина персика (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина сливы (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина алычи (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина шампиньонов (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина вёшенок (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина груш (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина хурмы (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина айвы (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина дикорастущих растений (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина красных водорослей (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина морской капусты (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина зерна овса (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        '|==Зерновые (литр)':1,
        }

metadict_detail['|=Корзина зерна пшеницы (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        '|==Зерновые (литр)':1,
        }

metadict_detail['|=Корзина красной фасоли в стручках (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина соевых бобов в стручках (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина кабачка (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина баклажанов (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина капусты белокочанной (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина картофеля (литр)'] = {
        # TODO:
            # Картофель (как и прочие корнеплоды) хранят в буртах
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина кофейных зёрен (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина лука репчатого (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина чеснока (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина моркови (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина огурцов (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина перца сладкого (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина оливок (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина свёклы (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина семян горчицы (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина семян конопли (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина семян льна (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина семян джута (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина семян хлопка (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина семян кунжута (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина семян подсолнечника (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина семян мака (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина маковых головок (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина томатов (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина тростникового сахара-сырца (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина тыквы (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина чайных листьев (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина листьев карри (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина яблок (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина плодов какао (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина плодов кофейного дерева (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина стручков ванили (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина стручков острого перца (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина стручков сладко-жгучего перца (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина гвоздики (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина цветов шафрана (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина гороха в стручках (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина нута бараньего в стручках (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина урда в стручках (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина зерна гречихи (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        '|==Зерновые (литр)':1,
        }

metadict_detail['|=Корзина зерна риса посевного (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        '|==Зерновые (литр)':1,
        }

metadict_detail['|=Корзина дикорастущих грибов (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина дикорастущих орехов (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина дикорастущих ягод (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина зерна ржи (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        '|==Зерновые (литр)':1,
        }

metadict_detail['|=Корзина зерна ячменя (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        '|==Зерновые (литр)':1,
        }

metadict_detail['|=Корзина зерна просо (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        '|==Зерновые (литр)':1,
        }

metadict_detail['|=Корзина корнеплодов (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина имбиря (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина корней фенхеля (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина листьев фенхеля (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина овощей (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина огородных растений (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина хмеля (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина мяты (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина кориандра (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина петрушки (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина шпината (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина плодов пименты (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина плодов чёрного перца (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина ревеня (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина репы (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина редьки (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина редиса (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина брюквы (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина турнепса (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина латука посевного (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина сельдерея (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина пастернака (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина спаржи (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина кресс-салата (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина укропа (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина лука зелёного (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина брокколи (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина артишоков (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина хрена (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина фруктов (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина лимонов (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина чечевицы (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина зерна кукурузы (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24 * 6,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        '|==Зерновые (литр)':1,
        }

#----
# Почта в мешках:

metadict_detail['|=Газеты (литр)'] = {
        'Использование мешка для хранения почты (часов/литр)':24*30,
        '|=Склад почтовый (кубометр)':1/1000,
        }

metadict_detail['|=Письма (литр)'] = {
        'Использование мешка для хранения почты (часов/литр)':24*30,
        '|=Склад почтовый (кубометр)':1/1000,
        }

metadict_detail['|=Посылки (литр)'] = {
        'Использование мешка для хранения почты (часов/литр)':24*30,
        '|=Склад почтовый (кубометр)':1/1000,
        }

metadict_detail['|=Журналы (литр)'] = {
        'Использование мешка для хранения почты (часов/литр)':24*30,
        '|=Склад почтовый (кубометр)':1/1000,
        }

metadict_detail['|=Книги (литр)'] = {
        'Использование мешка для хранения почты (часов/литр)':24*30,
        '|=Склад почтовый (кубометр)':1/1000,
        }

metadict_detail['|=Тетради (литр)'] = {
        'Использование мешка для хранения почты (часов/литр)':24*30,
        '|===Склад товарный (кубометр)':1/1000,
        }

#----
# Хранение в мешках, сумках и кулях:

metadict_detail['|=Мешок импортных фруктов (литр)'] = {
        'Использование мешка для хранения продовольствия (часов/литр)':24*6,
        '|=Склад продовольствия в мешках (кубометр)':1/1000,
        }

metadict_detail['|=Мешок импортных апельсинов (литр)'] = {
        'Использование мешка для хранения продовольствия (часов/литр)':24*6,
        '|=Склад продовольствия в мешках (кубометр)':1/1000,
        }

metadict_detail['|=Мешок импортных авокадо (литр)'] = {
        'Использование мешка для хранения продовольствия (часов/литр)':24*6,
        '|=Склад продовольствия в мешках (кубометр)':1/1000,
        }

metadict_detail['|=Мешок импортных бананов (литр)'] = {
        'Использование мешка для хранения продовольствия (часов/литр)':24*6,
        '|=Склад продовольствия в мешках (кубометр)':1/1000,
        }

metadict_detail['|=Мешок импортных манго (литр)'] = {
        'Использование мешка для хранения продовольствия (часов/литр)':24*6,
        '|=Склад продовольствия в мешках (кубометр)':1/1000,
        }

metadict_detail['|=Мешок импортных мандаринов (литр)'] = {
        'Использование мешка для хранения продовольствия (часов/литр)':24*6,
        '|=Склад продовольствия в мешках (кубометр)':1/1000,
        }

metadict_detail['|=Мешок импортных лаймов (литр)'] = {
        'Использование мешка для хранения продовольствия (часов/литр)':24*6,
        '|=Склад продовольствия в мешках (кубометр)':1/1000,
        }

#----
# Хранение в снопах:

metadict_detail['|=Связка сахарного тростника (литр)'] = {
        # TODO:
            # Ну насыпью же! Ага, двухметровые стволы.
        '|=Стог сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина початков кукурузы (литр)'] = {
        '|=Стог сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина цветов подсолнечника (литр)'] = {
        '|=Стог сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина коробочек кунжута (литр)'] = {
        '|=Стог сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Сноп фенхеля (литр)'] = {
        '|=Стог сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Сноп горчицы (литр)'] = {
        '|=Стог сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Сноп конопли (литр)'] = {
        '|=Стог сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Сноп льна (литр)'] = {
        '|=Стог сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Сноп джута (литр)'] = {
        '|=Стог сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Сноп овса (литр)'] = {
        '|=Стог сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Сноп овсяной соломы (литр)'] = {
        '|=Стог соломы (кубометр)':1/1000,
        }

metadict_detail['|=Сноп гречихи посевной (литр)'] = {
        '|=Стог сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Сноп гречишной соломы (литр)'] = {
        '|=Стог соломы (кубометр)':1/1000,
        }

metadict_detail['|=Сноп пшеницы (литр)'] = {
        '|=Стог сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Сноп пшеничной соломы (литр)'] = {
        '|=Стог соломы (кубометр)':1/1000,
        }

metadict_detail['|=Сноп ржаной соломы (литр)'] = {
        '|=Стог соломы (кубометр)':1/1000,
        }

metadict_detail['|=Сноп ржи (литр)'] = {
        '|=Стог сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Сноп ячменной соломы (литр)'] = {
        '|=Стог соломы (кубометр)':1/1000,
        }

metadict_detail['|=Сноп ячменя (литр)'] = {
        '|=Стог сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Сноп просяной соломы (литр)'] = {
        '|=Стог соломы (кубометр)':1/1000,
        }

metadict_detail['|=Сноп просо (литр)'] = {
        '|=Стог сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Сноп риса посевного (литр)'] = {
        '|=Стог соломы (кубометр)':1/1000,
        }

metadict_detail['|=Сноп рисовой соломы (литр)'] = {
        '|=Стог сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина пищевых отходов (литр)'] = {
        # TODO: в компостные ямы.
        }

#----
# Промышленные товары в тюках, рулонах и катушках:

metadict_detail['|=Тюк хлопчатой ваты (кубометр)'] = {
        '|=Склад промышленных товаров (кубометр)':1,
        }

metadict_detail['|=Рулон хлопчатого ковра (кубометр)'] = {
        '|=Склад промышленных товаров (кубометр)':1,
        }

metadict_detail['|=Рулон джутового ковра (кубометр)'] = {
        '|=Склад промышленных товаров (кубометр)':1,
        }

metadict_detail['|=Рулон соломенной ткани (кубометр)'] = {
        '|=Склад промышленных товаров (кубометр)':1,
        }

metadict_detail['|=Рулон бархата (кубометр)'] = {
        '|=Склад промышленных товаров (кубометр)':1,
        }

metadict_detail['|=Рулон брезента (кубометр)'] = {
        '|=Склад промышленных товаров (кубометр)':1,
        }

metadict_detail['|=Рулон бязи (кубометр)'] = {
        '|=Склад промышленных товаров (кубометр)':1,
        }

metadict_detail['|=Рулон джутовой ткани (кубометр)'] = {
        '|=Склад промышленных товаров (кубометр)':1,
        }

metadict_detail['|=Рулон замши (кубометр)'] = {
        '|=Склад промышленных товаров (кубометр)':1,
        }

metadict_detail['|=Рулон кирзовой ткани (кубометр)'] = {
        '|=Склад промышленных товаров (кубометр)':1,
        }

metadict_detail['|=Рулон льняной ткани (кубометр)'] = {
        '|=Склад промышленных товаров (кубометр)':1,
        }

metadict_detail['|=Рулон парусины (кубометр)'] = {
        '|=Склад промышленных товаров (кубометр)':1,
        }

metadict_detail['|=Рулон сатина (кубометр)'] = {
        '|=Склад промышленных товаров (кубометр)':1,
        }

metadict_detail['|=Катушка джутовой нити (кубометр)'] = {
        '|=Склад промышленных товаров (кубометр)':1,
        }

metadict_detail['|=Катушка льняной нити (кубометр)'] = {
        '|=Склад промышленных товаров (кубометр)':1,
        }

metadict_detail['|=Катушка пеньковой бечевы (кубометр)'] = {
        '|=Склад промышленных товаров (кубометр)':1,
        }

metadict_detail['|=Катушка пеньковой нити (кубометр)'] = {
        '|=Склад промышленных товаров (кубометр)':1,
        }

metadict_detail['|=Катушка хлопчатой нити (кубометр)'] = {
        '|=Склад промышленных товаров (кубометр)':1,
        }

#----
# Промышленные товары в таре:

metadict_detail['|=Бочка извести негашёной (литр)'] = {
        'Использование бочки для хранения промышленных товаров (часов/литр)':24*30,
        '|=Склад промышленных товаров (кубометр)':1/1000,
        }

metadict_detail['|=Бочка цемента М400 (литр)'] = {
        'Использование бочки для хранения промышленных товаров (часов/литр)':24*30,
        '|=Склад промышленных товаров (кубометр)':1/1000,
        }

metadict_detail['|=Бочка асбеста (литр)'] = {
        'Использование бочки для хранения промышленных товаров (часов/литр)':24*30,
        '|=Склад промышленных товаров (кубометр)':1/1000,
        }

metadict_detail['|=Бочка мелового порошка (литр)'] = {
        'Использование бочки для хранения промышленных товаров (часов/литр)':24*30,
        '|=Склад промышленных товаров (кубометр)':1/1000,
        }

metadict_detail['|=Бочка жидкого стекла (литр)'] = {
        'Использование бочки для хранения промышленных товаров (часов/литр)':24*30,
        '|=Склад промышленных товаров (кубометр)':1/1000,
        }

metadict_detail['|=Бочка стеклянной глазури (литр)'] = {
        'Использование бочки для хранения промышленных товаров (часов/литр)':24*30,
        '|=Склад промышленных товаров (кубометр)':1/1000,
        }

metadict_detail['|=Бочка дёгтя (литр)'] = {
        'Использование бочки для хранения промышленных товаров (часов/литр)':24*30,
        '|=Склад промышленных товаров (кубометр)':1/1000,
        }

metadict_detail['|=Бочка соды негашёной (литр)'] = {
        'Использование бочки для хранения промышленных товаров (часов/литр)':24*30,
        '|=Склад промышленных товаров (кубометр)':1/1000,
        }

metadict_detail['|=Бочка едкого натра (литр)'] = {
        'Использование бочки для хранения промышленных товаров (часов/литр)':24*30,
        '|=Склад промышленных товаров (кубометр)':1/1000,
        }

metadict_detail['|=Бочка хлорки (литр)'] = {
        'Использование бочки для хранения промышленных товаров (часов/литр)':24*30,
        '|=Склад промышленных товаров (кубометр)':1/1000,
        }

metadict_detail['|=Бочка серного эфира (литр)'] = {
        'Использование бочки для хранения промышленных товаров (часов/литр)':24*30,
        '|=Склад промышленных товаров (кубометр)':1/1000,
        }

metadict_detail['|=Бочка серной кислоты (литр)'] = {
        # TODO: в деревянных бочках не хранят.
        'Использование бочки для хранения промышленных товаров (часов/литр)':24*30,
        '|=Склад промышленных товаров (кубометр)':1/1000,
        }

metadict_detail['|=Бочка дегтярного масла (литр)'] = {
        'Использование бочки для хранения промышленных товаров (часов/литр)':24*30,
        '|=Склад промышленных товаров (кубометр)':1/1000,
        }

metadict_detail['|=Бочка масляных красок (литр)'] = {
        'Использование бочки для хранения промышленных товаров (часов/литр)':24*30,
        '|=Склад промышленных товаров (кубометр)':1/1000,
        }

metadict_detail['|=Бочка аниловых красок (литр)'] = {
        'Использование бочки для хранения промышленных товаров (часов/литр)':24*30,
        '|=Склад промышленных товаров (кубометр)':1/1000,
        }

metadict_detail['|=Бочка клея обойного (литр)'] = {
        'Использование бочки для хранения промышленных товаров (часов/литр)':24*30,
        '|=Склад промышленных товаров (кубометр)':1/1000,
        }

metadict_detail['|=Бочка олифы (литр)'] = {
        'Использование бочки для хранения промышленных товаров (часов/литр)':24*30,
        '|=Склад промышленных товаров (кубометр)':1/1000,
        }

metadict_detail['|=Бочка хозяйственного мыла (литр)'] = {
        'Использование бочки для хранения промышленных товаров (часов/литр)':24*30,
        '|=Склад промышленных товаров (кубометр)':1/1000,
        }

metadict_detail['|=Бочка машинного масла (литр)'] = {
        'Использование бочки для хранения промышленных товаров (часов/литр)':24*30,
        '|=Склад промышленных товаров (кубометр)':1/1000,
        }

metadict_detail['|=Бочка колёсной мази (литр)'] = {
        'Использование бочки для хранения промышленных товаров (часов/литр)':24*30,
        '|=Склад промышленных товаров (кубометр)':1/1000,
        }

metadict_detail['|=Бочка пироксилина (литр)'] = {
        'Использование бочки для хранения промышленных товаров (часов/литр)':24*30,
        '|=Склад промышленных товаров (кубометр)':1/1000,
        }

#----
# Строительные материалы

metadict_detail['|=Рулон смоляной пакли (кубометр)'] = {
        '|=Склад строительных материалов (кубометр)':1,
        }

#metadict_detail['|=Рулон глиносоломенного ковра (кубометр)'] = {
#        '|=Склад строительных материалов (кубометр)':1,
#        }

metadict_detail['|=Рулон соломенного ковра (кубометр)'] = {
        '|=Склад строительных материалов (кубометр)':1,
        }

metadict_detail['|=Рулон толя (кубометр)'] = {
        '|=Склад промышленных товаров (кубометр)':1,
        }

metadict_detail['|=Рулон обоев (кубометр)'] = {
        '|=Склад промышленных товаров (кубометр)':1,
        }

metadict_detail['|=Рулон бумаги (кубометр)'] = {
        '|=Склад промышленных товаров (кубометр)':1,
        }

metadict_detail['|=Рулон ткани (кубометр)'] = {
        '|=Склад промышленных товаров (кубометр)':1,
        }

metadict_detail['|=Рулон мешковины (кубометр)'] = {
        '|=Склад промышленных товаров (кубометр)':1,
        }

metadict_detail['|=Рулон вафельной ткани (кубометр)'] = {
        '|=Склад промышленных товаров (кубометр)':1,
        }

metadict_detail['|=Рулон махровой ткани (кубометр)'] = {
        '|=Склад промышленных товаров (кубометр)':1,
        }

metadict_detail['|=Рулон фланели (кубометр)'] = {
        '|=Склад промышленных товаров (кубометр)':1,
        }

metadict_detail['|=Рулон резины (кубометр)'] = {
        '|=Склад промышленных товаров (кубометр)':1,
        }

metadict_detail['|=Прокат стальной (кубометр)'] = {
        '|=Склад промышленных товаров (кубометр)':1,
        }

metadict_detail['|=Литьё стальное (кубометр)'] = {
        '|=Склад промышленных товаров (кубометр)':1,
        }

metadict_detail['|=Литьё чугунное (кубометр)'] = {
        '|=Склад промышленных товаров (кубометр)':1,
        }

metadict_detail['|=Пиломатериалы свежие (кубометр)'] = {
        '|=Склад строительных материалов (кубометр)':1,
        }

metadict_detail['|=Доски паркетные (кубометр)'] = {
        '|=Склад строительных материалов (кубометр)':1,
        }

metadict_detail['|=Кирпич (кубометр)'] = {
        '|=Склад строительных материалов (кубометр)':1,
        }

metadict_detail['|=Черепица (кубометр)'] = {
        '|=Склад строительных материалов (кубометр)':1,
        }

metadict_detail['|=Кафель (кубометр)'] = {
        '|=Склад строительных материалов (кубометр)':1,
        }

metadict_detail['|=Стекло листовое (кубометр)'] = {
        '|=Склад строительных материалов (кубометр)':1,
        }

metadict_detail['|=Кирпич опилкобетонный лёгкий (кубометр)'] = {
        '|=Склад строительных материалов (кубометр)':1,
        }

metadict_detail['|=Кирпич саманный лёгкий (кубометр)'] = {
        '|=Склад строительных материалов (кубометр)':1,
        }

metadict_detail['|=Глина (кубометр)'] = {
        '|=Склад промышленного сырья (кубометр)':1,
        }

metadict_detail['|=Грунт (кубометр)'] = {
        # TODO:
            # А куда грунт девать? С глаз долой?
        }

metadict_detail['|=Дрова (кубометр)'] = {
        '|=Склад промышленного сырья (кубометр)':1,
        }

metadict_detail['|=Дрова (Зебрика) (кубометр)'] = {
        '|=Склад промышленного сырья (кубометр)':1,
        }

metadict_detail['|=Брикеты прессованного жмыха (кубометр)'] = {
        '|=Склад промышленного сырья (кубометр)':1,
        }

metadict_detail['|=Брикеты прессованных отрубей (кубометр)'] = {
        '|=Склад промышленного сырья (кубометр)':1,
        }

metadict_detail['|=Валежник (кубометр)'] = {
        '|=Склад промышленного сырья (кубометр)':1,
        }

metadict_detail['|=Уголь древесный (кубометр)'] = {
        '|=Склад промышленного сырья (кубометр)':1,
        }

metadict_detail['|=Смоляк (кубометр)'] = {
        '|=Склад промышленного сырья (кубометр)':1,
        }

metadict_detail['|=Сноп сухой соломы (кубометр)'] = {
        '|=Склад промышленного сырья (кубометр)':1,
        }

metadict_detail['|=Тюк прессованной соломы (кубометр)'] = {
        '|=Склад промышленного сырья (кубометр)':1,
        }

metadict_detail['|=Тюк пакли (кубометр)'] = {
        '|=Склад промышленного сырья (кубометр)':1,
        }

metadict_detail['|=Тюк пеньки (кубометр)'] = {
        '|=Склад промышленного сырья (кубометр)':1,
        }

metadict_detail['|=Тюк джута-сырца (кубометр)'] = {
        '|=Склад промышленного сырья (кубометр)':1,
        }

metadict_detail['|=Тюк льна-сырца (кубометр)'] = {
        '|=Склад промышленного сырья (кубометр)':1,
        }

metadict_detail['|=Тюк хлопка-сырца (кубометр)'] = {
        '|=Склад промышленного сырья (кубометр)':1,
        }

metadict_detail['|=Тюк джутовой пряжи (кубометр)'] = {
        '|=Склад промышленного сырья (кубометр)':1,
        }

metadict_detail['|=Тюк льняной пряжи (кубометр)'] = {
        '|=Склад промышленного сырья (кубометр)':1,
        }

metadict_detail['|=Тюк пеньковой пряжи (кубометр)'] = {
        '|=Склад промышленного сырья (кубометр)':1,
        }

metadict_detail['|=Тюк хлопчатой пряжи (кубометр)'] = {
        '|=Склад промышленного сырья (кубометр)':1,
        }

metadict_detail['|=Лес круглый (кубометр)'] = {
        '|=Склад промышленного сырья (кубометр)':1,
        }

metadict_detail['|=Опилки древесные (кубометр)'] = {
        '|=Склад промышленного сырья (кубометр)':1,
        }

metadict_detail['|=Песок (кубометр)'] = {
        '|=Склад промышленного сырья (кубометр)':1,
        }

metadict_detail['|=Щебень (кубометр)'] = {
        '|=Склад промышленного сырья (кубометр)':1,
        }

metadict_detail['|=Известняк (кубометр)'] = {
        '|=Склад промышленного сырья (кубометр)':1,
        }

metadict_detail['|=Гравий (кубометр)'] = {
        '|=Склад промышленного сырья (кубометр)':1,
        }

metadict_detail['|=Бутовый камень (кубометр)'] = {
        '|=Склад промышленного сырья (кубометр)':1,
        }

#----
# Типы складов:

metadict_detail['|=Стог сельскохозяйственного сырья (кубометр)'] = {
        # Мерная копна -- 4.8 кубометра, 15 пудов сена (250 кг)
        # Обычная величина стога от 100 до 300 пудов (1.6-5 тонны, 32-100 кубометров)
        # Также необмолоченный хлеб хранили в земляных ямах:
            # https://www.gumer.info/bibliotek_Buks/History/milov/01_4.php
        '|===Склад полевой (кубометр)':1,
        }

metadict_detail['|=Стог соломы (кубометр)'] = {
        '|===Склад сырьевой (кубометр)':1,
        }

metadict_detail['|=Склад промышленного сырья (кубометр)'] = {
        '|===Склад сырьевой (кубометр)':1,
        }

metadict_detail['|=Склад сельскохозяйственного сырья (кубометр)'] = {
        '|===Склад сырьевой (кубометр)':1,
        }

metadict_detail['|=Склад солений в кадках (кубометр)'] = {
        '|===Склад сырьевой (кубометр)':1,
        }

metadict_detail['|=Склад продовольствия в бочках (кубометр)'] = {
        '|===Склад товарный (кубометр)':1,
        }

metadict_detail['|=Склад продовольствия в ящиках (кубометр)'] = {
        '|===Склад товарный (кубометр)':1,
        }

metadict_detail['|=Склад продовольствия в мешках (кубометр)'] = {
        '|===Склад товарный (кубометр)':1,
        }

metadict_detail['|=Склад консервов в банках и ящиках (кубометр)'] = {
        '|===Склад товарный (кубометр)':1,
        }

metadict_detail['|=Склад промышленных товаров (кубометр)'] = {
        '|===Склад товарный (кубометр)':1,
        }

metadict_detail['|=Склад почтовый (кубометр)'] = {
        '|===Склад товарный (кубометр)':1,
        }

metadict_detail['|=Склад строительных материалов (кубометр)'] = {
        '|===Склад товарный (кубометр)':1,
        }
