#----
# Потребление пищи, обслуживание:

metadict_detail['||Блюдо первое горячее (250-грамм/порция)'] = {
        # Обычно пони обедают компаниями в 10-25 носов.
            # Еду подают в больших мисках с носиками, каждый берёт себе сам.
            # Пони не едят ложками. Неудобно. Все пользуются своей посудой и собственным языком.
        '_-Потребление первого блюда (килограмм)':0.25,
        'Использование миски 0.5-литра для еды (часов)':30 / 60,
        }

metadict_detail['||Блюдо первое холодное (250-грамм/порция)'] = {
        # Мытьё посуды присобачим к инструментам.
            # Потому что не все пони настолько чистоплотны,
            # чтобы свои вылизанные мисочки ещё и после каждой еды мыть.
            # О страшных микроорганизмах они слышать не слышали, если что.
            # Да и вообще, хватают всё зубами, даже двери открывают так!
        '_-Потребление первого блюда (килограмм)':0.25,
        'Использование миски 0.5-литра для еды (часов)':30 / 60,
        }

metadict_detail['||Блюдо второе горячее (250-грамм/порция)'] = {
        '_-Потребление второго блюда (килограмм)':0.25,
        'Использование миски 0.5-литра для еды (часов)':30 / 60,
        }

metadict_detail['||Блюдо второе холодное (250-грамм/порция)'] = {
        '_-Потребление второго блюда (килограмм)':0.25,
        'Использование миски 0.5-литра для еды (часов)':30 / 60,
        }

metadict_detail['||Антреме горячее (250-грамм/порция)'] = {
        '_-Потребление антреме (килограмм)':0.25,
        'Использование миски 0.5-литра для еды (часов)':30 / 60,
        }

metadict_detail['||Антреме холодное (250-грамм/порция)'] = {
        '_-Потребление антреме (килограмм)':0.25,
        'Использование миски 0.5-литра для еды (часов)':30 / 60,
        }

metadict_detail['||Блюдо первое горячее (125-грамм/порция)'] = {
        # Исправить.
            # Вообще-то называть порцию в 125 грамм первым блюдом некорректно.
            # Это всё традиции южан, у которых не блюда, а пиалы с острыми супами и соусами.
        '_-Потребление первого блюда (килограмм)':0.125,
        'Использование чашки 0.25-литра для еды (часов)':30 / 60,
        }

metadict_detail['||Блюдо первое холодное (125-грамм/порция)'] = {
        # Блюдца неудобно брать копытами. Пони используют чашки и свои длинные языки.
        '_-Потребление первого блюда (килограмм)':0.125,
        'Использование чашки 0.25-литра для еды (часов)':30 / 60,
        }

metadict_detail['||Блюдо второе горячее (125-грамм/порция)'] = {
        '_-Потребление второго блюда (килограмм)':0.125,
        'Использование чашки 0.25-литра для еды (часов)':30 / 60,
        }

metadict_detail['||Блюдо второе холодное (125-грамм/порция)'] = {
        '_-Потребление второго блюда (килограмм)':0.125,
        'Использование чашки 0.25-литра для еды (часов)':30 / 60,
        }

metadict_detail['||Антреме горячее (125-грамм/порция)'] = {
        '_-Потребление второго блюда (килограмм)':0.125,
        'Использование чашки 0.25-литра для еды (часов)':30 / 60,
        }

metadict_detail['||Антреме холодное (125-грамм/порция)'] = {
        '_-Потребление второго блюда (килограмм)':0.125,
        'Использование чашки 0.25-литра для еды (часов)':30 / 60,
        }

metadict_detail['||Десерт горячий (125-грамм/порция)'] = {
        '_-Потребление десерта (килограмм)':0.125,
        'Использование чашки 0.25-литра для еды (часов)':30 / 60,
        }

metadict_detail['||Десерт холодный (125-грамм/порция)'] = {
        '_-Потребление десерта (килограмм)':0.125,
        'Использование чашки 0.25-литра для еды (часов)':30 / 60,
        }

metadict_detail['||Фрукты консервированные (250-грамм/порция)'] = {
        '_-Потребление фруктов (килограмм)':0.25,
        'Использование миски 0.5-литра для еды (часов)':30 / 60,
        }

metadict_detail['||Фрукты консервированные (125-грамм/порция)'] = {
        '_-Потребление фруктов (килограмм)':0.125,
        'Использование чашки 0.25-литра для еды (часов)':30 / 60,
        }

metadict_detail['||Питьё горячее (250-грамм/порция)'] = {
        '_-Потребление горячего питья (килограмм)':0.25,
        'Использование кружки 0.5-литра для питья (часов)':30 / 60,
        }

metadict_detail['||Питьё холодное (250-грамм/порция)'] = {
        '_-Потребление холодного питья (килограмм)':0.25,
        'Использование кружки 0.5-литра для питья (часов)':30 / 60,
        }

#----
# Порции в общей посуде:

metadict_detail['||Фрукты свежие (250-грамм/порция)'] = {
        '_-Потребление фруктов (килограмм)':0.25,
        'Использование корзинки для подачи фруктов (часов/килограмм)':1 / 4,
        }

metadict_detail['||Фрукты свежие (125-грамм/порция)'] = {
        '_-Потребление фруктов (килограмм)':0.125,
        'Использование корзинки для подачи фруктов (часов/килограмм)':1 / 8,
        }

metadict_detail['||Выпечка (50-грамм/порция)'] = {
        '_-Потребление выпечки (килограмм)':0.05,
        'Использование корзинки для подачи выпечки (часов/килограмм)':1 / 20,
        }

metadict_detail['||Выпечка жареная (50-грамм/порция)'] = {
        '_-Потребление жареной выпечки (килограмм)':0.05,
        'Использование корзинки для подачи жареной выпечки (часов/килограмм)':1 / 20,
        }

metadict_detail['||Выпечка жареная (25-грамм/порция)'] = {
        '_-Потребление жареной выпечки (килограмм)':0.025,
        'Использование корзинки для подачи жареной выпечки (часов/килограмм)':1 / 40,
        }

metadict_detail['||Хлеб (50-грамм/порция)'] = {
        '_-Нарезка хлеба (килограмм)':0.05,
        '_-Потребление хлеба (килограмм)':0.05,
        'Использование корзинки для подачи хлеба (часов/килограмм)':1 / 20,
        }

metadict_detail['||Сэндвичи (50-грамм/порция)'] = {
        '_-Потребление сэндвичей (килограмм)':0.05,
        'Использование корзинки для подачи сэндвичей (часов/килограмм)':1 / 20,
        }

metadict_detail['||Орешки (10-грамм/порция)'] = {
        '_-Потребление орешков (килограмм)':0.01,
        'Использование корзинки для подачи орешков (часов/килограмм)':1 / 100,
        }

metadict_detail['||Сладости (10-грамм/порция)'] = {
        '_-Потребление сладостей (килограмм)':0.01,
        'Использование корзинки для подачи сладостей (часов/килограмм)':1 / 100,
        }
