#----
# Потребление пищи, обслуживание:

metadict_detail['||Блюдо первое горячее (250-грамм/порция)'] = {
        '_-Сервировка первого блюда (килограмм)':0.25,
        '_-Потребление пищи (нормо-часов)':4 / 60,
        '_-Мытьё посуды (0.5-л/миска)':1,
        'Использование 0.5-литровой миски для еды (часов)':60 / 60,
        }

metadict_detail['||Блюдо первое холодное (250-грамм/порция)'] = {
        '_-Сервировка первого блюда (килограмм)':0.25,
        '_-Потребление пищи (нормо-часов)':4 / 60,
        '_-Мытьё посуды (0.5-л/миска)':1,
        'Использование 0.5-литровой миски для еды (часов)':60 / 60,
        }

metadict_detail['||Блюдо второе горячее (250-грамм/порция)'] = {
        '_-Сервировка второго блюда (килограмм)':0.25,
        '_-Потребление пищи (нормо-часов)':4 / 60,
        '_-Мытьё посуды (0.5-л/миска)':1,
        'Использование 0.5-литровой миски для еды (часов)':60 / 60,
        }

metadict_detail['||Блюдо второе холодное (250-грамм/порция)'] = {
        '_-Сервировка второго блюда (килограмм)':0.25,
        '_-Потребление пищи (нормо-часов)':4 / 60,
        '_-Мытьё посуды (0.5-л/миска)':1,
        'Использование 0.5-литровой миски для еды (часов)':60 / 60,
        }

metadict_detail['||Блюдо первое горячее (125-грамм/порция)'] = {
        '_-Сервировка первого блюда (килограмм)':0.125,
        '_-Потребление пищи (нормо-часов)':2 / 60,
        '_-Мытьё посуды (0.25-л/миска)':1,
        'Использование 0.25-литровой миски для еды (часов)':60 / 60,
        }

metadict_detail['||Блюдо первое холодное (125-грамм/порция)'] = {
        '_-Сервировка первого блюда (килограмм)':0.125,
        '_-Потребление пищи (нормо-часов)':2 / 60,
        '_-Мытьё посуды (0.25-л/миска)':1,
        'Использование 0.25-литровой миски для еды (часов)':60 / 60,
        }

metadict_detail['||Блюдо второе горячее (125-грамм/порция)'] = {
        '_-Сервировка второго блюда (килограмм)':0.125,
        '_-Потребление пищи (нормо-часов)':2 / 60,
        '_-Мытьё посуды (0.25-л/миска)':1,
        'Использование 0.25-литровой миски для еды (часов)':60 / 60,
        }

metadict_detail['||Блюдо второе холодное (125-грамм/порция)'] = {
        '_-Сервировка второго блюда (килограмм)':0.125,
        '_-Потребление пищи (нормо-часов)':2 / 60,
        '_-Мытьё посуды (0.25-л/миска)':1,
        'Использование 0.25-литровой миски для еды (часов)':60 / 60,
        }

metadict_detail['||Десерт горячий (125-грамм/порция)'] = {
        '_-Сервировка десерта (килограмм)':0.125,
        '_-Потребление пищи (нормо-часов)':2 / 60,
        '_-Мытьё посуды (0.25-л/чашка)':1,
        'Использование 0.25-литровой чашки для еды (часов)':60 / 60,
        }

metadict_detail['||Десерт холодный (125-грамм/порция)'] = {
        '_-Сервировка десерта (килограмм)':0.125,
        '_-Потребление пищи (нормо-часов)':2 / 60,
        '_-Мытьё посуды (0.25-л/чашка)':1,
        'Использование 0.25-литровой чашки для еды (часов)':60 / 60,
        }

metadict_detail['||Фрукты консервированные (250-грамм/порция)'] = {
        '_-Сервировка десерта (килограмм)':0.250,
        '_-Потребление пищи (нормо-часов)':4 / 60,
        '_-Мытьё посуды (0.5-л/миска)':1,
        'Использование 0.5-литровой миски для еды (часов)':60 / 60,
        }

metadict_detail['||Фрукты консервированные (125-грамм/порция)'] = {
        '_-Сервировка десерта (килограмм)':0.125,
        '_-Потребление пищи (нормо-часов)':2 / 60,
        '_-Мытьё посуды (0.25-л/миска)':1,
        'Использование 0.25-литровой миски для еды (часов)':60 / 60,
        }

metadict_detail['||Питьё горячее (250-грамм/порция)'] = {
        '_-Сервировка горячего питья (килограмм)':0.250,
        '_-Потребление питья (нормо-часов)':4 / 60,
        '_-Мытьё посуды (0.5-л/чашка)':1,
        'Использование 0.5-литровой чашки для питья (часов)':60 / 60,
        }

metadict_detail['||Питьё холодное (250-грамм/порция)'] = {
        '_-Сервировка холодного питья (килограмм)':0.250,
        '_-Потребление питья (нормо-часов)':1 / 60,
        '_-Мытьё посуды (0.5-л/чашка)':1,
        'Использование 0.5-литровой чашки для питья (часов)':60 / 60,
        }

#----
# Порции в общей посуде:

metadict_detail['||Фрукты свежие (250-грамм/порция)'] = {
        '_-Потребление пищи (нормо-часов)':4 / 60,
        '||Корзина с фруктами (1000-грамм)':1 / 4,
        }

metadict_detail['||Фрукты свежие (125-грамм/порция)'] = {
        '_-Потребление пищи (нормо-часов)':2 / 60,
        '||Корзина с фруктами (1000-грамм)':1 / 8,
        }

metadict_detail['||Выпечка (50-грамм/порция)'] = {
        # Группировка, подают ведь в блюдах.
        '_-Потребление пищи (нормо-часов)':1 / 60,
        '||Корзина с выпечкой (1000-грамм)':1 / 20,
        }

metadict_detail['||Хлеб (50-грамм/порция)'] = {
        '_-Потребление пищи (нормо-часов)':1 / 60,
        '||Корзина с хлебом (1000-грамм)':1 / 20,
        }

metadict_detail['||Выпечка жареная (50-грамм/порция)'] = {
        '_-Потребление пищи (нормо-часов)':1 / 60,
        '||Блюдо с жареной выпечкой (500-грамм)':1 / 10,
        }

metadict_detail['||Выпечка жареная (25-грамм/порция)'] = {
        '_-Потребление пищи (нормо-часов)':1 / 60,
        '||Блюдо с жареной выпечкой (500-грамм)':1 / 20,
        }

metadict_detail['||Орешки (10-грамм/порция)'] = {
        '_-Потребление пищи (нормо-часов)':1 / 60,
        '||Чашка с орешками (100-грамм)':1 / 10,
        }

metadict_detail['||Сладости (10-грамм/порция)'] = {
        '_-Потребление пищи (нормо-часов)':1 / 60,
        '||Чашка со сладостями (100-грамм)':1 / 10,
        }

#----
# Использование общей посуды:

metadict_detail['||Корзина с фруктами (1000-грамм)'] = {
        '_-Сервировка фруктов (килограмм)':1,
        'Использование корзины для подачи еды (часов/килограмм)':60 / 60,
        }

metadict_detail['||Корзина с выпечкой (1000-грамм)'] = {
        '_-Сервировка хлеба (килограмм)':1,
        'Использование корзины для подачи еды (часов/килограмм)':60 / 60,
        }

metadict_detail['||Корзина с хлебом (1000-грамм)'] = {
        '_-Нарезка хлеба (килограмм)':1,
        '_-Сервировка хлеба (килограмм)':1,
        'Использование корзины для подачи еды (часов/килограмм)':60 / 60,
        }

metadict_detail['||Блюдо с жареной выпечкой (500-грамм)'] = {
        '_-Сервировка хлеба (килограмм)':0.5,
        '_-Мытьё посуды (1-л/миска)':1,
        'Использование 1-литровой миски для подачи еды (часов)':60 / 60,
        }

metadict_detail['||Чашка с орешками (100-грамм)'] = {
        '_-Сервировка десерта (килограмм)':0.1,
        'Использование 0.25-литровой чашки для еды (часов)':60 / 60,
        }

metadict_detail['||Чашка со сладостями (100-грамм)'] = {
        '_-Мытьё посуды (0.25-л/чашка)':1,
        '_-Сервировка десерта (килограмм)':0.1,
        'Использование 0.25-литровой чашки для еды (часов)':60 / 60,
        }
