#----
# Работы по дому:

metadict_detail['_-@Домохозяйство, повар'] = {
        # Это занятия, предполагающие работу 4 × 300 = 1200 часов/год, кроме основной профессии.
        # Например, в расширенной семье или сообществе на 25 пони, 3 повара и 2-3 поварёнка.
        # Пони очень склонны к кооперации и специализации, поэтому готовят на всех.
        }

metadict_detail['_-@Домохозяйство, поварёнок'] = {
        }

metadict_detail['_-@Домохозяйство, прачка'] = {
        # А другие, тем временем, сменяя друг друга, занимаются стиркой, колкой дров, уборкой.
        }

metadict_detail['_-@Домохозяйство, разнорабочий'] = {
        }

metadict_detail['_-@Домохозяйство, уборщик'] = {
        }

metadict_detail['_-@Домохозяйство, писатели'] = {
        # Кто-то хорошо умеет писать письма.
        }

metadict_detail['_-@Домохозяйство, читатели'] = {
        # А кто-то читает вслух по вечерам.
        }

#----
# Профессии:

metadict_model['_-@Земледелие, бобовые'] = {
        # Это вакансии, предполагающие работу 8 × 200 = 1600 часов/год
        }

metadict_model['_-@Земледелие, грибовод'] = {
        }

metadict_model['_-@Земледелие, зебра'] = {
        }

metadict_model['_-@Земледелие, зерновые'] = {
        }

metadict_model['_-@Земледелие, лесник'] = {
        }

metadict_model['_-@Земледелие, масличные'] = {
        }

metadict_model['_-@Земледелие, огородник'] = {
        }

metadict_model['_-@Земледелие, пчеловод'] = {
        }

metadict_model['_-@Земледелие, садовод'] = {
        }

metadict_model['_-@Земледелие, технические'] = {
        }

metadict_model['_-@Обслуживание-культура, библиотекарь'] = {
        }

metadict_model['_-@Обслуживание-медицина, волшебник-врач, 1 круг'] = {
        }

metadict_model['_-@Обслуживание-медицина, врач, больница'] = {
        }

metadict_model['_-@Обслуживание-медицина, врач, поликлиника'] = {
        }

metadict_model['_-@Обслуживание-медицина, фельдшер, больница'] = {
        }

metadict_model['_-@Обслуживание-медицина, фельдшер, поликлиника'] = {
        }

metadict_model['_-@Обслуживание-медицина, фельдшер, скорая помощь'] = {
        }

metadict_model['_-@Обслуживание-медицина, фельдшер, скорая помощь, пегас'] = {
        }

metadict_model['_-@Обслуживание-образование, учитель, начальная школа'] = {
        }

metadict_model['_-@Обслуживание-образование, учитель, средняя школа'] = {
        }

metadict_model['_-@Обслуживание-образование, учитель, старшая школа'] = {
        }

metadict_model['_-@Обслуживание-образование, учитель, университет'] = {
        }

metadict_model['_-@Строительство, волшебник-сварщик, 0 круг'] = {
        }

metadict_model['_-@Промышленность-добыча, волшебник-шахтёр, 0 круг'] = {
        }

metadict_model['_-@Промышленность-добыча, рабочий, лесоруб'] = {
        }

metadict_model['_-@Промышленность-добыча, рабочий, сапёр'] = {
        }

metadict_model['_-@Промышленность-добыча, рабочий, шахтёр'] = {
        }

metadict_model['_-@Промышленность-добыча, рабочий, шахтёр, щебень'] = {
        }

metadict_model['_-@Промышленность-кустари, рабочий, портной'] = {
        }

metadict_model['_-@Промышленность-кустари, рабочий, сапожник'] = {
        }

metadict_model['_-@Промышленность-кустари, рабочий, ткач'] = {
        }

metadict_model['_-@Промышленность-кустари, рабочий, швец'] = {
        }

metadict_model['_-@Промышленность-фабрики, рабочий, бумага'] = {
        }

metadict_model['_-@Промышленность-фабрики, рабочий, дёготь'] = {
        }

metadict_model['_-@Промышленность-фабрики, рабочий, известь'] = {
        }

metadict_model['_-@Промышленность-фабрики, рабочий, кафель'] = {
        }

metadict_model['_-@Промышленность-фабрики, рабочий, кирпич'] = {
        }

metadict_model['_-@Промышленность-фабрики, рабочий, кирпич саманный'] = {
        }

metadict_model['_-@Промышленность-фабрики, рабочий, красильщик'] = {
        }

metadict_model['_-@Промышленность-фабрики, рабочий, лесопилка'] = {
        }

metadict_model['_-@Промышленность-фабрики, рабочий, маслозавод'] = {
        }

metadict_model['_-@Промышленность-фабрики, рабочий, мыловар'] = {
        }

metadict_model['_-@Промышленность-фабрики, рабочий, солевар'] = {
        }

metadict_model['_-@Промышленность-фабрики, рабочий, опилкобетон'] = {
        }

metadict_model['_-@Промышленность-фабрики, рабочий, паркет'] = {
        }

metadict_model['_-@Промышленность-фабрики, рабочий, пивоварня'] = {
        }

metadict_model['_-@Промышленность-фабрики, рабочий, прядильщик'] = {
        }

metadict_model['_-@Промышленность-фабрики, рабочий, солод'] = {
        }

metadict_model['_-@Промышленность-фабрики, рабочий, типография'] = {
        }

metadict_model['_-@Промышленность-фабрики, рабочий, ткач'] = {
        }

metadict_model['_-@Промышленность-фабрики, рабочий, хлебозавод'] = {
        }

metadict_model['_-@Промышленность-фабрики, рабочий, цемент'] = {
        }

metadict_model['_-@Промышленность-фабрики, рабочий, черепица'] = {
        }

metadict_model['_-@Строительство, дорожный строитель'] = {
        }

metadict_model['_-@Строительство, железнодорожный монтёр'] = {
        }

metadict_model['_-@Строительство, землекоп'] = {
        }

metadict_model['_-@Строительство, землекоп, глина'] = {
        }

metadict_model['_-@Строительство, каменщик'] = {
        }

metadict_model['_-@Строительство, каменщик, печник'] = {
        }

metadict_model['_-@Строительство, кровельщик'] = {
        }

metadict_model['_-@Строительство, маляр'] = {
        }

metadict_model['_-@Строительство, плотник'] = {
        }

metadict_model['_-@Строительство, разнорабочий'] = {
        }

metadict_model['_-@Строительство, разнорабочий-пегас'] = {
        }

metadict_model['_-@Строительство, штукатур'] = {
        }

metadict_model['_-@Транспорт, водовоз'] = {
        }

metadict_model['_-@Транспорт, водовоз-пегас'] = {
        }

metadict_model['_-@Транспорт, водопроводчик'] = {
        }

metadict_model['_-@Транспорт, возничий-зебра'] = {
        }

metadict_model['_-@Транспорт, возничий-пегас'] = {
        }

metadict_model['_-@Транспорт, грузчик'] = {
        }

metadict_model['_-@Транспорт, грузчик-зебра'] = {
        }

metadict_model['_-@Транспорт, железнодорожник'] = {
        }

metadict_model['_-@Транспорт, железнодорожник-пегас'] = {
        }

metadict_model['_-@Транспорт, лётчик-пегас'] = {
        }

metadict_model['_-@Транспорт, моряк'] = {
        }

metadict_model['_-@Транспорт, моряк-пегас'] = {
        }

metadict_model['_-@Транспорт, почтальон-пегас'] = {
        }

metadict_model['_-@Транспорт, почтовый служащий'] = {
        }

metadict_model['_-@Транспорт, путевой смотритель'] = {
        }

metadict_model['_-@Транспорт, таксист-пегас'] = {
        }
