#----
# Заметки:
    # Основные культуры:
        # https://en.m.wikipedia.org/wiki/Staple_food
        # https://ru.wikisource.org/wiki/ЭСБЕ/География_растений
    # Физико-механические свойства пшеницы, рожи, овеса, ячменя:
        # http://razvitie-pu.ru/?page_id=6665
    # Нормы высева полевых культур:
        # http://www.agrocounsel.ru/normy-vyseva-polevyh-kultur
    # Удобрения (1895 год):
        # https://istmat.org/node/27385
    # Разрыв между урожаем на корню и результатами обмолота (1935):
        # https://istmat.org/node/25125
    # Урожайность сельскохозяйственных культур (1964 год):
        # https://kaz-ekzams.ru/biologiya/uchebnaya-literatura-po-biologii/zhiznennye-resursy-chelovechestva/pishhevye-resursy/7145-urozhajnost-selskohozyajstvennyh-kultur.html
    # История сельского хозяйства США (с трудозатратами):
        # Rogin L. The Introduction of Farm Machinery. Berkeley: University of California Press, 1931
    # Традиционная белорусская деревня в европейской перспективе Земледелие и животноводство
        # http://vln.by/node/217
    # Великорусский пахарь и особенности российского исторического процесса
        # https://www.gumer.info/bibliotek_Buks/History/milov/01.php
    # Россия 1913 год. Статистико-документальный справочник
        # https://www.gumer.info/bibliotek_Buks/History/Stat/08.php
    # Россия 2024 год (1.9% населения мира), Растениеводство в процентах от мирового:
        # https://olegmakarenko.ru/2901099.html
    # Сельскохозяйственная статстика Российской империи:
        # Российская империя и страны мира в цифрах И.Г.Калабеков
        # http://ricw.ru/rish.html
        # https://istmat.org/node/21593
        # https://istmat.org/node/21363
    # Тесты:
        # amber -S "речной кантон" -E "|-посевы"
        # amber -S "речной кантон" -E "|--посевы"
        # amber -S "Эквестрия" -E "сады"
        # Перевод (пуды/десятина -> центнеры/гектар): 55 × 16.4 / 1.09 / 100 = 8.28

#----
# Урожайность (по странам мира)
    # Годовой сбор зерновых и картофеля 1908 год.
        # Культура     | Мировой урожай
        # ------------ | --------------
        # Пшеница      | 92 млн тонн
        # Кукуруза     | 89
        # Овёс         | 62
        # Рожь         | 50
        # Ячмень       | 31
        # Картофель    | 136
    # Урожайность зерновых (Бавария, 1886 год, 5.42 млн. населения)
        # Культура     | млн тонн | кг/чел   | центнеров/гектар
        # ------------ | -------- | -------- | ----------------
        # Пшеница      | 0.834    | 154      | 25.8
        # Рожь         | 1.330    | 245      | 24
        # Овёс         | 1.176    | 217      | 26.1
        # Ячмень       | 0.972    | 179      | 27.7
        # Полба        | 0.249    | 46       | 27
        # Картофель    | 5.454    | 1006     | 182
        # Всего зерновых -- 841 кг/человека (в России было 370 кг/чел)
        # https://ru.wikisource.org/wiki/ЭСБЕ/Бавария
    # Урожайность хлебов в России и других странах в 1913 год.
        # Культура   | Россия    | Канада | Германия
        # ---------- | --------- | ------ | --------
        # Пшеница    | 8.38 ц/га | 14.14  | 23.62
        # Рожь       | 8.42      | 9.18   | 19.11
        # Ячмень     | 9.33      | 16.24  | 22.27
        # Овёс       | 9.48      | 16.09  | 21.96
        # Картофель  | 73.88     | 112.84 | 159.04
        # Удобрения* | 6.4 кг/га | 44.28  | 114.32
        # Удобрения искусственные всех видов.
        # https://istmat.org/node/183
        # https://www.gumer.info/bibliotek_Buks/History/Stat/08.php
    # Севооборот:
        # Норфолкский (на 4 года): пшеница, репа, ячмень, клевер.
        # Оптимальный (51.35 ГДж/га): ячмень, овёс, люпин, горох.
        # https://ru.wikisource.org/wiki/ЭСБЕ/Севооборот
        # "УДК 633.351.631.524.8"
    # Азот от бобовых:
        # Фермент нитрогеназа (N2 воздуха + 18 МДж/кг --> NH3 аммиак)
        # Люцерна, клевер и вика, бобы, фасоль и арахис.
        # Горох -- 20-60 кг/гектар
        # Бобовые -- 40 кг/гектар
        # Люпин белый -- 40-80 кг/гектар
        # При ротации с зерновыми, 3-4 месяца бобовые, затем зерно.
    # Удобрения:
        # Растения усваивают
        # - 1961 год -- 68% азота (начало зелёной революции)
        # - 1980 год -- 47% азота (высокопродуктивные сорта)
        # - 2020 год -- 40% азота (Франция, Китай)
        # * В 1960 году 60% фермеров США использовали удобрения.
        # Навоз (0.5% азота) -- 10-40 тонн/гектар
        # Азотные удобрения -- 100-200 кг/гектар
        # Мочевина (46% азота) -- основное
        # Нитрат аммония (28-32% азота) -- редкое
        # Lassaletta L. et al. 50 year trends in nitrogen use efficiency of world cropping systems:
        # the relationship between yield and nitrogen input to cropland //
        # Environmental Research Letters. 2014. 9. 105011.
        # Guo J. et al. The rice production practices of high yield
        # and high nitrogen use effciency in Jiangsu //
        # Nature Scientific Reports. 2016. 7. Article 2101.
    # Цены удобрений (1897 год):
        # - суперфосфат (12% фосфорной кислоты, 0.3 тонны/гектар) -- 29.3 рублей/тонна
        # - фосфоритная мука (26% фосфорной кислоты, 0.5-0.8 тонны/гектар) -- 24.4 рублей/тонна
        # - сырой гипс (0.25-0.41 тонны/гектар) -- 18.3 рублей/тонна
        # - каинит (12% калия, 0.3 тонны/гектар) -- 45.8 рублей/тонна
        # - чилийская селитра (15% азота) -- 120 рублей/тонна
        # Фосфат и калий доступны и дешёвы, чилийские нитраты открыты в 1809 году.
    # Цены удобрений (2013 год):
        # Суперфосфат (26% фосфора) -- 414 долларов/тонна (25 рублей 1897 года)
        # Калийная соль (60% калия) -- 360 долларов/тонна (22 рубля 1897 года)
        # Аммиачная селитра (34.4% азота) -- 200 долларов/тонна (12.1 рубля 1897 года)
        # Азотные удобрения (2020 год) -- 60% Азия, 25% Европа и США, 5% Африка
        # Удобрения (Мир, 2022) -- 207.1 млн тонн (57% азотные, 22% фосфорные, 21% калийные)
    # Фотосинтез растений:
        # Солнечная постоянная -- 1366 Вт/м² (атмосфера отражает 25%)
        # Среднесуточное поглощение Землёй -- 239 Вт/м²
        # Максимум мощности фотосинтеза -- ~100 ватт/м²
        # Фотоны в 400-700 нм диапазоне -- 53%
        # Поглощённые растением фотоны -- 37%
        # Поглощается хлорофиллом -- 28.2%
        # Синтезируется сахара -- 9%
        # Сахара на развитие -- 5.4%
        # Сахара в плодах -- 0.25-0.5%
    # Синтез глюкозы растениями:
        # Среднее излучение -- 225 Вт/м² (7100 МДж/м² в год)
        # Средняя продуктивность -- 0.86 Вт/м² (270 ГДж/га, 26.5 ц/га)
        # - Рекомбинация элементов -- 100% КПД (0.102 МДж/грамм)
        # - Растения в среднем -- 0.64% КПД (16 МДж/грамм, 0.45 кг/м², 45 ц/га)
        # - Сахарный тростник -- 0.38% КПД (27 МДж/грамм, 0.26 кг/м², 26 ц/га)
        # Солнечные батареи (Urumqi, China 2024) -- 1600 ГДж/га (2.1% энергии)
        # https://en.wikipedia.org/wiki/Photosynthetic_efficiency
    # Антропогенная энергия:
        # Работа человека: 0.05-0.1 кВт-час, 1.5-2.9 МДж/день, 20% КПД, 1800-3500 ккалл/день
        # 1900 год -- 0.01 ЭДж (0.2 ГДж/гектар, 85% труд человека и животных, 60% вспашка)
        # 2015 год -- 15 ЭДж (18 ГДж/гектар при 50 ГДж/га урожая в целом)
        # "Энергия и цивилизация" Вацлав Смил.
    # Орошение:
        # Расход воды (1134 мм/год) -- 11 339 кубометров/гектар (на вегетацию 8889 м³/га)
        # 1900 год -- 50 млн га орошаемых земель (1.5-3 чел/га Хива, 10 чел/га Япония)
        # 2015 год -- 250 млн га орошаемых земель (18% от всех, 70% в Азии)
        # Обрабатываемая площадь расширилась на 40%
    # Испарение воды растениями:
        # Транспирационный коэффициент, это испарение воды через устьица при фотосинтезе.
            # Культура     | На грамм сухой массы
            # ------------ | --------------------
            # Кукуруза     | 368 грамм воды
            # Пшеница      | 513
            # Подсолнечник | 790
            # Ячмень       | 431
            # Картофель    | 636
            # Гречиха      | 578
            # Хлопчатник   | 645
            # Рис          | 410
            # Люцерна      | 831
        # Зерновые -- 20% сухого вещества, 0.4-0.5 зерно/стебль, 1 кг зерна = 1 кубометр воды.
            # Гектар       | Урожай      | Множитель    | Воды на вегетацию | Осадков мм
            # ------------ | ----------- | ------------ | ----------------- | ---------------
            # Кукуруза     | 5 тонн      | 350          | 1750 кубометров   | 175 мм
            # Пшеница      | 3           | 1000         | 3000              | 300
            # Горох        | 1.5         | 626          | 939               | 94 
            # https://ru.wikisource.org/wiki/ЭСБЕ/Испарение
        # Испарение в лесу в 2.5 раза медленее, чем в поле:
            # За 7 месяцев. Бавария.
            # - В поле -- 377 мм (100%)
            # - В лесу -- 158 мм (42%)
            # - Под сухой листвой -- 62 мм (16%)
            # https://ru.wikisource.org/wiki/ЭСБЕ/Отенение_почвы

#----
# Земледелие (Российская империя 1887-1916 годы, СССР 1928-1938 годы):
    # - 170 млн населения, 120 млн заняты в сельском хозяйстве (17 млн. семей)
    # - 306 млн гектаров обрабатываемых земель (14% территории, 18 га/семью)
    # - 109 млн гектаров посевов (5% территории, 6.4 га/семью)
    # 1923-24, потребление зерна -- 13.3-15.1 пудов/душу (218-248 кг/душу)
    # Норма потребления зерновых (статист. комитет РИ, 1900 год) -- 233 кг/душу
    # 24 пуда зерновых на взрослого крестьянина -- 400 килограмм/работника
    #
    # Расход зернофуража на голову скота (СССР 1923-24 году)
    # вид скота      | зерна (кг)    | муки и отрубей для подсыпки
    # -------------- | ------------- | ---------------------------
    # Рабочая лошадь | 234.5         | 93.5
    # Корова         | 9.8           | 65.6
    # Свинья         | 13.1          | 60.7
    # 250-260 кг/лошадь по расчётам Т. И. Осьминского
    # 1 кормовая единица сена = 5.9 МДж = 1 кг овса = 2.5 кг сена
    # Рацион 600-кг лошади при средних работах (25 км) = 11-12 КЕ = 5 кг овса 15 кг сена
    # 300-кг лошадь 45 кгс -- 3.8 КЕ вне работ; 6.2 КЕ 4 час 15 км; 9.2 КЕ 6 час 25 км
    # 600-кг лошадь 80 кгс -- 6.7 КЕ вне работ; 11.2 КЕ 4 час 15 км; 15.9 КЕ 6 час 25 км
    # 80 дней средней работы 300-кг лошади при 50% овса = 370 кг овса (давали 250 кг)
    # 150 дней средней работы 600-кг лошади при 50% овса = 1200 кг овса (давали 720 кг)
    # Фураж лошадей (США 1915) -- 604 кг/лошадь (37.6 млн га, 15.1 млн тонн овса, 25 млн лошадей и мулов)
    # Фураж лошадей (Россия 1897) -- 447 кг/лошадь (17.1 млн га, 8.4 млн тонн овса, 18.8 млн лошадей)
    # Фураж лошадей (Россия 1913) -- 550 кг/лошадь (19.7 млн га, 14.4 млн тонн овса, 22.8 млн лошадей)
    # Сено не более 8-12 кг/сутки = 3.2-4.8 кормовых единиц
    # https://www.gumer.info/bibliotek_Buks/History/milov/02.php
    # https://blender-chat.livejournal.com/135315.html
    # https://ru.wikisource.org/wiki/ЭСБЕ/Россия/Экономический_отдел/Россия_в_сельскохозяйственном_отношении
    # https://istmat.org/node/188
    #
    # Животные (1913 год)     | Количество  | На 7 селян
    # ----------------------- | ----------- | ----------
    # Лошади                  | 22 771 000  | 1.6
    # Крупный рогатый скот    | 31 074 600  | 2.5
    # Овцы и козы             | 42 299 400  | 3.6
    # Свиньи                  | 13 483 300  | 0.7
    # На скотину семья тратила 180-450 кг зерна (25-65 кг/человека)
    #
    # Тягловое | Вес        | Тяга      | Скорость    | Мощность
    # -------- | ---------- | --------- | ----------- | ------------
    # Лошадь   | 300-700 кг | 45-80 кгс | 0.9-1.1 м/с | 450-850 Ватт
    # Мул      | 350-500    | 50-60     | 0.9-1       | 500-600
    # Вол      | 350-700    | 40-70     | 0.6-0.8     | 250-550
    # Корова   | 200-400    | 20-40     | 0.6-0.7     | 100-300
    # Буйвол   | 300-600    | 30-60     | 0.8-0.9     | 250-550
    # Осёл     | 200-300    | 15-30     | 0.6-0.7     | 100-200
    # Формула тяги лошадей:
        # P = Q/9+12,
        # где:
        # Р — сила тяги (кгс);
        # Q — масса лошади (кг);
        # 12 — постоянная величина.
        # Лошадиная сила (0.75 кВт) = 75 кгс × м/с (0.9-1.1 м/с, 3.6 км/час)
        # Тяга 15% от веса животного, у лошадей до 35% при кратких нагрузках (до 2 кВт)
        # Причина: лошади помогает инерция, передняя половина тела тяжелее задней (3:2)
    # Тяговое усилие:
        # Тяжеловоз 900 кг = 90 кгс (0.75 кВт)
        # Першерон 500 кг = 50 кгс (0.5 кВт)
        # Лошадь 300 кг = 45 кгс
        # Пони 70 кг = 20 кгс (до 0.2 кВт)
        # Першерон в 500 кг, работающий с мощностью 500 Вт (50 кгс), потреблял около 10 МДж/ч.
        # Потоотделение -- лошадь до 100 г/м² кожи; верблюд 250 г/м²; человек 500-2000 г/м²
    # Необходимая тяга:
        # 80-120 кгс -- неглубокая вспашка
        # 120-170 кгс -- глубокая вспашка
        # 200 кгс -- механическая жатка и сноповязалка
        # 2 кгс/тонна -- баржа в канале при 3.6 км/час
        # 6 кгс/тонна -- баржа в канале при 7.2 км/час
        # 30 кгс/тонна -- гладкая, твёрдая, сухая дорога.
        # 150 кгс/тонна -- неровная земляная поверхность.
        # 210-300 кгс/тонна -- песчанная или болотистая почва.
    # Тракторы:
        # Поголовье скота (1915-1925 годы, США) -- 21.4 млн лошадей, 5.9 млн ослов (~20 ГВт)
        # 1910-е -- 90% тягловой силы скота, 10% тракторов
        # 1927 год -- 50% тягловой силы скота, 50% тракторов
        # 1940 год -- 33% тягловой силы скота, 66% тракторов
        # 1963 год -- <8% тягловой силы скота, >92% тракторов
        # Сельскохозяйственные машины работают по 500 часов/год
        # "Энергия и цивилизация" Вацлав Смил
    # Машины:
        # Сеялка (на 6 метров разброса) = 3 севца:
        # Жнея, жатка (на 4 лошадях) = 30 косцов
        # https://ru.wikisource.org/wiki/ЭСБЕ/Земледельческие_машины
    #
    # Инструмент (1913 год)   | Количество  | На 10 000 населения | Га посевов/орудие
    # ----------------------- | ----------- | ------------------- | -----------------
    # - Сохи                  | 7 867 502   | 463                 | 14
    # - Косули                |   966 346   | 57                  | 113
    # - Плуги деревянные      | 3 002 544   | 177                 | 36
    # - Плуги железные        | 5 446 790   | 320                 | 20
    # - Плуги паровые         |       335   | -                   | -
    # - Бороны деревянные     | 5 663 420   | 335                 | 19
    # - Бороны с жел. зубьями | 1 527 581   | 90                  | 71
    # - Бороны железные       |   490 457   | 29                  | 222
    # - Сеялки                |   354 481   | 21                  | 307
    # - Жатки                 |   811 023   | 48                  | 135
    # - Молотилки конные      |   549 895   | 32                  | 198
    # - Молотилки паровые     |    27 072   | 1.6                 | -
    # - Веялки                | 2 099 430   | 124                 | 52
    # - Сенокосилки           |   200 388   | 12                  | 544
    # - Конные грабли         |   252 619   | 15                  | 432
    # На 1 десятину посева капитал в с.‑х. машинах составит (1926 год):
    # - в 1926/27 г. -- 8 руб. 10 коп.
    # - в 1931/32 г. -- 10 руб. 50 коп.
    # На 1 крестьянское хозяйство, Новгородская губерния (7 человек)
    # - в 1901 г. -- 26 рублей (13.5 рублей возы, сани, конная упряжь)
    # https://www.gumer.info/bibliotek_Buks/History/Stat/08.php
    # https://istmat.org/node/43426
    #
    # Трактор (1927) -- 100 га/год, 10 лет амортизация, 1700 рублей/трактор
    # Затраты населения на приобретение с-х инвентаря -- 4-7% (от товарного зерна)
    # "Сельскохозяйственное машиностроение и индустриализация СССР" 1928 год
    # https://istmat.org/node/43401
    #
    # Инструмент (Богемия)    | Га посевов/орудие
    # ----------------------- | -----------------
    # Плуг паровой            | 1000
    # Молотилка паровая       | 250
    # Жатвенная машина        | 70
    # Молотилка конная        | 70
    # Плуг упряжной           | 30
    # Борона упряжная ×2      | 30
    # Мотыга упряжная         | 30
    # - Образцовое земледелие, капитал (169 га, Германия, 1900 год) -- 46 000 рублей (272 руб/гектар)
    # https://ru.wikisource.org/wiki/ЭСБЕ/Инвентарь_сельского_хозяйства
    #
    # Стоимость инструментов:
    # - плуги (опт, 715 раб) -- 20.4 руб/плуг (26.1-45.8 нормо-часов/плуг)
        # паровой плуг вытесняет 2/3 ручного труда
    # - однолемешковые плуги (опт, 300 раб) -- 12.5 руб/плуг (24 нормо-часа/плуг)
    # - борона зиг-заг (ширина 40 вершков, вес 86.4 кг) -- 27 рублей
    # - Сеялки разбросные 8-рядные -- 65|81 рублей/штука
    # - жатка, жнея, жатвенная машина, косилка (для хлеба, травы, льна) -- 150 рублей
        # Производительность (3 рабочих): 8 десятин, 3 нормо-часа/десятина
        # ширина 2 аршина, 5.75 вершка, вес -- 492 кг
        # два шкифа и приводной ремень от ходового колеса
        # Упряжь -- пара лошадей.
    # - ручная молотилка (кованое железо, две рукоятки, вес 220 кг) -- 62 рубля
    # - конная молотилка (две рукоятки, вес 220 кг) -- 114 рублей
    # - конный привод (24-48 оборотов штанги = 1 оборот коня, вес 420 кг, 2-4 лошади) -- 100 рублей
    # - ручная веялка (внтилятор, очистка зерна воздухом, вес 100 кг) -- 23 рубля
    # - Сенокосилки 4.5-футовые -- 90|112.5 рублей/штука
    # - грабли упряжные (стальные зубцы, рабочая колея 0.73 метра) -- 60 рублей
    # - Грабли конные 8-футовые -- 40|50 рублей/штука

#----
# Земледелие (трудозатраты):
    # Гектар зерновых (вспашка с плугом и волами) -- 150-400 нормо-часов (19-50 рабочих дней)
        # Фермерское хозяйство (север Франции, 18 век)
            # Страда на севере Франции -- 230 дней/год
            # Всего 39-42 нормо-дней/гектар
        # Монастырское хозяйство (Россия, 18 век)
            # Страда в нечерноземье России -- 130 дней/год
            # обыкновенная соха. Неглубокая вспашка, яровой хлеб родится хуже озимого.
            # финская борона (пластины молодых елей, сучья снизу на пядь длиной, держат в воде для тяжести)
            # борона разбивает комья земли после сохи. Мотыгой вдвое-вчетверо дольше.
            # Всего 54.1 нормо-дней/гектар
            # https://www.gumer.info/bibliotek_Buks/History/milov/index.php
        # Крестьянское хозяйство (Россия, 19 век):
            # - Вспашка, боронование и сев -- 5-20 нормо-дней/гектар
                # зависит от почвы и числа вспашек (двоение, троение)
                # На гектар -- 50-60 километров пути с сохой (норма 8-12 км/день)
            # - Прополка -- 4 нормо-дня/гектар
                # Пропалывание и окучивание -- 16 дней/год
            # - Удобрение -- 4-6 нормо-дней/гектар (1.8 нормо-часа/тонна навоза)
                # Удобрение навозом -- 22.6 тонны/гектар (раз в 6 лет)
                # Удобрение навозом -- 107 возов/десятина
                # Удобрение навозом -- 45 тонн/гектар
            # - Жатва -- 12-15 нормо-дней/гектар
            # - Возка и скирдование -- 2-4 нормо-дней/гектар
            # - Сушка и молотьба -- 12 нормо-дней/гектар (~10 центнеров зерна)
            # Всего 47 дней/гектар
            # https://ru.wikisource.org/wiki/ЭСБЕ/Земледельческие_рабочие
            # https://ru.wikisource.org/wiki/ЭСБЕ/Земледельческие_машины
        # Латифундрия (Рим, 1-2 века н.э.)
            # Деревяныный плуг, волы, сеяли вручную, жали серпами, молотили цепами.
            # Урожайность (пшеница) -- 5 центнеров/гектар
            # Всего 180-250 нормо-часов + 200 быко-часов (440 МДж/га, 0.9 МДж/кг)
        # Крестьянское хозяйство (Южный Китай, династия Цинь, 1900 год)
            # Удобрения (навоз) -- 10 тонн/га (50 кг азота дают зерна +250 кг/гектар) 
            # Урожайность (пшеница) -- 15 центнеров/гектар
            # Всего 300 нормо-часов + 250 быко-часов (560 МДж/га, 0.4 МДж/кг зерна, 17-40% внесение удобрений)
        # Крестьянское хозяйство (Япония, Meiji Restoration, 1900 год)
            # Сбор нечистот в городе, чистка канала, подъём воды, работа вручную.
            # Затопляемые поля ~0.5 га/дворохозяйство, 2-3 работника, 0.15 скота.
            # Урожайность (рис) -- 24-30 центнеров/гектар
            # Всего 2800-3100 нормо-часов (1000-1100 МДж/га, 0.37-0.46 МДж/кг зерна)
        # Фермерское хозяйство (долина Джерси, Нью-Йорк, 1801 год)
            # Воловья упряжка, деревянный плуг и борона, посев вручную, серпы и цепы.
            # - Вспашка, боронование и сев -- 27 нормо-часов/гектар
            # - Жатва, возка и скирдование -- 120 нормо-часов/гектар
            # Урожайность (пшеница) -- 10 центнеров/гектар
            # Всего 150 нормо-часов + 70 быко-часов (180 МДж/га, 0.2 МДж/кг зерна)
        # Фермерское хозяйство (долина Красной реки, Северная Дакота, 1901 год)
            # Упряжка из 4 лошадей, многолемешевый стальной плуг и борона, Механическая сеялка
            # Механическая жатка (или комбайн до 40 лошадей), Паровая молотилка
            # Урожайность (пшеница) -- 10 центнеров/гектар
            # Всего 22 нормо-часа + 37 коне-часов (108 МДж/га, 0.1 МДж/кг зерна)
        # Фермерское хозяйство (Россия, 2007 год)
            # Урожайность (пшеница) -- 20 центнеров/гектар
            # Всего 17-20 нормо-часов/гектар (??? МДж/кг зерна)
        # Фермерское хозяйство (долина реки Арканзас, 2021 год)
            # Урожайность (пшеница) -- 30-50 центнеров/гектар
            # Всего 2 нормо-часа/гектар (4 МДж/кг зерна)
            # "Как устроен мир на самом деле. Наше прошлое, настоящее и будущее глазами ученого" Вацлав Смил
            # "Энергия и цивилизация" Вацлав Смил
    # Работы:
        # Задача               | Италия 200 год | Англия 1200 год | Нидерланды 1800 год
        # -------------------- | -------------- | --------------- | -------------------
        # Вспашка волы/лошади  | 37/74 чел/скот | 25/150          | 15/30
        # Боронование          | 8/16           | 7/14            | 5/10
        # Сев вручную/сеялка   | 4/-            | 4/-             | 3/6
        # Внесение навоза      | -              | -               | 40/60
        # Жатва серпы/косы     | 50/-           | 50/-            | 24/-
        # Вывоз урожая         | 15/30          | 10/20           | 7/14
        # Обмолот волы/цепы    | 30/60          | 30/-            | 33/-
        # Веяние               | 25/-           | 25/-            | 30/-
        # Пересыпка в мешки    | 8/-            | 7/-             | 10/-
        # Всего                | 177/180 часов  | 158/184         | 167/120
        # Урожай зерна         | 4 центнера     | 5               | 20
        # Энергия затрачена    | 142 МДж        | 126             | 134
        # Пищевая ценность     | 3.3 ГДж        | 4.9             | 22.2
        # Возврат энергии      | ×23 раза       | ×39             | ×166
        # "Энергия и цивилизация" Вацлав Смил
    # Работы, 1900 год, черноземье, озимый хлеб:
        # | Работы            | Сезон         | Рабочие дни (8-10 часов)
        # | ----------------- | ------------- | ------------------------
        # | 1-я пахота        | осень         | 2—3 мужских Р. дня      
        # | бороньба          | осень         | 1—2 женск. Р. дня       
        # | 2-я пахота        | весна         | 2 мужск. Р. дня         
        # | бороньба          | весна         | 1 женского Р. дня       
        # | посев и бороньба  | весна         | 0.33 м. и 0.5 ж. Р.дня  
        # | уборка косой      | осень         | 3 м. и 4 ж. Р. дня      
        # | возка             | осень         | 0.25 м. и 1 ж. Р. дня   
        # Всего: 15-17 рабочих дней.
    # Работы, 1900 год, черноземье, яровой хлеб:
        # | Работы            | Сезон         | Рабочие дни (8-10 часов)
        # | ----------------- | ------------- | ------------------------
        # | весенняя пахота   | осень         | 2 мужских Р. дня      
        # | бороньба          | осень         | 1—2 женск. Р. дня       
        # | посев и бороньба  | весна         | 0.33 м. и 0.5 ж. Р.дня  
        # | уборка косой      | осень         | 2.5 м. и 4 ж. Р. дня      
        # | возка             | осень         | 0.25 м. и 1 ж. Р. дня   
        # Всего: 12 рабочих дней.
        # https://ru.wikisource.org/wiki/ЭСБЕ/Рабочее_время
        # https://ru.wikisource.org/wiki/ЭСБЕ/Мелиорации_сельскохозяйственные
        # https://grigvas.livejournal.com/830738.html

metadict_detail['_Выращивание пшеницы (центнер)'] = {
        # Урожайность: 30 центнеров с гектара.
        # Урожайность пшеницы (Германия, 1885-1894 годы) -- 12 центнеров/гектар
        # Урожайность пшеницы (Эреванская губерния, 1900 год) -- 14.5 центнеров/гектар
        # Урожайность пшеницы (Хивинское ханство, 1900 год) -- до 22.6 центнера/гектар
        # Урожайность американских прерий, зерновые (Кропоткин) -- 30 центнеров/гектар
        # Транспирационный коэффициент (по зерну) -- 0.24-0.33 м³/кг (855 тонн/га)
        # Урожай в 30 ц/га = 60 кг азота, 14.4 кг фосфора, 12 кг калия, 7.5 кг серы, 3 кг кальция, 3 кг магния.
        # "Laloux et al. 1980"
        # Пшеница требует 75 кг/гектар азотных удобрений
        # http://razvitie-pu.ru/?page_id=6621
        '|-Посевы пшеницы (гектар)':1 / 30,
        }

metadict_detail['_Выращивание ржи (центнер)'] = {
        '|-Посевы ржи (гектар)':1 / 25,
        }

metadict_detail['_Выращивание овса (центнер)'] = {
        # Исторически, выращивался на плохих землях, без удобрений
        # https://ru.wikisource.org/wiki/ЭСБЕ/Овес,_культурный_злак
        '|-Посевы овса (гектар)':1 / 25,
        }

metadict_detail['_Выращивание ячменя (центнер)'] = {
        # Урожайность ячменя (Эреванская губерния, возвышенности, 1900 год) -- 9.4 центнеров/гектар
        # Как и овёс выращивался на плохих землях, без удобрений
        # https://ru.wikisource.org/wiki/ЭСБЕ/Ячмень,_в_сельском_хозяйстве_и_торговле
        '|-Посевы ячменя (гектар)':1 / 30,
        }

metadict_detail['_Выращивание просо (центнер)'] = {
        # Урожайность: лучший -- сам-50, средний -- сам-20
        '|-Посевы просо (гектар)':1 / 30,
        }

metadict_detail['_Выращивание мака (центнер)'] = {
        # Урожайность: лучший -- сам-40
        # Урожайность М. не более 30—40 пд. на дес (600 кг/гектар)
        # Опиума получается с десятины от 25 до 45 и до 150 фн.
        # https://ru.wikisource.org/wiki/ЭСБЕ/Мак,_род_растений
        '|-Посевы мака (гектар)':1 / 6,
        }

metadict_detail['_Выращивание кукурузы (центнер)'] = {
        # Урожайность кукурузы (США, 1920 год) -- 20 центнеров/гектар
        # Урожайность кукурузы (США, 2020 год) -- 110 центнеров/гектар
        # Густота высадки -- 50 000 растений/гектар
        # Период вегетации -- 40-60 дней (Италия, скороспелые)
        # Фотосинтез кукурузы эффективнее пшеничного.
        # Вес зерна составляет 70 — 72% от веса початка
        # Транспирационный коэффициент (по зерну) -- 0.16-36 м³/кг (1500 тонн/га)
        # Кукуруза испаряет в 1,5 раза менее пшеницы, в 2 — свеклы, 2,5 — овса и 3,5 — клевера.
        # Кукуруза требует 150 кг/гектар азотных удобрений
        # Физико-механические свойства кукурузы
        # http://razvitie-pu.ru/?page_id=6639
        # https://ru.wikisource.org/wiki/ЭСБЕ/Маис
        '|-Посевы кукурузы (гектар)':1 / 50,
        }

metadict_detail['_Выращивание риса посевного (центнер)'] = {
        # Урожайность риса -- 22-42 центнеров/гектар (современная 60 ц/га)
        # Урожайность риса (Япония, 1886-1901) -- 18-25.7 ц/га (12-17.1 коку/га)
        # Урожайность риса (Япония, 1890-е) -- 25.3-32.2 ц/га (2800-3100 нормо-часов)
        # Урожайность риса (Япония, 1900 год) -- 24 ц/га (4400 нормо-часов)
        # Урожайность риса (Южный Китай, 1900 год) -- 25 ц/га (2000 нормо-часов)
        # Урожайность риса (Эреванская губерния, орошение, 1900 год) -- 39.4 ц/га
        # Период вегитации 150 дней (100 дней поля затоплены), температура 22-30 градусов.
        # Период вегитации 120 дней (90-100 дней поля затоплены) (ЭСБЕ)
        # Транспирационный коэффициент (по зерну) -- 0.4-0.8 м³/кг (2400 тонн/га)
        # Коку риса = 180-200 литров, 150 килограмм (годовой рацион)
        # https://ru.wikisource.org/wiki/ЭСБЕ/Туркестан
        # https://ru.wikisource.org/wiki/ЭСБЕ/Япония/Экономический_очерк
        # "Table 1: Rice Acreage, Yields and Labour Inputs in Japan, 1874-1920"
        # "Rural Society and Agricultural Development in Japan, 1870–1920" B. R. Tomlinson
        '|-Посевы риса посевного (гектар)':1 / 40,
        }

metadict_detail['_Выращивание гречихи посевной (центнер)'] = {
        # Урожайность сам-3, сам-4 на худших землях, сам-5, сам-6 на хороших
        # Гречиха очищает поля от сорняков. Хороший предшественник для ржи.
        # https://ru.wikisource.org/wiki/ЭСБЕ/Гречиха
        '|-Посевы гречихи посевной (гектар)':1 / 10,
        }

#----
# Зерновые-масличные:

metadict_detail['_Выращивание конопли масличной (центнер)'] = {
        '|-Посевы конопли (гектар)':1 / 5,
        }

metadict_detail['_Выращивание льна масличного (центнер)'] = {
        # С десятины урожай семян сам-3, сам-4, а волокна до 10 пудов (164 кг) (в урожайный год)
        '|-Посевы льна (гектар)':1 / 5,
        }

metadict_detail['_Выращивание горчицы белой (центнер)'] = {
        '|-Посевы горчицы белой (гектар)':1 / 5,
        }

metadict_detail['_Выращивание горчицы коричневой (центнер)'] = {
        '|-Посевы горчицы коричневой (гектар)':1 / 5,
        }

metadict_detail['_Выращивание подсолнечника (центнер)'] = {
        # Урожайность -- 60-80 пудов/десятина (10 центнеров/гектар)
        # https://ru.wikisource.org/wiki/ЭСБЕ/Подсолнечник
        '|-Посевы подсолнечника (гектар)':1 / 10,
        }

metadict_detail['_Выращивание кунжута (центнер)'] = {
        # TODO: Стебли кунжута идут на топливо:
        '|-Посевы кунжута (гектар)':1 / 10,
        }

metadict_detail['_Выращивание оливок (центнер)'] = {
        # С одного дерева 1-3 литра масла (270-830 литров/гектар)
        # С большого дерева (Палестина) 120 кг оливок, 25 литров масла (раз в 2 года)
        # Оливы растут на плохих, каменистых почвах, негодных под зерновые.
        # Собирают оливки постелив под деревом ткань. Они сами падают.
        # Калибр оливок -- 200-300 штук/килограмм
        # https://olivaoil.ru/articles/6_kalibr-olivok
        # https://ru.wikisource.org/wiki/ЕЭБЕ/Сад_и_садоводство
        '|-Оливковые сады (гектар)':1 / 30,
        }

#----
# Орехи:

metadict_detail['_Выращивание фисташек (центнер)'] = {
        # Урожайность (Узьбекистан, 2020 год) -- 2.9 центнера/гектар.
        # Урожайность (Соединённые штаты, 2017 год) -- 27 центнеров/гектар
        '|-Фисташковые сады (гектар)':1 / 6,
        }

metadict_detail['_Выращивание миндаля (центнер)'] = {
        # Урожайность, Калифорния 2018: 31 центнер/гектар
        '|-Миндальные сады (гектар)':1 / 10,
        }

#----
# Технические:

metadict_detail['_Выращивание льна технического (центнер)'] = {
        # Здесь вес высушенных в поле растений, а не волокна.
        # Льняное волокно -- 35% массы высушенного стебля (19% влажность)
        '|-Посевы льна (гектар)':1 / 3 * 0.35,
        }

metadict_detail['_Выращивание конопли технической (центнер)'] = {
        # Пеньки при хорошем урожае получали с дес. один берковец (10 пудов, 150 кг/гектар)
        # Волокно -- 20% массы высушенного стебля.
        '|-Посевы конопли (гектар)':1 / 1.5 * 0.2,
        }

metadict_detail['_Выращивание джута технического (центнер)'] = {
        # Волокно -- 20% массы высушенного стебля
        '|-Посевы джута (гектар)':1 / 3 * 0.2,
        }

metadict_detail['_Выращивание хлопчатника технического (центнер)'] = {
        # 26% -- хлопка при первичной обработке сырца.
        # Период вегетации -- 6-8 месяцев, жаркий и сухой климат. 50 кг семян/гектар
        # Урожайность волокна (сев. Америка 1895 года) -- 2.5 центнеров/гектар
        # Урожайность волокна (Андижанский уезд, 1904 год) -- 3 центнера/гектар
        # Урожайность волокна (Египет 1895 года, удобрения) -- 5 центнеров/гектар
        # Урожайность волокна (Хива, 1900 год, местный сорт) -- 1.9 центнера/гектар
        # Урожайность волокна (Бухара, 1900 год, местный сорт) -- 3.2 центнера/гектар
        # Урожайность волокна (Ферганская область, 1900 год, амер. сорт) -- 2.4 центнера/гектар
        # У нас по волокну после обработки на коттон-джине -- 3.1 центнера/гектар
        # amber "_Производство хлопка-сырца" -n 310 -E гектар
        # https://ru.wikisource.org/wiki/ЭСБЕ/Хлопчатник
        # https://ru.wikisource.org/wiki/ЭСБЕ/Хлопчатобумажное_производство
        # https://ru.wikisource.org/wiki/ЭСБЕ/Туркестан
        # https://ru.wikisource.org/wiki/ЭСБЕ/Андижан
        '|-Посевы хлопчатника (гектар)':1 / 3 * 0.26,
        }

metadict_detail['_Выращивание ивы прутовидной (центнер)'] = {
        # Корзиночная ива (белотала)
        # 432 000 черенков/гектар, сухих прутьев 2.3 тонны/гектар (сырых 35 центнеров/гектар)
        # - Крупные прутья, 1.5-2 метра, 12-15 мм -- 100 000 штук/гектар
        # - Средние прутья, 1-1.5 метра, 8-10 мм -- 200 000 штук/гектар
        # - Короткие прутья, 1 метр, 5-7 мм -- 280 000 штук/гектар
        # Глава 5. Выращивание сырья для производства лозовых изделий
        # http://splesti.ru/books/item/f00/s00/z0000004/st023.shtml
        '|-Ива прутовидная, домашняя (Salix viminalis) (гектар)':1 / 35,
        }

#----
# Бобовые:

metadict_detail['_Выращивание арахиса (центнер)'] = {
        # Урожайность (США, 1909 год) -- 7-48 центнеров/гектар (623-4211 pounds per acre)
        # Урожайность (США, 2020 год) -- 44.2 центнеров/гектар
        # 4-5 поливов за сезон. Скашивают, когда влажность бобов 25-50%,
        # Сушат прямо на поле до 10% влажности, дальше в мешках:
        # USDA "Crop Production Historical Track Records" April 2019
        # http://www.nationalpeanutboard.org/peanut-info/how-peanuts-grow.htm
        # https://www.botanichka.ru/article/arachis/
        # https://ru.wikisource.org/wiki/ЭСБЕ/Арахис
        '|-Посевы арахиса (гектар)':1 / 12,
        }

metadict_detail['_Выращивание сои (центнер)'] = {
        '|-Посевы сои (гектар)':1 / 15,
        }

metadict_detail['_Выращивание фасоли (центнер)'] = {
        # Урожайность бобовых -- 0.56 от урожайности зерновых (1960 год)
        # Урожайность бобовых -- 0.34 от урожайности зерновых (2013 год)
        # "Энергия и цивилизация" Вацлав Смил
        '|-Посевы фасоли (гектар)':1 / 20,
        }

metadict_detail['_Выращивание нута бараньего (центнер)'] = {
        '|-Посевы нута бараньего (гектар)':1 / 20,
        }

metadict_detail['_Выращивание гороха посевного (центнер)'] = {
        # Урожайность гороха (Самара, 2011) -- 17 центнеров/гектар
        # Урожайность гороха (Россия, 1900): 6 четв × 0.21 × 0.7 × 10 = 8.8 ц/га
        # https://ru.wikisource.org/wiki/ЭСБЕ/Горох
        # http://www.activestudy.info/uborka-goroxa-2/
        # "УДК: 633.31/37:633.2"
        '|-Посевы гороха посевного (гектар)':1 / 15,
        }

metadict_detail['_Выращивание чечевицы (центнер)'] = {
        # https://ru.wikisource.org/wiki/ЭСБЕ/Чечевица,_в_сельском_хозяйстве
        '|-Посевы чечевицы (гектар)':1 / 15,
        }

metadict_detail['_Выращивание урда (центнер)'] = {
        '|-Посевы урда (гектар)':1 / 15,
        }

#----
# Огородные:

metadict_detail['_Выращивание картофеля (центнер)'] = {
        # Урожайность (ЭСБЕ) -- 140 центнеров/гектар
        # Урожайность (ЭСБЕ, Япония, 1899 год) -- 85 центнеров/гектар
        # Урожайность (современность) -- 250 центнеров/гектар
        # Транспирационный коэффициент (вода/биомасса) -- 0.4-0.55 тонны/кг (сухого)
        # https://ru.wikisource.org/wiki/ЭСБЕ/Япония/Экономический_очерк
        # https://ru.wikisource.org/wiki/ЭСБЕ/Картофель
        # http://razvitie-pu.ru/?page_id=6639
        '|-Посевы картофеля (гектар)':1 / 200,
        }

metadict_detail['_Выращивание топинамбура (центнер)'] = {
        # Многолетнее растение, в севооборот не вводится.
        # Урожайность (ЭСБЕ) -- 85 центнеров/гектар
        # https://ru.wikisource.org/wiki/ЭСБЕ/Груша_земляная
        '|-Посевы топинамбура (гектар)':1 / 160,
        }

metadict_detail['_Выращивание батата (центнер)'] = {
        # Урожайность (ЭСБЕ, Япония, 1899) -- 68 центнер/гектар
        '|-Посевы батата (гектар)':1 / 200,
        }

metadict_detail['_Выращивание томатов (центнер)'] = {
        # Период вегетации -- 60-130 дней (при безрассадном способе на 14-21 день позже)
        # Урожайность (Астраханская губерния, 1913) -- 450 центнеров/гектар
        # Урожайность (современность) -- 300-500 центнеров/гектар
        # Урожайность (современность) -- 600-1000 центренов/гектар
        # Томаты (тепличные) требуют 1000-1500 кг/гектар азотных удобрений
        # https://ru.wikisource.org/wiki/ЭСБЕ/Томаты
        # https://upload.wikimedia.org/wikipedia/commons/3/37/Сад_Огород_и_Бахча_1913_№11.pdf
        '|-Посевы томатов (гектар)':1 / 200,
        }

metadict_detail['_Выращивание тыквы (центнер)'] = {
        # Урожайность (современность) -- 300-400 центнеров/гектар
        # https://ru.wikisource.org/wiki/ЭСБЕ/Тыква
        '|-Посевы тыквы (гектар)':1 / 200,
        }

metadict_detail['_Выращивание арбуза (центнер)'] = {
        # https://ru.wikisource.org/wiki/ЭСБЕ/Арбуз
        '|-Посевы арбуза (гектар)':1 / 250,
        }

metadict_detail['_Выращивание дыни (центнер)'] = {
        # Урожайность (1915 год, Туркестан) -- 7400 дынь/гектар (~370 центнеров/гектар)
        # https://rus-turk.livejournal.com/748275.html
        # https://ru.wikisource.org/wiki/ЭСБЕ/Дыня
        '|-Посевы дыни (гектар)':1 / 250,
        }

metadict_detail['_Выращивание кабачков (центнер)'] = {
        '|-Посевы кабачка (гектар)':1 / 200,
        }

metadict_detail['_Выращивание баклажанов (центнер)'] = {
        # Период вегетации -- 65-85 дней
        # Урожайность (современность) -- 350-450 центнеров/гектар
        # https://ru.wikisource.org/wiki/ЭСБЕ/Баклажан
        '|-Посевы баклажанов (гектар)':1 / 200,
        }

metadict_detail['_Выращивание огурцов (центнер)'] = {
        # Урожайность (ЭСБЕ) -- 160-490 центнеров/гектар (30-100 тыс. штук)
        # Высаживают после капусты. Часто поливают.
        # https://ru.wikisource.org/wiki/ЭСБЕ/Огурцы
        '|-Посевы огурцов (гектар)':1 / 300,
        }

metadict_detail['_Выращивание капусты кудрявой (центнер)'] = {
        # Капуста белокочанная
        # Урожайность (ЭСБЕ) -- 490-820 центнеров/гектар (10-20 тыс. кочанов, 4.1 кг/кочан)
        # Высаживают сразу после удобрения участка.
        # https://ru.wikisource.org/wiki/ЭСБЕ/Капуста
        '|-Посевы капусты кудрявой (гектар)':1 / 500,
        }

metadict_detail['_Выращивание капусты брокколи (центнер)'] = {
        # Урожайность -- 150-300 центнеров/гектар
        '|-Посевы капусты брокколи (гектар)':1 / 200,
        }

metadict_detail['_Выращивание латука посевного (центнер)'] = {
        # Урожайность (современность) -- 200-400 центнер/гектар
        # https://ru.wikisource.org/wiki/ЭСБЕ/Латук
        '|-Посевы латука посевного (гектар)':1 / 300,
        }

metadict_detail['_Выращивание моркови (центнер)'] = {
        # Урожайность (ЭСБЕ) -- 200-600 центнеров с гектара/год
        # Период вегетации -- 80-120 дней (2-3 урожая/лето)
        # https://ru.wikisource.org/wiki/ЭСБЕ/Морковь
        '|-Посевы моркови (гектар)':1 / 400,
        }

metadict_detail['_Выращивание репы (центнер)'] = {
        # Урожайность (18 век) -- 60 центнеров/гектар
        # Урожайность (современность) -- 150-350 центнеров/гектар (листьев 50-200 ц/га)
        # https://www.gumer.info/bibliotek_Buks/History/milov/01_8.php
        # https://ru.wikisource.org/wiki/ЭСБЕ/Репа
        '|-Посевы репы (гектар)':1 / 150,
        }

metadict_detail['_Выращивание брюквы (центнер)'] = {
        # Урожайность (современность) -- 250 центнеров/гектар
        '|-Посевы брюквы (гектар)':1 / 200,
        }

metadict_detail['_Выращивание турнепса (центнер)'] = {
        # Урожайность (современность) -- 220 центнеров/гектар
        '|-Посевы турнепса (гектар)':1 / 200,
        }

metadict_detail['_Выращивание редьки (центнер)'] = {
        # https://ru.wikisource.org/wiki/ЭСБЕ/Редечные
        '|-Посевы редьки (гектар)':1 / 150,
        }

metadict_detail['_Выращивание редиса (центнер)'] = {
        # Вегетационный период -- 20-30 дней
        # https://ru.wikisource.org/wiki/ЭСБЕ/Редечные
        '|-Посевы редиса (гектар)':1 / 300,
        }

metadict_detail['_Выращивание перца сладкого (центнер)'] = {
        # Урожайность (современность) -- 300-350 центнеров/гектар
        '|-Посевы перца сладкого (гектар)':1 / 300,
        }

metadict_detail['_Выращивание перца красного (центнер)'] = {
        '|-Посевы перца красного (гектар)':1 / 150,
        }

metadict_detail['_Выращивание лука репчатого (центнер)'] = {
        # Урожайность (современность) -- 200-300 центнеров/гектар
        '|-Посевы лука репчатого (гектар)':1 / 200,
        }

metadict_detail['_Выращивание лука зелёного (центнер)'] = {
        # Урожайность (современность) -- 300-350 центнеров/гектар
        '|-Посевы лука зелёного (гектар)':1 / 300,
        }

metadict_detail['_Выращивание кресс-салата (центнер)'] = {
        '|-Посевы кресс-салата (гектар)':1 / 500,
        }

metadict_detail['_Выращивание шпината (центнер)'] = {
        # https://ru.wikisource.org/wiki/ЭСБЕ/Шпинат
        # https://ru.wikisource.org/wiki/ЭСБЕ/Щавель
        '|-Посевы шпината (гектар)':1 / 400,
        }

metadict_detail['_Выращивание петрушки (центнер)'] = {
        '|-Посевы петрушки (гектар)':1 / 400,
        }

metadict_detail['_Выращивание укропа (центнер)'] = {
        '|-Посевы укропа (гектар)':1 / 400,
        }

metadict_detail['_Выращивание чеснока (центнер)'] = {
        '|-Посевы чеснока (гектар)':1 / 150,
        }

metadict_detail['_Выращивание свёклы (центнер)'] = {
        # Урожайность (Киевская губерния, 19 век) -- 150 центнеров/гектар
        # https://ru.m.wikipedia.org/wiki/Киевская_губерния#Сельское_хозяйство
        '|-Посевы свёклы (гектар)':1 / 150,
        }

metadict_detail['_Выращивание артишоков (центнер)'] = {
        '|-Посевы артишоков (гектар)':1 / 100,
        }

metadict_detail['_Выращивание ревеня (центнер)'] = {
        # https://ru.wikisource.org/wiki/ЭСБЕ/Ревень
        '|-Посевы ревеня (гектар)':1 / 200,
        }

metadict_detail['_Выращивание сельдерея (центнер)'] = {
        '|-Посевы сельдерея (гектар)':1 / 200,
        }

metadict_detail['_Выращивание пастернака (центнер)'] = {
        # Требователен к условиям и уходу.
        '|-Посевы пастернака (гектар)':1 / 150,
        }

metadict_detail['_Выращивание спаржи (центнер)'] = {
        '|-Посевы спаржи (гектар)':1 / 70,
        }

metadict_detail['_Выращивание хрена (центнер)'] = {
        '|-Посевы хрена (гектар)':1 / 150,
        }

metadict_detail['_Выращивание хмеля (центнер)'] = {
        # Урожайность (Германия, 1896 год) -- 12 центнеров/гектар (сухого хмеля!)
        # Урожайность свежего хмеля (75% воды) -- 60 центнеров/гектар
        '|-Посевы хмеля (гектар)':1 / (12 * 5),
        }

metadict_detail['_Выращивание имбиря (центнер)'] = {
        # Урожайность (современность) -- 150-250 центнеров/гектар (корневища сырые)
        '|-Посевы имбиря (гектар)':1 / 150,
        }

metadict_detail['_Выращивание фенхеля (центнер)'] = {
        # Урожайность (современность) -- 40 центнеров/гектар (60 ц/га листья)
        '|-Посевы фенхеля (гектар)':1 / 40,
        }

metadict_detail['_Выращивание мяты (центнер)'] = {
        # Урожайность (современность) -- 150-160 центнеров/гектар (зелёная масса)
        '|-Посевы мяты (гектар)':1 / 100,
        }

metadict_detail['_Выращивание кориандра (центнер)'] = {
        # Зелень кориандра, кинза.
        '|-Посевы кориандра (гектар)':1 / 100,
        }

metadict_detail['_Выращивание тмина (центнер)'] = {
        # 50 центнеров плодов тмина = 6 центнеров семян
        # Урожайность (СССР) -- 6-10 центнеров/гектар (сушёные семена, 12% влажность)
        # Медоносное растение -- 100 кг/гектар
        # http://www.eda-server.ru/prjan/058.shtml
        '|-Посевы тмина (гектар)':1 / 50,
        }

#----
# Садовые:

metadict_detail['_Выращивание яблок (центнер)'] = {
        # Карликовые яблони, Миннесота (2020 год) -- 180 центнеров/гектар (60% годных на продажу)
        # Сидра получается 7000 литров/гектар (при 80 центнерах урожайности)
        '|-Яблоневые сады (гектар)':1 / 80,
        }

metadict_detail['_Выращивание вишни (центнер)'] = {
        '|-Вишнёвые сады (гектар)':1 / 60,
        }

metadict_detail['_Выращивание черешни (центнер)'] = {
        '|-Черешневые сады (гектар)':1 / 60,
        }

metadict_detail['_Выращивание груши (центнер)'] = {
        '|-Грушёвые сады (гектар)':1 / 80,
        }

metadict_detail['_Выращивание хурмы (центнер)'] = {
        '|-Хурмовые сады (гектар)':1 / 60,
        }

metadict_detail['_Выращивание айвы (центнер)'] = {
        # https://ru.wikisource.org/wiki/БСЭ1/Айва
        '|-Айвовые сады (гектар)':1 / 60,
        }

metadict_detail['_Выращивание винограда (центнер)'] = {
        # Урожайность винограда (Франция, 1895 год) -- 35-42 центнера/гектар (1671 литр/гектар)
        # Урожайность винограда (Кутаиси, Грузия, 1901 год) -- 38 центнера/гектар (1570 литр/гектар)
        # Урожайность винограда (Шуша, Нагорный Карабах, 1901 год) -- 4.64 центнера/гектар (221 литр/гектар)
        # "Лоза должна страдать". Старые виноградники в сухих условиях дают отличныу урожаи.
        # Пони не мучают виноград густой посадкой. Это не кустики, а раскидистые деревья.
        # Вина получается 3200 литров/гектар (при 80 центнерах урожайности)
        # http://vinograd.info/info/vinogradarstvo-po-novomy/gystota-posadki.html
        # https://ru.wikisource.org/wiki/ЭСБЕ/Виноградарство
        # https://ru.wikisource.org/wiki/ЭСБЕ/Франция
        # https://ru.wikisource.org/wiki/ЭСБЕ/Кутаис
        # https://ru.wikisource.org/wiki/ЭСБЕ/Шуша
        '|-Виноградные сады (гектар)':1 / 80,
        }

metadict_detail['_Выращивание лимона (центнер)'] = {
        # 300 плодов/дерево (36 килограмм/дерево, 900 деревьев/гектар, 324 центнера/гектар), 
        # https://ru.m.wikipedia.org/wiki/Лимон
        '|-Лимонные сады (гектар)':1 / 150,
        }

metadict_detail['_Выращивание инжира (центнер)'] = {
        # Смоковница, это фикус, фиги, инжир. Зимние соцветия съедобны в начале апреля.
        # Урожайность 50-140 килограмм/дерево, 156 деревьев/гектар (156 ц/га)
        # https://web.archive.org/http://figtree.com.ua/blog/urozhajnost-inzhira/
        # https://ru.wikisource.org/wiki/ЕЭБЕ/Сад_и_садоводство
        '|-Инжирные сады (гектар)':1 / 150,
        }

metadict_detail['_Выращивание граната (центнер)'] = {
        # Урожайность 30-50 килограмм/куст, 500 деревьев/гектар (150 ц/га)
        # http://berrylib.ru/books/item/f00/s00/z0000043/st018.shtml
        '|-Гранатовые сады (гектар)':1 / 150,
        }

metadict_detail['_Выращивание фиников (центнер)'] = {
        # Урожайность фиников (Сивах, Ливия, 1900 год) -- 9.6 кг/дерево (7.7-24 ц/га при 80-250 пальм/га)
        # Урожайность фиников (Современность) -- 60-80 кг с 13-летнего дерева, 80 пальм/га (50 ц/га)
        # Полив 2 ведра воды на финиковую пальму в день.
        # https://ru.wikisource.org/wiki/ЭСБЕ/Сивах
        '|-Финиковые сады (гектар)':1 / 20,
        }

metadict_detail['_Выращивание абрикоса (центнер)'] = {
        '|-Абрикосовые сады (гектар)':1 / 50,
        }

metadict_detail['_Выращивание персика (центнер)'] = {
        '|-Персиковые сады (гектар)':1 / 50,
        }

metadict_detail['_Выращивание сливы (центнер)'] = {
        # https://ru.wikisource.org/wiki/ЭСБЕ/Слива,_культура
        '|-Сливовые сады (гектар)':1 / 50,
        }

metadict_detail['_Выращивание алычи (центнер)'] = {
        # Алыча тоже слива
        '|-Сливовые сады (гектар)':1 / 50,
        }

metadict_detail['_Выращивание рябины (центнер)'] = {
        # Урожайность черноплодной рябины -- 72 ц/гектар
        # Сбор урожая рябины: 60-80 кг и более за 8-часовой рабочий день (0.11 нормо-часа/кг)
        # http://www.spec-kniga.ru/rastenievodstvo/yagodnye-kultury/osnovnye-yagodnye-kultury-chernoplodnaya-ryabina.html
        '|-Рябиновые сады (гектар)':1 / 50,
        }

#----
# Выращивание грибов:

metadict_detail['_Выращивание шампиньонов (центнер)'] = {
        # TODO: Учти расход компоста и его состав
            # 250 килограмм с тонны компоста (4 кг компоста на килограмм);
            # 50 кг урожай с квадратного метра в год;
            # https://agaricus.ru/statyi-aleksandra-tsareva/gribovodstvo-v-tsifrakh-i-faktakh
        '|-Грядки шампиньонов (квадратный метр)':2,
        '-Пищевые отходы (требуется/килограмм)':4 * 100,
        }

metadict_detail['_Выращивание вёшенок (центнер)'] = {
        # TODO: Уточнить урожайность вёшенок.
            # Учесть расход комоста и его состав
        '|-Грядки вёшенок (квадратный метр)':2,
        '-Пищевые отходы (требуется/килограмм)':4 * 100,
        }

#----
# Собирательство дикоросов, пчеловодство:

metadict_detail['_Сбор пчелиного мёда (центнер)'] = {
        # Сбор мёда (РИ, 1910) -- 32.8 тыс.тонн (206 грамм/чел)
        # - 1910 - 5.715-6.31 млн пчелиных семей, 339k пасек, 5-6 кг/семья, 18-35% рамочных ульев
        # - 1919 - 1.315-3.2 млн
        # - 1929 - 5-6 млн
        # - 1938 - 8.6 млн
        # - 1940 - 10 млн (95% рамочных ульев)
        # - 1945 - 4.9 млн
        # - 1955 - 9 млн, 143k пасек
        # - 1965 - 10 млн пчелиных семей, 10 кг/семья, 90 тыс тонн
        # - 1973 - 9.4 млн, 63k пасек
        # - 1989 - 8.5 млн (4 млн любители на 1 млн пасек), 14 кг/улей, 123 тыс тонн
        # - 1990 - 4.3 млн, 42 тыс тонн
        # - 2000 - 3.4575 млн (83% любители, 15% общ.сектор)
        # - 2010 - 3 млн (90% любители)
        # - 2014 - 3.5 млн (90% в частном секторе), 102 тыс.тонн (30-70% фальшивый)
        # - 2022 - 2.7 млн, 67 тыс.тонн
        # Сбор мёда (Алтай, 1849) -- 1.4 кг/улей
        # Сбор мёда (Тамбовская губерния, 1851) -- 8.2 кг/улей
        # Сбор мёда (Воронежская губерния, 1851) -- 8.2 кг/улей
        # Сбор мёда (Казанская губерния, 1850) -- 6.1-18.4 кг/улей
        # Сбор мёда (Самарская губерния, 1853) -- 12.3-16.4 кг/улей
        # Сбор мёда (Нижегородская губерния, 1850 год) -- 8 кг/улей
        # Сбор воска (Нижегородская губерния, 1850 год) -- 1.23 кг/улей
        # Сбор мёда (Сырдарьинская область, 1900 год) -- 5.5 кг/улей
        # Сбор воска (Сырдарьинская область, 1900 год) -- 0.33 кг/улей
        # Пчелиная семья даёт 25 кг мёда (без подкормки 20 кг)
        # Пчёлам требуется 18-22 кг мёда на зиму.
        # В мире людей пчёл подкарливают сахарным сиропом:
        # Подкормка 30%. 5-8 литров 70% сиропа на улей (3.5-5.6 кг сахара-песка)
        # https://ru.wikisource.org/wiki/ЭСБЕ/Мед,_продукт_пчеловодства
        # https://ru.wikisource.org/wiki/ЭСБЕ/Туркестан
        # https://zoohoz.ru/pchelovodstvo/sezonnoe/zimnyaya-podkormka-11935/
        # http://aromatmeda.ru/pchelovodstvo_v_rossii_19_veka
        # https://ru.wikipedia.org/wiki/Пчеловодство_в_России
        '|-Пчелиная семья (Ápis melliféra)':7,
        }

metadict_detail['_Сбор кленового сока (центнер)'] = {
        '_-Сбор кленового сока (килограмм)':100,
        '-Сок кленовый (требуется/килограмм)':100,
        }

metadict_detail['_Сбор сосновой живицы (центнер)'] = {
        # Подсочка леса:
            # Подсочка деревьев начинается с 12-22 лет
            # 3-4.5 кг живицы с Pinus maritima 45-летнего возраста
            # 2-2.5 кг живицы с сосны обыкновенной 60-летней (1.2 кубометра)
            # Используют стимуляторы выделения, от дрожжей до кислоты.
            # Без стимуляторов 90% живицы выделяется в 24 часа после подсочки.
            # 9 грамм 96% серной кислоты увеличивает выход в 3-6 раз (выработка 2.5 раза)
            # 1 литр серной кислоты + 700 грамм каолина --> загущённая кислота (хранить 10 дней)
        # Организация работ:
            # Франция (1900 год, 39 млн человек) -- ~170 тыс га, 60 000 тонн живицы (1.54 кг/чел)
                # Pinus maritima -- 240-450 кг/гектар.
                # Сосна обыкновенная -- 100-200 кг/гектар.
            # Мастерской участок (Белоруссия, 2011 год) -- 700 гектаров (150-180 карр/гектар)
                # Годовой план добычи -- 20-80 тонн (29-114 кг/га, 0.3 кг/дерево)
                # Рабочий участок -- 5-6 тонн (30-50 гектар, 1.25 кг/карр)
                # Разбивка леса -- 100 карр/гектар (40% деревьев)
                # 60-80% времени тратится на переходы.
            # Начинают работы при +7°C (с первой декады мая до 1 ноября, 170 дней, Белоруссия)
        # Нормы выработки:
            # Подготовительные работы:
            # - Разметка карр -- 1580 карр/день (за 15 дней)
            # - Подрумянивание (снятие коры) -- 120 карр/день (раз в год, 4-5 месяцев)
            # - Перечёт кары -- 1800 карр/день
            # - Проводка направляющих желобков -- 1200 карр/день (весной)
            # - Подноска карроборудования до 150 метров -- 1200 карр/день
            # - Установка карроборудования (приёмника) -- 800-1000 карр/день
            # Один рабочий-вздымщик на участок (12 тысяч карр в 2 недели)
            # Один вздымщик -- 8-10 тонн живицы за сезон (10-16 часов/сутки, 5 дней/неделю)
            # Производственные работы:
            # - Нанесение подновки и стимулятора -- 1350 карр/день (раз в 2 недели)
            # - Сбор живицы -- 80-100 кг/день (в бочки по 200 литров)
            # Один рабочий-сборщик на участок (12 тысяч карр в 20 дней)
            # Один сборщик -- 9.5 тонн живицы за сезон (10-16 часов/сутки, 5 дней/неделю)
            # Один вздымщик-сборщик (ЭСБЕ) -- 300-400 карр/день + 33-49 кг/день
        # Инстурменты:
            # Хаки с резцами, цинковый жёлоб, эмалированный глиняный сосуд.
            # Резцы затупляются после 200-250 карроподновок
            # Химическая заточка. В уксусную кислоту на 18-24 часа при 18-22°C
            # Равномерная коррозия режущей кромки и поверхности резца.
            # Промыть 10-15% раствором бикарбоната натрия (питьевой соды)
            # Резцы с хромированной поверхностью служат 6.6-40 тысяч карроподновок
            # "ПОДСОЧКА ЛЕСА" Н. П. Ковбаса
            # https://ru.wikisource.org/wiki/ЭСБЕ/Живица_и_ее_переработка
        '_-Сбор сосновой живицы (килограмм)':100,
        '-Живица (требуется/килограмм)':100,
        }

metadict_detail['_Сбор дикорастущих грибов (центнер)'] = {
        # Урожайность белого гриба 50-200 килограмм/гектар (10% грибных лесов)
        '_-Работа на сборе дикорастущих грибов (нормо-часов)':40,
        '-Дикорастущие грибы (требуется/килограмм)':100,
        }

metadict_detail['_Сбор дикорастущих орехов (центнер)'] = {
        '_-Работа на сборе дикорастущих орехов (нормо-часов)':40,
        '-Дикорастущие орехи (требуется/килограмм)':100,
        }

metadict_detail['_Сбор дикорастущих растений (центнер)'] = {
        # Анис, бадьян, фенхель, лаванда, кориандр, многие другие.
        # Средняя урожайность дикоросов -- 8.8 центнеров/гектар
        '_-Работа на сборе дикорастущих растений (нормо-часов)':40,
        '-Дикорастущие растения (требуется/килограмм)':100,
        '-Луга дикоросов (требуется/гектар)':1,
        }

metadict_detail['_Сбор и сушка мха (центнер)'] = {
        # Мох (сфагнум) -- 66.9-358 кг/гектар
        '_-Работа на сборе дикорастущих растений (нормо-часов)':20,
        }

metadict_detail['_Сбор дикорастущих ягод (центнер)'] = {
        # Грабельцы -- небольшой совочек с зубьями для сбора ягод. Брусники, клюквы.
        # Биологическая урожайность ягодников -- 70-400 кг/гектар (15-45% леса)
        # Период загодовки 30-45 дней
        '_-Работа на сборе дикорастущих ягод (нормо-часов)':40,
        '-Дикорастущие ягоды (требуется/килограмм)':100,
        '-Луга дикоросов (требуется/гектар)':1,
        }

metadict_detail['_Сбор морской капусты (центнер)'] = {
        '_-Работа на сборе морских растений (нормо-часов)':4,
        '|-Фермы морских растений (гектар)':1 / 100,
        }

metadict_detail['_Сбор красных водорослей (центнер)'] = {
        '_-Работа на сборе морских растений (нормо-часов)':4,
        '|-Фермы морских растений (гектар)':1 / 100,
        }

#----
# Импорт:

metadict_detail['_Выращивание чёрного перца (центнер)'] = {
        '|-Плантации чёрного перца (гектар)':1 / 100,
        }

metadict_detail['_Выращивание гвоздики (центнер)'] = {
        # 200 деревьев на гектар
        '|-Плантации гвоздики (гектар)':1 / 100,
        }

metadict_detail['_Выращивание шафрана (центнер)'] = {
        # 80 000 цветов на гектар
        '|-Плантации шафрана (гектар)':1 / 80,
        }

metadict_detail['_Выращивание плодов кофейного дерева (центнер)'] = {
        # https://ru.wikisource.org/wiki/ЭСБЕ/Кофе
        # Урожайность кофе (Африка, Узамбара, 1895 год) -- 15 центнеров/гектар
        # 900 деревьев/гектар; 1-5 кг кофейных семян с дерева (9-45 центнеров/гектар)
        # Урожайность кофе (туземцы, Ява, 1895 год) -- 0.385 кг/дерево,
            # 650 деревьев/семья, 4400 нормо-часов/гектар
        # Урожайность кофе (Бразилия, Сан-Пауло, 1895 год) -- 1 кг/дерево,
            # 3500 деревьев/семья, 823 нормо-часа/гектар
        # Плоды втрое больше по массе, поэтому умножаем на три.
        '|-Плантации кофейного дерева (гектар)':1 / (15 * 3),
        }

metadict_detail['_Выращивание бананов (центнер)'] = {
        # Средняя урожайность -- 55 центнеров/гектар
        '|-Плантации банана (гектар)':1 / 55,
        }

metadict_detail['_Выращивание манго (центнер)'] = {
        # Средняя урожайность -- 40-70 центнеров/гектар
        '|-Плантации манго (гектар)':1 / 50,
        }

metadict_detail['_Выращивание авокадо (центнер)'] = {
        # Средняя урожайность -- 70 центнеров/гектар
        # 120 плодов с дерева (150-200 кг/дерево)
        '|-Плантации авокадо (гектар)':1 / 50,
        }

metadict_detail['_Выращивание апельсинов (центнер)'] = {
        # Средняя урожайность -- 150 центнеров/гектар
        # 200-350 плодов с дерева, плод 150-175 грамм (32-56 кг/дерево, 400 деревьев/гектар)
        # https://ru.wikisource.org/wiki/ЭСБЕ/Апельсин
        '|-Плантации апельсинов (гектар)':1 / 100,
        }

metadict_detail['_Выращивание мандаринов (центнер)'] = {
        # https://ru.wikisource.org/wiki/ЭСБЕ/Мандарин,_растение
        '|-Плантации мандаринов (гектар)':1 / 80,
        }

metadict_detail['_Выращивание лаймов (центнер)'] = {
        '|-Плантации лаймов (гектар)':1 / 120,
        }

metadict_detail['_Выращивание плодов дерева какао (центнер)'] = {
        # Среднемировой уровень -- 4 центнера какао-бобов с гектара (16 центнеров плодов)
            # 0.5 кг. какао-порошка с одного дерева в год.
        '|-Плантации дерева какао (гектар)':1 / 15,
        }

metadict_detail['_Выращивание ванили (центнер)'] = {
        # Ваниль паразитирует на какао.
        # 1.5-6 килограмм стручков с растения, 1.5-2 центнера готовой продукции на гектар.
        '|-Плантации ванили (гектар)':1 / 5,
        }

metadict_detail['_Выращивание корицы (центнер)'] = {
        # https://ru.m.wikipedia.org/wiki/Корица_(пряность)
        '|-Плантации корицы (гектар)':1 / 3,
        }

metadict_detail['_Выращивание сахарного тростника (центнер)'] = {
        # Культура сахарного тростника в СССР:
        # http://www.activestudy.info/kultura-saxarnogo-trostnika-v-sssr/
        # https://en.m.wikipedia.org/wiki/Sugar_cane#Ethanol
        # Урожайность, хорошая (1895, Африка, дельта Руфиджи): 1000-1200 центнеров/гектар (18-22% сахар)
        '|-Плантации сахарного тростника (гектар)':1 / 300,
        }

metadict_detail['_Выращивание чая (центнер)'] = {
        # Урожайность чая (ЭСБЕ, Япония, 1899 год) -- сухого 7.2 центнера/гектар (191.6 кван/гектар)
        # Япония 1899 год: 39 889 га чая, 568 000 занятых семей, 14 семей/гектар (побочная работа)
        # Норма выработки на сборе -- 30-35 кг/день
        # Сбор: 230 нормо-часов/тонна, 1150 нормо-часов/гектар
        # Чай требует 500-1000 кг/гектар азотных удобрений (много азота в листьях)
        # https://ru.wikisource.org/wiki/ЭСБЕ/Япония/Экономический_очерк
        '|-Плантации чая (гектар)':1 / 50,
        #'_-Работа зебр на сборе чая (нормо-часов)':1200,
        }

metadict_detail['_Выращивание дерева карри (центнер)'] = {
        # Листья карри.
        '|-Плантации карри (гектар)':1 / 20,
        }

metadict_detail['_Сбор смолы асафетиды (центнер)'] = {
        # 1) найти заросли асафетиды
        # 2) оторвать корни, очистить от грунта, снять листья. Оставить на 1 месяц.
        # 3) срезать верхнюю часть стебля, накрыть тентом, оставить на 2 суток.
        # 4) снять сок, вновь срезать слой корня, следующая партия через 5 суток.
        # С одного стебля 0.9-1.3 кг асафетиды.
        '_-Работа зебр на сборе дикоросов (нормо-часов)':40,
        #'-Луга дикоросов в Эверглейдсе (требуется/гектар)':1 / 7,
        }

#----
# Культуры, упрощение:

metadict_detail['|-Ива прутовидная, домашняя (Salix viminalis) (гектар)'] = {
        '|-Ива прутовидная, домашняя (Salix viminalis)':10000 / (0.8 * 0.25),
        '|--Лесничества (гектар)':1,
        }

metadict_detail['|-Яблоневые сады (гектар)'] = {
        # Деревья высотой около 3 метров, посадка 3x3
        # Уход за садом (14 дней/гектар) и уборка яблок (6 дней на гектар):
        # https://vignette.wikia.nocookie.net/mlp/images/4/4d/Twilight_bucking_apples_S1E4.png
        # https://web.archive.org/web/20200928015036/https://mehanik-ua.ru/tekhnologicheskie-karty/1470-tekhnologicheskaya-karta-vyrashchivaniya-yablok.html
        # Механизация:
            # Плодоуборочный комбайн МПУ-1 -- заменяет до 80 человек (а расчёт машины?)
            # Агрегат для ухода за садами АСВ-8 -- заменяет 2.8 человека на обрезке
        # Трудовые нормы:
            # Работа                          | Трудозатраты
            # ------------------------------- | -------------------
            # =Уборка яблок                   | =24-75 часов/тонна (3-10 дней/гектар)
            # Сбор яблок, среднерослые сады   | 12-47
            # Сортировка и укладка            | 9-24
            # Разгрузка ящиков                | 1
            # Переноска ящиков, 25-50 метров  | 2-4
        # Нормы:
            # Сбор яблок -- 300 кг/8_часов (советский норматив) (какая-то чушь, откуда это?)
            # Сбор яблок -- 1500 кг/8_часов (Украина, 2018 год, оплата за результат)
        '|-Яблоня карликовая (Malus pumila)':10000 / (3.2 * 3.2),
        '|--Фруктовые сады (гектар)':1,
        }

metadict_detail['|-Виноградные сады (гектар)'] = {
        # Трудозатраты:
            # Шпалерный -- 180 дней на гектар (1440 нормо-часов)
            # Виноградник (25 га, 10-16 рабочих, Катон) -- 1200-2000 нормо-часов/гектар
            # Коловой культуры (5 га, 5 рабочих) -- 250 дней на гектар (2000 нормо-часов)
            # Высокоштамбовой культуры -- 96 дней (768 нормо-часов)
            # Большинство работ с 15 марта по 1 ноября (225 дней)
            # http://vinograd.info/info/vinogradarstvo-po-novomy/zatraty-tryda-pri-vysokoshtambovoi-kyltyre.html
        # Виноделие Франция, 1892 год, 38 млн населения:
            # 53 млн га земель, 1.8 млн га виноградники (3.45%)
            # 1894-95 годы -- 3 007 млн кг/год (79 литров/человека, 1671 литр/гектар)
            # https://ru.wikisource.org/wiki/ЭСБЕ/Франция
        # Виноделие Франция, 2024 год, 66.6 млн населения:
            # 55 млн га земель, 0.8 млн га виноградников (1.46%)
            # 2024 год -- 4 667 млн кг/год (70 литров/человека, 5834 литров/гектар)
        # Виноградник владения Домека, Херес, Испания 1856 год:
            # 1500 тонн вина/год, годовой запас в 15 000 бочонков.
            # 200 рабочих (7.5 тонн вина/рабочего), до 1500 сезонных (1 тонна/рабочего)
            # Трудовая стоимость вина (оценочно) от 220 нормо-часов тонну до 630 нормо-часов/тонну.
            # Бутылка хереса - 0.77 литра, бочонок -- 462 литра (11 копеек/литр)
            # http://az.lib.ru/g/grigorowich_d_w/text_1873_korabl_retvizan.shtml
        # Производительность:
            # Старый виноградник (Кавказ, 1940-е годы) -- 4800 литров/гектар
            # Виноградник высокоштамбовой культуры -- 8400 литров/гектар
            # Вина 1-3 меха с югера (Катон) -- 2400-7200 литров/гектар (средний 3600 л/га)
            # По ЭСБЕ Виноградарство -- 1800-7400 литров/гектар
            # https://ru.wikisource.org/wiki/ЭСБЕ/Виноградарство
            # http://vinograd.info/info/vinogradarstvo-po-novomy/
        # Редкая высокоштамбовая посадка.
        '|-Виноград культурный (Vítis vinífera)':10000 / (3.5 * 1.2),
        '|--Фруктовые сады (гектар)':1,
        #'_-Работа виноградовода (нормо-часов)':800,
        }

metadict_detail['|-Оливковые сады (гектар)'] = {
        '|-Олива Эквестрийская (Olea Equestriana)':10000 / (6 * 6),
        '|--Масличные сады (гектар)':1,
        }

metadict_detail['|-Фисташковые сады (гектар)'] = {
        # Двухгодичная цикличность. В один год урожайность гораздо больше, чем в другой.
        # Фисташки собирают ночью, днём листья кустарника вызывают головокружение.
        # Фисташковая смола -- 14% хиосский терпентин, живица, подобно сосновой.
        '|-Фисташка (Pistácia)':10000 / (14 * 14),
        '|--Масличные сады (гектар)':1,
        }

metadict_detail['|-Миндальные сады (гектар)'] = {
        # Источник камеди (гумми), но у нас используют живичную канифоль.
        # Низкорослый, 5-10 кг с куста. 36 м²/саженец, 280 саженцев на гектар.
        '|-Миндаль обыкновенный (Prunus dulcis)':10000 / (6 * 6),
        '|--Масличные сады (гектар)':1,
        }

metadict_detail['|-Рябиновые сады (гектар)'] = {
        '|-Рябина Эквестрийская (Sorbus Equestriana)':10000 / (6 * 6),
        '|--Фруктовые сады (гектар)':1,
        }

metadict_detail['|-Вишнёвые сады (гектар)'] = {
        # Дикорос -- Черёмуха поздняя (Prunus serotina)
        '|-Вишня обыкновенная (Prúnus cérasus)':10000 / (6 * 4),
        '|--Фруктовые сады (гектар)':1,
        }

metadict_detail['|-Черешневые сады (гектар)'] = {
        # Дикорос -- Черёмуха поздняя (Prunus serotina)
        '|-Черешня (Prúnus ávium)':10000 / (6 * 4),
        '|--Фруктовые сады (гектар)':1,
        }

metadict_detail['|-Грушёвые сады (гектар)'] = {
        '|-Груша обыкновенная (Pýrus commúnis)':10000 / (6 * 4),
        '|--Фруктовые сады (гектар)':1,
        }

metadict_detail['|-Хурмовые сады (гектар)'] = {
        # https://upload.wikimedia.org/wikipedia/commons/3/34/Persimmons_yamagata_2005-10.JPG
        '|-Хурма Эквестрийская (Diospyros Virginiana)':10000 / (6 * 4),
        '|--Фруктовые сады (гектар)':1,
        }

metadict_detail['|-Айвовые сады (гектар)'] = {
        '|-Айва Эквестрийская (Cydōnia Equestriana)':10000 / (6 * 4),
        '|--Фруктовые сады (гектар)':1,
        }

metadict_detail['|-Лимонные сады (гектар)'] = {
        '|-Лимон (Cítrus límon)':10000 / (3.2 * 3.2),
        '|--Фруктовые сады (гектар)':1,
        }

metadict_detail['|-Инжирные сады (гектар)'] = {
        '|-Фиговое дерево (Fícus cárica)':10000 / (8 * 8),
        '|--Фруктовые сады (гектар)':1,
        }

metadict_detail['|-Финиковые сады (гектар)'] = {
        '|-Финик пальчатый (Phoenix dactylifera)':10000 / (11 * 11),
        '|--Фруктовые сады (гектар)':1,
        }

metadict_detail['|-Гранатовые сады (гектар)'] = {
        '|-Гранат (Punica)':10000 / (4.5 * 4.5),
        '|--Фруктовые сады (гектар)':1,
        }

metadict_detail['|-Абрикосовые сады (гектар)'] = {
        '|-Абрикос Эквестрийский (Prúnus Equestriana)':10000 / (5 * 5),
        '|--Фруктовые сады (гектар)':1,
        }

metadict_detail['|-Персиковые сады (гектар)'] = {
        '|-Персик Эквестрийский (Prúnus Equestriana)':10000 / (5 * 5),
        '|--Фруктовые сады (гектар)':1,
        }

metadict_detail['|-Сливовые сады (гектар)'] = {
        '|-Слива домашняя (Prúnus doméstica)':10000 / (4 * 4),
        '|--Фруктовые сады (гектар)':1,
        }

metadict_detail['|-Плантации кофейного дерева (гектар)'] = {
        # https://ru.m.wikipedia.org/wiki/Coffea_canephora
        '|-Кофе робуста (Coffea robusta)':10000 / (3.3 * 3.3),
        '|--Плантации в Эверглейдсе (гектар)':1,
        }

metadict_detail['|-Плантации дерева какао (гектар)'] = {
        '|--Плантации в Эверглейдсе (гектар)':1,
        }

metadict_detail['|-Плантации гвоздики (гектар)'] = {
        '|--Плантации в Эверглейдсе (гектар)':1,
        }

metadict_detail['|-Плантации шафрана (гектар)'] = {
        '|--Плантации в Эверглейдсе (гектар)':1,
        }

metadict_detail['|-Плантации чёрного перца (гектар)'] = {
        '|--Плантации в Эверглейдсе (гектар)':1,
        }

metadict_detail['|-Плантации ванили (гектар)'] = {
        '|--Плантации в Эверглейдсе (гектар)':1,
        }

metadict_detail['|-Плантации корицы (гектар)'] = {
        '|--Плантации в Эверглейдсе (гектар)':1,
        }

metadict_detail['|-Плантации чая (гектар)'] = {
        '|--Плантации в Эверглейдсе (гектар)':1,
        }

metadict_detail['|-Плантации карри (гектар)'] = {
        '|--Плантации в Эверглейдсе (гектар)':1,
        }

metadict_detail['|-Плантации сахарного тростника (гектар)'] = {
        '|--Плантации в Эверглейдсе (гектар)':1,
        }

metadict_detail['|-Плантации банана (гектар)'] = {
        # Травянистое растение:
        #'|-Банан райский (Musa paradisiaca)':10000 / (2.5 × 2.5),
        '|--Плантации в Эверглейдсе (гектар)':1,
        }

metadict_detail['|-Плантации манго (гектар)'] = {
        '|--Плантации в Эверглейдсе (гектар)':1,
        }

metadict_detail['|-Плантации авокадо (гектар)'] = {
        '|--Плантации в Эверглейдсе (гектар)':1,
        }

metadict_detail['|-Плантации апельсинов (гектар)'] = {
        '|--Плантации в Эверглейдсе (гектар)':1,
        }

metadict_detail['|-Плантации мандаринов (гектар)'] = {
        '|--Плантации в Эверглейдсе (гектар)':1,
        }

metadict_detail['|-Плантации лаймов (гектар)'] = {
        '|--Плантации в Эверглейдсе (гектар)':1,
        }

metadict_detail['|-Посевы арахиса (гектар)'] = {
        # TODO: Узнать нормы высева арахиса
            # Арахис, 0.5 метра между растениями, 40 000 растений на гектар.
        '|=Корзина арахиса в шелухе (килограмм)':150,
        '|--Посевы бобовых (гектар)':1,
        }

metadict_detail['|-Посевы арбуза (гектар)'] = {
        '|--Посевы бахчёвых (гектар)':1,
        }

metadict_detail['|-Посевы дыни (гектар)'] = {
        '|--Посевы бахчёвых (гектар)':1,
        }

metadict_detail['|-Посевы имбиря (гектар)'] = {
        '|--Посевы огородных (гектар)':1,
        }

metadict_detail['|-Посевы фенхеля (гектар)'] = {
        '|--Посевы огородных (гектар)':1,
        }

metadict_detail['|-Посевы капусты кудрявой (гектар)'] = {
        '|--Посевы огородных (гектар)':1,
        }

metadict_detail['|-Посевы капусты брокколи (гектар)'] = {
        '|--Посевы огородных (гектар)':1,
        }

metadict_detail['|-Посевы конопли (гектар)'] = {
        # Удобрение навозом -- 3000 пудов/десятина (45 тонн/гектар, раз в 6 лет)
        # Посев -- 8-10 четвериков/десятина (~125 кг/гектар)
        '_Обмолот масличных культур (килограмм)':125,
        '|=Корзина семян конопли (килограмм)':125,
        '|=Сноп конопли (килограмм)':125 / 0.33,
        '|--Посевы технических культур (гектар)':1,
        }

metadict_detail['|-Посевы джута (гектар)'] = {
        # Corchorus capsularis
        '_Обмолот масличных культур (килограмм)':125,
        '|=Корзина семян джута (килограмм)':125,
        '|=Сноп джута (килограмм)':125 / 0.33,
        '|--Посевы технических культур (гектар)':1,
        }

metadict_detail['|-Посевы льна (гектар)'] = {
        # Нормы высева -- 8 четвериков/десятина (~125 кг/гектар)
        '_Обмолот масличных культур (килограмм)':125,
        '|=Корзина семян льна (килограмм)':125,
        '|=Сноп льна (килограмм)':125 / 0.33,
        '|--Посевы технических культур (гектар)':1,
        }

metadict_detail['|-Посевы хлопчатника (гектар)'] = {
        # Семена, 50 килограмм/гектар
        # Уборка хлопка вручную -- 15-50 кг/день (0.25 нормо-часа/кг)
        # Уборка урожая -- 288 часов (1150 килограмм семенных коробочек)
        # https://ru.wikisource.org/wiki/ЭСБЕ/Хлопчатник
        '_Обмолот масличных культур (килограмм)':50,
        '|=Корзина семян хлопка (килограмм)':50,
        '|--Посевы технических культур (гектар)':1,
        }

metadict_detail['|-Посевы мяты (гектар)'] = {
        '|--Посевы технических культур (гектар)':1,
        }

metadict_detail['|-Посевы кориандра (гектар)'] = {
        '|--Посевы технических культур (гектар)':1,
        }

metadict_detail['|-Посевы горчицы белой (гектар)'] = {
        '|--Посевы технических культур (гектар)':1,
        }

metadict_detail['|-Посевы горчицы коричневой (гектар)'] = {
        '|--Посевы технических культур (гектар)':1,
        }

metadict_detail['|-Посевы тмина (гектар)'] = {
        '|--Посевы технических культур (гектар)':1,
        }

metadict_detail['|-Посевы хмеля (гектар)'] = {
        '|--Посевы технических культур (гектар)':1,
        }

metadict_detail['|-Посевы мака (гектар)'] = {
        # Нормы высева -- 5—10 фн. семян (20-41 кг/га)
        '|--Посевы масличных (гектар)':1,
        }

metadict_detail['|-Посевы подсолнечника (гектар)'] = {
        # Норма высева -- 50 000 растений/гектар (5 кг/га)
        '|--Посевы масличных (гектар)':1,
        }

metadict_detail['|-Посевы кунжута (гектар)'] = {
        '|--Посевы масличных (гектар)':1,
        }

metadict_detail['|-Посевы пшеницы (гектар)'] = {
        # Пшеница хорошо растёт в 30-60° северной широты, до высоты 3000 метров.
        # Орошение 10 000 кубометров/гектар (естественное при осадках 1200+ мм/год)
        # Нормы высева -- 160-270 кг/га
        # Четверть пшеницы — 1600 кв. саж. (196-225 кг/гектар)
        # https://www.gumer.info/bibliotek_Buks/History/milov/01_3.php
        # https://ru.wikisource.org/wiki/ЭСБЕ/Пшеница
        '_Обмолот зерновых (килограмм)':200 / (1 - 0.20),
        '|=Корзина зерна пшеницы (килограмм)':200,
        '|=Сноп пшеницы (килограмм)':200 * (1 / 0.5) / (1 - 0.20),
        '|=Сноп пшеничной соломы (килограмм)':200 * (1 / 0.5 - 1) / (1 - 0.20),
        '+Солома пшеничная (доступно/килограмм)':200 * (1 / 0.5 - 1) / (1 - 0.20),
        '|--Посевы зерновых (гектар)':1,
        }

metadict_detail['|-Посевы ржи (гектар)'] = {
        # Нормы высева (рожь озимая) -- 150-250 кг/га
        # Четверть ржи высевалась на площади 1920 кв. саж. (146-170 кг/га)
        # Урожай на хорошем поле 1881 год -- ржи 1.33 т/га, соломы 3.4 т/га (72% масса соломы)
        # (71 ЧетвертьРжи) / (5 десятин) ≈ 1330,681058 kg/ha
        # (1136 пудов) / (5 десятин) ≈ 3406,543508 kg/ha
        # Рожь плохо подходит для кормления скота, пентозан не переваривается (поэтому обваривали).
        # https://sdelanounas.ru/blogs/144596/
        # https://ru.wikisource.org/wiki/ЭСБЕ/Рожь,_в_сельском_хозяйстве_и_мировой_экономике
        # http://nik2nik.ru/node/287
        '_Обмолот зерновых (килограмм)':200 / (1 - 0.20),
        '|=Корзина зерна ржи (килограмм)':200,
        '|=Сноп ржи (килограмм)':200 * (1 / 0.38) / (1 - 0.20),
        '|=Сноп ржаной соломы (килограмм)':200 * (1 / 0.38 - 1) / (1 - 0.20),
        '+Солома ржаная (доступно/килограмм)':200 * (1 / 0.38 - 1) / (1 - 0.20),
        '|--Посевы зерновых (гектар)':1,
        }

metadict_detail['|-Посевы овса (гектар)'] = {
        # Нормы высева -- 150-220 кг/га
        # Четверть овса — 860 кв. саж. (230 кг/га)
        '_Обмолот зерновых (килограмм)':200 / (1 - 0.20),
        '|=Корзина зерна овса (килограмм)':200,
        '|=Сноп овса (килограмм)':200 * (1 / 0.23) / (1 - 0.20),
        '|=Сноп овсяной соломы (килограмм)':200 * (1 / 0.23 - 1) / (1 - 0.20),
        '+Солома овсяная (доступно/килограмм)':200 * (1 / 0.23 - 1) / (1 - 0.20),
        '|--Посевы зерновых (гектар)':1,
        }

metadict_detail['|-Посевы ячменя (гектар)'] = {
        # Нормы высева (яровой) -- 160-220 кг/га
        # Четверть ячменя — 2400 кв. саж (115 кг/га).
        '_Обмолот зерновых (килограмм)':200 / (1 - 0.20),
        '|=Корзина зерна ячменя (килограмм)':200,
        '|=Сноп ячменя (килограмм)':200 * (1 / 0.34) / (1 - 0.20),
        '|=Сноп ячменной соломы (килограмм)':200 * (1 / 0.34 - 1) / (1 - 0.20),
        '+Солома ячменная (доступно/килограмм)':200 * (1 / 0.34 - 1) / (1 - 0.20),
        '|--Посевы зерновых (гектар)':1,
        }

metadict_detail['|-Посевы кукурузы (гектар)'] = {
        # Нормы высева -- 25 кг/га
        # https://vignette.wikia.nocookie.net/mlp/images/b/b2/Applejack_harvesting_corn_S2E01.png
        # Кукуруза (США, 1910 год) -- 48.2 нормо-часов/тонна
        # Кукуруза (США, 1960 год) -- 8.21 нормо-часов/тонна
        '_Обмолот зерновых (килограмм)':25 / (1 - 0.20),
        '|=Корзина зерна кукурузы (килограмм)':25,
        '|=Корзина початков кукурузы (килограмм)':25 * (1 / 0.70) / (1 - 0.20),
        '|--Посевы зерновых (гектар)':1,
        }

metadict_detail['|-Посевы просо (гектар)'] = {
        # Нормы высева -- 18-22 кг/га
        # https://ru.wikisource.org/wiki/ЭСБЕ/Просо
        '_Обмолот зерновых (килограмм)':20 / (1 - 0.20),
        '|=Корзина зерна просо (килограмм)':20,
        '|=Сноп просо (килограмм)':20 * (1 / 0.34) / (1 - 0.20),
        '|=Сноп просяной соломы (килограмм)':20 * (1 / 0.34 - 1) / (1 - 0.20),
        '+Солома просяная (доступно/килограмм)':20 * (1 / 0.34 - 1) / (1 - 0.20),
        '|--Посевы зерновых (гектар)':1,
        }

metadict_detail['|-Посевы риса посевного (гектар)'] = {
        # Урожайность риса (Южный Китай, 1900 год) -- 25 центнеров/гектар (2000 нормо-часов)
        # Рисоводство. Орошение 9400 кубометров/гектар (50 000 м³/гектар ЭСБЕ)
            # https://ru.wikisource.org/wiki/ЭСБЕ/Рис,_в_сельском_хозяйстве_и_мировой_экономике
            # https://ru.m.wikipedia.org/wiki/Производство_риса_в_Таиланде
        # Разводят карпов и раков (70-150 кг рыбы/гектар, 300 грамм карпы за 90 дней)
            # Разведение карпа (Китай, 1983 год) -- 82.4 кг/гектар
            # Разведение карпа (Китай, 1994 год) -- 242.5 кг/гектар
            # При 7 чел/га пашни в 1920 году, это 10-21 кг рыбы на человека.
            # Карпы спасают от комаров, питаясь личинками, рыхлят грунт (урожайность +7-15%)
            # https://ru.wikisource.org/wiki/ЭСБЕ/Рис,_в_сельском_хозяйстве_и_мировой_экономике
            # https://www.activestudy.info/razvedenie-karpa-na-risovyx-polyax-i-polojnyx-vodoemax/
            # "Fish culture in rice fields at Kafr El-Sheikh"
            # https://en.wikipedia.org/wiki/Rice-fish_system
        # Нормы высева -- 180-230 кг/га
        '_Обмолот зерновых (килограмм)':200 / (1 - 0.20),
        '|=Корзина зерна риса посевного (килограмм)':200,
        '|=Сноп риса посевного (килограмм)':200 * (1 / 0.6) / (1 - 0.20),
        '|=Сноп рисовой соломы (килограмм)':200 * (1 / 0.6 - 1) / (1 - 0.20),
        '+Солома рисовая (доступно/килограмм)':200 * (1 / 0.6 - 1) / (1 - 0.20),
        '|--Посевы зерновых (гектар)':1,
        }

metadict_detail['|-Посевы гречихи посевной (гектар)'] = {
        # Нормы высева -- 80-100 кг/га
        # Четверть гречи -- 2400 кв. саж. (127 кг/га)
        '_Обмолот зерновых (килограмм)':100 / (1 - 0.20),
        '|=Корзина зерна гречихи (килограмм)':100,
        '|=Сноп гречихи посевной (килограмм)':100 * (1 / 0.66) / (1 - 0.20),
        '|=Сноп гречишной соломы (килограмм)':100 * (1 / 0.66 - 1) / (1 - 0.20),
        '+Солома рисовая (доступно/килограмм)':100 * (1 / 0.66 - 1) / (1 - 0.20),
        '|--Посевы зерновых (гектар)':1,
        }

metadict_detail['|-Посевы картофеля (гектар)'] = {
        # Картофель хорошо растёт при прохладном лете и обильных дождях.
        # Нормы высева:
            # Нормы высева -- 2000-2500 кг/га (клубни 45-60 мм)
            # Чтобы засадить десятину, достаточно 10—12 четв. клубней (1.5 тонны/гектар)
            # https://ru.wikisource.org/wiki/ЭСБЕ/Картофель
        # Технологическая карта:
            # 1) Подготовка семенного материала:
            # 2) Подготовка земли:
                # - весеннее боронование зяби;
                # - внесение минеральных удобрений;
                # - перепашка зяби;
                # - предпосадочная подготовка почвы (культивация, нарезка гребней);
            # 3) посадка картофеля;
            # 4) уход за посадками
                # - довсходовое рыхление междурядий с одновременным боронованием,
                # - междурядная обработка всходов и 2-3 окучивания,
                # - химическая обработка против болезней и вредителей
            # 5) уборка картофеля;
            # 6) закладка на хранение.
        # Трудовые нормы:
            # Работа                          | Трудозатраты
            # ------------------------------- | -------------------
            # =Подготовка семенного материала | =23-28 часов/тонна
            #  Перебрать семенной картофель   | 8
            #  Яровизация картофеля           | 5 
            #  Уход во время яровизации       | 5
            #  Вынос из хранилища             | 4-9
            #  Загрузка картофелесажалки      | 1
            # ------------------------------- | --------------------
            # =Посадка картофеля:             | =69-77 часов/гектар
            #  Удобрения по бороздам          | 35
            #  Картофель по бороздам          | 27-35
            #  Подпахивание плугом            | 7
            # ------------------------------- | --------------------
            # =Уход за посадками:             | =226 часов/гектар
            #  Рыхление и окучивание          | 156
            #  Прополка                       | 31-63
            #  Скосить ботву                  | 23
            # ------------------------------- | --------------------
            # =Уборка картофеля               | =18 часов/тонна
            #  Выкопать картофелекопателем    | 10 (17 лопатой)
            #  Сортировка в поле из куч       |  6
            #  Засыпать в хранилище           |  2
            # ------------------------------- | --------------------
            # =На продажу                     | =14 часов/тонна
            #  Сортировка в мешки             | 14
            # ТИПОВЫЕ НОРМЫ ВЫРАБОТКИ НА РУЧНЫЕ РАБОТЫ В ПОЛЕВОДСТВЕ И ОВОЩЕВОДСТВЕ
            # http://www.libussr.ru/doc_ussr/usr_12301.htm
        '|--Посевы корнеплодов (гектар)':1,
        '|=Корзина картофеля (килограмм)':2000,
        }

metadict_detail['|-Посевы батата (гектар)'] = {
        # TODO: Узнать нормы высева батат.
        '|--Посевы корнеплодов (гектар)':1,
        '|=Корзина батата (килограмм)':2000,
        }

metadict_detail['|-Посевы топинамбура (гектар)'] = {
        # TODO: Узнать нормы высева топинамбура.
            # Это многолетнее растение
        '|--Посевы корнеплодов (гектар)':1,
        '|=Корзина топинамбура (килограмм)':1000,
        }

metadict_detail['|-Посевы свёклы (гектар)'] = {
        # Нормы высева -- 2.5-3.5 кг/га (семена)
        '|--Посевы корнеплодов (гектар)':1,
        }

metadict_detail['|-Посевы моркови (гектар)'] = {
        '|--Посевы корнеплодов (гектар)':1,
        }

metadict_detail['|-Посевы репы (гектар)'] = {
        '|--Посевы корнеплодов (гектар)':1,
        }

metadict_detail['|-Посевы редиса (гектар)'] = {
        '|--Посевы огородных (гектар)':1,
        }

metadict_detail['|-Посевы редьки (гектар)'] = {
        '|--Посевы огородных (гектар)':1,
        }

metadict_detail['|-Посевы брюквы (гектар)'] = {
        '|--Посевы огородных (гектар)':1,
        }

metadict_detail['|-Посевы турнепса (гектар)'] = {
        '|--Посевы огородных (гектар)':1,
        }

metadict_detail['|-Посевы лука репчатого (гектар)'] = {
        '|--Посевы бахчёвых (гектар)':1,
        }

metadict_detail['|-Посевы лука зелёного (гектар)'] = {
        '|--Посевы огородных (гектар)':1,
        }

metadict_detail['|-Посевы чеснока (гектар)'] = {
        '|--Посевы бахчёвых (гектар)':1,
        }

metadict_detail['|-Посевы перца сладкого (гектар)'] = {
        '|--Посевы огородных (гектар)':1,
        }

metadict_detail['|-Посевы перца красного (гектар)'] = {
        '|--Посевы огородных (гектар)':1,
        }

metadict_detail['|-Посевы артишоков (гектар)'] = {
        '|--Посевы огородных (гектар)':1,
        }

metadict_detail['|-Посевы петрушки (гектар)'] = {
        '|--Посевы огородных (гектар)':1,
        }

metadict_detail['|-Посевы ревеня (гектар)'] = {
        '|--Посевы огородных (гектар)':1,
        }

metadict_detail['|-Посевы латука посевного (гектар)'] = {
        '|--Посевы огородных (гектар)':1,
        }

metadict_detail['|-Посевы сельдерея (гектар)'] = {
        '|--Посевы огородных (гектар)':1,
        }

metadict_detail['|-Посевы пастернака (гектар)'] = {
        '|--Посевы огородных (гектар)':1,
        }

metadict_detail['|-Посевы спаржи (гектар)'] = {
        '|--Посевы огородных (гектар)':1,
        }

metadict_detail['|-Посевы кресс-салата (гектар)'] = {
        '|--Посевы огородных (гектар)':1,
        }

metadict_detail['|-Посевы шпината (гектар)'] = {
        '|--Посевы огородных (гектар)':1,
        }

metadict_detail['|-Посевы укропа (гектар)'] = {
        '|--Посевы огородных (гектар)':1,
        }

metadict_detail['|-Посевы хрена (гектар)'] = {
        '|--Посевы огородных (гектар)':1,
        }

metadict_detail['|-Посевы томатов (гектар)'] = {
        '|--Посевы томатов (гектар)':1,
        }

metadict_detail['|-Посевы тыквы (гектар)'] = {
        '|--Посевы бахчёвых (гектар)':1,
        }

metadict_detail['|-Посевы кабачка (гектар)'] = {
        '|--Посевы бахчёвых (гектар)':1,
        }

metadict_detail['|-Посевы баклажанов (гектар)'] = {
        '|--Посевы бахчёвых (гектар)':1,
        }

metadict_detail['|-Посевы огурцов (гектар)'] = {
        '|--Посевы бахчёвых (гектар)':1,
        }

metadict_detail['|-Посевы сои (гектар)'] = {
        # Нормы высева -- 40-60 кг/га; 120-140 кг/га
        '|=Корзина соевых бобов в стручках (килограмм)':100,
        '|--Посевы бобовых (гектар)':1,
        }

metadict_detail['|-Посевы фасоли (гектар)'] = {
        # Нормы высева -- 80-150 кг/га
        '|=Корзина красной фасоли в стручках (килограмм)':120,
        '|--Посевы бобовых (гектар)':1,
        }

metadict_detail['|-Посевы гороха посевного (гектар)'] = {
        # Нормы высева -- 220-330 кг/га
            # Четверть гороха -- 2400 кв. саж (140 кг/га).
        '|=Корзина гороха в стручках (килограмм)':250,
        '|--Посевы бобовых (гектар)':1,
        }

metadict_detail['|-Посевы нута бараньего (гектар)'] = {
        # Нормы высева -- 120-200 кг/га
        '|=Корзина нута бараньего в стручках (килограмм)':150,
        '|--Посевы бобовых (гектар)':1,
        }

metadict_detail['|-Посевы чечевицы (гектар)'] = {
        # Нормы высева -- 100-200 кг/га
        '|=Корзина чечевицы (килограмм)':150,
        '|--Посевы бобовых (гектар)':1,
        }

metadict_detail['|-Посевы урда (гектар)'] = {
        # TODO: Узнать нормы высева урда.
        '|=Корзина урда в стручках (килограмм)':150,
        '|--Посевы бобовых (гектар)':1,
        }

metadict_detail['|-Грядки шампиньонов (квадратный метр)'] = {
        '|--Грядки грибов (квадратный метр)':1,
        }

metadict_detail['|-Грядки вёшенок (квадратный метр)'] = {
        '|--Грядки грибов (квадратный метр)':1,
        }

#----
# Лесные запасы, лесоводство:

metadict_model['Участок под вырубку лиственного леса (гектар)'] = {
        # Лиственные леса восстанавливается за 50 лет. Пони рубят выборочно, раз в десятилетие.
        '|-Лиственные леса (гектар)':50,
        '|--Лесничества (гектар)':50,
        }

metadict_model['Участок под вырубку лиственного леса (Зебрика) (гектар)'] = {
        # TODO: пили леса Эверглейдса в стиле Амазонии. Сейчас тут ссылка на обычные эквинские дубравы.
        '|-Лиственные леса (гектар)':50,
        #'|--Лесничества (гектар)':50,
        }

metadict_model['Участок под вырубку хвойного леса (гектар)'] = {
        # Леса России (Современность) -- 81.3 млрд. м³, восстановление -- 0.97 млрд. м³ (86 лет)
        # Леса европейской России (1920 год, доклад ГОЭЛРО) -- 150 млн. гектар (+318 кубометров/год)
            # Производительность лесов (современность) -- 6.5 кубометра/гектар
            # Производительность лесов (ГОЭЛРО) -- 2.12 кубометра/гектар
            # Производительность лесов (ЭСБЕ) -- 4.4 кубометра/гектар
            # Производительность лесов (Япония) -- 1.2 кубометра/гектар
        # Эффективная механизация лесосеки 25-50 гектар (200×2000 метров)
        '|-Хвойные леса (гектар)':50,
        '|--Лесничества (гектар)':50,
        }

#----
# Трудозатраты (оценочно):
    # ТИПОВЫЕ НОРМЫ ВЫРАБОТКИ НА РУЧНЫЕ РАБОТЫ В ПОЛЕВОДСТВЕ И ОВОЩЕВОДСТВЕ
        # http://www.libussr.ru/doc_ussr/usr_12301.htm
    # ТИПОВЫЕ НОРМЫ ВЫРАБОТКИ НА МЕХАНИЗИРОВАННЫЕ И РУЧНЫЕ РАБОТЫ В САДОВОДСТВЕ
        # http://www.libussr.ru/doc_ussr/usr_14391.htm
    # Великорусский пахарь и особенности российского исторического процесса
        # https://www.gumer.info/bibliotek_Buks/History/milov/01_6.php
    # Сельскохозяйственные работы (Катон, античность):
        # - Мотыжение 3/4 или 3/5 югера (0.15-0.2 гектара/день);
        # - Копка ям: 14 ям размером в 4 куб фута (0.1 кубометра яма, 1.4 кубометра/день)
        # - Косьба — 1 югер (0.25 гектара/день);
        # - Пахота на тяжелой земле:
            # - Первая — 3 дня югер (12 дней/гектар), на легкой — 2 дня (8 дней/гектар);
            # - Вторичная — 2 дня на тяжелой и 1 день на легкой;
            # - Третья — 1 день (в третий раз пахали только тяжелую почву);
        # - Посев и заделка семян: на тяжелой — югер полдня, на легкой — югер четверть дня (1-2 дня/гектар)
        # - Уборка соломы: за день 1 югер (4 дня/гектар).
        # https://flibusta.site/b/480536
    # Сельскохозяйственные работы (Колумелла, античность (2.12.2 — 6)):
        # Вспашка, посев, бороньба, мотыженье, прополка, жатва:
        # Посев пшеницы (5 модиев/югер) -- 140-280 кг/гектар
        # под пшеницу -- 10 1/2 дней (42 дня/гектар);
        # под ячмень — 6 1/2 (26 дней/гектар);
        # под бобы — 7 — 8 (32 дня/гектар);
        # под вику — 3 — 4 (16 дней/гектар);
        # под фасоль — 6 (24 дня/гектар);
        # под чечевицу — 8 (32 дня/гектар);
        # под лен — 11 дней (44 дня/гектар);

metadict_detail['|--Лесничества (гектар)'] = {
        # Объезды:
            # Объезд объезчика 545-1635 га обход лесника 218-436 га
            # Объезчик на 3-8 лесников. Лесник на 181-204 гектаров
            # https://ru.wikisource.org/wiki/ЭСБЕ/Объезд
        # Лесные дачи:
            # Дача от слова "дать", их давали крестьянам на дровяной лес.
            # Казённые лесные дачи в среднем 6 гектаров (32 дачи/лесник)
            # Семья (5 чел) = 39 м³ дров, 15 м³ хвороста и древяных кореньев
            # Семья (5 чел) = 211 ГДж/дом = 14 тонн дров = 3-6 гектар
            # https://www.gumer.info/bibliotek_Buks/History/Stat/10.php
        # Разведение леса
            # Лесоохранный закон (1888 года):
            # | Тип лесничества     | число   | суммарная площадь | площадь
            # | ------------------- | ------- | ----------------- | --------
            # | Защитные дачи       |   2 410 |    522 452 дес    |  217 дес
            # | Водоохранные        |     394 |    510 427        | 1296
            # | Упрощённые планы    |  14 427 |  6 814 111        |  472
            # | Без плана хозяйства | 198 794 | 28 035 000        |  141
            # 56 комитетов, 547 работников, 4044 местных начальников.
            # Расходы казны -- 100k руб/год; освобождение от сборов -- 53k рублей
            # Лесоразведение (казённые лесничества) -- 61.6k десятин + 5k дес/год
            # Лесоразведение в Южной России -- 5-6% прибыли к вложенным средствам.
            # Искусственное разведение леса -- 27-55 рублей/гектар
            # На улучшение лесов тратят 10-12% дохода.
            # https://ru.wikisource.org/wiki/ЭСБЕ/Россия/Экономический_отдел/Леса_и_лесное_хозяйство
            # https://ru.wikisource.org/wiki/ЭСБЕ/Высокоствольное_лесное_хозяйство
            # https://ru.wikisource.org/wiki/ЭСБЕ/Вышка_лесная
        # Трудозатраты в лесном хозяйстве:
            # НА ЛЕСОКУЛЬТУРНЫЕ РАБОТЫ, ВЫПОЛНЯЕМЫЕ В РАВНИННЫХ УСЛОВИЯХ
            # http://www.libussr.ru/doc_ussr/usr_13746.htm
            # НА ЛЕСОКУЛЬТУРНЫЕ РАБОТЫ, ВЫПОЛНЯЕМЫЕ В ГОРНЫХ УСЛОВИЯХ
            # http://www.libussr.ru/doc_ussr/usr_13250.htm
        # Красноярский край, Богучанский район (2021 год, 45 373 чел) -- 53 980 км²
            # Осадки 400 мм/год. 240-275 дней морозов. Июль +13-15°C; Январь -34-38°C.
            # Густота дорог -- 0.83-1.64 км на 100 гектаров, 48% квартальная сеть.
        # Богучанское лесничество -- 113 789 га (лиственница 23%, сосна 21%, ель 7%, береза 27%)
            # Сырьё                   | Название              | тонн      | кг/га
            # ----------------------- | --------------------- | --------- | -----
            # Брусника                | -                     | 7.4       | 0.54
            # Черника                 | -                     | 39.0      | 2.83
            # Белый гриб              | Beletus edulis        | 25.3      | 1.83
            # Подосиновик             | Beletus rufus         | 13.2      | 0.12
            # Подберёзовик            | Beletus scaber        | 15.2      | 0.14
            # Маслёнок                | Beletus luteus        | 92.6      | 0.82
            # Рыжик                   | Lactarius delicious   | 89.4      | 0.79
            # Груздь                  | Lactarius piperatus   | 30.9      | 0.27
            # Волнушка                | Lactarius terminosus  | -         | -
            # Сыроежка                | Russula spp.          | -         | -
            # Опёнок осенний          | Armillaria mellea     | 14        | 0.12
            # Лисичка                 | Cantharellus cibarius | -         | -
            # Чага                    | -                     | 25.9      | 0.84
            # Береста                 | -                     | 1700      | 55.3
            # Мох (сфагнум)           | -                     | 7500      | 66.9
            # Пни (смоляк)            | -                     | 22 400 м³ | 0.2
            # Хворост                 | -                     | 30 700 м³ | 0.27 м³
        # Гремучинское лесничество -- 115 212 га (лиственница 30%, сосна 44%, ель 7%, брёза 10%)
            # Сырьё                   | Название              | тонн       | кг/га
            # ----------------------- | --------------------- | ---------- | -----
            # Орех кедровый           | -                     | 617.3      | 5.4
            # Брусника                | -                     | 13.1       | 0.11
            # Черника                 | -                     | 7.9        | 0.07
            # Голубика                | -                     | 32.8       | 0.28
            # Клюква                  | -                     | 4.4        | 0.04
            # Малина                  | -                     | 5.2        | 0.05
            # Смородина чёрная        | -                     | 3.6        | 0.03
            # Смородина красная       | -                     | 5.4        | 0.05
            # Жимолось                | -                     | 5.5        | 0.05
            # Рябина                  | -                     | 5.4        | 0.05
            # Белый гриб              | Beletus edulis        | 8.5        | 0.07
            # Подосиновик             | Beletus rufus         | 4.3        | 0.04
            # Подберёзовик            | Beletus scaber        | 5.8        | 0.05
            # Маслёнок                | Beletus luteus        | 11.0       | 0.1
            # Рыжик                   | Lactarius delicious   | 1.3        | 0.01
            # Груздь                  | Lactarius piperatus   | 5.4        | 0.05
            # Волнушка                | Lactarius terminosus  | -          | -
            # Сыроежка                | Russula spp.          | -          | -
            # Опёнок осенний          | Armillaria mellea     | 7.7        | 0.07
            # Лисичка                 | Cantharellus cibarius | -          | -
            # Чага                    | -                     | 516.3      | 44.7
            # Берёзовый сок           | -                     | 21.5       | 1.9
            # Папоротник орляк        | -                     | 8.5        | 0.07
            # Лист брусники           | -                     | 1.6        | -
            # Лист черники            | -                     | 3.2        | -
            # Лист толокнянки         | -                     | 2.1        | -
            # Лист багульника         | -                     | 3.6        | -
            # Береста                 | -                     | 2300       | 199
            # Мох (сфагнум)           | -                     | 41 300     | 358
            # Пни (смоляк)            | -                     | 1 312 000  | 11.4т
            # Стволовой осмол         | -                     | 294 000 м³ | 11.2 м³
            # Хворост                 | -                     | 206 500 м³ | 1.8 м³
        # Урожайность дикоросов:
            # Ягоды (Алтай, 2021 год, 15-45% ягодников) -- 16-100 кг/гектар
            # Ягоды (Красноярский край, ??? ягодников) -- 0.73-3.37 кг/га
            # Грибы (Белоруссия, 10% грибоносных лесов) -- 50 кг/га
            # Грибы (Россия, ??% грибоносных лесов) -- 25-100 кг/га
            # Грибы (Красноярский край, ??% грибоносных) -- 4 кг/га
            # Грибы (Япония, 2018 год, все леса) -- 18.5 кг/гектар
            # Лекарственное сырьё (Белоруссия, все леса) -- 8 кг/гектар
            # "К методике определения урожая некоторых съедобных грибов" Веремьева
            # http://www.bibliotekar.ru/5-lesnik/57.htm
        # Сбор грибов к площади лесов:
            # Румыния -- 1.03 кг/гектар
            # Венгрия -- 0.2
            # Чехословакия -- 0.16
            # Польша -- 0.09
            # Россия -- 0.02
        '|---Леса (гектар)':1,
        '|----Необрабатываемые земли (гектар)':1,
        '_-Работа лесника (нормо-часов)':8,
        '+Дикорастущие растения (доступно/килограмм)':20 * 0.5,
        '+Дикорастущие грибы (доступно/килограмм)':50 * 0.3,
        '+Дикорастущие ягоды (доступно/килограмм)':50 * 0.5,
        '+Валежник (доступно/кубометр)':80 / 200 * 0.5,
        }

metadict_detail['|--Фруктовые сады (гектар)'] = {
        # Астраханские сады 1785 год:
            # 2 постоянных работника на гектар, 2 сезонных на два месяца (600 нормо-часов?)
            # https://www.gumer.info/bibliotek_Buks/History/milov/01_8.php
        # Мелкое садоводство Миннесота (4 га):
            # 0.5 работника на гектар (карликовые яблони, 1000 деревьев/гектар)
        # Современное садоводство на Украине (520 га):
            # 300-500 работников, в сезон 1000 (1-2 работника/гектар)
            # https://web.archive.org/web/20180226164750/http://infoindustria.com.ua/etalon-yablonevogo-sada
        # Уход за садом (14 дней/гектар) и уборка яблок (6 дней на гектар). Всего 20 дней/гектар
            # ТИПОВЫЕ НОРМЫ ВЫРАБОТКИ НА МЕХАНИЗИРОВАННЫЕ И РУЧНЫЕ РАБОТЫ В САДОВОДСТВЕ, ВИНОГРАДАРСТВЕ И ПИТОМНИКОВОДСТВЕ
            # http://www.libussr.ru/doc_ussr/usr_14391.htm
        # Технологическая карта, выращивание яблок:
            # http://mehanik-ua.ru/tekhnologicheskie-karty/1470-tekhnologicheskaya-karta-vyrashchivaniya-yablok.html
        # Заметки:
            # https://ru.wikisource.org/wiki/ЭСБЕ/Плодовый_сад
            # https://ru.wikisource.org/wiki/ЭСБЕ/Обрезка_плодовых_деревьев
            # https://ru.wikisource.org/wiki/ЭСБЕ/Обмазка_деревьев
        '|---Сады (гектар)':1,
        '|----Обрабатываемые земли (гектар)':1,
        '_-Работа в саду (нормо-часов)':800,
        '+Валежник (доступно/кубометр)':80 / 200 * 0.5,
        }

metadict_detail['|--Масличные сады (гектар)'] = {
        # Оливы, орехи.
        # Трудозатраты:
            # Масличный сад (60 га, Катон) -- 5-13 рабочих, 250-600 нормо-часов/гектар
            # Уборка оливок вручную (сомнительно) -- 0.14 нормо-часа/кг (420 часов/урожай)
            # Оливки сами падают, под деревьями подстилают соломенные ковры.
        # Оборудование:
            # Масличный сад (15 гектаров) -- 1 пресс и одна мельница для отделения косточек.
        '|---Сады (гектар)':1,
        '|----Обрабатываемые земли (гектар)':1,
        '_-Работа в саду (нормо-часов)':600,
        '+Валежник (доступно/кубометр)':80 / 200 * 0.5,
        }

metadict_detail['|--Посевы огородных (гектар)'] = {
        # Один морг (около 0,5 дес.) огорода овощей был равен 9 коне-дням и 199 человеко-дням.
            # Крестьянские огороды (Белоруссия, 1900 год) -- 0.2 гектара (80-90 человеко-дней)
            # Это около 365 нормо-дней/гектар или 2920-3650 нормо-часов/гектар.
            # Какие-то дикие числа, на грани окупаемости по калорийности репы:
            # https://www.gumer.info/bibliotek_Buks/History/milov/01_8.php
        # Урожайность парижских огородов (Кропоткин) -- 1136 центнеров/гектар, 13 100 нормо-часов/гектар.
            # Тоже дикие числа. В переводе на 200 центнеров/гектар будет 2305 нормо-часов/гектар.
        # Огороды окружают живые изгороди: облепиха, шиповник
            # https://ru.wikisource.org/wiki/ЭСБЕ/Хотан
        '|---Огороды (гектар)':1,
        '|----Обрабатываемые земли (гектар)':1,
        '_-Работа на огороде (нормо-часов)':1200,
        }

metadict_detail['|--Посевы томатов (гектар)'] = {
        # Lycopersicon esculentum
        # Густота высадки (152+28)×32 -- 35 000 растений/гектар
        # Севооборот (предшественник): бобовые, капуста, огурец, лук.
        # Подготовка почвы:
            # - лущение на 6-8 см дисковыми лущильщиками
            # - зеблевая вспашка на 27-32 см плугами
        # Высадка:
            # - боронование зубовыми боронами (борьба с сорняками)
            # - культивация на 4-5 см
            # - высадка рассадопосадочными машинами или семенами на 1-2 см (1 кг/гектар)
            # - прикатывание поля после высадки
        # Уход:
            # - межрядовая культивация на 4-8 см и 10-12 см (4 раза)
            # - боронование лёгкими боронами поперёк рядов
        # Уборка:
            # - начинают при созревании 10-15% плодов.
            # - ручная уборка 50-80% себестоимости продукции.
            # - уборка комбайном возможна при созревании 75-95% плодов
        # Трудозатраты:
            # - уборка 4-5 центнеров/смена (320-400 нормо-часов/гектар при 200 ц/гектар)
            # - комбайн заменяет 150-510 рабочих (3 гектара/смена)
        # Удобрения:
            # - СаSO4 3.5 тонн/гектар
            # - фосфогипс 5 тонн/гектар (если почва солёная, при pH >8 в течении 3-4 лет)
            # - органические удобрения на 25% потребности в азоте.
            # - азотные удобрения с поливом (1 кг на 100 литров воды)
            # - поливная норма (по периодам вегетации) 40-60; 70-100; 120-150 м³/га; всего 270 м³/га
        # Заметки:
            # - потери урожая от болезней 30-50% (до 80%)
        '|---Огороды (гектар)':1 / 0.85,
        '|----Обрабатываемые земли (гектар)':1,
        '_-Работа на огороде (нормо-часов)':800,
        }

metadict_detail['|--Посевы корнеплодов (гектар)'] = {
        # Гектар картофеля (без механизации) -- 830 нормо-часов (100 рабочих дней)
            # С минимальной механизацией (плуг, картофелесажалка) -- 500 нормо-часов (60 рабочих дней)
            # Сбор картофеля (1895 год) -- 80 нормо-часов (10 рабочих дней)
            # Сбор свёклы (1895 год) -- 128 нормо-часов (16 рабочих дней)
            # https://ru.wikisource.org/wiki/ЭСБЕ/Огородничество
            # https://ru.wikisource.org/wiki/ЭСБЕ/Огород
            # https://istmat.org/node/27386
        # Картофель, топинамбур, батат, свёкла, лук, морковь, репа
        '|---Огороды (гектар)':1 / 0.85,
        '|----Обрабатываемые земли (гектар)':1,
        '_-Работа на огороде (нормо-часов)':600,
        }

metadict_detail['|--Посевы бахчёвых (гектар)'] = {
        # Арбуз, дыня, тыква, огурцы, кабачки, баклажаны + лук, чеснок
        '|---Огороды (гектар)':1 / 0.85,
        '|----Обрабатываемые земли (гектар)':1,
        '_-Работа на огороде (нормо-часов)':600,
        }

metadict_detail['|--Посевы бобовых (гектар)'] = {
        # Посевы --> Пашня --> Луга дикоросов
            # Процент посева к пашне (1926 год) -- 61-66%
            # Процент посева к пашне (2013 год) -- 71%
        # Обмолот и перевозка урожая -- отдельные работы.
        # Гектар фасоли (без механизации) -- 465 нормо-часов (58 рабочих дней)
            # Пропалывание и окучивание -- 10 дней/год
        '|---Пашня (гектар)':1 / 0.65,
        '|----Обрабатываемые земли (гектар)':1 / 0.65,
        '_-Работа на полях бобовых (нормо-часов)':300,
        '|-Луга дикоросов (гектар)':3,
        }

metadict_detail['|--Посевы зерновых (гектар)'] = {
        # TODO: Разберись с удобрениями.
            # Сульфат кальция, известняк, негашёная известь -- регуляция кислотности.
            # тонко молотая известь, гипс, зола -- подщелачивание почвы (регуляция кислотности)
            # азот из соломы, но солома в почве сильно усложняет вспашку.
        # TODO: Разберись с механизацией.
            # Статистика сельхоз орудий есть в таблице "Земледелие" в начале.
        '|---Пашня (гектар)':1 / 0.65,
        '|----Обрабатываемые земли (гектар)':1 / 0.65,
        '_-Работа на полях зерновых (нормо-часов)':200,
        '|-Луга дикоросов (гектар)':3,
        }

metadict_detail['|--Посевы масличных (гектар)'] = {
        # Подсолнечник, кунжут.
        '|---Пашня (гектар)':1 / 0.65,
        '|----Обрабатываемые земли (гектар)':1 / 0.65,
        '_-Работа на полях масличных (нормо-часов)':300,
        '|-Луга дикоросов (гектар)':3,
        }

metadict_detail['|--Посевы технических культур (гектар)'] = {
        # Трудозатраты (хлопок, Новая Гвинея, 1895 год) -- 0.22 рабочих/гектар, 350 нормо-часов/гектар
        # Уборка хлопка вручную -- 15-50 кг/день (0.25 нормо-часа/кг)
        # Уборка урожая -- 288 часов (1150 килограмм семенных коробочек)
        '|---Пашня (гектар)':1 / 0.65,
        '|----Обрабатываемые земли (гектар)':1 / 0.65,
        '_-Работа на полях технических культур (нормо-часов)':400,
        '|-Луга дикоросов (гектар)':3,
        }

metadict_detail['|--Плантации в Эверглейдсе (гектар)'] = {
        # Дальние владения Эквестрии, пашут зебры.
        '|---Плантации (гектар)':1,
        '_-Работа зебр на плантациях (нормо-часов)':600,
        }

metadict_detail['|--Грядки грибов (квадратный метр)'] = {
        # TODO: Уточнить, сколько там шампиньонам требуется ухода.
        '_-Работа на грибоводстве (нормо-часов)':5,
        }

metadict_detail['|-Пчелиная семья (Ápis melliféra)'] = {
        # TODO: Пчеловодство. Нужны медоносы в лесах и на пашнях.
            # В Эквестрии 8.5 млн пчелиных семей. Многовато.
            # Отдельно посчитать медоносную способность растений.
            # Клёны и дубы эквестрийских лесов -- отличные медоносы.
        # ГЛАВА VII. НАУЧНАЯ ОРГАНИЗАЦИЯ ТРУДА В ПЧЕЛОВОДСТВЕ:
            # Таблица 21. Нормативы времени обслуживлния в пчеловодстве
                # http://paseka.su/books/item/f00/s00/z0000047/st029.shtml
                # Одна пчелосемья -- 831 минута/год (14 нормо-часов, 2 дней/гектар)
        # Один пчеловод (СССР 1955) -- 60 ульев
        # Один пчеловод (СССР 1973) -- 150-200 ульев
        # Один гектар -- одна пчелиная семья.
        '_-Работа пчеловода (нормо-часов)':14,
        '-Луга медоносов (требуется/гектар)':1,
        }

metadict_detail['|-Луга дикоросов (гектар)'] = {
        # Залежные земли.
            # Клевер и люцерна обогащают почву азотом.
            # Клевер и широколиственные бобовые оттеняют почву, уменьшая испарение.
            # Оттеняя почву, клевер уничтожает ростки сорных трав.
            # https://ru.wikisource.org/wiki/ЭСБЕ/Обогащающие_растения
            # https://ru.wikisource.org/wiki/ЭСБЕ/Отенение_почвы
        '|---Луга (гектар)':1,
        '|----Необрабатываемые земли (гектар)':1,
        '|-Травяные луга (гектар)':1,
        '+Луга медоносов (доступно/гектар)':1,
        '+Луга дикоросов (доступно/гектар)':1,
        '+Дикорастущие ягоды (доступно/килограмм)':25 * 0.5,
        '+Дикорастущие грибы (доступно/килограмм)':25 * 0.2,
        '+Дикорастущие растения (доступно/килограмм)':50 * 0.5,
        }

metadict_detail['|-Фермы морских растений (гектар)'] = {
        # В изобилии растут вдоль побережья (зона в 10-100 метров)
        #'|---Побережье (километр)':1 / 10,
        }
