#----
# Южноморский рацион:

metadict_detail['Южноморский рацион (пони/год)'] = {
        'Южноморский весенний рацион (пони/день)':90,
        'Южноморский летний рацион (пони/день)':90,
        'Южноморский осенний рацион (пони/день)':90,
        'Южноморский зимний рацион (пони/день)':90,
        }

#----
# Южноморский рацион (времена года):

metadict_detail['Южноморский весенний рацион (пони/день)'] = {
        # В эквестрийской неделе -- 6 дней
        'Южноморский весенний повседневный рацион (пони/день)':5 / 6,
        'Южноморский весенний праздничный рацион (пони/день)':1 / 6,
        }

metadict_detail['Южноморский летний рацион (пони/день)'] = {
        'Южноморский летний повседневный рацион (пони/день)':5 / 6,
        'Южноморский летний праздничный рацион (пони/день)':1 / 6,
        }

metadict_detail['Южноморский зимний рацион (пони/день)'] = {
        'Южноморский зимний повседневный рацион (пони/день)':5 / 6,
        'Южноморский зимний праздничный рацион (пони/день)':1 / 6,
        }

metadict_detail['Южноморский осенний рацион (пони/день)'] = {
        'Южноморский осенний повседневный рацион (пони/день)':5 / 6,
        'Южноморский осенний праздничный рацион (пони/день)':1 / 6,
        }

#----
# Южноморский рацион (дни недели):

metadict_detail['Южноморский весенний повседневный рацион (пони/день)'] = {
        'Южноморский весенний повседневный завтрак':1,
        'Южноморский весенний повседневный обед':1,
        'Южноморский весенний повседневный ужин':1,
        'Южноморское весеннее повседневное питьё v1':3 / 3,
        'Южноморское весеннее повседневное питьё v2':3 / 3,
        'Южноморское весеннее повседневное питьё v3':3 / 3,
        }

metadict_detail['Южноморский весенний праздничный рацион (пони/день)'] = {
        'Южноморский весенний праздничный завтрак':1,
        'Южноморский весенний праздничный обед':1,
        'Южноморский весенний праздничный ужин':1,
        'Южноморское весеннее праздничное питьё v1':3 / 3,
        'Южноморское весеннее праздничное питьё v2':3 / 3,
        'Южноморское весеннее праздничное питьё v3':3 / 3,
        }

metadict_detail['Южноморский зимний повседневный рацион (пони/день)'] = {
        'Южноморский зимний повседневный завтрак':1,
        'Южноморский зимний повседневный обед':1,
        'Южноморский зимний повседневный ужин':1,
        'Южноморское зимнее повседневное питьё v1':3 / 3,
        'Южноморское зимнее повседневное питьё v2':3 / 3,
        'Южноморское зимнее повседневное питьё v3':3 / 3,
        }

metadict_detail['Южноморский зимний праздничный рацион (пони/день)'] = {
        'Южноморский зимний праздничный завтрак':1,
        'Южноморский зимний праздничный обед':1,
        'Южноморский зимний праздничный ужин':1,
        'Южноморское зимнее праздничное питьё v1':3 / 3,
        'Южноморское зимнее праздничное питьё v2':3 / 3,
        'Южноморское зимнее праздничное питьё v3':3 / 3,
        }

metadict_detail['Южноморский летний повседневный рацион (пони/день)'] = {
        'Южноморский летний повседневный завтрак':1,
        'Южноморский летний повседневный обед':1,
        'Южноморский летний повседневный ужин':1,
        'Южноморское летнее повседневное питьё v1':3 / 3,
        'Южноморское летнее повседневное питьё v2':3 / 3,
        'Южноморское летнее повседневное питьё v3':3 / 3,
        }

metadict_detail['Южноморский летний праздничный рацион (пони/день)'] = {
        'Южноморский летний праздничный завтрак':1,
        'Южноморский летний праздничный обед':1,
        'Южноморский летний праздничный ужин':1,
        'Южноморское летнее праздничное питьё v1':3 / 3,
        'Южноморское летнее праздничное питьё v2':3 / 3,
        'Южноморское летнее праздничное питьё v3':3 / 3,
        }

metadict_detail['Южноморский осенний повседневный рацион (пони/день)'] = {
        'Южноморский осенний повседневный завтрак':1,
        'Южноморский осенний повседневный обед':1,
        'Южноморский осенний повседневный ужин':1,
        'Южноморское осеннее повседневное питьё v1':3 / 3,
        'Южноморское осеннее повседневное питьё v2':3 / 3,
        'Южноморское осеннее повседневное питьё v3':3 / 3,
        }

metadict_detail['Южноморский осенний праздничный рацион (пони/день)'] = {
        'Южноморский осенний праздничный завтрак':1,
        'Южноморский осенний праздничный обед':1,
        'Южноморский осенний праздничный ужин':1,
        'Южноморское осеннее праздничное питьё v1':3 / 3,
        'Южноморское осеннее праздничное питьё v2':3 / 3,
        'Южноморское осеннее праздничное питьё v3':3 / 3,
        }

#----
# Южноморский рацион (весна):
    # Март, апрель, май

metadict_detail['Южноморский весенний повседневный завтрак'] = {
        'Лепёшки рисово-просяные паровые (грамм)':50 * 2,
        'Рис обжаренный с капустой и спаржей (грамм)':200,
        'Картофель печёный дольками (грамм)':100,
        'Салат из морской капусты с соевым соусом (грамм)':100,
        'Соус арахисово-тамариндовый (грамм)':25,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        '||Блюдо второе холодное (100-грамм/порция)':1,
        '||Соус холодный (25-грамм/порция)':1,
        }

metadict_detail['Южноморский весенний повседневный обед'] = {
        'Рис варёный с соевым соусом (грамм)':200,
        'Суп-пюре пряный гороховый (грамм)':200,
        'Суп-лапша с морской капустой (грамм)':100,
        'Батат печёный со шпинатом и соевым соусом (грамм)':100,
        'Капуста квашеная с соевым соусом (грамм)':100,
        '||Антреме горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (100-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        '||Блюдо второе холодное (100-грамм/порция)':1,
        }

metadict_detail['Южноморский весенний повседневный ужин'] = {
        'Лепёшки рисово-ячменные паровые (грамм)':50 * 2,
        'Каша пшённая с чечевицей и спаржей (грамм)':200,
        'Пюре бататное (грамм)':200,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе холодное (200-грамм/порция)':1,
        }

metadict_detail['Южноморское весеннее повседневное питьё v1'] = {
        'Чай чёрный (грамм)':200 * 2,
        'Кубики рисовые в сахарной глазури (грамм)':50,
        'Финики без косточек (грамм)':10 * 2,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка жареная (50-грамм/порция)':1,
        '||Сладости (10-грамм/порция)':2,
        }

metadict_detail['Южноморское весеннее повседневное питьё v2'] = {
        'Сидр яблочный (грамм)':200,
        'Блины рисовые с арахисовой пастой (грамм)':50,
        '||Питьё холодное (200-грамм/порция)':1,
        '||Выпечка жареная (50-грамм/порция)':1,
        }

metadict_detail['Южноморское весеннее повседневное питьё v3'] = {
        'Кофе с сахаром (грамм)':200 * 2,
        'Блины рисовые с темпе (грамм)':50,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка жареная (50-грамм/порция)':1,
        }

metadict_detail['Южноморский весенний праздничный завтрак'] = {
        'Лепёшки рисово-ячменные паровые (грамм)':50 * 2,
        'Рис обжаренный с консервированными овощами (грамм)':200,
        'Суп-лапша с бататом и солёными томатами (грамм)':100,
        'Вёшенки тушёные (грамм)':100,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (100-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        }

metadict_detail['Южноморский весенний праздничный обед'] = {
        'Шарики фасолевые жареные во фритюре (грамм)':25 * 5,
        'Рис варёный с соевым соусом (грамм)':200,
        'Пюре гороховое с пряностями (грамм)':200,
        'Суп-пюре пряный чечевичный со шпинатом (грамм)':100,
        'Картофель жареный брусками во фритюре (грамм)':100,
        'Горчица медовая (грамм)':25,
        '||Выпечка жареная (25-грамм/порция)':5,
        '||Антреме горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (100-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        '||Соус холодный (25-грамм/порция)':1,
        }

metadict_detail['Южноморский весенний праздничный ужин'] = {
        'Хлеб пшеничный домашний (грамм)':50 * 2,
        'Картофель тушёный в соевом соусе (грамм)':200,
        'Халва морковная (грамм)':100,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Десерт холодный (100-грамм/порция)':1,
        }

metadict_detail['Южноморское весеннее праздничное питьё v1'] = {
        'Чай чёрный (грамм)':200 * 2,
        'Лепёшки рисовые с лимонным сиропом (грамм)':50 * 2,
        'Желе из ревеня (грамм)':100,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка жареная (50-грамм/порция)':2,
        '||Десерт холодный (100-грамм/порция)':1,
        }

metadict_detail['Южноморское весеннее праздничное питьё v2'] = {
        'Вино белое сухое (грамм)':200,
        'Козинаки медовые с фисташками (грамм)':10 * 2,
        '||Питьё холодное (200-грамм/порция)':1,
        '||Сладости (10-грамм/порция)':2,
        }

metadict_detail['Южноморское весеннее праздничное питьё v3'] = {
        'Компот из свежего ревеня (грамм)':200 * 2,
        '||Питьё холодное (200-грамм/порция)':2,
        }

#----
# Южноморский рацион (лето):
    # Июнь, июль, август

metadict_detail['Южноморский летний повседневный завтрак'] = {
        'Лепёшки рисово-просяные паровые (грамм)':50 * 2,
        'Рис обжаренный с капустой и овощами (грамм)':200,
        'Пастернак печёный дольками (грамм)':100,
        'Салат огуречно-морковный с соевым соусом (грамм)':100,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        '||Блюдо второе холодное (100-грамм/порция)':1,
        }

metadict_detail['Южноморский летний повседневный обед'] = {
        # TODO: Замени томатный суп на какой-нибудь суп-соус.
        'Рис варёный с соевым соусом (грамм)':200,
        'Суп-пюре пряный нутовый с луком-пореем (грамм)':200,
        'Суп томатный с фасолью (грамм)':100,
        'Овощи обжаренные в остром арахисовом соусе (грамм)':100,
        'Салат капустный с пряностями (грамм)':100,
        '||Антреме горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (100-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        '||Блюдо второе холодное (100-грамм/порция)':1,
        }

metadict_detail['Южноморский летний повседневный ужин'] = {
        'Лепёшки рисово-ячменные паровые (грамм)':50 * 2,
        'Каша пшённая с чечевицей и овощами (грамм)':200,
        'Фрукты летние южноморские (грамм)':200,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Фрукты свежие (200-грамм/порция)':1,
        }

metadict_detail['Южноморское летнее повседневное питьё v1'] = {
        'Чай чёрный (грамм)':200 * 2,
        'Лепёшки рисовые с финиковым соусом (грамм)':50 * 2,
        'Орех грецкий чищенный (грамм)':10 * 2,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка жареная (50-грамм/порция)':2,
        '||Орешки (10-грамм/порция)':2,
        }

metadict_detail['Южноморское летнее повседневное питьё v2'] = {
        'Вино красное сухое (грамм)':200,
        'Блины рисовые с арахисовой пастой (грамм)':50 * 2,
        '||Питьё холодное (200-грамм/порция)':1,
        '||Выпечка жареная (50-грамм/порция)':2,
        }

metadict_detail['Южноморское летнее повседневное питьё v3'] = {
        'Чай чёрный с сахаром (грамм)':200 * 2,
        'Оладьи картофельные с пряностями (грамм)':50,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка жареная (50-грамм/порция)':1,
        }

metadict_detail['Южноморский летний праздничный завтрак'] = {
        'Лепёшки рисово-ячменные паровые (грамм)':50 * 2,
        'Рис тушёный с вёшенками и овощами (грамм)':200,
        'Суп-лапша с кабачком и свежими томатами (грамм)':100,
        'Салат огуречный с лимонно-соевым соусом (грамм)':100,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (100-грамм/порция)':1,
        '||Блюдо второе холодное (100-грамм/порция)':1,
        }

metadict_detail['Южноморский летний праздничный обед'] = {
        'Шарики картофельные жареные во фритюре (грамм)':25 * 5,
        'Рис варёный с соевым соусом (грамм)':200,
        'Суп-пюре пряный шпинатный с темпе (грамм)':200,
        'Суп-пюре пряный бататный (грамм)':100,
        'Пастернак запечённый с томатами (грамм)':100,
        'Паста чесночно-кинзовая (грамм)':25,
        '||Выпечка жареная (25-грамм/порция)':5,
        '||Антреме горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (100-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        '||Соус холодный (25-грамм/порция)':1,
        }

metadict_detail['Южноморский летний праздничный ужин'] = {
        'Хлеб пшеничный домашний (грамм)':50 * 2,
        'Картофель тушёный с горошком и пряностями (грамм)':200,
        'Пудинг кукурузно-миндальный с изюмом (грамм)':100,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Десерт холодный (100-грамм/порция)':1,
        }

metadict_detail['Южноморское летнее праздничное питьё v1'] = {
        'Чай чёрный (грамм)':200 * 2,
        'Лепёшки рисовые с яблочным сиропом (грамм)':50 * 2,
        'Желе лимонное (грамм)':100,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка жареная (50-грамм/порция)':2,
        '||Десерт холодный (100-грамм/порция)':1,
        }

metadict_detail['Южноморское летнее праздничное питьё v2'] = {
        'Вино белое сухое (грамм)':200,
        'Козинаки медовые с миндалем (грамм)':10 * 2,
        '||Питьё холодное (200-грамм/порция)':1,
        '||Сладости (10-грамм/порция)':2,
        }

metadict_detail['Южноморское летнее праздничное питьё v3'] = {
        'Компот из свежих персиков (грамм)':200 * 2,
        '||Питьё холодное (200-грамм/порция)':2,
        }


#----
# Южноморский рацион (осень):
    # Сентябрь, октябрь, ноябрь

metadict_detail['Южноморский осенний повседневный завтрак'] = {
        'Лепёшки рисово-ячменные паровые (грамм)':50 * 2,
        'Рис обжаренный с капустой и грибами (грамм)':200,
        'Батат печёный дольками (грамм)':100,
        'Салат огуречно-морковный с соевым соусом (грамм)':100,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        '||Блюдо второе холодное (100-грамм/порция)':1,
        }

metadict_detail['Южноморский осенний повседневный обед'] = {
        # TODO: Слишком большая порция самбара. Это же скорее соус, чем суп.
            # Просто уменьши порцию и дай к обеду кукурузные лепёшки.
        'Рис варёный с соевым соусом (грамм)':200,
        'Суп-пюре пряный чечевичный с тыквой (грамм)':200,
        'Суп томатный с фасолью (грамм)':100,
        'Кукуруза печёная с соевым соусом (грамм)':100,
        'Салат капустный с пряностями (грамм)':100,
        '||Антреме горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (100-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        '||Блюдо второе холодное (100-грамм/порция)':1,
        }

metadict_detail['Южноморский осенний повседневный ужин'] = {
        'Хлеб соевый домашний (грамм)':50 * 2,
        'Каша пшённая с чечевицей и горошком (грамм)':200,
        'Фрукты осенние южноморские (грамм)':200,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Фрукты свежие (200-грамм/порция)':1,
        }

metadict_detail['Южноморское осеннее повседневное питьё v1'] = {
        'Чай чёрный (грамм)':200 * 2,
        'Лепёшки рисовые с алычовым соусом (грамм)':50 * 2,
        'Орех кешью обжаренный (грамм)':10 * 2,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка жареная (50-грамм/порция)':2,
        '||Орешки (10-грамм/порция)':2,
        }

metadict_detail['Южноморское осеннее повседневное питьё v2'] = {
        'Сок яблочный (грамм)':200 * 2,
        'Блины рисовые с арахисовой пастой (грамм)':50 * 2,
        '||Питьё холодное (200-грамм/порция)':2,
        '||Выпечка жареная (50-грамм/порция)':2,
        }

metadict_detail['Южноморское осеннее повседневное питьё v3'] = {
        # TODO: Убирай чай с мёдом. Расточительно для повседневного.
            # Южане делают офигенную чурчхелу и козинаки.
        'Чай чёрный с мёдом (грамм)':200 * 2,
        'Оладьи картофельные с пряностями (грамм)':50,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка жареная (50-грамм/порция)':1,
        }

metadict_detail['Южноморский осенний праздничный завтрак'] = {
        'Лепёшки рисово-ячменные паровые (грамм)':50 * 2,
        'Рис тушёный с вёшенками и овощами (грамм)':200,
        'Суп-лапша с кабачком и свежими томатами (грамм)':100,
        'Тыква фаршированная картофелем с пряностями (грамм)':100,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (100-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        }

metadict_detail['Южноморский осенний праздничный обед'] = {
        'Шарики овощные жареные во фритюре (грамм)':25 * 5,
        'Рис варёный с соевым соусом (грамм)':200,
        'Нут тушёный с томатами и пряностями (грамм)':200,
        'Суп-пюре пряный морковный (грамм)':100,
        'Картофель жареный в томатном соусе (грамм)':100,
        'Соус арахисовый острый (грамм)':25,
        '||Выпечка жареная (25-грамм/порция)':5,
        '||Антреме горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (100-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        '||Соус холодный (25-грамм/порция)':1,
        }

metadict_detail['Южноморский осенний праздничный ужин'] = {
        'Хлеб пшеничный домашний (грамм)':50 * 2,
        'Фасоль стручковая тушёная (грамм)':200,
        'Халва тыквенная (грамм)':100,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Десерт холодный (100-грамм/порция)':1,
        }

metadict_detail['Южноморское осеннее праздничное питьё v1'] = {
        'Чай чёрный (грамм)':200 * 2,
        'Лепёшки рисовые с лимонным сиропом (грамм)':50 * 2,
        'Желе яблочное (грамм)':100,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка жареная (50-грамм/порция)':2,
        '||Десерт холодный (100-грамм/порция)':1,
        }

metadict_detail['Южноморское осеннее праздничное питьё v2'] = {
        'Компот гранатово-яблочный с имбирем (грамм)':200,
        'Чурчхела с грецкими орехами (грамм)':10 * 2,
        'Чурчхела с миндалем (грамм)':10 * 2,
        '||Питьё холодное (200-грамм/порция)':1,
        '||Сладости (10-грамм/порция)':4,
        }

metadict_detail['Южноморское осеннее праздничное питьё v3'] = {
        'Компот из свежей вишни (грамм)':200 * 2,
        '||Питьё холодное (200-грамм/порция)':2,
        }

#----
# Южноморский рацион (зима):
    # Декабрь, январь, февраль

metadict_detail['Южноморский зимний повседневный завтрак'] = {
        'Лепёшки кукурузные (грамм)':50 * 2,
        'Рис тушёный с чечевицей и луком (грамм)':200,
        'Батат печёный дольками (грамм)':100,
        'Салат морковный с соевым соусом (грамм)':100,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        '||Блюдо второе холодное (100-грамм/порция)':1,
        }

metadict_detail['Южноморский зимний повседневный обед'] = {
        'Рис варёный с соевым соусом (грамм)':200,
        'Суп-пюре пряный фасолевый (грамм)':200,
        'Суп-лапша с морской капустой (грамм)':100,
        'Корень сельдерея печёный с соевым соусом (грамм)':100,
        'Капуста квашеная с соевым соусом (грамм)':100,
        '||Антреме горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (100-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        '||Блюдо второе холодное (100-грамм/порция)':1,
        }

metadict_detail['Южноморский зимний повседневный ужин'] = {
        'Хлеб кукурузный домашний (грамм)':50 * 2,
        'Каша пшённая с чечевицей (грамм)':200,
        'Пюре тыквенное (грамм)':200,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе холодное (200-грамм/порция)':1,
        }

metadict_detail['Южноморское зимнее повседневное питьё v1'] = {
        'Чай чёрный (грамм)':200 * 2,
        'Крендельки в сахарной глазури (грамм)':50,
        'Фисташки обжаренные (грамм)':10 * 2,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка жареная (50-грамм/порция)':1,
        '||Орешки (10-грамм/порция)':2,
        }

metadict_detail['Южноморское зимнее повседневное питьё v2'] = {
        # TODO: Добавь пирожки samosa
        'Сидр грушевый (грамм)':200,
        '||Питьё холодное (200-грамм/порция)':1,
        #'||Выпечка жареная (50-грамм/порция)':1,
        }

metadict_detail['Южноморское зимнее повседневное питьё v3'] = {
        'Чай чёрный с мёдом (грамм)':200 * 2,
        'Темпе обжаренный (грамм)':50,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка жареная (50-грамм/порция)':1,
        }

metadict_detail['Южноморский зимний праздничный завтрак'] = {
        'Хлеб пшеничный домашний (грамм)':50 * 2,
        'Рис обжаренный с консервированными овощами (грамм)':200,
        'Суп-лапша с бататом и солёными томатами (грамм)':100,
        'Вёшенки обжаренные с соевым соусом (грамм)':100,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (100-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        }

metadict_detail['Южноморский зимний праздничный обед'] = {
        'Шарики нутовые жареные во фритюре (грамм)':25 * 5,
        'Рис варёный с соевым соусом (грамм)':200,
        'Пюре гороховое с пряностями (грамм)':200,
        'Суп-пюре пряный нутово-томатный (грамм)':100,
        'Корень сельдерея жареный брусками во фритюре (грамм)':100,
        'Паста морковно-чесночная (грамм)':25,
        '||Выпечка жареная (25-грамм/порция)':5,
        '||Антреме горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (200-грамм/порция)':1,
        '||Блюдо первое горячее (100-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        '||Соус холодный (25-грамм/порция)':1,
        }

metadict_detail['Южноморский зимний праздничный ужин'] = {
        'Хлеб пшеничный домашний (грамм)':50 * 2,
        'Картофель тушёный с оливками и лимоном (грамм)':200,
        'Айва тушёная с мёдом и красным вином (грамм)':100,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Десерт холодный (100-грамм/порция)':1,
        }

metadict_detail['Южноморское зимнее праздничное питьё v1'] = {
        'Чай чёрный с лимоном (грамм)':200 * 2,
        'Лепёшки рисовые с айвовым сиропом (грамм)':50 * 2,
        'Желе виноградное (грамм)':100,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка жареная (50-грамм/порция)':2,
        '||Десерт холодный (100-грамм/порция)':1,
        }

metadict_detail['Южноморское зимнее праздничное питьё v2'] = {
        'Кофе с шоколадом (грамм)':200,
        'Темпе запечённый с сахаром (грамм)':100,
        '||Питьё холодное (200-грамм/порция)':1,
        '||Десерт холодный (100-грамм/порция)':1,
        }

metadict_detail['Южноморское зимнее праздничное питьё v3'] = {
        'Компот из сухофруктов с красным вином (грамм)':200 * 2,
        '||Питьё холодное (200-грамм/порция)':2,
        }
