#----
# Заметки:
    # "Россия в цифрах" Н.А. Рубакин 1910
    # https://istmat.org/node/24767
    # Бюджеты городов по сметным данным на 1913 год
    # https://www.gumer.info/bibliotek_Buks/History/Stat/32.php
    # https://www.gumer.info/bibliotek_Buks/History/Stat/43.php
    # Статистический ежегодник Российской Империи (1904-1916 годы):
    # https://istmat.org/node/21366
    # А.Г. Рашин Население России за 100 лет (1813 - 1913) Статистические очерки
    # https://istmat.org/node/30
    # Модель жизненного цикла крестьянского дворохозяйства
    # http://vln.by/node/117
    # Очерки экономической географии СССР, Огановский, 1924 год
    # https://istmat.org/node/24031
    # Перспективный план реконструкции сельского хозяйства на пятилетие 1927/28-1931/32 гг.
    # https://istmat.org/node/43426
    # Современная демография США:
    # https://www.homefacts.com/demographics.html

#----
# Мэйнхеттенский регион (мегаполисы):
    # Популяция Эквестрии:
    # https://derpicdn.net/img/view/2017/3/23/1394230__safe_analysis_chart_charts+and+graphs_math_pie+chart_population_statistics.png

metadict_army['Мэйнхеттенские прибрежные городские пони'] = {
        # Значимые районы:
            # - Общенаучный университет (Академия наук)
                # РАН -- 97k сотрудников (6.7 на 10k населения), 55% исследователи, 780 академики.
                # Особенности:
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Академия_Наук_Императорская
            # - Экономический университет (Торговая гильдия)
                # Особенности:
                    # Элитная школа для менеджеров и капитанов.
                    # Идеология пегасьего либерализма и скорой наживы.
                    # Пегасы неожиданно хорошо чуют, откуда дует ветер.
                    # Пегасьи капитаны держат морскую торговлю Эквуса.
                    # Многие банкиры и торговцы Эквестрии это пегасы.
                    # 2800 плутов 3-6 lvl составляют круг капитанов.
                    # 188 плутов 7+ lvl имеют связи по всему миру.
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Коммерческое_образование
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Академия_Коммерческих_наук
                # Штат:
                    # * Плуты: (12000 × 0.7) × 0.13 = 1100 дэринг ду
                    # * Барды: (900 × 0.8) × 0.13 = 100 рэрити и динки ду
                # Оборот:
                    # 50% национальных капиталов --> фонды --> доля банкиров
                    # Расходы на менеджмент: 36 млрд × 50% × 0.3% = 54 млн/год
                    # Доходы банков и фондов с капиталов: 36 × 50% × 3% = 540 млн
                    # Грамотный менеджмент капитала повышает ренту на 1-4% в год.
                    # Преподаватели дико богатые. Эти пегаски несут золотые яйца.
                # Бюджет:
                    # Всего 2.5/54 млн. бит (4.6% оборота, 0.04% ВВП, 2083 бит/студента)
                    # Фонд оплаты труда (52%):
                    # * 40 профессоров 9+ lvl (80%) (12800 бит/год) -- 0.52 млн.
                    # * 80 преподавателей 7+ lvl (53%) (6400 бит/год) -- 0.52 млн.
                    # * 100 служащих администрации (1600 бит/год) -- 0.16 млн.
                    # * 110 обслуживающего персонала (800 бит/год) -- 0.09 млн.
                    # Социальные расходы (28%):
                    # * Столовая на 1200 студентов (180 бит/год) -- 0.22 млн.
                    # * Стипендии на 600 студентов (400 бит/год) -- 0.24 млн.
                    # * Жильё для 1200 студентов (200 бит/год, по 20 м²) -- 0.24 млн.
                    # Содержание имущества (20%):
                    # * Фонды основные 10 млн = 40 лет × 0.5 млн/год × 0.5
                # Капиталы университетов (США, 2010 год):
                    # 800 вузов, всего 400 млрд долларов, медиана 100 млн (2 млн бит)
                    # Гарвард 30 млрд, Йель 20 млрд, Принстон и Стэнфорд по 15 млрд
                # Доступность образования (США, 2010 год):
                    # 50% бедных -- 10-20% выпусников вузов
                    # 25% богатых -- 40% --> 80% выпускников вузов 1970-2010 годы
                    # Обучение в Гарварде -- 54k долларов (1k бит, 30% за жильё)
                    # Средние доходы родителей -- 450k долларов/год (9k бит/год)
        # Градообразующие предприятия:
            # - Торговый порт, импорт (сахар, чай, лес)
            # - Торговый порт, экспорт (станки, ткани, зерно)
            # - Судостроительные верфи (20+ барков/год, 100+ шхун/год)
            # - Тяжёлая промышленность (машиностроение, станкостроение)
            # - Текстильная промышленность (хлопчатые ткани, ковры и одежда)
                # На 10 000 жителей:
                # 1.6 ткацких мастерских и 3000 кв.метров готовых тканей в рабочий день.
                # -Красильщик..................................... | 29
                # -Портной........................................ | 158
                # -Сапожник....................................... | 44
                # -Ткач........................................... | 220
                # -Швея........................................... | 32
                # Всего 9.6% трудоспособных жителей в текстильной промышленности.
        # Поровну пегасов и единорогов, мало земных.
        'Североморские земнопони (мегаполисы)':0.20,
        'Североморские единороги (мегаполисы)':0.40,
        'Североморские пегасы (мегаполисы)':0.40,
        # Мэйнхеттен снабжает оленей и грифонов тёплой одеждой.
        # Производство 5 лишних комплектов тёплой одежды на каждого жителя.
        '+Потребность в одежде, северяне (олени)':3,
        '+Потребность в одежде, богатеи (олени)':3 * 0.03,
        '+Потребность в одежде, северяне (грифоны)':2,
        '+Потребность в одежде, богатеи (грифоны)':2 * 0.03,
        }

metadict_army['Сталлионградские речные городские пони'] = {
        # Значимые районы:
            # - Инженерная академия (Горный техникум)
            # TODO: здесь единороги получают Feat_Artificer_Initiate (1 заклинание + 1 заговор)
            # https://ru.wikisource.org/wiki/ЭСБЕ/Горные_училища
        # Градообразующие предприятия:
            # - Сталелитейный завод (стальной прокат, рельсы 230+ тысяч тонн)
            # - Тяжёлая промышленность (машиностроение, железнодорожные машины)
            # - Гидроэлектростанция
        # Город на границе оленьих земель. Почти нет земных.
        'Североморские земнопони (мегаполисы)':0.10,
        'Североморские единороги (мегаполисы)':0.50,
        'Североморские пегасы (мегаполисы)':0.40,
        }

metadict_army['Нэйгарские горные городские пони'] = {
        # Значимые районы:
        # Градообразующие предприятия:
            # - Шахта (железная руда, магнетит)
            # - Гидроэлектростанция
        # Крупный шахтёрский город. Много единорогов, почти нет земных.
        'Североморские земнопони (мегаполисы)':0.10,
        'Североморские единороги (мегаполисы)':0.50,
        'Североморские пегасы (мегаполисы)':0.40,
        }

metadict_army['Харсвардские прибрежные городские пони'] = {
        # Значимые районы:
            # - Юридический университет (Гуманитарный университет)
                # Особенности:
                    # Элитная школа чиновников, преимущественно для земных.
                    # Идеология уравниловки и аграризма, крайний консерватизм.
                    # Выпускники 1520 действующих и 1270 бывших мэров Эквестрии.
                    # Чиновников кантоны выбирают из выпускниц на 20+ лет службы.
                    # Чиновники на службе вырастают до должности мэра к 40 годам.
                    # 25% выпускниц становятся мэрами, остальные в прочие службы.
                    # 600 текущих мэров монахи 5+ lvl (160 из них монахи 7+ lvl)
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Кембридж,_город_в_США
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Университет
                # Штат:
                    # * Монахи: (25000 × 0.7) × 0.13 = 2300 бон-бонок
                # Оборот:
                    # 5% доходов от 1% богатых --> фонды --> обучение наследниц
                    # 5% доходов от 1% Понивиля -- 4.6k бит (10 млн бит всего)
                    # После прогрессивного подоходного налога в местный бюджет.
                    # Из 25 семей (3200+ бит/год-семью), 9 кобылиц чиновники
                    # Российская империя (1905 год) -- 101 тыс. чинов 1-8 класса (10.4 на 10 тыс. населения)
                # Бюджет:
                    # Всего 2.1/10 млн. бит (21% оборота, 0.03% ВВП, 913 бит/студента)
                    # Фонд оплаты труда (49%):
                    # * 70 профессоров 9+ lvl (71%) (6400 бит/год) -- 0.45 млн.
                    # * 80 преподавателей 7+ lvl (27%) (3200 бит/год) -- 0.26 млн.
                    # * 75 служащих администрации (1600 бит/год) -- 0.12 млн.
                    # * 230 обслуживающего персонала (800 бит/год) -- 0.19 млн.
                    # Социальные расходы (31%):
                    # * Столовая на 2300 студентов (180 бит/год) -- 0.41 млн.
                    # * Жильё для 2300 студентов (10 м²) (100 бит/год) -- 0.23 млн.
                    # Содержание имущества (20%):
                    # * Фонды основные 8.4 млн = 40 лет × 0.42 млн/год × 0.5
                # Педагогический университет имени Герцена, 2016 год:
                    # * Доктора -- 262
                    # * Профессора -- 242
                    # * Преподаватели -- 1215
                    # * Магистратура -- 2600
                    # * Студенты -- 16 000
                    # Расходы:
                    # - выплаты персоналу -- 2.1 млрд (78%)
                    #     - фонд оплаты труда -- 1.6 млрд (60%)
                    #         - профессора и преподаватели -- 1.1 млрд (41%)
                    #         - прочий основной персонал -- 0.1 млрд (4%)
                    #         - вспомогательный персонал -- 0.1 млрд (4%)
                    #         - административно-управленческий персонал -- 0.3 млрд (11%)
                    #     - социальное страхование -- 0.5 млрд (19%)
                    # - социальные выплаты (стипендии) -- 0.2 млрд (7%)
                    # - закупка товаров, работ, услуг -- 0.4 млрд (15%)
                    #     - коммунальные услуги -- 0.1 млрд (4%)
                    #     - содержание имущества -- 0.1 млрд (4%)
                    #     - прочие работы -- 0.12 млрд (4%)
                    # Всего 2.7 млрд рублей (3.4 млн бит)
                    # https://www.herzen.spb.ru/sveden/budget/
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Фонд_заработной_платы
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Фонд_погашения
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Резервный_фонд
        # Градообразующие предприятия:
            # - Торговый порт, импорт (сахар, чай, лес)
            # - Торговый порт, экспорт (керамика, зерно)
            # - Гончарная промышленность (черепица, кафель, фаянс)
                # На 10 000 жителей:
                # 150 гончарных мастерских и 12 000 изделий каждый рабочий день
                # _-@Домохозяйство, разнорабочий.................... | 46
                # _-@Земледелие, лесник............................. | 60
                # _-@Промышленность-добыча, рабочий, лесоруб........ | 30
                # _-@Промышленность-фабрики, рабочий, керамика...... | 253
                # _-@Строительство, землекоп, глина................. | 3
                # _-@Транспорт, возничий-пегас...................... | 15
                # _-@Транспорт, грузчик............................. | 29
                # _-@Транспорт, железнодорожник..................... | 4
                # _-@Транспорт, железнодорожник-пегас............... | 19
                # _-@Транспорт, моряк............................... | 4
                # _-@Транспорт, моряк-пегас......................... | 11
                # Всего 13% трудоспособных единорогов, это гончары.
        # Город на границе Грифонии, вблизи мыса Тёплых вод. Удобная гавань и сплав леса по реке.
        'Североморские земнопони (мегаполисы)':0.40,
        'Североморские единороги (мегаполисы)':0.30,
        'Североморские пегасы (мегаполисы)':0.30,
        # Харсвард знаменит керамикой на весь североморский/южноморский регион.
        '+Потребность в посуде, керамика, северяне (олени)':40,
        '+Потребность в посуде, керамика, богатеи (олени)':40 * 0.03,
        '+Потребность в посуде, керамика, северяне (грифоны)':20,
        '+Потребность в посуде, керамика, богатеи (грифоны)':20 * 0.03,
        '+Потребность в посуде, керамика, южане (зебры)':60,
        '+Потребность в посуде, керамика, богатеи (зебры)':60 * 0.03,
        '+Потребность в посуде, керамика, южане (кабанчики)':20,
        '+Потребность в посуде, керамика, богатеи (кабанчики)':20 * 0.03,
        }

#----
# Ванхуверский регион (мегаполисы):

metadict_army['Ванхуверские прибрежные городские пони'] = {
        # Значимые районы:
        # Градообразующие предприятия:
            # - Торговый порт, импорт (пряности, редкоземельные металлы)
            # - Торговый порт, экспорт (станки, ткани, фрукты, зерно, масло, мыло)
            # - Аэропорт (5000 пегасов, 200 тяжёлых грузо-пассажирских планёров)
                # Эти крылатые регулярно перелетают океан на 12 000 километровом торговом маршруте.
                # Полёт в Маэт-Кэр занимает 20 дней (8 часов/сутки), с отдыхом и ночёвками на островах.
                # Прибыв к киринам пегасы отдыхают, а их планёр на обратном пути берёт отдохнувшая команда.
                # Каждый день аэропорты Маэт-Кэра и Ванхувера принимают по 10 планёров океанского пути.
                # Воздушные грузоперевозки (тонно-километр)................................... | 289,333,974
                # Маршрут международный-воздушный, Ванхувер <-> Маэт-Кэр (тонно-километров)... | 104,965,445
                # Маршрут международный-воздушный, Ванхувер <-> Якияк (тонно-километров)...... | 4,810,916
                # Маршрут международный-воздушный, Ванхувер <-> мыс Вестхуф (тонно-километров) | 3,936,204
            # - Текстильная промышленность (хлопчатые ткани, ковры и одежда)
                # На 10 000 жителей:
                # 1.9 ткацких мастерских и 2800 кв.метров готовых тканей в рабочий день.
                # -Красильщик..................................... | 29
                # -Портной........................................ | 123
                # -Сапожник....................................... | 38
                # -Ткач........................................... | 258
                # -Швея........................................... | 37
                # Всего 9.7% трудоспособных жителей в текстильной промышленности.
        # Крупнейший порт на западном побережье, межконтинентальная торговля с киринским Маэт-Кэром.
        'Североморские земнопони (мегаполисы)':0.25,
        'Североморские единороги (мегаполисы)':0.35,
        'Североморские пегасы (мегаполисы)':0.40,
        # Ванхувер торгует с заокеанскими киринами
        '+Потребность в одежде, среднеземцы (кирины)':5,
        '+Потребность в одежде, богатеи (кирины)':5 * 0.1,
        }

metadict_army['Онтаринские прибрежные городские пони'] = {
        # Образец (Астрахань, 70k населения (57k уезд, 480k губерния), 9500 зданий, 22% каменных):
            # Фабрик и заводов (в губернии) 234, с производством на 2.4 млн руб., при 2107 рабочих;
            # Городское имущество -- 13.7 млн рублей.
            # Торговый оборот -- 30.4 млн рублей (Персия 2.8 млн, Бухара 0.9 млн)
            # Прибыло: 4277 судов (7% с балластом), Отошло: 4342 (69% с балластом).
            # Городские доходы за 1888 г: 582 231 руб:
            # - с городских недвижимых имуществ и оброчных статей — 302 397 р. (52%)
            # - оценочный сбор с недвижимых имуществ — 48 284 р. (8.3%)
            # - с трактирных и других торговых заведений — 48 953 р. (8.4%)
            # - с документов за право торговли — 32 905 р. (5.6%)
            # - за свидетельство протестов и представленных ко взысканию актов — 11 680 р. (2%)
            # - с извозного и перевозного промысла — 19 431, (3.3%)
            # - прочие мелочные и случайные поступления — 60 866 р. (10.5%)
            # - из других источников — 39 412 р. (6.7%)
            # - Недоимок 28 303 р.,
            # Городские расходы за 1888 г: 608 917 руб. (94% указано ниже)
            # - содержание городского общественного управления и зданий — 68 394 р. (11.8%)
            # - содержание городской полиции — 73 809 р. (12.7%)
            # - пожарной команды и обоза — 50 115 р. (9%)
            # - благотворительные и другие общественные заведения — 58 018 р. (10%)
            # - строительная часть — 117 770 р. (20.2%)
            # - на воинские потребности — 6401 р. (1.1%)
            # - содержание врачебного персонала — 19 469, (3.3%)
            # - устройство и содержание мостовых — 69 855 р. (12%)
            # - освещение улиц — 15 593 р. (2.7%)
            # - и прочие расходы — 52 563 р. (9%)
            # https://ru.wikisource.org/wiki/ЭСБЕ/Астрахань,_уезд_и_губерния
        # Значимые районы:
        # Градообразующие предприятия:
            # - Шахта (медно-никелевые руды + серебро)
            # - Шахта (полиметаллические руды, цинк, магний)
        # Шахты раскиданы на десятки километров от города.
        # Колония Эквестрии в ячьих землях. Много пегасов.
        'Североморские земнопони (мегаполисы)':0.10,
        'Североморские единороги (мегаполисы)':0.40,
        'Североморские пегасы (мегаполисы)':0.50,
        }

metadict_army['Инхарнеские речные городские пони'] = {
        # Значимые районы:
        # Градообразующие предприятия:
            # - Шахта (фосфориты)
            # - Химическая промышленность (удобрения)
            # - Гидроэлектростанция
        # Город на границе земель алмазных псов.
        'Североморские земнопони (города)':0.15,
        'Североморские единороги (города)':0.35,
        'Североморские пегасы (города)':0.50,
        }

metadict_army['Шайенские горные городские пони'] = {
        # Значимые районы:
        # Градообразующие предприятия:
            # - Шахта (касситерит -- олово)
        # Единственная оловянная шахта на континенте.
        'Североморские земнопони (города)':0.25,
        'Североморские единороги (города)':0.35,
        'Североморские пегасы (города)':0.40,
        }

#----
# Филлидельфийский регион (мегаполисы):

metadict_army['Филлидельфийские речные городские пони'] = {
        # Значимые районы:
            # - Земледельческий университет (Агротехнический университет)
            # https://ru.wikisource.org/wiki/ЭСБЕ/Московский_сельскохозяйственный_институт
        # Градообразующие предприятия:
            # - Торговый порт, импорт (сахар, чай, лес, каучук)
            # - Торговый порт, экспорт (зерно, масло, ткани, удобрения, бумага)
            # - Агротранзитный центр (элеваторы и хранилища на 2+ миллиона тонн зерна)
            # - Тяжёлая промышленность (машиностроение, сельскохозяйственная техника)
            # - Химическая промышленность (удобрения, кислоты, бумага, взрывчатка)
            # - Гидроэлектростанция
        # Город смышлёных земных.
        'Среднеземные земнопони (мегаполисы)':0.35,
        'Среднеземные единороги (мегаполисы)':0.35,
        'Среднеземные пегасы (мегаполисы)':0.30,
        }

metadict_army['Троттингемские речные городские пони'] = {
        # Значимые районы:
        # Градообразующие предприятия:
            # - Текстильная промышленность (пеньковая пряжа, канаты и ткани)
            # - Химическая промышленность (чернила, краски, лаки, олифы, парафин)
        # Много единорогов: ткачей и портных.
        'Среднеземные земнопони (мегаполисы)':0.25,
        'Среднеземные единороги (мегаполисы)':0.55,
        'Среднеземные пегасы (мегаполисы)':0.20,
        }

metadict_army['Камильхильские горные городские пони'] = {
        # Значимые районы:
        # Градообразующие предприятия:
            # - Шахта (яркосветы)
            # - Шахта (Серебро-свинцовые руды, цинковые руды)
            # Светокристаллы для Continual_Flame на 30/62 млн компонентов/год
            # Серебро-свинцовые руды (концентрат, 71% свинца, 4.5% цинк, 1.1 кг серебра)
            # Цинковые руды, галмея (обжиг, 55% цинка)
        # Крупный город шахтёров к западу от Филлидельфии.
        'Среднеземные земнопони (мегаполисы)':0.15,
        'Среднеземные единороги (мегаполисы)':0.45,
        'Среднеземные пегасы (мегаполисы)':0.40,
        }

metadict_army['Мэрэйские речные городские пони'] = {
        # Значимые районы:
        # Градообразующие предприятия:
            # - Торговый порт, импорт (сосновая живица, лес, торф, пенька)
            # - Торговый порт, экспорт (зерно, масло, керамика, ткани, бумага)
            # - Судостроительные верфи, речные (100+ барж/год)
                # Волжское судостроение:
                    # В 1879-1888 годы построено -- 65 250 судов на 52 млн рублей (544-918 рублей/судно)
                    # Большие суда (построены на Волге) -- 4085 судов на 8.1 млн рублей (2226 рублей/судно)
                    # Меньшие суда (строились на притоках) -- 39 862 судов на 32.3 млн рублей (809 рублей/судно)
                # Судостроительные верфи на Волге (9 важнейших, 4.1 млн рублей/десятилетие, 50% строительства)
                    # - город Балахна (на 943 тыс. руб.),
                    # - селение Городец (на 684 тыс. руб.),
                    # - город Молога (на 595 тыс. руб.),
                    # - деревня Сологузова (на 583 тыс. руб.),
                    # - деревня Юг (на 340 тыс. руб.),
                    # - селение Работки (на 320 тыс. руб.),
                    # - селение Печоры (на 232 тыс. руб.),
                    # - деревня Абрашкина (на 207 тыс. руб.)
                    # - город Рыбинск (на 203 тыс. руб.).
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Волга
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Балахна,_город
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Молога,_город
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Рыбинск
        # Центр речной торговли, множество пегасов с их баржами. Сплав леса.
        # Город на границе с оленьим Фонтэйном.
        'Среднеземные земнопони (города)':0.15,
        'Среднеземные единороги (города)':0.25,
        'Среднеземные пегасы (города)':0.60,
        }

#----
# Кантерлотский регион (мегаполисы):

metadict_army['Кантерлотские горные городские пони'] = {
        # Значимые районы:
            # - Магический университет (Школа волшебства)
                # Особенности:
                    # Здесь обучаются 90% волшебников Эквестри и 50% чародеев.
                    # Все волшебники 5+ lvl, это специалисты из школы волшебства.
                    # Кастеры 9+ lvl живут в Кантерлоте ради Teleportation_Circle.
                # Штат:
                    # * Волшебники: (10600 × 0.9) × 0.13 = 1200 тваек
                    # * Чародеи: (13600 × 0.5) × 0.13 = 900 глоу
                    # Всего 2100 студентов
                # Оборот:
                    # Налог добавленной стоимости --> корпорация заклинателей --> школа волшебства
                    # Корпоративные доходы: 56 млн, это 8.2/300k бит (2.7%) НДС с каждого понивиля.
                    # Тип        | Заговоры |  1   |  2   |  3   |  4   | 5     | Стоимость (всего)
                    # ---------- | -------- | ---- | ---- | ---- | ---- | ----- | -----------
                    # Заговоры * | 11 млрд  | -    | -    | -    | -    | -     | 18.3 млн. бит
                    # Заклинания | -        | 16   | 4    | 0.9  | 0.2  | 0.04  | 26.2
                    # Ритуалы *  | -        | 88   | 21   | 4.7  | 1.3  | 0.4   | 11.5
                    # Стоимость  | 1/600    | 1    | 1.5  | 2.2  | 7    | 20    | 56 млн.
                    # ---------- | -------- | ---- | ---- | ---- | ---- | ----- | ------------
                    # Кантрипы: 11 млрд/год (18 млн. часов) = 18 млн. бит
                    # * Заговоры в 600 раз дешевле заклинаний 1 круга (1 час = 1 бит)
                    # * Ритуалы в среднем вдесятеро дешевле заклинаний (1 час = 0.6 бит)
                    # Доходы магов:
                    # 1 круг (1 lvl): 750 + 600 + 480           = 1830 --> 1400 бит/год (22% налог)
                    # 2 круг (3 lvl): 1125 + 1700 + 600 + 480   = 3905 --> 2700 бит/год (30% налог)
                    # 3 круг (5 lvl): 1125 + 1700 + 2500        = 5325 --> 3500 бит/год (35% налог)
                    # 4 круг (7 lvl): 1125 + 1700 + 2500 + 5800 = 11 125 --> 5400 бит/год (51% налог)
                    # Маги 1-2 круга подрабатывают ритуалами и заговорами (600 + 480 бит)
                    # amber -sm "Герои-единороги (волшебники)" -d 2
                    # _++0 lvl (C) (заговоров/год) (доступно)............ | 540,000 (480/900 бит)
                    # _++0 lvl (C) Лепка земли (0 lvl Mold_Earth)........ | 270,000
                    # _++0 lvl (C) Малая иллюзия (0 lvl Minor_Illusion).. | 108,000
                    # _++0 lvl (C) Фокусы (0 lvl Prestidigitation)....... | 108,000
                    # _++1 lvl (R) (ритуалов/год) (доступно)............. | 7,200 (600/720 бит)
                    # _++1 lvl (R) Невидимый слуга (1 lvl Unseen_Servant) | 3,600
                    # _++1 lvl (R) Обнаружение магии (1 lvl Detect_Magic) | 1,440
                    # _++1 lvl (R) Опознание (1 lvl Identify)............ | 720
                    # _++1 lvl (R) Переписчик (1 lvl Amanuensis)......... | 720
                    # _++1 lvl (S) (заклинаний/год) (доступно)........... | 900 (750/900 бит)
                    # _++1 lvl (S) Доспехи мага (1 lvl Mage_Armor)....... | 450
                    # _++1 lvl (S) Безмолвный образ (1 lvl Silent_Image). | 180
                    # _++1 lvl (S) Усыпление (1 lvl Sleep)............... | 90
                    # _++1 lvl (S) Черепашка (1 lvl Turtle_Shell)........ | 90
                    # По значению:
                    # * Горные работы с Mold_Earth и Shape_Water (>9 млн бит/год)
                    # * Светокристаллы Continual_Flame (5.1 млн бит/год, 74 млн компоненты)
                    # * Почта с Leomund_Secret_Chest и Teleportation_Circle (<35 млн бит/год)
                    # * Сверхпрочные материалы с Arcane_Fabric и Fortify_Matter (>3 млн бит/год)
                    # * Станкостроение с Cantrip_to_Device и Enchant_Item (>1 млн бит/год)
                    # * Химпром с Unseen_Servant и Sphere_of_Clear_Air (9 млн бит/год)
                    # * Реклама с Minor_Illusion и Silent_Image (11 млн бит/год)
                    # * Оператор связи Sending (4 млн бит/год)
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Цехи_в_Западной_Европе
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Гильдии
                # Бюджет:
                    # Всего 2.8/56 млн. бит (5% оборота, 0.04% ВВП, 1330 бит/студента)
                    # Фонд оплаты труда (36%):
                    # * 70 профессоров 9+ lvl (75%) (6400 бит/год) -- 0.5 млн.
                    # * 70 преподавателей 7+ lvl (25%) (3200 бит/год) -- 0.23 млн.
                    # * 70 служащих администрации (1600 бит/год) -- 0.11 млн.
                    # * 210 обслуживающего персонала (800 бит/год) -- 0.17 млн.
                        # amber -sm Среднеземные горожане середняки -n 2100 -E @
                        # Коэффициент 0.35 -- эффективность домохозяйств в сравнении со служащими.
                        # 600 домохозяек × 0.35 = 210 служащих (10 студентов/служащего)
                    # Социальные расходы (43%):
                    # * Столовая на 2100 студентов (180 бит/год) -- 0.38 млн.
                    # * Стипендии на 1000 студентов (400 бит/год) -- 0.4 млн.
                    # * Жильё для 2100 студентов (200 бит/год, по 20 м²) -- 0.42 млн.
                    # Содержание имущества (20%):
                    # * Фонды основные 11.2 млн = 40 лет × 0.56 млн/год × 0.5
            # ------------------------------------------------------------
            # - Медицинский университет (медицинская школа)
                # Особенности:
                    # Здесь обучаются 90% колдунов, 90% паладинов и 50% друидов.
                    # Колдуны и паладины Эквестрии, это проводники магии богини.
                    # Бесталанные маги, которые используют кристальные сердца.
                    # Друиды из коз и оленей Кантерского предгорья. Аптекари.
                # Штат:
                    # * Колдуны: (5144 × 0.9) × 0.13 = 600 блюбладов
                    # * Паладины: (1304 × 0.9) × 0.13 = 150 шайнингов
                    # * Друиды: (4890 × 0.5) × 0.13 = 320 флаттершаек
                    # Всего 1100 студентов
                # Оборот:
                    # Поземельный налог --> страховой фонд --> корпорация медиков --> медицинская школа
                    # Тип        | Заговоры |  1   |  2   |  3   |  4   | 5     | Стоимость (всего)
                    # ---------- | -------- | ---- | ---- | ---- | ---- | ----- | ------------
                    # Заговоры   | 2.9 млрд | -    | -    | -    | -    | -     | 4,8 млн. бит
                    # Заклинания | -        | 9.1  | 2.8  | 0.7  | 0.16 | 0.05  | 26.2
                    # Ритуалы    | -        | 45   | 10   | 2.5  | 0.64 | 0.21  | 11.5
                    # Стоимость  | 1/600    | 1    | 1.5  | 2.2  | 7    | 20    | 29 млн.
                    # ---------- | -------- | ---- | ---- | ---- | ---- | ----- | ------------
                    # По значению:
                    # * Амбулатория с Detect_Poison_and_Disease
                    # * Операции с Lesser_Restoration и Greater_Restoration
                    # * Реанимация с Death_Ward, Aura_of_Vitality и Beacon_of_Hope
                    # * Синтез медикаментов с Goodberry
                # Бюджет:
                    # Всего 2/29 млн. бит (7% оборота, 0.03% ВВП, 1820 бит/студента)
                    # Фонд оплаты труда (34%):
                    # * 40 профессоров 9+ lvl (87%) (6400 бит/год) -- 0.26 млн.
                    # * 70 преподавателей 7+ lvl (39%) (3200 бит/год) -- 0.23 млн.
                    # * 60 служащих администрации (1600 бит/год) -- 0.1 млн.
                    # * 110 обслуживающего персонала (800 бит/год) -- 0.09 млн.
                    # Социальные расходы (43%):
                    # * Столовая на 1100 студентов (180 бит/год) -- 0.2 млн.
                    # * Стипендии на 1100 студентов (400 бит/год) -- 0.44 млн.
                    # * Жильё для 1100 студентов (200 бит/год, по 20 м²) -- 0.22 млн.
                    # Содержание имущества (23%):
                    # * Фонды основные 9.2 млн = 40 лет × 0.46 млн/год × 0.5
            # ------------------------------------------------------------
            # - Военная академия (гвардейская школа, военная гильдия)
                # Особенности:
                    # Здесь обучается 70% варваров Эквестрии (sic!)
                    # А кроме того 20% бойцов, слишком диких для ополчения.
                    # ADHD. Дофаминовые наркоманы, гиперфокусировка на риск.
                    # Гвардия полна пегасок, с редкими вкраплениями перитонов.
                # Штат:
                    # * Варвары -- (8509 × 0.7) × 0.13 = 770 скуталу
                    # * Бойцы -- (21 880 × 0.2) × 0.13 = 570 рэйнбоу
                    # Всего 1400 студентов
                # Оборот:
                    # Корпорация заклинателей --> гвардейская школа
                    # Кормятся с доходов волшебников, поскольку близки.
                    # В медицинской и волшебной школе есть военные факультеты.
                # Бюджет:
                    # Всего 1.7/56 млн. бит (3% оборота, 0.03% ВВП, 1200 бит/студента)
                    # Фонд оплаты труда (45%):
                    # * 50 старших офицеров 9+ lvl (43%) (6400 бит/год) -- 0.32 млн.
                    # * 50 младших офицеров 7+ lvl (14%) (3200 бит/год) -- 0.16 млн.
                    # * 100 служащих администрации (1600 бит/год) -- 0.16 млн.
                    # * 140 обслуживающего персонала (800 бит/год) -- 0.12 млн.
                    # Социальные расходы (34%):
                    # * Столовая на 1400 студентов (90 бит/год) -- 0.13 млн.
                    # * Стипендии на 1400 студентов (200 бит/год) -- 0.3 млн.
                    # * Жильё для 1400 студентов (100 бит/год, по 10 м²) -- 0.14 млн.
                    # Содержание имущества (20%):
                    # * Фонды основные 6.8 млн = 40 лет × 0.34 млн/год × 0.5
            # ------------------------------------------------------------
            # - Полк гвардии (первый и единственный)
                # Особенности:
                    # 3 пегасьих батальона, 12 варварских рот, батальон паладинов и батальон чародеев.
                    # Кроме того дивизион боевого обеспечения (пегасья разведка) и тыловой дивизион.
                    # Батальон Клаудсдэйла, батальон Кантерлота и батальон Мэйнхеттена.
                    # Роты варваров в округах Диколесья, в приграничных понивилях.
                    # Разведка работает отделениями в диколесье и на фронтире.
                    # Чародеи работают повзводно, если угроза велика.
                    # Паладины служат военной полицией и мед.службой.
                # Штат:
                    # 4300 гвардейцев 2+ lvl.
                    # В составе полка 1100 бойцов и 1500 варваров в отдельных ротах.
                    # Военная полиция -- 320 паладинов; артиллерия -- 350 чародеев.
                    # Боевое обеспечение -- 400 следопытов; Тыловики -- 600 пони.
                # Организация:
                    # * Батальон (подполковник 11+ lvl со штабом, 3×120 солдат)
                    # * Рота (майор 9+ lvl с отделением управления, 3×36 солдат)
                    # * Взвод (капитан 7+ lvl с заместителем, 3×11 солдат)
                    # * Отделение (лейтенант 5+ lvl, 10 солдат 2-4 lvl)
                    # Гвардия суть рыцарский орден, звания смещены вниз.
                # Вооружение;
                    # Главная сила, это чародеи с их Magic_Missile и Flaming_Sphere.
                    # 35 Magic_Missile в залпе взвода чародеев развоплотят кого угодно.
                    # Пегасы вооружены реактивными гранатами или кумулятивными бомбами.
                    # Магазинные винтовки знают и любят, но используют редко, нет задач.
                    # Противники гвардии либо убиваются копытом, либо не убиваются пулей.
                # Обеспечение:
                    # Снаряжение гвардейцы покупают себе сами, жёстких стандартов нет.
                    # На заказ делают латные доспехи, но нередко выбирают Mage_Armor.
                    # Медицина на приданных паладинах. Вывозят раненых сразу в города.
                # Тактика:
                    # Пегасов 61%, аэромобильность дикая. Наступают с 80 км/час.
                    # Пегасы закидывают бомбами, варвары преследуют, чародеи добивают.
                    # Это полк штурмовой авиации в понячьем исполнении.
                    # Совмещённый с десантно-штурмовыми ротами.
                # Оборот:
                    # Корпорация заклинателей --> гвардейская школа
                    # Кормятся с доходов волшебников, поскольку близки.
                    # Норма расходов на армию 1908 год 2-3% ВВП (у нас 0.1% ВВП)
                    # Это не армия, а смесь рыцарского ордена и охотничьего клуба.
                    # Простым бойцам платят не больше, чем таксистам или морякам.
                    # Отставники становятся командирами городского ополчения.
                # Бюджет:
                    # Всего 6/56 млн. бит (11% оборота, 0.1% ВВП, 1372 бит/солдата)
                    # Фонд оплаты труда (66%):
                    # * 50 майоров 9+ lvl (43%) (6400 бит/год) -- 0.32 млн.
                    # * 150 капитанов 7+ lvl (42%) (3200 бит/год) -- 0.48 млн.
                    # * 300 лейтенантов 5+ lvl (1600 бит/год) -- 0.48 млн.
                    # * 670 паладинов и чародеев 2-4 lvl (1600 бит/год) -- 1.1 млн.
                    # * 2500 бойцов и варваров 2-4 lvl (500 бит/год) -- 1.25 млн.
                    # * 600 тыловиков 1 lvl (500 бит/год) -- 0.3 млн.
                    # Социальные расходы (14%):
                    # * Столовые на 4300 военных (90 бит/год) -- 0.4 млн.
                    # * Жильё для 4300 военных (100 бит/год, по 10-20 м²) -- 0.43 млн.
                        # Жильё для военных, это организованная аренда квартир в приграничье.
                        # Точно так же и с продовольствием. Стараются на планёрах подвозить.
                    # Содержание имущества (20%):
                    # * Фонды основные 24 млн = 40 лет × 1.2 млн/год × 0.5
                        # В основном это содержание дворца богини в Кантерлоте.
                        # Крепостей не строят, постов не держат, в казармах не живут.
            # ------------------------------------------------------------
            # - Правительство и государственный совет.
        # Градообразующие предприятия:
            # - Тяжёлая промышленность (композиты, маховики, планёры, приборостроение)
            # - Гидроэлектростанция
        # Множество единорогов, мало пегасов и земных.
        'Среднеземные земнопони (мегаполисы)':0.15,
        'Среднеземные единороги (мегаполисы)':0.65,
        'Среднеземные пегасы (мегаполисы)':0.20,
        }

metadict_army['Клаудсдэйлские летучие городские пони'] = {
        # Значимые районы:
            # - Погодная академия (Погодная школа, погодная гильдия)
                # Особенности:
                    # Здесь обучались 50% крылатых жрецов (28% всех пегасов Клаудсдэйла)
                    # Камлают тучи, приносят дожди в сухие степи, в меру сил лечат лесное зверьё.
                    # Погодников в 3 раза больше, чем волшебников, чародеев и колдунов вместе взятых.
                # Штат:
                    # + Жрецы -- (85 089 × 0.5) × 0.13 = 5500 дэшек
                # Оборот:
                    # 1/10 единого поземельного налога -- 70 млн. бит
                    # Поземельный налог --> погодная служба --> дожди для земных
                    # Тип        |  1   |  2   |  3   |  4   |  5   |  6   |  7    | 8     | Стоимость
                    # ---------- | ---- | ---- | ---- | ---- | ---- | ---- | ----- | ----- | ---------
                    # Заклинания | 35   | 8    | 2    | 0.35 | 0.07 | 0.01 | 0.003 | 0.001 | 23.4
                    # Ритуалы    | 230  | 57   | 14   | 3.6  | 0.9  | 0.2  | 0.05  | 0.02  | 17.1
                    # Стоимость  | 0.3  | 1    | 1.5  | 2.2  | 7    | 20   | 60    | 130   | 40.5 млн.
                    # ---------- | ---- | ---- | ---- | ---- | ---- | ---- | ----  | ----- | ---------
                    # * Цены заклинаний на уровень ниже арканных.
                    # Грузоперевозки ритуалами Floating_Disk
                    # Реклама ритуалами Whispering_Wind и Skywrite
                    # Защита от пыли/газов ритуалом Sphere_of_Clear_Air
                    # Защита себя с Feather_Fall и Absorb_Elements
                    # Защита товарищей с Warding_Wind и Warding_Bond
                    # Управление водой с Tidal_Wave и Wall_of_Water
                    # Управление стихиями с Conjure_Minor_Elementals
                # Бюджет:
                    # Всего 5.8/70 млн. бит (8.3% оборота, 0.1% ВВП, 1055 бит/студента)
                    # Фонд оплаты труда (43%):
                    # * 180 профессоров 9+ lvl (55%) (6400 бит/год) -- 1.16 млн.
                    # * 200 преподавателей 7+ lvl (20%) (3200 бит/год) -- 0.64 млн.
                    # * 200 служащих администрации (1600 бит/год) -- 0.32 млн.
                    # * 400 обслуживающего персонала (800 бит/год) -- 0.32 млн.
                    # Социальные расходы (38%):
                    # * Столовая на 5500 студентов (90 бит/год) -- 0.5 млн.
                    # * Стипендии на 5500 студентов (200 бит/год) -- 1.1 млн.
                    # * Жильё для 5500 студентов (100 бит/год, по 10 м²) -- 0.55 млн.
                    # Содержание имущества (20%):
                    # * Фонды основные 23.2 млн = 40 лет × 1.16 млн/год × 0.5
            # ------------------------------------------------------------
        # Градообразующие предприятия:
            # - Погодная служба (смягчение климата южной Эквестрии)
                # Метод:
                    # Способ управления траекторией циклона
                    # >на пути сформировавшегося циклона создается коридор пониженного давления
                    # >Было показано, что регулируя температурный режим вблизи центра циклона
                    # >(изменения до 3 градусов Цельсия) и находя самоусиливающее внесенное возмущение,
                    # >можно изменить существенно направление и скорость ветра.
                    # https://www.nkj.ru/archive/articles/6756/
                    # https://findpatent.ru/patent/239/2392794.html
                # Задача:
                    # Обжитые земли Эквестрии 593 265 км² (30% от площади страны)
                    # Пашни, сады и плантации 127 193 км² (22% от обжитых земель)
                    # Пашни степных регионов 43 878 км² (32% населения, житница страны)
                    # Климат южной Эквестрии как в Испании: 8 месяцев засухи, 4 месяца дождей.
                    # Средние осадки степи 25 мм/месяц, а нужно 50 мм/месяц (1.1 млрд. тонн воды)
                    # Земные собирают воду с помощью системы каналов и прудов, но этого мало.
                # Циклон:
                    # 5-мильный радиус для Control_Weather.
                    # Объём центра: 3.14 × (9^2) × 3 × 0,75 = 600 км³
                    # Масса центра: 600 × 1.2 кг/м³ = 720 млн.т воздуха
                    # Водность (2-4 г/м³ воды): 600 × 0.003 = 1.8 млн.тонн воды
                    # Это атмосферный вихрь, видимость в котором 30 метров (90 ft)
                    # Это 18% водных ресурсов кантона или три озера по 36 га (1000×500×3 м)
                    # Это озеро площадью 36 гектаров при глубине 5 метров (10-20% вод кантона)
                    # В 3-километровом столбе слоисто-дождевых облаков 9 литров воды (9 мм/кв.метр)
                    # Требуется 600 циклонов/месяц, 4800 циклонов/сезон.
                    # У нас 115 заклинаний/месяц, 923 заклинаний/сезон (19%)
                # Маршрут:
                    # Дистанция 1000 километров (Клаудсдэйл --> центральная Эквестрия) 
                    # Через "субтропический хребет", от циркуляции умеренных широт до ячейки Хэдли.
                    # К северу от Клаудсдэйла ветер дует с запада на восток, на юге наоборот.
                    # Пегасы собирают тучи над болотами севера и направляют на юго-восток.
                    # Клаудсдэйл, Кантерлот, Хуффингтон, Доджтаун -- четыре остановки.
                    # Далее восточный ветер циркуляции Хэдли сам тащит тучи в степь.
                # Энергия:
                    # При V=17 м/с, L=10 км и R=7 км кинетическая энергия циклона 10^14 Дж
                    # Скорость: 72 км/час (4 Бофорта, оптимальная скорость полёта пегасов)
                    # Мощность: 720 млн.кг воздуха × 20 метров/секунду × 9.8 = 141 гигаватт
                    # Нагревание: 10^14 / (141 × 10^9) = 709 секунд (12 минут при 141 ГВт)
                    # Магия пегасов, это управляемый нагрев малой мощности на огромной площади.
                    # Шейди считает, что достаточно и 14 ГВт, на площади с R=3 км, но у нас R=7
                    # 10 погодников = 1 кВт/кв.метр в круге с радиусом 0.77 км (2 кв.км площади)
                    # 10 погодников = 2 гигаватта мощности, сравнимых с Солнцем в палящий день.
                    # На каждый квадратный метр тучи нужно 0.36 киловатта, чтобы создать циклон.
                    # Нам требуется 705 пегасов (20 МВт/пегас), чтобы начать вращение циклона.
                    # Пегасы собираются сотнями, создавая циклон диаметром 20-30 километров.
                    # Hurricane Fluttershy таки взлетит!
                # Доставка:
                    # Нагрев --> разрежённый воздух --> пониженное давление --> путь циклона
                    # Пегасы ведут облако, создавая перед ним фронт пониженного давления.
                    # Для этого требуется вдесятеро меньше пегасов, просто пробить коридор.
                    # Туча на 1000 километров, это 14 часов, 4 смены пегасов (туда и домой).
                    # Создание 600 туч/месяц, это 10 575 пегасо-дней, 17 пегасо-дней/туча
                    # Доставка 600 туч/месяц, это 38 туч/день, 212 пегасо-дней/туча.
                    # Снабжение водой адресное, вдоль отмеченных земными полос полей.
                # Работа:
                    # Один циклон -- 17 пегасо-дней на создание, 212 пегасо-дней доставка.
                    # 4800 циклонов -- 1.1 млн пегасо-дней, 5500 пегасов-погодников (7%)
                    # На деле больше из-за наземных служб и адресной доставки воды.
                    # Погодная служба -- 5500+ пегасов на 84 тысячи жрецов.
                # Оборот:
                    # 1/10 единого поземельного налога -- 70 млн. бит
                    # Тень медицинской службы с их бюджетом в 160+ млн бит (2.7% ВВП)
                    # 1.8 млн тонн воды = 229 пегасо-дней (1832 нормо-часов, 0.4 бит/час)
                    # 1.1 млрд. тонн/месяц = 0.45 млн бит/месяц
                    # Сезон (8 месяцев) = 3.6 млн бит/год
                # Бюджет:
                    # Всего 45/70 млн. бит (64% оборота, 0.8% ВВП, 1184 бит/бойца)
                    # Фонд оплаты труда (64%):
                    # * 150 майоров 9+ lvl (42%) (6400 бит/год) -- 1.96 млн.
                    # * 400 капитанов 7+ lvl (40%) (3200 бит/год) -- 1.28 млн.
                    # * 1600 лейтенантов 5+ lvl (82%) (1600 бит/год) -- 2.56 млн.
                    # * 16 000 погодников 2-4 lvl (87%) (800 бит/год) -- 12.8 млн.
                    # * 16 000 подмастерий 1 lvl (64%) (500 бит/год) -- 8 млн.
                    # * 3600 тыловиков 1 lvl (15%) (500 бит/год) -- 1.8 млн.
                    # Социальные расходы (16%):
                    # * Столовые на 38 000 погодников (90 бит/год) -- 3.42 млн.
                    # * Жильё для 38 000 погодников (100 бит/год, по 10-20 м²) -- 3.8 млн.
                        # Гостевые дома в кантонах, могут принять по 700 погодников.
                    # Содержание имущества (20%):
                    # * Фонды основные 180 млн = 40 лет × 9 млн/год × 0.5
                        # Базы снабжения в округах, погодные посты и метеостанции.
                        # Строят свои общежития для погодников в кантонах.
                # Адресная доставка:
                    # 1 тонна воды к полям = 0.001 нормо-часа (0.5 бита/час)
                    # Дожди --> луга --> каналы --> пашня --> пруд --> огород
                    # Степная ферма -- 25 пони, 40 га пашня-сад-огород, 131 га обжитых земель.
                        # -|$ Продукция, стоимость (бит).................. | 5,275
                        # -|$ Продукция, стоимость (бит/пони)............. | 211
                        # |----$Единый поземельный налог (бит/год)........ | 1,168 (22% доходов)
                    # Ферме нужно 25 литров/метр-месяц (33 000 м³/месяц, 262 000 м³/сезон)
                    # Ферме нужно 33 пегаско-часов/месяц, 260 часов/сезон (130 бит/сезон)
                    # Оплата пегасов-погодников, это 11.4% поземельного налога.
                    # Орошение (740 мм/сезон) -- 7400 м³/га пашни
                # Для сравнения (Хивинское ханство, 1900 год):
                    # Чистка оросительных каналов -- 280-920 нормо-часов на 40 га
                    # Орошение (889 мм/сезон) -- 8889 м³/га пашни (без учёта потерь)
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Хивинское_ханство
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Зеравшан
            # ------------------------------------------------------------
        # Абсолютное большинство -- пегасы. Земных в городе вовсе нет.
        'Среднеземные земнопони (мегаполисы)':0.00,
        'Среднеземные единороги (мегаполисы)':0.05,
        'Среднеземные пегасы (мегаполисы)':0.95,
        }

metadict_army['Хуффингтонские речные городские пони'] = {
        # Город на крупнейшей реке и трансконтинентальной железной дороге.
        # Значимые районы:
            # - Художественная академия (Академия изящных искусств)
            # TODO: здесь единороги получают Feat_Ritual_Caster (1 ритуал)
            # Потребность черчения/рисования огромна во всех ремёслах и строительстве.
        # Градообразующие предприятия:
            # - Агротранзитный центр (элеваторы и хранилища на 0.5+ миллиона тонн зерна)
            # - Текстильная промышленность (хлопчатые ткани, ковры и одежда)
                # На 10 000 жителей:
                # 1.6 ткацких мастерских и 3150 кв.метров готовых тканей в рабочий день.
                # -Красильщик..................................... | 30
                # -Портной........................................ | 129
                # -Сапожник....................................... | 39
                # -Ткач........................................... | 237
                # -Швея........................................... | 42
                # Всего 9.5% трудоспособных жителей в текстильной промышленности.
            # - Гончарная промышленность (черепица, кафель, фаянс и хуффингтонский фарфор)
                # На 10 000 жителей:
                # 107 гончарных мастерских и 9000 изделий каждый рабочий день
                # _-@Домохозяйство, разнорабочий.................... | 33
                # _-@Земледелие, лесник............................. | 43
                # _-@Промышленность-добыча, рабочий, лесоруб........ | 22
                # _-@Промышленность-фабрики, рабочий, керамика...... | 181
                # _-@Строительство, землекоп, глина................. | 2
                # _-@Транспорт, возничий-пегас...................... | 11
                # _-@Транспорт, грузчик............................. | 21
                # _-@Транспорт, железнодорожник..................... | 3
                # _-@Транспорт, железнодорожник-пегас............... | 14
                # _-@Транспорт, моряк............................... | 3
                # _-@Транспорт, моряк-пегас......................... | 8
                # Всего 6.8% трудоспособных жителей в гончарном производстве
        'Среднеземные земнопони (мегаполисы)':0.25,
        'Среднеземные единороги (мегаполисы)':0.35,
        'Среднеземные пегасы (мегаполисы)':0.40,
        # Внезапно, овечки тоже стригутся и покупают одежду:
        # Производство 7 лишних комплектов среднеземной одежды на каждого жителя.
        '+Потребность в одежде, среднеземцы (козы)':5,
        '+Потребность в одежде, богатеи (козы)':5 * 0.03,
        '+Потребность в одежде, среднеземцы (овцы)':2,
        '+Потребность в одежде, богатеи (овцы)':2 * 0.03,
        # Торгуют керамикой с предгорными овцами и козами Заречья. Речной путь.
        '+Потребность в посуде, керамика, среднеземцы (бизоны)':40,
        '+Потребность в посуде, керамика, богатеи (бизоны)':40 * 0.03,
        '+Потребность в посуде, керамика, среднеземцы (козы)':40,
        '+Потребность в посуде, керамика, богатеи (козы)':40 * 0.03,
        '+Потребность в посуде, керамика, среднеземцы (овцы)':20,
        '+Потребность в посуде, керамика, богатеи (овцы)':20 * 0.03,
        }

metadict_army['Пайвильские речные городские пони'] = {
        # 15-тысячный окружной городок в Приграничье.
        # Образец (Рыбинск на Волге, 25k населения (91k уезда), 3100 зданий, 28% каменных):
            # Фабрик и заводов 31, с производством на 669 686 руб., при 346 рабочих;
            # - 2 паровые мукомольные мельницы (417 448 руб.)
            # - пиво-медоваренный завод (105 950 руб.)
            # Городской общественный банк (баланс 1898 г. — 1 530 367 руб.)
            # Капитал биржевого комитета (купцы) -- 653 404 рублей
            # - речная полиция (4 пожарных парохода) -- 100 000 рублей
            # Городские доходы за 1896 г: 216 509 руб.,
            # Городские расходы 222 805 руб. (73% указано ниже)
            # - содержание общественного управления 33 887 руб. (15%)
            # - содержание городских общественных зданий 21 716 руб. (10%)
            # - уплата по займам 31 922 руб. (14%)
            # - содержание учебных заведений 40 145 руб. (18%)
            # - благотворительных учреждений 19 417 руб. (9%)
            # - пожарная часть 15 791 руб. (7%)
            # https://ru.wikisource.org/wiki/ЭСБЕ/Рыбинск
            # https://ru.wikisource.org/wiki/ЭСБЕ/Красноярск
        # Значимые районы:
            # - Ополчение города
                # Особенности:
                    # 80% бойцов Эквестрии, это ополчение.
                    # Ополчение почти полностью состоит из пегасов.
                    # В военной академии они не учились, просто местные задиры.
                    # Гвардейцы, остепенившись, становятся командирами ополчения.
                # Штат:
                    # В Эквестрии около 100 рот ополчения на 124 округа и 16 мегаполисов.
                    # Не в каждом округе есть своя рота, чаще взводы/отделения при шерифе.
                    # * Бойцы -- (21 880 × 0.8) × 0.8 / 100 = 140 ополченцев
                # Организация:
                    # * Рота (капитан 7+ lvl с отделением управления, 3×40 солдат)
                    # * Взвод (лейтенант 5+ lvl с заместителем, 3×12 солдат)
                    # * Отделение (сержант 3+ lvl, 10 солдат 1-2 lvl)
                # Оборот:
                    # 1/10 муниципального налога -- 50 тысяч бит
                    # Муниципальные налоги --> ополчение --> стража фронтира, лесники и полиция
                    # Налоги 15-тысячного аграрного города -- 500+ тысяч бит (не считая доходов округа)
                # Бюджет:
                    # Всего 60/50 тыс. бит (120% оборота, 417 бит/бойца)
                    # Фонд оплаты труда (80%):
                    # * 1 капитан 7+ lvl (3200 бит/год) -- 3.2 тыс.
                    # * 3 лейтенанта 5+ lvl (1600 бит/год) -- 4.8 тыс.
                    # * 20 сержантов 3+ lvl (800 бит/год) -- 16 тыс.
                    # * 120 бойцов 1-2 lvl (200 бит/год) -- 24 тыс.
                        # Это ополчение, бойцы совмещают службу со своей работой.
                    # Содержание имущества, коммунальные услуги, прочие работы (20%)
                    # * Фонды основные 0.24 млн = 40 лет × 12 тыс/год × 0.5
        # Градообразующие предприятия:
        # Город на границе Диколесья, окружной центр, сосед Понивиля.
        'Среднеземные земнопони (города)':0.25,
        'Среднеземные единороги (города)':0.35,
        'Среднеземные пегасы (города)':0.40,
        }

#----
# Лас-Пегаски регион (мегаполисы):

metadict_army['Лас-Пегаские степные городские пони'] = {
        # Значимые районы:
        # Градообразующие предприятия:
            # - Агротранзитный центр (элеваторы и хранилища на 0.5 миллиона тонн зерна)
            # - Текстильная промышленность (хлопчатая пряжа)
            # - Аэропорт.
        # Центр караванной и воздушной торговли с бизонами.
        'Среднеземные земнопони (мегаполисы)':0.15,
        'Среднеземные единороги (мегаполисы)':0.25,
        'Среднеземные пегасы (мегаполисы)':0.60,
        }

metadict_army['Вайамэйнские степные городские пони'] = {
        # TODO: нам надо 26 млн избыточных рационов соли. Город даёт 15/26.
        # TODO: проблема солеварения. Добыча на соляных озёрах эффективнее.
            # Наши пони тратят x4 усилий, чтобы вытопить из раствора ту же самую соль.
            # Только на самих солеварнях работало бы 7500 пони на 300k тонн соли.
            # К тому же доставка топлива в степь добавляет расходов.
            # Соль стоит 49 бит/тонна, должна стоить 18-25 бит/тонну (как в РИ)
            # А в Японии выпаривали из морской воды по 16 кг/душу и не заморачивались.
        # Значимые районы:
        # Градообразующие предприятия:
            # - Шахта (сера)
                # Cопутствует соляным озёрам, бактерии поглощают сероводород.
            # - Солёные озёра, соледобыча
                # Образец (Баскучанские озёра, 1888 год) -- 304 857 тонн, 5527 рабочих (52-56 тонн/рабочего-год)
                # В Эквестрии добывают 100 тыс. тонн соли для собственных нужд и 100 тыс. тонн на экспорт.
                # Вайамэйнские соляные озёра дают 75 тыс. тонн экспортной соли для степных племён.
                # 350 тыс. тонн дров сжигают ежегодно, это вчетверо больше, чем на прочие нужны округа.
            # - Химическая промышленность (солеварение)
                # На 10 000 жителей:
                # 70 солеварень и 125 тонн соли в рабочий день (25 тыс. тонн соли в год)
                # _-@Домохозяйство, разнорабочий............. | 190
                # _-@Земледелец, лесник...................... | 250
                # _-@Земледелец, технические................. | 203
                # _-@Промышленность-добыча, рабочий, лесоруб. | 126
                # _-@Промышленность-фабрики, рабочий, солевар | 625
                # _-@Транспорт, возничий-пегас............... | 106
                # _-@Транспорт, грузчик...................... | 199
                # Всего 34% трудоспособных жителей обслуживают солеварение.
        'Среднеземные земнопони (города)':0.25,
        'Среднеземные единороги (города)':0.35,
        'Среднеземные пегасы (города)':0.40,
        # Добыча соли в избыточных рационах:
        '+Городской рацион, избыток, соль (пони/год)':500,
        }

metadict_army['Хуфстонские степные городские пони'] = {
        # Значимые районы:
        # Градообразующие предприятия:
            # - Стройка западной железной дороги (200/500 км главных путей)
            # Строительство на 5+ млн/год, 7.6-12.2 млн/год (Франция/Россия 1900 года 38-66k руб/км)
            # В год ставят 36 000 тонн рельсов стоимостью 2.2 млн (в день 100 тонн рельсов)
        # Торговый город на границе кантерского заречья. Земли коз.
        'Среднеземные земнопони (города)':0.25,
        'Среднеземные единороги (города)':0.35,
        'Среднеземные пегасы (города)':0.40,
        }

#----
# Эпплузский регион (мегаполисы):

metadict_army['Доджтаунские степные городские пони'] = {
        # Значимые районы:
        # Градообразующие предприятия:
            # - Агротранзитный центр (элеваторы и хранилища на 0.5 миллиона тонн зерна)
            # - Текстильная промышленность (хлопчатая пряжа)
        # Центр караванной и воздушной торговли с бизонами. Южная железная дорога и речной порт.
        'Среднеземные земнопони (мегаполисы)':0.25,
        'Среднеземные единороги (мегаполисы)':0.35,
        'Среднеземные пегасы (мегаполисы)':0.40,
        }

metadict_army['Эпплузские степные городские пони'] = {
        # Значимые районы:
        # Градообразующие предприятия:
            # - Текстильная промышленность (хлопчатая пряжа)
            # - Стройка юго-западной железной дороги (300/500 км главных путей)
            # Строительство на 7.6+ млн/год
        # Аграрный город на границе степей. Земли бизонов.
            # Хиванское ханство (1900 год, 0.7 млн) -- 62 000 км² (4-12% орошаемых)
            # Экспорт Хиванского ханства     | тыс. пудов | млн. кг | кг/человека
            # ------------------------------ | ---------- | ------- | -----------
            # Хлопкового и кунжутного семени | 1000       | 16.4    | 23.4
            # Хлопка                         | 500        | 8.2     | 11.7
            # Свежих фруктов                 | 250        | 4.1     | 5.9
            # Сушеных фруктов                | 50         | 0.8     | 1.2
            # Продуктов скотоводства         | 50         | 0.8     | 1.2
            # Прочих грузов                  | 150        | 2.4     | 3.6
            # Всего                          | 2 млн пуд  | 32.8    | 47
            # 
            # Импорт Хиванского ханства      | тыс. пудов | млн. кг | кг/человека
            # ------------------------------ | ---------- | ------- | -----------
            # мануфактура (ткани)            | 100        | 1.6     | 2.3 
            # сахар                          | 100        | 1.6     | 2.3
            # железо сталь и изделия         | 100        | 1.6     | 2.3
            # керосин                        | 50         | 0.8     | 1.2
            # чай                            | 10         | 0.2     | 0.2
            # прочие товары                  | 40         | 0.6     | 0.9
            # Всего                          | 500        | 8.2     | 12
            # * Оценка при проектировании железной дороги Александров Гай — Хива — Чарджуй
            # https://ru.wikisource.org/wiki/ЭСБЕ/Хивинское_ханство
        'Среднеземные земнопони (города)':0.25,
        'Среднеземные единороги (города)':0.35,
        'Среднеземные пегасы (города)':0.40,
        }

metadict_army['Бруктаунские степные городские пони'] = {
        # Значимые районы:
        # Градообразующие предприятия:
            # - Текстильная промышленность (хлопчатая пряжа)
            # - Химическая промышленность (опиум, твирин, сантонин)
        # Город на границе степей. Земли бизонов и Драконика. Речной порт.
        'Среднеземные земнопони (города)':0.25,
        'Среднеземные единороги (города)':0.35,
        'Среднеземные пегасы (города)':0.40,
        }

#----
# Балтимэрские регион (мегаполисы):

metadict_army['Балтимэрские прибрежные городские пони'] = {
        # Культурный и туристический центр, старейший город страны. Город ленивых земных.
        # Значимые районы:
            # - Мореходная академия (Гильдия капитанов)
            # https://ru.wikisource.org/wiki/ЭСБЕ/Мореходное_образование
        # Градообразующие предприятия:
            # - Торговый порт, импорт (сахар, чай, лес, шоколад)
            # - Торговый порт, экспорт (ткани, зерно, вино, кондитерские изделия)
            # - Судостроительные верфи (10+ барков/год, 20+ шхун/год)
            # - Текстильная промышленность (хлопчатые ткани, ковры и одежда)
                # На 10 000 жителей:
                # 1.9 ткацких мастерских и 3300 кв.метров готовых тканей в рабочий день.
                # -Красильщик..................................... | 30
                # -Портной........................................ | 64
                # -Сапожник....................................... | 27
                # -Ткач........................................... | 250
                # -Швея........................................... | 57
                # Всего 8.6% трудоспособных жителей в текстильной промышленности.
        'Южноморские земнопони (мегаполисы)':0.35,
        'Южноморские единороги (мегаполисы)':0.30,
        'Южноморские пегасы (мегаполисы)':0.35,
        # Торговля с зебрами Эверглейдса и местными кабанчиками:
        # Производство 10 лишних комплектов южной одежды на каждого жителя.
        '+Потребность в одежде, южане (зебры)':7,
        '+Потребность в одежде, богатеи (зебры)':7 * 0.03,
        '+Потребность в одежде, южане (кабанчики)':3,
        '+Потребность в одежде, богатеи (кабанчики)':3 * 0.1,
        }

metadict_army['Энфильдские прибрежные городские пони'] = {
        # Значимые районы:
        # Градообразующие предприятия:
            # - Текстильная промышленность (джутовая пряжа, канаты, ковры, мешки)
            # - Гончарная промышленность (черепица, кафель, фаянс)
                # На 10 000 жителей:
                # 86 гончарных мастерских и 7000 изделий каждый рабочий день
                # _-@Домохозяйство, разнорабочий.................... | 26
                # _-@Земледелие, лесник............................. | 35
                # _-@Промышленность-добыча, рабочий, лесоруб........ | 17
                # _-@Промышленность-фабрики, рабочий, керамика...... | 145
                # _-@Строительство, землекоп, глина................. | 2
                # _-@Транспорт, возничий-пегас...................... | 9
                # _-@Транспорт, грузчик............................. | 17
                # _-@Транспорт, железнодорожник..................... | 2
                # _-@Транспорт, железнодорожник-пегас............... | 11
                # _-@Транспорт, моряк............................... | 2
                # _-@Транспорт, моряк-пегас......................... | 6
        # Город на границе между Эквестрией и Эверглейдсом, вблизи влажных предгорных лесов.
        'Южноморские земнопони (мегаполисы)':0.25,
        'Южноморские единороги (мегаполисы)':0.35,
        'Южноморские пегасы (мегаполисы)':0.40,
        # Традиционно торгуют керамикой с зебрами.
        '+Потребность в посуде, керамика, южане (зебры)':60,
        '+Потребность в посуде, керамика, богатеи (зебры)':60 * 0.03,
        '+Потребность в посуде, керамика, южане (кабанчики)':20,
        '+Потребность в посуде, керамика, богатеи (кабанчики)':20 * 0.03,
        }

metadict_army['Камбэлэндские горные городские пони'] = {
        # Город на границе зебринского Эверглейдса и Драконьих гор. Центр воздушной торговли.
        # Это точка в радиусе 720 км (8-часового перелёта) от Доджтауна, Балтимэра и побережья Зенкори. 
        # Значимые районы:
        # Градообразующие предприятия:
            # - Шахта (золотая руда)
                # Золотодобыча (1856 год, Сибирь) -- 2.5 тонн/год, 1200 шахтёров (работа 5 месяцев/год)
                # У нас M0 17% ВВП и на 33% обеспечена золотом, это ~340 млн золотых бит/год
                # - Инфляция + рост = 2% это 6.8 млн золотых ежегодно (5.1 тонны/год)
                # - Сундуки Leomund_Secret_Chest съедают >3.4 млн бит (~3 тонны/год)
                # - Прочие промыслы пожирают ту же долю в 2% золота (5.1 тонны/год)
                # В Эквестрии и у зависимых соседей должно быть добычи на 40 тонн/год
                # В мире добывается ~200 тонн/год (на 500 млн населения, 0.6 бит/душу)
            # - Аэропорт (10 000 пегасов, 400 тяжёлых грузовых и пассажирских планёров)
                # Полёт к Зенкори занимает 8 часов, к Зевере 14 часов.
                # Каждый день аэропорт Камбэлэнда принимает 100 планёров на смену экипажей.
                # Это крупнейший транзитный аэропорт страны и дом десятков тысяч пегасов.
                # Практически все камбэлэндские пегасы живут этим торговым маршрутом.
                    # 350 / 960 тяжёлых пассажирских планёров на международных маршрутах.
                        # 67% (230) из них летают в Зеверу и к Зенкори.
                    # 510 тяжёлых грузовых планёров на международных маршрутах.
                        # 50% (250) из них на маршруте в зебринский Эверглейдс.
            # Доставка зебринских фруктов (49%)
                # Воздушные грузоперевозки (тонно-километр)................................... | 289,333,974
                # Маршрут международный-воздушный, Балтимэр <-> Грифус (тонно-километров)..... | 14,870,105
                # Маршрут международный-воздушный, Балтимэр <-> Зевера (тонно-километров)..... | 8,747,120
                # Маршрут международный-воздушный, Балтимэр <-> Зенкори (тонно-километров).... | 4,810,916
                # Маршрут международный-воздушный, Балтимэр <-> Капо-Тун (тонно-километров)... | 13,558,037
                # Маршрут международный-воздушный, Зевера --> Балтимэр (тонно-километров)..... | 83,112,461
                # Маршрут международный-воздушный, Зенкори --> Балтимэр (тонно-километров).... | 45,711,853
        'Южноморские земнопони (города)':0.15,
        'Южноморские единороги (города)':0.25,
        'Южноморские пегасы (города)':0.60,
        }

#----
# Городские жители (уездные города):

metadict_army['Северо-восточные горные городские пони'] = {
        # Северо-восток -- страна единорогов. Мало пегасов и земных.
        # Города в долинах, окружённые гребнями гор.
        'Североморские земнопони (города)':0.10,
        'Североморские единороги (города)':0.50,
        'Североморские пегасы (города)':0.40,
        # Торговля с оленями:
        '+Потребность в одежде, северяне (олени)':5,
        '+Потребность в одежде, богатеи (олени)':5 * 0.03,
        }

metadict_army['Северо-восточные лесные городские пони'] = {
        # Города в округах с 75% леса, без крупных рек.
        'Североморские земнопони (города)':0.15,
        'Североморские единороги (города)':0.50,
        'Североморские пегасы (города)':0.35,
        '+Потребность в одежде, северяне (олени)':5,
        '+Потребность в одежде, богатеи (олени)':5 * 0.03,
        }

metadict_army['Северо-восточные прибрежные городские пони'] = {
        # Города на берегу океанов, морей и крупных озёр.
        'Североморские земнопони (города)':0.20,
        'Североморские единороги (города)':0.45,
        'Североморские пегасы (города)':0.35,
        '+Потребность в одежде, северяне (олени)':5,
        '+Потребность в одежде, богатеи (олени)':5 * 0.03,
        }

metadict_army['Северо-восточные речные городские пони'] = {
        # https://ru.wikisource.org/wiki/ЭСБЕ/Чистополь
        # Города на берегах крупных судоходных рек.
        'Североморские земнопони (города)':0.20,
        'Североморские единороги (города)':0.50,
        'Североморские пегасы (города)':0.30,
        '+Потребность в одежде, северяне (олени)':5,
        '+Потребность в одежде, богатеи (олени)':5 * 0.03,
        }

metadict_army['Северо-западные горные городские пони'] = {
        # Северо-запад континента -- те же североморские переселенцы.
        'Североморские земнопони (города)':0.15,
        'Североморские единороги (города)':0.55,
        'Североморские пегасы (города)':0.30,
        '+Потребность в одежде, северяне (яки)':5,
        '+Потребность в одежде, богатеи (яки)':5 * 0.03,
        }

metadict_army['Северо-западные прибрежные городские пони'] = {
        'Североморские земнопони (города)':0.10,
        'Североморские единороги (города)':0.50,
        'Североморские пегасы (города)':0.40,
        '+Потребность в одежде, северяне (яки)':5,
        '+Потребность в одежде, богатеи (яки)':5 * 0.03,
        }

metadict_army['Северо-западные речные городские пони'] = {
        'Североморские земнопони (города)':0.20,
        'Североморские единороги (города)':0.40,
        'Североморские пегасы (города)':0.40,
        '+Потребность в одежде, северяне (яки)':5,
        '+Потребность в одежде, богатеи (яки)':5 * 0.03,
        }

metadict_army['Северо-западные степные городские пони'] = {
        # Города субтропических равнин, без крупных рек и каналов.
        'Североморские земнопони (города)':0.25,
        'Североморские единороги (города)':0.35,
        'Североморские пегасы (города)':0.40,
        '+Потребность в одежде, северяне (яки)':5,
        '+Потребность в одежде, богатеи (яки)':5 * 0.03,
        }

metadict_army['Среднеземные горные городские пони'] = {
        # Средний запад -- страна пегасов и смышлёных земных.
        'Среднеземные земнопони (города)':0.20,
        'Среднеземные единороги (города)':0.45,
        'Среднеземные пегасы (города)':0.35,
        # Торговля с козами и овцами Заречья:
        # Производство 7 лишних комплектов среднеземной одежды на каждого жителя.
        '+Потребность в одежде, среднеземцы (козы)':5,
        '+Потребность в одежде, богатеи (козы)':5 * 0.03,
        '+Потребность в одежде, среднеземцы (овцы)':2,
        '+Потребность в одежде, богатеи (овцы)':2 * 0.03,
        }

metadict_army['Среднеземные лесные городские пони'] = {
        'Среднеземные земнопони (города)':0.20,
        'Среднеземные единороги (города)':0.40,
        'Среднеземные пегасы (города)':0.40,
        # Производство 7 лишних комплектов среднеземной одежды на каждого жителя.
        '+Потребность в одежде, среднеземцы (козы)':5,
        '+Потребность в одежде, богатеи (козы)':5 * 0.03,
        '+Потребность в одежде, среднеземцы (овцы)':2,
        '+Потребность в одежде, богатеи (овцы)':2 * 0.03,
        }

metadict_army['Среднеземные прибрежные городские пони'] = {
        'Среднеземные земнопони (города)':0.25,
        'Среднеземные единороги (города)':0.35,
        'Среднеземные пегасы (города)':0.40,
        # Производство 7 лишних комплектов среднеземной одежды на каждого жителя.
        '+Потребность в одежде, среднеземцы (козы)':5,
        '+Потребность в одежде, богатеи (козы)':5 * 0.03,
        '+Потребность в одежде, среднеземцы (овцы)':2,
        '+Потребность в одежде, богатеи (овцы)':2 * 0.03,
        }

metadict_army['Среднеземные речные городские пони'] = {
        'Среднеземные земнопони (города)':0.25,
        'Среднеземные единороги (города)':0.35,
        'Среднеземные пегасы (города)':0.40,
        # Производство 7 лишних комплектов среднеземной одежды на каждого жителя.
        '+Потребность в одежде, среднеземцы (козы)':5,
        '+Потребность в одежде, богатеи (козы)':5 * 0.03,
        '+Потребность в одежде, среднеземцы (овцы)':2,
        '+Потребность в одежде, богатеи (овцы)':2 * 0.03,
        }

metadict_army['Среднеземные степные городские пони'] = {
        'Среднеземные земнопони (города)':0.30,
        'Среднеземные единороги (города)':0.30,
        'Среднеземные пегасы (города)':0.40,
        # Торговля со степными бизонами. Их, хм, бизонята носят одежду, поэтому размер понячий.
        # Производство 7 лишних комплектов среднеземной одежды на каждого жителя.
        '+Потребность в одежде, среднеземцы (бизоны)':7,
        '+Потребность в одежде, богатеи (бизоны)':7 * 0.03,
        }

metadict_army['Юго-восточные прибрежные городские пони'] = {
        # Юго-восток, Балтимэрский полуостров -- страна ленивых земных.
        'Южноморские земнопони (города)':0.35,
        'Южноморские единороги (города)':0.30,
        'Южноморские пегасы (города)':0.35,
        # Торговля с зебрами Эверглейдса и местными кабанчиками:
        '+Потребность в одежде, южане (зебры)':7,
        '+Потребность в одежде, богатеи (зебры)':7 * 0.03,
        '+Потребность в одежде, южане (кабанчики)':3,
        '+Потребность в одежде, богатеи (кабанчики)':3 * 0.1,
        }

metadict_army['Юго-восточные речные городские пони'] = {
        'Южноморские земнопони (города)':0.35,
        'Южноморские единороги (города)':0.30,
        'Южноморские пегасы (города)':0.35,
        '+Потребность в одежде, южане (зебры)':7,
        '+Потребность в одежде, богатеи (зебры)':7 * 0.03,
        '+Потребность в одежде, южане (кабанчики)':3,
        '+Потребность в одежде, богатеи (кабанчики)':3 * 0.1,
        }

metadict_army['Юго-восточные степные городские пони'] = {
        'Южноморские земнопони (города)':0.30,
        'Южноморские единороги (города)':0.30,
        'Южноморские пегасы (города)':0.40,
        '+Потребность в одежде, южане (зебры)':7,
        '+Потребность в одежде, богатеи (зебры)':7 * 0.03,
        '+Потребность в одежде, южане (кабанчики)':3,
        '+Потребность в одежде, богатеи (кабанчики)':3 * 0.1,
        }

metadict_army['Юго-восточные горные городские пони'] = {
        'Южноморские земнопони (города)':0.20,
        'Южноморские единороги (города)':0.45,
        'Южноморские пегасы (города)':0.35,
        '+Потребность в одежде, южане (зебры)':7,
        '+Потребность в одежде, богатеи (зебры)':7 * 0.03,
        '+Потребность в одежде, южане (кабанчики)':3,
        '+Потребность в одежде, богатеи (кабанчики)':3 * 0.1,
        }

#----
# Городские жители (значимые городки):

metadict_army['Понивильские лесные городо-сельские пони'] = {
        # Аграрный городок на границе диколесья. Центр 10-тысячного кантона.
            # https://tabun.everypony.ru/blog/science/23446.html
            # https://www.deviantart.com/dziadek1990/art/Ponyville-Statistical-Trivia-Population-293863525
            # https://mlp.fandom.com/wiki/Ponyville#Infrastructure_and_places
            # https://ru.wikisource.org/wiki/ЭСБЕ/Туапсе
            # https://www.rpglibrary.org/utils/meddemog/
        # Понивиль -- 3700 жителей, 533 домов (саманные фахверки, 49% каменных):
            # Понивиль, это один из новых городов западного фронтира Эквестрии.
            # Поселение занимает 50-100 гектаров усадьб, садов, дорог, огородов.
            # Понивильский кантон, это 5 сельских управ по ~1400 населения.
            # Площадь кантона 300 км² (27% пашня, 38% луга, 35% леса)
            # До границы кантона 9 км, до соседнего понивиля 18 км.
            # До 15-тысячного областного центра 56 километров.
            # 3.7 километра судоходной реки + 1.6 км судоходного канала.
            # 21 километр железнодорожной магистрали Ванхувер-Кантерлот.
            # 42 километра шоссе связывают Понивиль с соседними кантонами.
            # 148 километров грунтовых дорог, сеть между сёлами и деревнями.
        # Демографический состав (кантона)
            # Вывод war-economy-analyser.py (распределение Гомпертца-Мейкхама):
            # ------------------------------------------------------------
            # Ожидаемая численность: 10575
            # Численность популяции: 10556
            # Численность поколений: 31510
            # Суммарный коэффициент рождаемости: 1.9 (1.8 детей в семье)
            # ------------------------------------------------------------
            # Смерти от болезней (в год): 127 (1% от численности населения)
            # Несчастные случаи (в год): 5 (4% от числа смертей)
            # ------------------------------------------------------------
            # Средний возраст популяции: 35
            # Ожидаемая продолжительность жизни: 78
            # ------------------------------------------------------------
            # Распределение населения по возрастам:
            # 0-4 -- 790 (7.5%)
            # 5-9 -- 774 (7.3%)
            # 10-14 -- 759 (7.2%)
            # 15-19 -- 746 (7.1%)
            # 20-24 -- 729 (6.9%)
            # 25-29 -- 715 (6.8%)
            # 30-34 -- 697 (6.6%)
            # 35-39 -- 679 (6.4%)
            # 40-44 -- 659 (6.2%)
            # 45-49 -- 634 (6.0%)
            # 50-54 -- 605 (5.7%)
            # 55-59 -- 570 (5.4%)
            # 60-64 -- 526 (5.0%)
            # 65-69 -- 470 (4.4%)
            # 70-74 -- 405 (3.8%)
            # 75-79 -- 326 (3.1%)
            # 80-84 -- 237 (2.2%)
            # 85-89 -- 150 (1.4%)
            # 90-94 -- 76 (0.7%)
            # 95-99 -- 28 (0.3%)
            # 100+ -- 6 (0.1%)
        # Демографический состав (семьи)
            # Состав семьи      | доля/семей | пони/10k кантон | семей/кантон
            # ----------------- | ---------- | --------------- | ------------
            # Одиночки          |  5%        |   110           | 110
            # Семьи из 2 ч      | 15%        |   659           | 330
            # Семьи из 3 ч      | 25%        | 1 648           | 549
            # Семьи из 4-5 ч *  | 30%        | 2 967           | 659
            # Семьи из 6-9 ч    | 20%        | 3 297           | 440
            # Семьи из 10+      |  5%        | 1 319           | 110
            # * Семьи из 5 членов -- средние. 2200 домохозяйств/кантон.
        # Интеллект населения:
            # Твайки (INT 20+; IQ 145+) -- 2 школьника 7 взрослых 2 старика
            # Блумки (INT 17-19; IQ 130-145) -- 38 школьников 131 взрослых 42 старика
            # Динки (INT 14-16; IQ 115-130) -- 262 школьников 846 взрослых 296 стариков
            # Всего 1626 одарённых пони (24% получают специальное/высшее образование)
        # Зарплаты служащих:
            # $$$$ эксперты -- 2 бит/час, 3200 бит/год, высшее обр., TOP 1%
            # $$$ спецы -- 1 бит/час, 1200 бит/год, проф. обр., верхние 20%
            # $$ рабочие -- 0.5 бит/час 800 бит/год, сред. обр., средн. 30%
            # $ помогайки -- 0.2 бит/час 320 бит/год, нач. обр., нижние 50%
            # В здоровой семье 2.5 работника (1 основной и 1.5 помогайки)
            # ------------------------------------------------------------
            # Живут/подрабатывают на налоги с кантона 40% городских семей:
            # 219/555 семей 480-800 бит/год, 72/178 семей 800-1200 бит/год
            # Среднеземные горожане единороги бедняки (%)...... | 25
            # Среднеземные горожане земнопони бедняки (%)...... | 38
            # Среднеземные горожане пегасы бедняки (%)......... | 12
            # Среднеземные горожане единороги середняки (%).... | 10
            # Среднеземные горожане земнопони середняки (%).... | 12
            # Среднеземные горожане пегасы середняки (%)....... | 2
            # Среднеземные горожане единороги богатеи (%)...... | 1
            # Среднеземные горожане земнопони богатеи (%)...... | 1
            # Среднеземные горожане пегасы богатеи (%)......... | 0
            # ------------------------------------------------------------
        # Балансировка властей:
            # Используется разграничение по активам и приём "выравнивание элит":
            # - Законодательная vs экзаменационная власть (советы vs школа)
            # - Исполнительная vs кризисная власть (шериф vs гвардия)
            # - Судебная vs контрольная власть (врачи vs нотариат)
            # Организации должны быть менее 25 пони (иначе статусный разрыв)
        # Муниципальные организации (подоходный налог):
            # [2$$$$, 14$$$, 46$$, 41$, расходы 73.1/270k бит/год]
            # - Магистрат {Исполнительная власть}
                # + Мэрия [1$$$$, 4$$$, 4$$, 4$]
                    # Совет земледельческих общин, артелей и богачей.
                    # Власть совета в отношении местных налогов и земель.
                    # Избираемый (по списку) мэр с его командой и планом реформ.
                    # Мэр ищет баланс между выгодами торговли и местными обычаями.
                    # Ратуша, это поле боя налогоплатильщиков за городской бюджет.
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Инициатива_законодательная
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Муниципальные_учреждения
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Заседатели
                    # https://ru.m.wikipedia.org/wiki/Теорема_Эрроу
                    # https://ru.m.wikipedia.org/wiki/Метод_Шульце
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Мэр
                    # https://static.wikia.nocookie.net/mlp/images/8/8e/Ponyville_town_square_S01E05.png
                    # ------------------------------------------------------------
                    # Система законодательной власти куринально-имущественная.
                    # Прогрессивный подоходный налог муниципалитета (26% семей)
                    # Налогоплатильщики управляют своей долей в рамках проектов:
                    # - 40% налогов --> 30% бедных семей. Пенсии, пособия.
                    # - 30% налогов --> муниципалитет. Оклады, фонды.
                    # - 30% налогов --> строительство и развитие.
                    # На что тратить, решают налогоплатильщики на общем собрании.
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Расходы_городские
                    # https://ru.wikipedia.org/wiki/Политическая_машина
                    # ------------------------------------------------------------
                    # Капиталы Понивиля: 3 млн ВВП × 6 = 18 млн бит
                    # 26% богатых семей принадлежит 50% городских капиталов.
                    # Грамотный менеджмент капитала повышает ренту на 1-4%.
                    # Менеджмент 50% капиталов 0.3-1% (27-90k бит, мэр 15-48%)
                    # Отток прибыли 50% капиталов в фонды 4% (360k бит, 12% ВВП)
                    # Капиталы города часть крупных фондов, мэр представляет их.
                    # Рекомендации фондов повышают прибыль, но и требуют своего.
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Кредитные_общества_городские
                    # https://ru.m.wikipedia.org/wiki/Кредитный_кооператив
                    # https://en.m.wikipedia.org/wiki/History_of_credit_unions
                    # ------------------------------------------------------------
                    # Налогооблажение (26% из 2000 домохозяйств, 10 000 жителей):
                    # уровень дохода | ставка | налог | семей | семей | собрано
                    # -------------- | ------ | ----- | ----- | ----- | -------
                    # 100 бит/месяц  | 10%    | 10    | 26.0% | 520   | 5200
                    # 200            | 30     | 60    |  5.0  | 100   | 6000
                    # 300            | 60     | 180   |  2.0  |  40   | 7200
                    # 400            | 80     | 320   |  1.0  |  20   | 6400
                    # 600+           | 100    | 600   |  0.2  |   4   | 2400+
                    # 520 семей 1 уровень налога, 100 семей доплачивают 2 уровень и т.д.
                    # Налоговая для 10-тысячного кантона = 132 нормо-часа.
                    # Сумма блоков: 27 200 бит/месяц (326 000 бит/год)
                    # Точнее по gini-coefficient.py -- 270 000 бит/год
                    # ------------------------------------------------------------
                    # Вывод gini-coefficient.py (коэффициент Джини для 2000 семей)
                    # Поддержка 30% бедных (39.8% бюджета): 0-420/144528 (7.5%) --> 420-420/252000 (13.1%)
                    # Доходы 20% богатых: 957504/1921776 (49.8%) --> 688050/1759288 (39.1%)
                    # Доходы 1% богатых: 175680/1921776 (9.1%) --> 92044/1759288 (5.2%)
                    # Квинтильный коэффициент: 4.1 (13.42 до налогов)
                    # Децильный коэффициент: 5.17 (28.71 до налогов)
                    # Коэффициент Джини: 0.32 (0.462 до налогов)
                    # ------------------------------------------------------------
            # - Ополчение кантона
                # + Офис шерифа [1$$$$, 1$$$]
                    # Следователь с ограниченной властью. Тюрем нет.
                    # В кантоне кого-то могут убить с 2-7% шансом в год.
                    # Пегас кого-то поранит/расшибётся с 24-40% шансом/год.
                    # Преступность среди своих ничтожна, но хватает и чужаков.
                    # Шериф может лишить гражданства через голосование кантона.
                    # Шериф может запретить вход в город любому сорту чужаков.
                    # Шерифа избирают всеобщим голосованием (и пони, и зверей)
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Власть_карательная
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Шериф,_в_Англии
                    # https://en.wikisource.org/wiki/1911_Encyclop%C3%A6dia_Britannica/Sheriff
                # + Сеть лесоохранных постов [6$$$, 24$$, 24$]
                    # Служба лесничьих. 6 постов в граничных с лесом деревнях.
                    # Фактически, это хутора по 25 пони (9 лесников с семьями)
                    # Шерифы леса. Городской шериф часто избирается из их числа.
                    # Следят за дровяными лесами, вырубками сухостоя, посадками.
                    # Отвечают за санитарию лесных зверей и доставку их к врачам.
                    # В лесном кантоне 6-10 следопытов 1-2 lvl, прочие не вояки.
                    # Лесники являются самой опытной частью ополчения кантона.
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Объезд
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Корпус_лесничих
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Лесные_учебные_заведения
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Сборы_учебные_чинов_запаса_и_ратников_ополчения
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Казаки
                    # ------------------------------------------------------------
                    # Туземцы и домашние животные:
                    # - 3.8k разумных копытных (овцы, козы, олени, кабанчики)
                    # - 65k домашней крысы (31 крыс/дом) и до 0.5 млн полёвок.
                    # - 2.6k пчелиных семей (Ápis melliféra)
                    # Грызуны защищают дома от насекомых за известную плату.
                    # _++1 lvl (R) Разговор с животными (переговоров/кантон)...... | 6,520
                    # _++1 lvl (R) Разговор с животными (переговоров/день-кантон). | 18
                    # ------------------------------------------------------------
            # - Служба связи
                # + Библиотека [1$$$, 1$$, 1$]
                    # 1650 читателей, 236 посетителей в день (33 за книгой)
                    # 86% посетителей берут свежие газеты и журналы.
                    # - 1 книгу -- берут 9.7% читателей
                    # - 2-5 книг -- берут 27% читателей
                    # - 6-10 книг -- берут 25.2% читателей
                    # - 11-20 книг -- берут 19.9% читателей
                    # - 21-30 книг -- берут 11.0% читателей
                    # - >30 книг -- берут 7.2% читателей
                    # 5000+ томов, это 100 кв.метров. "Дубового домика" хватит.
                    # В библиотеке 100 книжных шкафов, в подвале городской архив.
                    # https://static.wikia.nocookie.net/mlp/images/b/b0/DtD_Library.png
                    # https://static.wikia.nocookie.net/mlp/images/8/8e/DtD_LibraryInside.png
                # + Сеть сельских библиотек [5$$]
                    # Город отвечает за 5 библиотек в селениях.
                    # 700 читателей/село, 90 в день (13 за книгой)
                    # 1000+ томов, 20 книжных шкафов, коробки газет и журналов.
                # + Почта, почтовая служба [2$$$, 12$$, 12$]
                    # Работают 360 дней в году и каждый день развозят:
                    # 824 письма, 412 газет, 69 журналов, 27 книг, 206 посылок.
                    # 10 доставочных участков (по 200 домов), 154 доставок/день.
                    # Почтовой артели платят из бюджета для удобства горожан.
                    # Работают и частные доставочные службы. Пегасы же.
                    # "Организация и эксплуатация почтовой связи"
                    # https://www.bibliofond.ru/view.aspx?id=16244
        # Муниципально-государственные организации (поземельный налог):
            # [8$$$$, 22$$$, 31$$, 10$ расходы 80/300k бит/год]
                # 8/25 богатейших семей Понивиля это врачи.
                # Медицинская служба суть жреческая аристократия.
                # Медицина бесплатна. Монополия борется с частниками.
                # Главный ресурс, заклинание лечения Lesser_Restoration.
                # Отмена частной медицины высвобождает ресурс для жеребят.
                # Запрет на внутреннюю конкуренцию лучше для большинства.
                # И хуже для меньшинства. Редкие болезни лечить не умеют.
                # По уровню знаний система подобна медицине СССР 1950-х.
                # Поземельный налог суть облигации медицинской службы.
                # ------------------------------------------------------------
                # amber -sm Понивильский кантон -E "@Обслуживание-медицина"
                # _-@Обслуживание-медицина, волшебник-врач, 0 круг........ | 2
                # _-@Обслуживание-медицина, волшебник-врач, 1 круг........ | 2
                # _-@Обслуживание-медицина, врач, больница................ | 7
                # _-@Обслуживание-медицина, врач, поликлиника............. | 3
                # _-@Обслуживание-медицина, фельдшер, больница............ | 16
                # _-@Обслуживание-медицина, фельдшер, поликлиника......... | 13
                # _-@Обслуживание-медицина, фельдшер, скорая помощь....... | 4
                # _-@Обслуживание-медицина, фельдшер, скорая помощь, пегас | 8
                # ------------------------------------------------------------
            # - Амбулатория кантона {Судебная власть}
                # Плечо обслуживания 10-15 километров (300 км²)
                # Обслуживаемое население 10.5k пони и 3.8k туземцев.
                # + Городская амбулатория [3$$$$, 6$$$, 7$$]:
                    # 160 рождений в год, 2000 стариков 60+ лет, 127 смертей
                    # - Болезни и травмы в год -- 7 800 на 10 000, 21.7 в день
                    # - Профилактика взрослых -- 2700 (34%/год), 13.5 в день
                    # - Профилактика детей -- 1500 (73%/год), 7.5 в день
                    # Младенческая смертность 0.8 на 160
                # + Сеть сельских фельдшерских пунктов [5$$$, 5$$]
                    # Это часть амбулатории и сигнальный элемент скорой помощи.
                    # https://ru.m.wikipedia.org/wiki/Фельдшерско-акушерский_пункт
                # + Судебная служба примирителей [1$$$$, 1$$$]
                    # Психолог с помощником, местные, столичное образование.
                    # Конфликты уровня разбитых носов, но чаще охраны труда.
                    # Юстиция причастных, цель консенсус, примирение сторон.
                    # Магия очарования не только разрешена, но и одобряется.
                    # Число смертей и болезней в регионе, это мера их труда.
                    # И число сбежавших пони, кто уже не может их дурь терпеть.
                    # В Эквестрии весьма деятельная и несносная судебная власть.
                    # >Absolute Pacifism. I thought of an alternative justice
                    # >Where psychological manipulation is used instead of punishment.
                    # >So, you'd trick the subject into not doing bad basically.
                    # >You might say "well, that violates basic human rights of consent."
                    # >Well, so does punishment. Both approaches are non-consensual,
                    # >But one comes with zero trauma and zero pain.
                    # >Punishment and revenge don't fix things.
                    # >Fixing things fixes things.
                    # "Пределы наказания" Нильс Кристи
                    # https://archive.4plebs.org/pol/thread/475692386
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Третейский_суд
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Гминные_суды
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Арбитр
            # - Больница кантона
                # + Городская больница на 200 коек [3$$$$, 6$$$, 8$$, 10$]
                    # 100-150 болеющих на стационаре, 13 рождений/месяц
                    # Когда суть болезни ясна и нужен только присмотр.
                    # Под наблюдением:
                    # - 90 инвалидов -- 1 группы;
                    # - 400 инвалидов -- 2 группы;
                    # - 300 инвалидов -- 3 группы.
                    # Из них 43 жеребёнка с инвалидностью (и одна Сноудроп)
                    # https://static.wikia.nocookie.net/mlp/images/7/72/Hospital_S2E13.png
                # + Аптека и волшебная медицина [1$$$$, 1$$$, 2$$]
                    # Фармацевт -- друид 1-2 lvl с заклинанием "Goodberry".
                    # Рецептор -- кастер 1-2 lvl с Detect_Poison_and_Disease.
                    # Волшебниц из школы Кантерлота рассылают по городкам.
                    # Призывают по необходимости, жильё вблизи больниц.
                    # Лекарства рецептурные, все производит медслужба.
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Аптека
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Рецептура,_рецепт
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Фармация
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Фармацевт
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Фармакология
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Фармакогнозия
                # + Служба скорой помощи [2$$$, 8$$]
                    # 4 планёра, на каждый пара возничьих пегасов.
                    # Основной маршрут: фельдшерский пункт --> больница
                    # Также перевозят тяжёлых больных в больницу округа.
                    # 2200-3500 полётов в год, 6-10 полётов в день.
                # + Пожарная служба [1$$$, 1$$]
                    # 4 планёра, система сигналов, специалист по ТБ.
                    # Предохранение лучше, чем борьба с последствиями.
                    # В пожарной службе 1-2 lvl пегасы-жрецы (погодники)
                    # Шингарев А.И. "Вымирающая деревня" 1907 год
                    # - два пожара за 10 лет, 13 дворов (8% жилья)
                    # - у понях горит 10 домов/год (0.5% жилья/год)
        # Государственные организации (НДС госмонополий):
            # [4$$$$, 22$$$, 42$$, 49$, расходы 88.5/300k бит/год]
            # - Государственные школы {Экзаменационная власть}
                # + Средняя школа на 150 учеников 11-14 лет [1$$$$, 4$$$, 3$$]
                    # 20% бюджета, это попечители и дополнительные уроки.
                    # 80% бюджета, это вклады монополий в будущих рабочих.
                    # Судьбу пони выбирает метка. На выбор метки можно повлиять.
                    # ------------------------------------------------------------
                    # Статистика образования кантона (10 тысяч жителей):
                    # _-@Обслуживание-образование, учитель, средняя школа.......... | 3
                    # -+Образование, начальное (пони).............................. | 6,683
                    # -+Образование, среднее (пони)................................ | 1,351
                    # -+Образование, специалисты (пони)............................ | 231
                    # -+Образование, специалисты (единороги)....................... | 120
                    # -+Образование, врачи (пони).................................. | 5
                    # -+Образование, врачи (единороги)............................. | 5
                    # -+Образование, высшее (пони)................................. | 20
                    # -+Образование, высшее (единороги)............................ | 16
                    # Потребность в образовании, начальная школа (пони)............ | 468
                    # Потребность в образовании, средняя школа (пони).............. | 135
                    # Потребность в образовании, профессиональная школа (пони)..... | 28
                    # Потребность в образовании, профессиональная школа (единороги) | 14
                    # Потребность в образовании, университеты (единороги).......... | 3
                    # Потребность в образовании, университеты (пони)............... | 3
                    # Потребность в образовании, университеты (пони-взрослые)...... | 2
                    # Потребность в образовании, университеты (единороги-взрослые). | 1
                    # ------------------------------------------------------------
                # + Сеть начальных школ на 500 учеников 7-10 лет [7$$$, 7$$]
                    # Город отвечает за 5 начальных школ в окрестных селениях.
                    # Учителя работают в 2 смены (уроки длятся 4.2 часа/день)
                    # Учителя работают на выезде и изредка меняются.
                    # Два года преподавания в селе, год в городе.
                    # ------------------------------------------------------------
                    # _-@Обслуживание-образование, учитель, начальная школа........ | 6
                    # Потребность в образовании, начальная школа (пони) (город).... | 163
                    # Потребность в образовании, начальная школа (пони) (округа)... | 305
                    # ------------------------------------------------------------
                    # https://static.wikia.nocookie.net/mlp/images/c/c6/The_schoolhouse_in_Ponyville_S1E12.png
                # + Служба статистики кантона [1$$$$, 1$$$]
                    # Инспектор независим от местных, назначается на 1 год.
                    # Переписи населения, регистрация рождений и смертей.
                    # Земельная и торговая статистика, налоги и наследства.
                    # Инспекция больничных средств и санитарии предприятий.
                    # Канализация, водопровод, теплоснабжение зимой, т.д.
                    # Власти приказать не имеет, только собирает данные.
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Статистика_теоретическая
            # - Пограничники {Кризисная власть}
                # + Взвод гвардии [1$$$$, 4$$$, 10$$, 20$]
                    # Командир взвода с заместителем, три отделения.
                    # - Первое отделение -- СПН с бойцами-пегасами 3-4 lvl.
                    # - Второе и третье -- бойцы без специализации 2 lvl.
                    # Клуб охотников с дикой гордыней и гербом Диколесья.
                    # Балансируют ополчение, не позволяя им расслабляться.
                    # Пентестеры местных законов и отстойник преступности.
                    # В отличии от лесничьих устраивают рейды в диколесье.
                    # Откаты за охрану даёт им железнодорожная служба.
            # - Железнодорожная служба
                # + Железнодорожный околоток [3$$$, 10$$, 10$]
                    # Две бригады посменно/совместно отвечают за 21 км пути.
                    # Обслуживание двухколейных главных путей (километр) | 21
                    # Обслуживание подъездных путей (километр).......... | 4
                    # Обслуживание станционных путей (километр)......... | 4
                    # Текущий и средний ремонт делает служба округа.
                    # Капитальный ремонт делает региональная служба.
                # + Сеть путевых постов [6$$]
                    # Околоток отвечает за 3 поста на каждые 7 километров.
                    # Путевые смотрители ежедневно обходят свой участок.
            # - Акционерное общество взаимопомощи {контрольная власть}
                # + Нотариус [1$$$$, 2$$$, 6$$] (местная церковь)
                    # Нотариусы, это клерки, клир местечковой веры.
                    # Свои верования есть и у земных, и у туземцев.
                    # Их сделки создают обычаи, нотариальные нормы.
                    # Сделки заверяются клятвами в священных местах.
                    # В основе доверие и репутация, а не юстиция.
                    # Базовое наследство служит тестом доверия.
                    # Пролюбившим наследство кредита не дают.
                    # https://ru.wikisource.org/wiki/НЭС/Нотариат
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Нотариат
                    # ------------------------------------------------------------
                    # Капиталы Понивиля: 3 млн ВВП × 6 = 18 млн бит
                    # Налоги с капитала: 18 млн × 4% рента = 720k бит
                    # Отток в фонды: 18 млн × 50% × 4% рента = 360k бит
                    # Доходность капитала: 18 млн × 2% рента = 360k бит
                    # - 1% кабанов: 360k × 20% = 72k бит (по 3.6k бит)
                    # - 9% богатеев: 360k × 30% = 108k бит (по 600 бит)
                    # - 40% середняков: 360k × 40% = 144k бит (по 180 бит)
                    # - 50% середняков: 360k × 10% = 36k бит (по 36 бит)
                    # Вклады жителей кантона и дивиденды с общих проектов.
                    # - <1% получателей кредита (до 180k бит, по 9k бит)
                    # Ссуды на инструменты и сельхозмашины, склады, предприятия.
                    # Солидарная модель накопления капитала. За риск платят все.
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Кредит
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Мелкий_кредит
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Ломбард,_кредитное_учреждение
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Сельскохозяйственный_кредит
                    # ------------------------------------------------------------
                    # Пенсионный фонд: 18 × 30% × 2% = 108k бит, 3.6% ВВП
                    # - 660 семей бедняков с пенсиями по 164 бит/год
                    # - на 75% это семьи с инвалидами 1-2 группы.
                    # Муниципальные пенсии из подоходного налога.
                    # Пенсии из доли дохода наследников, алименты.
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Облигация
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Акционерные_компании
                    # ------------------------------------------------------------
                    # Поземельный фонд: 18 × 50% × 2% = 180k бит, 6% ВВП
                    # - 760 семей туземцев с пенсиями по 237 бит/год
                    # - 70% берут урожаем, 30% деньгами по 71 бит/год
                    # Поземельный налог оплачивают фермеры, 20% урожая.
                    # Защита от спекуляций землёй + замирение туземцев.
                    # ------------------------------------------------------------
                    # Обороты наследства: 18 млн × 3.5% = 600k бит/год
                    # 132 получателей обычных наследств и дарений
                    # - 10% богатеев: 600k × 50% × 40% = 120k бит (по 9.2k бит)
                    # - 40% середняков: 600k × 40% = 240k бит (по 4.5k бит)
                    # - 50% бедняков: 600k × 10% = 60k бит (по 0.9k бит)
                    # 150 получателей базового наследства (150k бит)
                    # 30 дарений базового наследства туземцам (30k бит)
                    # Базовое наследство раздаётся всем без исключения.
                    # Налог на наследство в 60% только для 10% богатых.
                    # В итоге 70% наследств нормальные, 30% распределение.
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Право_наследственное
                    # ------------------------------------------------------------
                # + Местечковая типография [1$$$, 1$$]
                    # Пресса, это инструмент бизнеса для контроля чиновников.
                    # Газета "Жеребячий вестник", 620 газет/неделя (25% газет)
                    # - Годовая подписка -- 2 бита (оборот до 1200 бит/год)
                    # - Бедные семьи тратят 20/420 бит на культурные расходы.
                    # Также распечатывает листы объявлений, народные издания.
                    # Реклама. В крупных газетах объявления >50% площади листов.
                # + Бесплатное общежитие на 150 коек [1$$, 3$]
                    # Элемент сети общежитий при станциях железной дороги.
                    # Типовая гостиница для погодников и дорожных рабочих.
                    # Даёт временное жильё бродягам андеркласса, коих около 1%
                    # Андеркласс понях, это подростки путешествующие без ничего.
                    # Базовое наследство помогает им остепениться. Но не всем.
                    # amber -sm "Среднеземные горожане середняки" -n 150 -E @
                    # Коэффициент 0.35: 9 × 0.35 = 3.15 служащих
                # + Гостевые дома на 600 коек
                    # В Понивиле 100 гостевых домов (25% семейных фахверков)
                    # Это 10 000 кв.метров, +350 кв.метров/год (+3 дома/год)
                    # Гостевые дома в большинстве принадлежат молодым семьям.
                    # Принимают школьников с дальних ферм и перелётных пегасов.
                    # Помогают инвалидам и одиноким старикам, сезонным рабочим.
                    # Акционерное общество с 50% компенсацией стоимости жилья.
                    # Когда рождается третий ребёнок, обязательство закончено.
                    # https://ru.wikisource.org/wiki/ЭСБЕ/Квартирная_повинность
                # + Бесплатная столовая на 500 рационов [1$$$, 4$$, 16$]
                    # 1 шеф, 4 повара, 16 поварят и уборщиц (4 смены, 360 дней/год)
                    # Каши, супы, сезонные овощи, хлеб из городской пекарни.
                    # Обслуживает школу, больницу, андеркласс, погодников.
                    # Оборачиваемость столового места -- 8 раз/день, 100 мест.
                    # Оборот: 0.18 бит/клиент, 90 бит/день, 32 000 бит/год
                        # Сырьё: 1 кг/клиент, 50 бит/день, 18 000 бит/год
                        # Хлеб: 0.3 кг/клиент, 10 бит/день, 3600 бит/год
                        # Здание (100 мест, 200+200 м², своё): 800 бит/год
                        # Зарплаты: (1×1200 + 4×800 + 16×320) = 9520 бит/год
                        # Столовая обходится -- 65 бит/клиент-год
                    # Поставки из пекарни (весенний сезон) -- 11 бит/день
                        # Хлеб пшеничный фабричный (килограмм)............. | 53
                        # Хлеб ржано-пшеничный фабричный (килограмм)....... | 50
                        # Булочки пшеничные с изюмом и арахисом (килограмм) | 25
                        # Капкейки с сухофруктами (килограмм).............. | 25
                    # Городской рацион: 36-52 бит/год (0.1-0.15 бит/день)
                        # 36 бит -- транспорт ресурсов + фабричная переработка
                        # 16 бит -- транспорт с полей + переработка дома
                    # Домашняя кухня понивильцев -- 286 нормо-часов
                        # Выбрано: Городской весенний повседневный рацион (пони/день) 500
                        # -|3 Обработка пищи (нормо-часов)................. | 27
                        # -|3 Обработка пищи, дом (нормо-часов)............ | 59
                        # -|4 Приготовление пищи, дом (нормо-часов)........ | 200
                    # Кухня современной столовой -- 53 нормо-часа
                        # Коэффициент горячего и холодного цехов -- ×6
                        # коэффициент пекарни на 250 кг/день -- ×4
                    # Сеть "Перекрёсток" 2023 год -- 26 нормо-часов
                        # до 500 готовых блюд/работника-сутки, 62 блюда/нормо-час
                        # до 150 рационов/работника-сутки, 19 рационов/нормо-час
                        # 33 кв.метра/работника
                    # https://r-kompleks.ru/modulnye-zdaniya/modulnoe-zdanie-stolovaya-na-100-posadochnykh-mest/
        # Транспорт:
            # - Железнодорожная станция
                # 160 пассажиров/день -- поезд до областного центра каждый день.
                # |===Пассажиронапряжённость межрегиональных железнодорожных путей (пони/год) | 5,280
                # |===Пассажиронапряжённость региональных железнодорожных путей (пони/год)... | 51,022
                # https://static.wikia.nocookie.net/mlp/images/e/e4/Train_station_overview_S3E4.png
            # - Пристань для барж с краном
                # 60 пассажиров/неделю -- еженедельная баржа, очень неспешная.
                # Маршрут по реке Кантер, не дальше Кантерлота и Хуффингтона.
                # |===Пассажиронапряжённость межрегиональных речных путей (пони/год)......... | 132
                # |===Пассажиронапряжённость региональных речных путей (пони/год)............ | 3,401
            # - Взлётная полоса из щебня
                # 23 пары пегасов-таксистов с планёрами, 10 пассажиров/планёр-день
                # 14 пассажиров/неделю на дальние маршруты -- 1 рейсовый планёр.
                # 113 пассажиров/день у таксистов -- 100-200 км (1-3 часа полёта)
                # |===Пассажиронапряжённость заграничных воздушных путей (пони/год).......... | 179
                # |===Пассажиронапряжённость межрегиональных воздушных путей (пони/год)...... | 660
                # |===Пассажиронапряжённость региональных воздушных путей (пони/год)......... | 40,818
        # Культура и спорт:
            # - Театр
            # - Бассейн
            # - Боулинг
            # - Аркада
            # https://static.wikia.nocookie.net/mlp/images/7/7b/Ponies_entering_the_theater_S4E19.png
            # https://static.wikia.nocookie.net/mlp/images/1/1f/The_swimming_pool_S4E20.png
            # https://static.wikia.nocookie.net/mlp/images/e/e0/Ponyville_Mysteries_issue_2_page_3.jpg
            # https://static.wikia.nocookie.net/mlp/images/2/2e/Gamer_foals_S2E17.png
        # Предприятия:
            # - Элеватор (3500 тонн зерна)
            # - Продовольственные склады и холодильник
            # - Пекарня (400 кг/сутки) [1$$$, 3$$, 3$]
                # 1 технолог, 3 пекаря, 3 подай-приберись.
                # Отпускает 50% хлеба для бесплатной столовой.
                # Оптовая продажа выпечки: столовая, школы, рынок, кафе
                # Хлеб пшеничный фабричный (килограмм)............ | 61,985
                # Хлеб ржано-пшеничный фабричный (килограмм)...... | 58,293
                # Пони не очень любят фабричный хлеб:
                # Хлеб пшеничный домашний (килограмм)............. | 334,142
            # - Кондитерская "Сахарный уголок" [1$$$$, 2$$$, 6$$, 12$]
                # 1 шеф, 8 поваров, 12 поварят и помогаек (4 смены, 360 дней/год)
                # Редкие сладости, отборные ингредиенты, воздушная доставка.
                # 250 покупателей/день, 100 кг напитков и 75 кг сладостей.
                # Оборот: 0.3 бит/клиент, 75 бит/день, 27 000 бит/год.
                    # Сырьё: 0.06 бит/клиент, 15 бит/день, 5400 бит/год
                    # Здание (30 мест, 100+50 м², своё): 600 бит/год
                    # Зарплаты: (1×3200 + 2×1200 + 6×800 + 12×320) = 14 240
                    # Доход: 0.075 бит/клиент, 18.8 бит/день, 6760 бит/год
                    # Прибыль (39% налог): 4100 бит/год (15% рентабельность)
                # Продукция:
                    # 110+ наименований, ×2-3 стоимость ингредиентов.
                    # ЖД.транспорт (13%, 6000 км): 0.035 бит/кг = 170 бит/год
                    # Ниже предельные показатели, 60% отбивают конкуренты.
                    # ------------------------------------------------------------
                    # amber -sm Понивильский кантон -E "рацион"
                    # amber -sm "городской рацион (пони/год)" -n 2507 -d 5 -S
                    # amber -sm "изысканный рацион (пони/год)" -n 557 -d 5 -S
                    # xclip -o | sed "s@[^0-9]*@@g" | tr '\n' '+' | c
                    # Напитки: 90 238 кг/год, 251 кг/день, 31 кг/час
                    # Пироги: 10 028 кг/год, 28 кг/день, 3.5 кг/час
                    # Блины: 10 969 кг/год, 30.5 кг/день, 3.8 кг/час
                    # Оладьи: 8462 кг/год, 23.5 кг/день 2.9 кг/час
                    # Выпечка: 8771 кг/год, 24.4 кг/день, 3.1 кг/час
                    # Пудинги и желе: 8777, 24.4 кг/день, 3.1 кг/час
                    # Сладости: 6640 кг/год, 18.4 кг/день, 2.3 кг/час
                    # Закуски: 5955 кг/год, 16.5 кг/день, 2.1 кг/час
                    # ------------------------------------------------------------
                    # https://static.wikia.nocookie.net/mlp/images/b/b2/AiP_Sugarcubecorner.png
            # - Пивоваренный завод (10 рабочих, 200 000 литров/год).
                # Пиво ячменное заводское (килограмм)............. | 150,420
            # - Консервный завод
            # - Маслозавод
            # - 2 мельницы
            # - Лесопилка
        # Ремёсла:
            # - Корзинное производство.
            # - Гончарная мастерская.
            # - Бондарная мастерская.
            # - Жестяная мастерская.
            # - Швейная мастерская.
            # - Артель кузнецов.
            # - Артель каменщиков.
            # - 3 артели лесорубов.
            # - 3 артели плотников.
            # - 50 мелких мастерских.
            # Необходимые ремёсла: бондари, гончары, изготовление телег.
            # https://ru.wikisource.org/wiki/ЭСБЕ/Цехи_в_Западной_Европе
            # https://ru.wikisource.org/wiki/ЭСБЕ/Артель
        # Обслуживание:
            # - 10 бань, спа и парикмахерских [10$$, 20$]
                # Общественные бани и стрижка от местных рогатых.
                # Нужны для 55% горожан, раз в неделю, 60 недель/год
                # Посетителей: ((3700 × 55% × 60) / 200) / 10 = 61 пони/день
                # Оборот: 0.2 бит/клиент, 12.2 бит/день, 2440 бит/год
                    # Сырьё: 0.05 бит/клиент, 3 бит/день, 600 бит/год
                    # Здание (10 мест, 50+30 м², аренда): 400 бит/год
                    # Зарплаты: (1 × 800 + 2 × 320) = 1440 бит/год
                    # Прибыль (0% налог): 0 бит/год (0% рентабельность)
                    # Семейное заведение, самозанятость, самоокупаемость.
                    # https://static.wikia.nocookie.net/mlp/images/7/7d/Spa_S02E23.png
            # - 10 кафе и ресторанов [10$$, 30$]
                # Повар, поварёнок, официантка, посудомойка-уборщица.
                # Местные продукты и местная кухня, сезонный рацион.
                # Оборот: 0.3 бит/клиент, 15 бит/день, 4500 бит/год
                    # Сырьё: 0.16 бит/клиент, 8 бит/день, 2400 бит/год
                    # Баланс: 0.14 бит/клиент, 7 бит/день, 2100 бит/год
                    # Здание (10 мест, 30+30 м², аренда): 300 бит/год
                    # Зарплаты: (1 × 800 + 3 × 320) = 1760 бит/год
                    # Прибыль (0% налог): 40 бит/год (0% рентабельность)
                    # Семейное заведение, самозанятость, самоокупаемость.
                    # https://static.wikia.nocookie.net/mlp/images/e/eb/Twilight_and_Spike_at_a_café_S1E03.png
                    # https://static.wikia.nocookie.net/mlp/images/c/c2/Ponies_outside_the_Ponyville_Cafe_S7E3.png
                    # https://static.wikia.nocookie.net/mlp/images/8/8e/CMC_walking_to_the_Hay_Burger_S4E15.png
                # Оборачиваемость места в кафе -- 8 раз/день, 10-20 мест.
                    # 557 × 3 / 10 = 167 заказов/день (50% доставка)
                    # 60k кг/год, 166 кг/день, 21 кг/час
                    # Завтрак 0.5-0.7 кг; чай 0.25-0.5 кг
                    # Обед 0.7-0.8 кг; чай 0.25-0.5 кг
                    # Ужин 0.4 кг; чай 0.25-0.5
                    # Суммарно 1.6-1.8 кг пищи за 0.3 бит.
                    # amber -sm Среднеземный осенний праздничный рацион -n 50 -d 1
                    # amber -sm "изысканный рацион (пони/год)" -n "557/10" -d 5
                    # xclip -o | sed "s@[^0-9]*@@g" | tr '\n' '+' | c
        # Торговля:
            # - Ярмарка (осенняя, длится 1-2 месяца после урожая)
                # Экспорт+Импорт 350 + 350 = 700 тысяч бит (24% ВВП)
                # Средняя стоимость труда фермеров -- 0.25 бита/нормо-час
                # --------------------------------------------------------
                # amber "Экспорт Понивиля, ярмарка"
                # ++++ Население.................................. | 10,575
                # -|- Трудозатраты (нормо-часов).................. | 1,429,686
                # -|$ Продукция, стоимость (бит).................. | 351,267
                # |====Грузов произведено (тонн).................. | 23,572
                # |===Грузов перевезено (тонн).................... | 48,840
                # |==Зерновые (тонн).............................. | 4,395
                # |==Зернобобовые (тонн).......................... | 1,398
                # |==Продовольствие (тонн)........................ | 1,198
                # --------------------------------------------------------
                # >>>Экспорт, 80% в столицу округа (Пайвиль)
                # amber "Экспорт Понивиля, ярмарка" -E "Маршрут окружной"
                # Маршрут окружной-гужевой, городок <-> город (тонн)........ | 1,160
                # Маршрут окружной-железнодорожный, городок <-> город (тонн) | 2,899
                # Маршрут окружной-речной, городок <-> город (тонн)......... | 1,740
                # >>>затем 80% в Кантерлот/Хуффингтон/Ванхувер
                # amber "Экспорт Понивиля, ярмарка" -E "Маршрут региональный"
                # Маршрут региональный-железнодорожный, город <-> мегаполис (тонн). | 3,665
                # Маршрут региональный-речной, город <-> мегаполис (тонн).......... | 916
                # --------------------------------------------------------
                # "ОБОРОТЫ ЯРМАРОК ТУЛЬСКОЙ ГУБЕРНИИ В XIX – НАЧАЛЕ XX В."
                # https://science-education.ru/ru/article/view?id=9578
                # https://ru.wikisource.org/wiki/ЭСБЕ/Торговля
                # https://ru.wikisource.org/wiki/ЭСБЕ/Ярмарки
            # - Базар [2$$$$, 8$$$, 20$$, 40$] (+60 пегасов в 10 артелях грузчиков)
                # 10 управленцев, 20 кассиров, 40 курьеров (4 смены, 360 дней/год)
                # 5664 дневных рационов: 889 бит ×1.2 наценка = 1067 бит/день
                # 16 выходов/месяц, 2832 покупателей/день (<8.6 кг/покупка)
                # 250-500 покупателей/час, 5-10 касс (3000 м² площадь рынка)
                # Оборот: 0.38 бит/клиент, 1067 бит/день, 384 120 бит/год
                    # Сырьё: 0.31 бит/клиент, 899 бит/день, 320 153 бит/год
                    # Здание (склад + ледник, 1000 м², аренда): 2000 бит/год
                    # Здание (крытая площадь, 3000 м², аренда): 3000 бит/год
                    # Зарплаты: (2×3200 + 8×1200 + 20×800 + 40×320) = 44 800 бит/год
                    # Доход: 0.014 бит/клиент, 39.4 бит/день, 14 167 бит/год
                    # Прибыль (55% налог): 6375 бит/год (10% рентабельность)
                # --------------------------------------------------------
                # Рынок и транспорт кормят больше 50% понивильских пегасов:
                # Торговая схема №1: фермеры --> пегас --> базар
                # Торговая схема №2: город --> пегас --> фермеры
                # >300 прилавков от сельских общин (10 покупателей/прилавок)
                # Подобие супермаркета, прилавки без продавцов с общей кассой.
                # - У людей базар, это культурный и социальный центр уезда.
                # - У понях земные презирают торговлю и доверяют её пегасам.
                # Пегас привозит товары к прилавку, пони берут свои заказы.
                # К вечеру пегас отвозит почту, выручку и заказы фермерам.
                # Если спешка, за пару часов доставят заказы на планёрах.
                # Страховка и распределение рисков защищает от воровства.
                # Для начала 20 века характерна доставка товаров на дом.
                # https://ru.wikisource.org/wiki/ЭСБЕ/Офеня
                # https://ru.wikisource.org/wiki/ЭСБЕ/Торговые_ряды
                # https://rus-turk.livejournal.com/112966.html
                # https://static.wikia.nocookie.net/mlp/images/b/be/Background_ponies_in_the_market_S2E23.png
                # --------------------------------------------------------
                # amber Торговля Понивиля -n "1/360"
                # -|- Трудозатраты (нормо-часов).............. | 1,271,431
                # -|$ Продукция, стоимость (бит).............. | 320,153
                # -|$ Продукция, стоимость (бит/день)......... | 889
                # |====Грузов произведено (тонн).............. | 66
                # |===Грузов перевезено (тонн)................ | 120
                # |===Грузов перевезено на рынок (тонн)....... | 24.4
                # |==Зерновые (тонн).......................... | 4.1
                # |==Зернобобовые (тонн)...................... | 1.0
                # |==Овощи (тонн)............................. | 7.8
                # |==Фрукты (тонн)............................ | 5.0
                # |==Продовольствие (тонн).................... | 6.5
                # --------------------------------------------------------
                # amber Торговля Понивиля -n "1/360" -E грузооборот
                # amber Торговля Понивиля -n "1/360" -E грузонапряжённость
                # -|5 Транспортировка (нормо-часов)................. | 503
                # |===Грузооборот шоссейных дорог (тонно-километров) | 727
                # |===Грузооборот воздушных путей (тонно-километров) | 300
                # |===Грузооборот грунтовых дорог (тонно-километров) | 37
                # |===Грузонапряжённость сельских дорог (тонн)...... | 47
                # |===Грузонапряжённость шоссейных дорог (тонн)..... | 21
                # |===Грузонапряжённость воздушных путей (тонн)..... | 2
                # --------------------------------------------------------
                # amber Торговля Понивиля -n "1/360" -S -E Работа
                # _-Работа пегаса-возничего (нормо-часов)........... | 69
                # _-Работа земнопони-возничего (нормо-часов)........ | 50
                # _-Работа бригады грузчиков (нормо-часов).......... | 105
                # _-Работа грузчика с тележкой (нормо-часов)........ | 43
                # _-Работа грузчика (нормо-часов)................... | 21
                # --------------------------------------------------------
            # - 5 винных лавок [5$$, 5$]
                # Купец и помощник, 40 покупателей/день, 3 литра/покупка
                # Оборот: 0.3 бит/клиент, 12 бит/день, 3600 бит/год
                    # Сырьё: 0.2 бит/клиент, 8 бит/день, 2400 бит/год
                    # Баланс: 0.1 бит/клиент, 4 бит/день, 1200 бит/год
                    # Здание (лавка+склад, 10+10 м², аренда): 100 бит/год
                    # Зарплаты: (1 × 800 + 1 × 320) = 1120 бит/год
                    # Прибыль (0% налог): -20 бит/год (0% рентабельность)
                    # Семейное заведение, самозанятость, самоокупаемость.
                # Все винные лавки 600 литров/день (20% винодельня Берри)
                    # Потребление 0.05-0.2 литра/день, 20 л/год, 100 л/семья
                    # Вино красное сухое (килограмм).................. | 132,929
                    # Вино белое сухое (килограмм).................... | 81,630
            # - 30 мелких магазинов и бакалейных лавок [30$$, 30$]
                # Купец и помощник -- 25-40 покупателей/день
                # Колониальные товары, межрегиональная торговля.
                # Всё то, что слишком дорого для пегасьего базара.
                # Одежда, утварь, мебель, инструменты, стройматериалы,
                # Чай и кофе, пряности, игрушки, книги, украшения, часы.
                # https://static.wikia.nocookie.net/mlp/images/7/76/Rarity's_Carousel_Boutique_S1E14.png
                # https://static.wikia.nocookie.net/mlp/images/7/77/Twilight_and_Spike_in_costumes_S1E3.png
                # https://static.wikia.nocookie.net/mlp/images/b/b6/Pinkie_Pie_and_Rainbow_Shopping_S1E5.png
                # https://static.wikia.nocookie.net/mlp/images/a/a8/Spike_visits_Quills_and_Sofas_S1E24.png
                # https://static.wikia.nocookie.net/mlp/images/2/28/Rarity_in_Mr._Breezy's_empty_store_S7E19.png
                # https://static.wikia.nocookie.net/mlp/images/2/26/Tea_salespony_in_her_tea_store_S7E12.png
                # https://static.wikia.nocookie.net/mlp/images/1/1b/Twilight%2C_Spike%2C_and_Flurry_enter_the_toy_store_S7E3.png
                # https://static.wikia.nocookie.net/mlp/images/8/8f/Pinkie_asks_about_glowing%2C_flying%2C_self-folding_napkins_S7E12.png
                # https://static.wikia.nocookie.net/mlp/images/6/66/Window_error_S1E5.png
                # https://static.wikia.nocookie.net/mlp/images/7/7e/Jeweler_Pony_greeting_Starlight_and_Trixie_S7E2.png
                # https://static.wikia.nocookie.net/mlp/images/9/99/Applejack_and_Big_Mac_outside_Rich's_Barnyard_Bargains_S6E23.png
        # В сумме это >1000 рабочих мест, что охватывают всё население городка.
        'Среднеземные земнопони (городки)':0.50,
        'Среднеземные единороги (городки)':0.35,
        'Среднеземные пегасы (городки)':0.15,
        }

#----
# Городские жители (городки):

metadict_army['Северо-восточные горные городо-сельские пони'] = {
        'Североморские земнопони (городки)':0.15,
        'Североморские единороги (городки)':0.45,
        'Североморские пегасы (городки)':0.40,
        }

metadict_army['Северо-восточные лесные городо-сельские пони'] = {
        'Североморские земнопони (городки)':0.15,
        'Североморские единороги (городки)':0.50,
        'Североморские пегасы (городки)':0.35,
        }

metadict_army['Северо-восточные прибрежные городо-сельские пони'] = {
        'Североморские земнопони (городки)':0.20,
        'Североморские единороги (городки)':0.45,
        'Североморские пегасы (городки)':0.35,
        }

metadict_army['Северо-восточные речные городо-сельские пони'] = {
        'Североморские земнопони (городки)':0.20,
        'Североморские единороги (городки)':0.45,
        'Североморские пегасы (городки)':0.35,
        }

metadict_army['Северо-западные горные городо-сельские пони'] = {
        'Североморские земнопони (городки)':0.15,
        'Североморские единороги (городки)':0.45,
        'Североморские пегасы (городки)':0.40,
        }

metadict_army['Северо-западные прибрежные городо-сельские пони'] = {
        'Североморские земнопони (городки)':0.20,
        'Североморские единороги (городки)':0.45,
        'Североморские пегасы (городки)':0.35,
        }

metadict_army['Северо-западные речные городо-сельские пони'] = {
        'Североморские земнопони (городки)':0.20,
        'Североморские единороги (городки)':0.45,
        'Североморские пегасы (городки)':0.35,
        }

metadict_army['Северо-западные степные городо-сельские пони'] = {
        'Североморские земнопони (городки)':0.25,
        'Североморские единороги (городки)':0.40,
        'Североморские пегасы (городки)':0.35,
        }

metadict_army['Среднеземные горные городо-сельские пони'] = {
        'Среднеземные земнопони (городки)':0.20,
        'Среднеземные единороги (городки)':0.35,
        'Среднеземные пегасы (городки)':0.45,
        }

metadict_army['Среднеземные лесные городо-сельские пони'] = {
        'Среднеземные земнопони (городки)':0.20,
        'Среднеземные единороги (городки)':0.35,
        'Среднеземные пегасы (городки)':0.45,
        }

metadict_army['Среднеземные прибрежные городо-сельские пони'] = {
        'Среднеземные земнопони (городки)':0.25,
        'Среднеземные единороги (городки)':0.35,
        'Среднеземные пегасы (городки)':0.40,
        }

metadict_army['Среднеземные речные городо-сельские пони'] = {
        'Среднеземные земнопони (городки)':0.25,
        'Среднеземные единороги (городки)':0.35,
        'Среднеземные пегасы (городки)':0.40,
        }

metadict_army['Среднеземные степные городо-сельские пони'] = {
        'Среднеземные земнопони (городки)':0.30,
        'Среднеземные единороги (городки)':0.30,
        'Среднеземные пегасы (городки)':0.40,
        }

metadict_army['Юго-восточные прибрежные городо-сельские пони'] = {
        'Южноморские земнопони (городки)':0.30,
        'Южноморские единороги (городки)':0.30,
        'Южноморские пегасы (городки)':0.40,
        }

metadict_army['Юго-восточные речные городо-сельские пони'] = {
        'Южноморские земнопони (городки)':0.30,
        'Южноморские единороги (городки)':0.30,
        'Южноморские пегасы (городки)':0.40,
        }

metadict_army['Юго-восточные степные городо-сельские пони'] = {
        'Южноморские земнопони (городки)':0.35,
        'Южноморские единороги (городки)':0.25,
        'Южноморские пегасы (городки)':0.40,
        }

metadict_army['Юго-восточные горные городо-сельские пони'] = {
        'Южноморские земнопони (городки)':0.15,
        'Южноморские единороги (городки)':0.40,
        'Южноморские пегасы (городки)':0.45,
        }

#----
# Сельские жители (сёла):

metadict_army['Северо-восточные горные сельские пони'] = {
        # Селение в предгорной долине. 650 жителей, 130 брусчатых домов.
        # Центр округи (5 деревень, 12 ферм) с общим население в 1550 пони.
        # Муниципальные организации (подоходный налог):
            # - Сельская управа (собрание фермеров и окрестных общин)
            # - Библиотека при управе (1000+ томов, один библиотекарь)
            # В библиотеке 20 книжных шкафов, плюс коробки газет и журналов.
            # 700 читателей, 8 книг/год на читателя, 19 посетителей/день.
        # Муниципально-государственные организации (поземельный налог):
            # - Фельдшерский пункт (1 фельдшер, 1 пегас)
            # - Водонапорная башня с пожарной бочкой и телегой.
        # Государственные организации (НДС госмонополий):
            # - Начальная школа на 30 учеников (7-10 лет), 1 учитель. Земская школа.
            # От школы до дальних ферм 2-4 километра. Жеребята добираются пешком.
            # https://upload.wikimedia.org/wikipedia/ru/8/87/Проект_всеобщего_обучения_в_Гжатском_уезде.jpg
        # Предприятия:
            # - Амбары для зерна.
            # - 1/2 Мельницы
        # Ремёсла:
            # - 3-6 пегасов-возничьих.
            # - 2-3 мелких мастерских (гончар, столяр, тележник)
        # Дельцы:
            # - 2-3 лавки привозных товаров.
            # - 2-3 местечковые таверны.
            # - 2-3 общественные бани.
        # Сельское хозяйство:
            # Селяне, это огородники и садоводы.
            # Из-за долгого пути к полям мало зерновых.
            # https://istmat.org/node/27384
        'Североморские земнопони (селения)':0.82,
        'Североморские единороги (селения)':0.03,
        'Североморские пегасы (селения)':0.15,
        '+Североморский рацион, избыток (пони/год)':0.25,
        }

metadict_army['Северо-восточные лесные сельские пони'] = {
        'Североморские земнопони (селения)':0.82,
        'Североморские единороги (селения)':0.03,
        'Североморские пегасы (селения)':0.15,
        '+Североморский рацион, избыток (пони/год)':0.5,
        }

metadict_army['Северо-восточные прибрежные сельские пони'] = {
        'Североморские земнопони (селения)':0.87,
        'Североморские единороги (селения)':0.03,
        'Североморские пегасы (селения)':0.10,
        '+Североморский рацион, избыток (пони/год)':1,
        }

metadict_army['Северо-восточные речные сельские пони'] = {
        'Североморские земнопони (селения)':0.87,
        'Североморские единороги (селения)':0.03,
        'Североморские пегасы (селения)':0.10,
        '+Североморский рацион, избыток (пони/год)':1,
        }

metadict_army['Северо-западные горные сельские пони'] = {
        'Североморские земнопони (селения)':0.82,
        'Североморские единороги (селения)':0.03,
        'Североморские пегасы (селения)':0.15,
        '+Североморский рацион, избыток (пони/год)':0.25,
        }

metadict_army['Северо-западные прибрежные сельские пони'] = {
        'Североморские земнопони (селения)':0.87,
        'Североморские единороги (селения)':0.03,
        'Североморские пегасы (селения)':0.10,
        '+Североморский рацион, избыток (пони/год)':1,
        }

metadict_army['Северо-западные речные сельские пони'] = {
        'Североморские земнопони (селения)':0.87,
        'Североморские единороги (селения)':0.03,
        'Североморские пегасы (селения)':0.10,
        '+Североморский рацион, избыток (пони/год)':1,
        }

metadict_army['Северо-западные степные сельские пони'] = {
        'Североморские земнопони (селения)':0.87,
        'Североморские единороги (селения)':0.03,
        'Североморские пегасы (селения)':0.10,
        '+Североморский рацион, избыток (пони/год)':1,
        }

metadict_army['Среднеземные горные сельские пони'] = {
        'Среднеземные земнопони (селения)':0.80,
        'Среднеземные единороги (селения)':0.10,
        'Среднеземные пегасы (селения)':0.10,
        '+Среднеземный рацион, избыток (пони/год)':0.25,
        }

metadict_army['Среднеземные лесные сельские пони'] = {
        'Среднеземные земнопони (селения)':0.80,
        'Среднеземные единороги (селения)':0.10,
        'Среднеземные пегасы (селения)':0.10,
        '+Среднеземный рацион, избыток (пони/год)':0.5,
        }

metadict_army['Среднеземные прибрежные сельские пони'] = {
        'Среднеземные земнопони (селения)':0.85,
        'Среднеземные единороги (селения)':0.05,
        'Среднеземные пегасы (селения)':0.10,
        '+Среднеземный рацион, избыток (пони/год)':1,
        }

metadict_army['Среднеземные речные сельские пони'] = {
        'Среднеземные земнопони (селения)':0.85,
        'Среднеземные единороги (селения)':0.05,
        'Среднеземные пегасы (селения)':0.10,
        '+Среднеземный рацион, избыток (пони/год)':1,
        }

metadict_army['Среднеземные степные сельские пони'] = {
        'Среднеземные земнопони (селения)':0.85,
        'Среднеземные единороги (селения)':0.05,
        'Среднеземные пегасы (селения)':0.10,
        '+Среднеземный рацион, избыток (пони/год)':1,
        }

metadict_army['Юго-восточные прибрежные сельские пони'] = {
        'Южноморские земнопони (селения)':0.85,
        'Южноморские единороги (селения)':0.05,
        'Южноморские пегасы (селения)':0.10,
        '+Южноморский рацион, избыток (пони/год)':1,
        }

metadict_army['Юго-восточные речные сельские пони'] = {
        'Южноморские земнопони (селения)':0.85,
        'Южноморские единороги (селения)':0.05,
        'Южноморские пегасы (селения)':0.10,
        '+Южноморский рацион, избыток (пони/год)':1,
        }

metadict_army['Юго-восточные степные сельские пони'] = {
        'Южноморские земнопони (селения)':0.85,
        'Южноморские единороги (селения)':0.05,
        'Южноморские пегасы (селения)':0.10,
        '+Южноморский рацион, избыток (пони/год)':1,
        }

metadict_army['Юго-восточные горные сельские пони'] = {
        'Южноморские земнопони (селения)':0.80,
        'Южноморские единороги (селения)':0.10,
        'Южноморские пегасы (селения)':0.10,
        '+Южноморский рацион, избыток (пони/год)':0.25,
        }

#----
# Сельские жители (деревни):

metadict_army['Северо-восточные горные деревенские пони'] = {
        # Деревни в 50-300 (среднее 125) жителей на 600 гектарах плодородной земли.
        # Организация:
            # Аграрная община с совместным трудом и общими наделами.
            # Разделения труда -- не самоцель. Достаточно самообеспечения.
            # Освоение новых ремёсел ценнее специализации. Эксперты уезжают.
            # У каждого равная с остальными доля прав, обязанностей и прибыли.
            # Много совместных сезонных работ. Строят жилища тоже сообща.
            # Товарищество с разными паями, но равными дивидендами.
            # http://vln.by/node/192
        # Социум (исторический):
            # Социальная психология крестьянства -- компромисс существования.
            # - Благополучие, это не богатство, а экономия здоровья и труда.
            # - Экстенсивное земледелие лучше из-за меньших трудовых затрат.
            # - Низкий статус женщин и детей = экономия труда взрослых мужчин.
            # - Высокая рождаемость = меньше затрат труда на члена семьи.
            # "Бюджет времени рабочего и крестьянина" 1922-1923 гг. Струмилин
            # "Очерки экономики мелкого земледелия" Маслов, 1918 год
            # "Энергия и цивилизация" Вацлав Смил
            # https://istmat.org/node/27934
            # https://istmat.org/node/44238
        # Социум (оптимальный):
            # Горизонтальные связи и предохранители, чтобы спускать пар:
            # 1) Ежедневные собрания, где все могут обсудить "что делать".
            # 2) Мобильность населения. Дома общинные, сменить общину легко.
            # 3) Расширенные семьи. Любовь и дружба важнее кровного родства.
            # 4) Сети связей. Учёба и найм в соседних общинах, в общих артелях.
            # 5) Отчётность. Личный капитал, это сумма вложенного в общину труда.
            # 6) Страхование. Капитал застрахован, уходящие забирают свой вклад.
            # Доходы равные, решения коллегиальные, ответственность коллективная.
            # Нильс Кристи "По ту сторону одиночества" 8. Ситуация с властью
            # Александр Дворкин "Сектоведение" Глава 3. Тоталитарные секты.
        # Демографический состав (деревня)
            # 15-30 семей по 4-8 пони, живут в отдельных домах.
            # 15 поколений по ~8 пони, диапазон возраста ±2 года.
            # Распределение населения по возрастам:
            # 0-4 -- 10 (8%)
            # 5-9 -- 9 (7%)
            # 10-14 -- 9 (7%)
            # 15-19 -- 9 (7%)
            # 20-24 -- 9 (7%)
            # 25-29 -- 9 (7%)
            # 30-34 -- 8 (6%)
            # 35-39 -- 8 (6%)
            # 40-44 -- 8 (6%)
            # 45-49 -- 8 (6%)
            # 50-54 -- 7 (6%)
            # 55-59 -- 7 (5%)
            # 60-64 -- 6 (5%)
            # 65-69 -- 5 (4%)
            # 70-74 -- 5 (4%)
            # 75-79 -- 4 (3%)
            # 80-84 -- 3 (2%)
            # 85-89 -- 2 (1%)
            # 90-94 -- 1 (1%)
        # Государственные:
            # Медицинский пункт при доме собраний.
            # https://ru.m.wikipedia.org/wiki/Домовое_хозяйство_(медицинское_учреждение)
        # Сельское хозяйство:
            # Такая деревня может обеспечивать себя и до 375 горожан.
            # Тогда радиус до границы полей -- 1900 метров
            # Дорожные затраты времени -- до 35% работы.
            # https://istmat.org/node/27384
        # Дороги:
            # 2 километра грунтовой дороги, соединённой с шоссе.
        'Североморские земнопони (деревни)':0.82,
        'Североморские единороги (деревни)':0.03,
        'Североморские пегасы (деревни)':0.15,
        '+Североморский рацион, избыток (пони/год)':1,
        }

metadict_army['Северо-восточные лесные деревенские пони'] = {
        'Североморские земнопони (деревни)':0.82,
        'Североморские единороги (деревни)':0.03,
        'Североморские пегасы (деревни)':0.15,
        '+Североморский рацион, избыток (пони/год)':1,
        }

metadict_army['Северо-восточные прибрежные деревенские пони'] = {
        'Североморские земнопони (деревни)':0.87,
        'Североморские единороги (деревни)':0.03,
        'Североморские пегасы (деревни)':0.10,
        '+Североморский рацион, избыток (пони/год)':2,
        }

metadict_army['Северо-восточные речные деревенские пони'] = {
        'Североморские земнопони (деревни)':0.87,
        'Североморские единороги (деревни)':0.03,
        'Североморские пегасы (деревни)':0.10,
        '+Североморский рацион, избыток (пони/год)':2,
        }

metadict_army['Северо-западные горные деревенские пони'] = {
        'Североморские земнопони (деревни)':0.87,
        'Североморские единороги (деревни)':0.03,
        'Североморские пегасы (деревни)':0.10,
        '+Североморский рацион, избыток (пони/год)':1,
        }

metadict_army['Северо-западные прибрежные деревенские пони'] = {
        'Североморские земнопони (деревни)':0.87,
        'Североморские единороги (деревни)':0.03,
        'Североморские пегасы (деревни)':0.10,
        '+Североморский рацион, избыток (пони/год)':2,
        }

metadict_army['Северо-западные речные деревенские пони'] = {
        'Североморские земнопони (деревни)':0.87,
        'Североморские единороги (деревни)':0.03,
        'Североморские пегасы (деревни)':0.10,
        '+Североморский рацион, избыток (пони/год)':2,
        }

metadict_army['Северо-западные степные деревенские пони'] = {
        'Североморские земнопони (деревни)':0.87,
        'Североморские единороги (деревни)':0.03,
        'Североморские пегасы (деревни)':0.10,
        '+Североморский рацион, избыток (пони/год)':2,
        }

metadict_army['Среднеземные горные деревенские пони'] = {
        'Среднеземные земнопони (деревни)':0.80,
        'Среднеземные единороги (деревни)':0.10,
        'Среднеземные пегасы (деревни)':0.10,
        '+Среднеземный рацион, избыток (пони/год)':1,
        }

metadict_army['Среднеземные лесные деревенские пони'] = {
        'Среднеземные земнопони (деревни)':0.80,
        'Среднеземные единороги (деревни)':0.10,
        'Среднеземные пегасы (деревни)':0.10,
        '+Среднеземный рацион, избыток (пони/год)':2,
        }

metadict_army['Среднеземные прибрежные деревенские пони'] = {
        'Среднеземные земнопони (деревни)':0.85,
        'Среднеземные единороги (деревни)':0.05,
        'Среднеземные пегасы (деревни)':0.10,
        '+Среднеземный рацион, избыток (пони/год)':2,
        }

metadict_army['Среднеземные речные деревенские пони'] = {
        'Среднеземные земнопони (деревни)':0.85,
        'Среднеземные единороги (деревни)':0.05,
        'Среднеземные пегасы (деревни)':0.10,
        '+Среднеземный рацион, избыток (пони/год)':2,
        }

metadict_army['Среднеземные степные деревенские пони'] = {
        'Среднеземные земнопони (деревни)':0.85,
        'Среднеземные единороги (деревни)':0.05,
        'Среднеземные пегасы (деревни)':0.10,
        '+Среднеземный рацион, избыток (пони/год)':2,
        }

metadict_army['Юго-восточные прибрежные деревенские пони'] = {
        'Южноморские земнопони (деревни)':0.85,
        'Южноморские единороги (деревни)':0.05,
        'Южноморские пегасы (деревни)':0.10,
        '+Южноморский рацион, избыток (пони/год)':2,
        }

metadict_army['Юго-восточные речные деревенские пони'] = {
        'Южноморские земнопони (деревни)':0.85,
        'Южноморские единороги (деревни)':0.05,
        'Южноморские пегасы (деревни)':0.10,
        '+Южноморский рацион, избыток (пони/год)':2,
        }

metadict_army['Юго-восточные степные деревенские пони'] = {
        'Южноморские земнопони (деревни)':0.85,
        'Южноморские единороги (деревни)':0.05,
        'Южноморские пегасы (деревни)':0.10,
        '+Южноморский рацион, избыток (пони/год)':2,
        }

metadict_army['Юго-восточные горные деревенские пони'] = {
        'Южноморские земнопони (деревни)':0.80,
        'Южноморские единороги (деревни)':0.10,
        'Южноморские пегасы (деревни)':0.10,
        '+Южноморский рацион, избыток (пони/год)':1,
        }

#----
# Сельские жители (фермы):

metadict_army['Северо-восточные горные фермерские пони'] = {
        # Хутора на 5-50 (среднее 25) жителей на ~120 гектарах (23 га под пашней и садами).
        # Среднее владение (1900 год, США) -- 60 гектаров (20 га пашни, 3 лошади)
        # Сельское хозяйство:
            # Такая ферма может обеспечивать себя и 75 горожан.
            # Тогда радиус до границы полей -- 850 метров.
            # Дорожные затраты времени -- до 14% работы.
            # https://istmat.org/node/27384
        # Домашние животные:
            # Пони не держат домашних свиней (исключая чудовищных Эпплов)
            # Основные спутники, это грызуны, они спасают от насекомых.
            # до 155 домашних крыс (31 крысы/дом) и до 1016 полёвок.
            # Заклинание Speak_with_Animals помогает дружить с ними.
            # Кормятся они 50% пищевых отходов и потерями зерна.
        # Производство товарного хлеба по типам хозяйств:
            # Хозяйства | в 1913/14 году       | в 1926/27 году
            # --------- | ----- | ----- | ---- | ----- | ----- | ----
            # Владельцы | зерно | товар | %    | зерно | товар | %
            # --------- | ----- | ----- | ---- | ----- | ----- | ----
            # Помещики  | 9.84  | 4.62  | 46.9 | -     | -     | -
            # Кулаки    | 31.16 | 10.66 | 34.2 | 10.11 | 2.07  | 20.4
            # Крестьяне | 41.0  | 6.1   | 14.8 | 66.43 | 7.64  | 11.5
            # Совхозы   | -     | -     | -    | 13.1  | 6.2   | 47.3
            # Итого     | 82.0  | 21.33 | 26.0 | 77.85 | 10.33 | 13.3
            # https://istmat.org/node/48163
            # https://web.archive.org/web/http://ricw.ru/rish.html
        # Фермы вдвое производительнее деревень (50-75% товарного зерна)
        'Североморские земнопони (фермы)':0.87,
        'Североморские единороги (фермы)':0.03,
        'Североморские пегасы (фермы)':0.10,
        '+Североморский рацион, избыток (пони/год)':2,
        }

metadict_army['Среднеземные лесные фермерские пони, семья Берри'] = {
        # Винодельня Берри (25 пони, 13 работников)
            # Поставляет вина на 2500 среднеземных пони (32% потребления кантона)
            # |-Виноградные сады (гектар)..................... | 13
            # Вино красное сухое (килограмм).................. | 42,514
            # Виноград отборный (килограмм)................... | 85,080
        'Среднеземные земнопони (фермы)':1,
        '+Среднеземный рацион, избыток, вино Берри (пони/год)':100,
        }

metadict_army['Среднеземные лесные фермерские пони, семья Эпплов'] = {
        # Эпплы (25 пони, 13 работников)
            # Забота о саде (40 акров) -- 51% рабочих часов.
            # Обеспечивают яблоками 1/10 потребления кантона.
            # Также выращивают кукурузы и овощи на свои нужды.
            # От фермы до окраины Понивиля менее полукилометра.
            # https://static.wikia.nocookie.net/mlp/images/6/6c/CMC_Treehouse_S2E17.png
        # Площать Sweet Apple Acres (оригинальная):
            # 24 567 837 травинок (насчитанных Спайком) при густоте 400-1000,
            # Это 24578-61445 кв.метров, 2.5-6.2 гектара, 6.2-15.3 акров.
            # Это посильно для семьи из 2 работников, старушки и кобылки.
        # Яблоки, это 50% доходов фермы -- 2 000 бит (после налогов)
            # -|$ Продукция, стоимость (бит).................. | 5,467
            # -|$ Продукция, стоимость (бит).................. | 2,705
            # |----$Единый поземельный налог (бит/год)........ | 749
        # Уход за садом -- 300 дней на 15 гектар.
            # |-Яблоневые сады (гектар)....................... | 15
            # |---Пашня (гектар).............................. | 6
            # |---Огороды (гектар)............................ | 1
            # |----Обжитые земли (гектар)..................... | 63
            # |----Обжитые земли (радиус, метр)............... | 446
            # Уход за садом (14 дней/гектар) и уборка яблок (6 дней на гектар)
        # Сортировка яблок -- 1446 нормо-часов/урожай, 181 дней
            # |=Ящик яблок (250 среднеплодных, 25 кг)......... | 4,916
            # |=Корзина яблок (килограмм)..................... | 122,907
            # Сортировка яблок с протиркой и укладкой в тару (среднеплодных) -- 30 кг/час.
            # Сортировка и упаковка яблок и груш (среднеплодных) -- 85 кг/час.
            # http://www.libussr.ru/doc_ussr/usr_14391.htm
        # Трудовые нормы:
            # Работа                          | Трудозатраты
            # ------------------------------- | -------------------
            # =Уборка яблок                   | =24-75 часов/тонна (3-10 дней/гектар)
            # Сбор яблок, среднерослые сады   | 12-47
            # Сортировка и укладка            | 9-24
            # Разгрузка ящиков                | 1
            # Переноска ящиков, 25-50 метров  | 2-4
        # Потребности фермы (выращивают/покупают):
            # Могут тратить до 12 800 рабочих часов или менее 2700 бит.
            # Зерновые и бобовые:
                # Зерно пшеницы (килограмм)............................. | 1,863
                # Зерно кукурузы (килограмм)............................ | 1,128
                # Зерно овса (килограмм)................................ | 337
                # Зерно риса посевного (килограмм)...................... | 315
                # Бобы фасоли в стручках (килограмм).................... | 538
                # Бобы гороха в стручках (килограмм).................... | 105
                # Бобы арахиса в шелухе (килограмм)..................... | 68
            # Корнеплоды и овощи:
                # Картофель (килограмм)................................. | 2,523
                # Томаты (килограмм).................................... | 1,930
                # Лук репчатый (килограмм).............................. | 1,104
                # Тыква (килограмм)..................................... | 999
                # Морковь (килограмм)................................... | 718
                # Батат (килограмм)..................................... | 570
                # Перец сладкий (килограмм)............................. | 492
                # Сельдерей (килограмм)................................. | 481
                # Турнепс (килограмм)................................... | 380
                # Спаржа (килограмм).................................... | 347
                # Огурцы (килограмм).................................... | 313
                # Капуста брокколи (килограмм).......................... | 307
                # Латук посевной (килограмм)............................ | 246
                # Капуста кудрявая (килограмм).......................... | 228
                # Стручки нежгучего перца (килограмм)................... | 223
                # Ревень (килограмм).................................... | 209
                # Баклажан (килограмм).................................. | 206
                # Кабачок (килограмм)................................... | 160
                # Чеснок (килограмм).................................... | 172
                # Пастернак (килограмм)................................. | 152
                # Свёкла (килограмм).................................... | 152
                # Шпинат (килограмм).................................... | 95
                # Стручки острого перца (килограмм)..................... | 88
                # Лук зелёный (килограмм)............................... | 74
                # Артишоки (килограмм).................................. | 53
            # Пряные травы:
                # Базилик (килограмм)................................... | 88
                # Петрушка (килограмм).................................. | 74
                # Розмарин (килограмм).................................. | 68
                # Эстрагон (килограмм).................................. | 65
                # Тимьян (килограмм).................................... | 63
                # Орегано (килограмм)................................... | 62
                # Кориандр (килограмм).................................. | 57
                # Корень куркумы (килограмм)............................ | 51
            # Ягоды:
                # Виноград (килограмм).................................. | 1,517
                # Арбуз (килограмм)..................................... | 182
                # Дыня (килограмм)...................................... | 136
                # Земляника (килограмм)................................. | 153
                # Малина (килограмм).................................... | 70
                # Смородина (килограмм)................................. | 85
                # Черника (килограмм)................................... | 59
            # Фруктовые деревья:
                # Груша (килограмм)..................................... | 1,015
                # Вишня (килограмм)..................................... | 301
                # Лимон (килограмм)..................................... | 210
                # Слива (килограмм)..................................... | 152
                # Оливки (килограмм).................................... | 129
                # Абрикос (килограмм)................................... | 79
                # Персик (килограмм).................................... | 62
                # Инжир (килограмм)..................................... | 53
            # Ореховые деревья:
                # Орех пекана (килограмм)............................... | 142
                # Орех миндаля (килограмм).............................. | 129
                # Каштан посевной (килограмм)........................... | 128
                # Орешки кедровые в шишках (килограмм).................. | 57
            # Грибы:
                # Шампиньоны (килограмм)................................ | 227
                # Боровики (килограмм).................................. | 90
                # Сморчки (килограмм)................................... | 65
        # Потребности фермы (покупают):
            # Товары:
                # Сахар-песок (килограмм)............................... | 279
                # Мёд пчелиный (килограмм).............................. | 141
                # Соль поваренная (килограмм)........................... | 101
                # Сода негашёная, карбонат натрия (килограмм)........... | 92
                # Сода пищевая (килограмм).............................. | 6
            # Масло:
                # Масло оливковое (килограмм)........................... | 293
                # Масло арахисовое (килограмм).......................... | 199
                # Масло подсолнечное (килограмм)........................ | 176
                # Масло хлопчатое (килограмм)........................... | 18
                # Масло какао (килограмм)............................... | 16
                # Масло льняное (килограмм)............................. | 7
                # Масло горчичное (килограмм)........................... | 5
                # Масло конопляное (килограмм).......................... | 3
                # Масло кунжутное (килограмм)........................... | 2
        # Потребности фермы (покупают):
            # amber -sm "ферма Эпплов" -E "|||"
            # Литература:
                # |||Продукция печатная (газета).................... | 329
                # |||Продукция печатная (журнал).................... | 55
                # |||Продукция печатная (книга)..................... | 22
                # |||Продукция печатная (конверт)................... | 659
                # |||Продукция печатная (почтовая бандероль)........ | 242
                # |||Продукция печатная (почтовая марка)............ | 659
                # |||Продукция печатная (тетрадь)................... | 27
                # |||Продукция печатная (учебник)................... | 5
            # Канцтовары:
                # |||Инструмент канцелярский (грифель).............. | 3
                # |||Инструмент канцелярский (грифельная доска)..... | 2
                # |||Инструмент канцелярский (ластик)............... | 1
                # |||Инструмент канцелярский (ручка перьевая)....... | 2
                # Чернила канцелярские (грамм)...................... | 347
                # Клей полиграфический (грамм)...................... | 678
            # Одежда:
                # |||Обувь, галоши (резина)......................... | 4
                # |||Обувь, туфли (джут)............................ | 10
                # |||Одежда, ветровка (брезент)..................... | 4
                # |||Одежда, жилет (парусина)....................... | 4
                # |||Одежда, пальто (хлопок)........................ | 4
                # |||Одежда, плащ (брезент)......................... | 2
                # |||Одежда, чепчик (хлопок)........................ | 6
                # |||Одежда, чулки (хлопок)......................... | 4
                # |||Одежда, шляпа (солома)......................... | 12
            # Ткани:
                # |||Бельё, одеяло лоскутное (вата)......................... | 11
                # |||Бельё, простыня (парусина)............................. | 3
                # |||Бельё, простыня (хлопок)............................... | 5
                # |||Бельё, чехол тюфяка (мешковина)........................ | 7
                # |||Утварь текстильная (ковёр джутовый) (квадратный метр).. | 12
                # |||Утварь текстильная (ковёр соломенный) (квадратный метр) | 62
                # |||Утварь текстильная (ковёр хлопчатый) (квадратный метр). | 1
                # |||Утварь текстильная (полотенце 40x60 вафельное)......... | 4
                # |||Утварь текстильная (полотенце 50x90 вафельное)......... | 12
                # |||Утварь текстильная (полотенце 70x140 махровое)......... | 6
                # |||Утварь текстильная (сито).............................. | 1
                # |||Утварь текстильная (шторы водонепроницаемые 100x100-см) | 4
                # |||Утварь текстильная (шторы оконные 100x100-см).......... | 9
            # Посуда
                # |||Посуда деревянная долблёная (ковш 1-литровый)...... | 2
                # |||Посуда деревянная долблёная (солонка 0.25-литровая) | 1
                # |||Посуда деревянная долблёная (уголок для сбора сока) | 1
                # |||Посуда керамическая (горшок печной 10-литровый).... | 2
                # |||Посуда керамическая (кружка 0.5-литровая).......... | 11
                # |||Посуда керамическая (кувшин 3-литровый)............ | 2
                # |||Посуда керамическая (миска 0.5-литровая)........... | 14
                # |||Посуда керамическая (миска 3-литровая)............. | 5
                # |||Посуда керамическая (миска 5-литровая)............. | 3
                # |||Посуда керамическая (чашка 0.25-литровая).......... | 8
            # Утварь:
                # |||Ёмкость бондарная (бочка наливная 300-литровая, 83x83x83-см).. | 3
                # |||Ёмкость бондарная (бочка наливная 500-литровая, 135x73x73-см). | 1
                # |||Ёмкость бондарная (бочка сухотарная 100-литровая, 56x53x53-см) | 2
                # |||Ёмкость бондарная (ведро 10-литровое, 35x27x27-см)............ | 4
                # |||Ёмкость бондарная (кадка 50-литровая, 48x45x45-см)............ | 1
                # |||Ёмкость деревянная пиленая (лоток 12-литровый)................ | 9
                # |||Ёмкость деревянная пиленая (ящик 50-литровый решётчатый)...... | 2
                # |||Ёмкость плетёная (корзина 10-литровая)........................ | 3
                # |||Ёмкость плетёная (корзина 50-литровая)........................ | 56
            # Мебель:
                # |||Мебель деревянная шлифованная (кровать односпальная, 90x180x30-см)...... | 2
                # |||Мебель деревянная шлифованная (стол кухонный, 140x90x50-см)............. | 2
                # |||Мебель деревянная шлифованная (стол обеденный, 200x180x50-см)........... | 1
                # |||Мебель деревянная шлифованная (сундук 100-литровый, 65x40x45-см)........ | 3
                # |||Мебель деревянная шлифованная (шкаф-гардероб 600-литровый, 80x60x150-см) | 1
            # Ремонт жилища :
                # Сельский двор, двухэтажный фахверк (эксплуатация)...... | 1
                # Сельский двор, каркасный дом (эксплуатация)............ | 3
                # |||Утварь стеклянная (лампа светляковая 10x10x20-см, 100 Лм)..... | 2
                # |||Утварь стеклянная (лампа светляковая 10x10x20-см, 200 Лм)..... | 1
                # |||Утварь стеклянная (лампа светокристальная 10x10x20-см, 200 Лм) | 2
                # |||Штукатурка, печь (квадратный метр).................. | 3
                # |||Кафель (квадратный метр)............................ | 1
                # |||Паркет (квадратный метр)............................ | 6
                # |||Обои (квадратный метр).............................. | 20
                # |||Дверь внутренняя (150x80-см)........................ | 2
                # |||Оконный блок со стёклами (100x100-см)............... | 5
                # |||Оконный блок со стёклами (150x100-см)............... | 4
                # Толь (квадратный метр)................................. | 132
                # Глиносоломенные ковры 25-мм (квадратный метр).......... | 115
                # Соломенные ковры 25-мм (квадратный метр)............... | 61
                # Стекло листовое (квадратный метр)...................... | 17
                # Кафель (квадратный метр)............................... | 2
                # Щебень (кубометр)...................................... | 19
                # Пиломатериалы (кубометр)............................... | 8
                # Грунт, вывоз (кубометр)................................ | 8
                # Кирпич саманный лёгкий (кубометр)...................... | 6
                # Камень бутовый (кубометр).............................. | 4
                # Песок (кубометр)....................................... | 3
                # Раствор кладочный М200 (кубометр)...................... | 2
                # Глина необработанная (кубометр)........................ | 2
                # Глина мятая (кубометр)................................. | 1
                # Торф для клозетов (килограмм).......................... | 2,700
                # Кирпич керамический (штука)............................ | 663
                # Мастика битумная (килограмм)........................... | 133
                # Пакля смоляная (килограмм)............................. | 41
                # Краски масляные (килограмм)............................ | 30
                # Дёготь (килограмм)..................................... | 10
                # Скипидар (килограмм)................................... | 8
                # Олифа (килограмм)...................................... | 9
                # Пакля (килограмм)...................................... | 6
                # Шпатлёвка (килограмм).................................. | 8
                # Литьё стальное, детали (килограмм)..................... | 51
                # Литьё чугунное, детали (килограмм)..................... | 83
                # Литьё чугунное, трубы (килограмм)...................... | 61
                # Литьё чугунное, арматура (килограмм)................... | 2
                # Прокат стальной, детали (килограмм).................... | 20
                # Прокат стальной, листы (килограмм)..................... | 22
                # Прокат железный, гвозди (килограмм).................... | 17
                # Прокат стальной, проволока (килограмм)................. | 6
        'Среднеземные земнопони (фермы)':1,
        '+Среднеземный рацион, избыток, яблоки Эпплов (пони/год)':40,
        }

metadict_army['Северо-восточные лесные фермерские пони'] = {
        'Североморские земнопони (фермы)':0.87,
        'Североморские единороги (фермы)':0.03,
        'Североморские пегасы (фермы)':0.10,
        '+Североморский рацион, избыток (пони/год)':2,
        }

metadict_army['Северо-восточные прибрежные фермерские пони'] = {
        'Североморские земнопони (фермы)':0.92,
        'Североморские единороги (фермы)':0.03,
        'Североморские пегасы (фермы)':0.05,
        '+Североморский рацион, избыток (пони/год)':3,
        }

metadict_army['Северо-восточные речные фермерские пони'] = {
        'Североморские земнопони (фермы)':0.92,
        'Североморские единороги (фермы)':0.03,
        'Североморские пегасы (фермы)':0.05,
        '+Североморский рацион, избыток (пони/год)':3,
        }

metadict_army['Северо-западные горные фермерские пони'] = {
        'Североморские земнопони (фермы)':0.87,
        'Североморские единороги (фермы)':0.03,
        'Североморские пегасы (фермы)':0.10,
        '+Североморский рацион, избыток (пони/год)':2,
        }

metadict_army['Северо-западные прибрежные фермерские пони'] = {
        'Североморские земнопони (фермы)':0.85,
        'Североморские единороги (фермы)':0.05,
        'Североморские пегасы (фермы)':0.10,
        '+Североморский рацион, избыток (пони/год)':3,
        }

metadict_army['Северо-западные речные фермерские пони'] = {
        'Североморские земнопони (фермы)':0.85,
        'Североморские единороги (фермы)':0.05,
        'Североморские пегасы (фермы)':0.10,
        '+Североморский рацион, избыток (пони/год)':3,
        }

metadict_army['Северо-западные степные фермерские пони'] = {
        'Североморские земнопони (фермы)':0.85,
        'Североморские единороги (фермы)':0.05,
        'Североморские пегасы (фермы)':0.10,
        '+Североморский рацион, избыток (пони/год)':3,
        }

metadict_army['Среднеземные горные фермерские пони'] = {
        # Среднеземные фермы, в отличии от деревень, снабжают крупные города.
        'Среднеземные земнопони (фермы)':0.80,
        'Среднеземные единороги (фермы)':0.05,
        'Среднеземные пегасы (фермы)':0.15,
        '+Городской рацион, избыток (пони/год)':2,
        }

metadict_army['Среднеземные лесные фермерские пони'] = {
        'Среднеземные земнопони (фермы)':0.80,
        'Среднеземные единороги (фермы)':0.05,
        'Среднеземные пегасы (фермы)':0.15,
        '+Городской рацион, избыток (пони/год)':3,
        }

metadict_army['Среднеземные прибрежные фермерские пони'] = {
        'Среднеземные земнопони (фермы)':0.80,
        'Среднеземные единороги (фермы)':0.10,
        'Среднеземные пегасы (фермы)':0.10,
        '+Городской рацион, избыток (пони/год)':3,
        }

metadict_army['Среднеземные речные фермерские пони'] = {
        'Среднеземные земнопони (фермы)':0.80,
        'Среднеземные единороги (фермы)':0.10,
        'Среднеземные пегасы (фермы)':0.10,
        '+Городской рацион, избыток (пони/год)':3,
        }

metadict_army['Среднеземные степные фермерские пони'] = {
        # Степные американские фермы конца 19 века -- 40-200 га (у нас ~100 га)
        # https://istmat.org/node/24084
        'Среднеземные земнопони (фермы)':0.85,
        'Среднеземные единороги (фермы)':0.05,
        'Среднеземные пегасы (фермы)':0.10,
        '+Городской рацион, избыток (пони/год)':3,
        }

metadict_army['Юго-восточные прибрежные фермерские пони'] = {
        'Южноморские земнопони (фермы)':0.85,
        'Южноморские единороги (фермы)':0.05,
        'Южноморские пегасы (фермы)':0.10,
        '+Южноморский рацион, избыток (пони/год)':3,
        }

metadict_army['Юго-восточные речные фермерские пони'] = {
        'Южноморские земнопони (фермы)':0.85,
        'Южноморские единороги (фермы)':0.05,
        'Южноморские пегасы (фермы)':0.10,
        '+Южноморский рацион, избыток (пони/год)':3,
        }

metadict_army['Юго-восточные степные фермерские пони'] = {
        'Южноморские земнопони (фермы)':0.85,
        'Южноморские единороги (фермы)':0.05,
        'Южноморские пегасы (фермы)':0.10,
        '+Южноморский рацион, избыток (пони/год)':3,
        }

metadict_army['Юго-восточные горные фермерские пони'] = {
        'Южноморские земнопони (фермы)':0.85,
        'Южноморские единороги (фермы)':0.05,
        'Южноморские пегасы (фермы)':0.10,
        '+Южноморский рацион, избыток (пони/год)':2,
        }

#----
# Благосостояние (североморские единороги):
    # Распределение богатств в amber-model-workers и amber-detail-goods

metadict_army['Североморские единороги (мегаполисы)'] = {
        # Североморские пони -- наследники Юникорнии. Единороги заправляют всем.
        # - Наёмные работники и служащие.
        # - Владельцы своих лавок и мастерских.
        # - Рантье и деловитые капиталисты.
        'Североморские горожане единороги бедняки':0.45,
        'Североморские горожане единороги середняки':0.50,
        'Североморские горожане единороги богатеи':0.05,
        '+--1 Жители мегаполисов':1,
        }

metadict_army['Североморские единороги (города)'] = {
        'Североморские горожане единороги бедняки':0.47,
        'Североморские горожане единороги середняки':0.50,
        'Североморские горожане единороги богатеи':0.03,
        '+--2 Жители городов':1,
        }

metadict_army['Североморские единороги (городки)'] = {
        'Североморские горожане единороги бедняки':0.53,
        'Североморские горожане единороги середняки':0.45,
        'Североморские горожане единороги богатеи':0.02,
        '+--3 Жители городков':1,
        }

metadict_army['Североморские единороги (селения)'] = {
        # Сельские простогривые единорожки, "рогатые земные".
        'Североморские селяне единороги бедняки':0.80,
        'Североморские селяне единороги середняки':0.19,
        'Североморские селяне единороги богатеи':0.01,
        '+--4 Жители селений':1,
        }

metadict_army['Североморские единороги (деревни)'] = {
        'Североморские селяне единороги бедняки':0.90,
        'Североморские селяне единороги середняки':0.09,
        'Североморские селяне единороги богатеи':0.01,
        '+--5 Жители деревень':1,
        }

metadict_army['Североморские единороги (фермы)'] = {
        # Лендлорды. Владельцы своих ферм.
        'Североморские селяне единороги бедняки':0.48,
        'Североморские селяне единороги середняки':0.50,
        'Североморские селяне единороги богатеи':0.02,
        '+--6 Жители ферм':1,
        }

#----
# Благосостояние (североморские земные):

metadict_army['Североморские земнопони (мегаполисы)'] = {
        # Торговцы-лоточники, владельцы своих лавок и редкие кондитеры-профессионалы.
        # Их относительное благосостояние строится на убытках их же собственных общин.
        'Североморские горожане земнопони бедняки':0.45,
        'Североморские горожане земнопони середняки':0.54,
        'Североморские горожане земнопони богатеи':0.01,
        '+--1 Жители мегаполисов':1,
        }

metadict_army['Североморские земнопони (города)'] = {
        'Североморские горожане земнопони бедняки':0.45,
        'Североморские горожане земнопони середняки':0.54,
        'Североморские горожане земнопони богатеи':0.01,
        '+--2 Жители городов':1,
        }

metadict_army['Североморские земнопони (городки)'] = {
        'Североморские горожане земнопони бедняки':0.55,
        'Североморские горожане земнопони середняки':0.44,
        'Североморские горожане земнопони богатеи':0.01,
        '+--3 Жители городков':1,
        }

metadict_army['Североморские земнопони (селения)'] = {
        # В общине все равны. В общине все бедны.
        'Североморские селяне земнопони бедняки':0.95,
        'Североморские селяне земнопони середняки':0.04,
        'Североморские селяне земнопони богатеи':0.01,
        '+--4 Жители селений':1,
        }

metadict_army['Североморские земнопони (деревни)'] = {
        'Североморские селяне земнопони бедняки':0.95,
        'Североморские селяне земнопони середняки':0.04,
        'Североморские селяне земнопони богатеи':0.01,
        '+--5 Жители деревень':1,
        }

metadict_army['Североморские земнопони (фермы)'] = {
        # Арендаторы, которым осточертели деревенские общины.
        'Североморские селяне земнопони бедняки':0.75,
        'Североморские селяне земнопони середняки':0.24,
        'Североморские селяне земнопони богатеи':0.01,
        '+--6 Жители ферм':1,
        }

#----
# Благосостояние (североморские пегасы):

metadict_army['Североморские пегасы (мегаполисы)'] = {
        # Наёмные рабочие на фабриках, почтальоны, погодники, моряки и судовладельцы.
        'Североморские горожане пегасы бедняки':0.75,
        'Североморские горожане пегасы середняки':0.24,
        'Североморские горожане пегасы богатеи':0.01,
        '+--1 Жители мегаполисов':1,
        }

metadict_army['Североморские пегасы (города)'] = {
        'Североморские горожане пегасы бедняки':0.75,
        'Североморские горожане пегасы середняки':0.24,
        'Североморские горожане пегасы богатеи':0.01,
        '+--2 Жители городов':1,
        }

metadict_army['Североморские пегасы (городки)'] = {
        'Североморские горожане пегасы бедняки':0.75,
        'Североморские горожане пегасы середняки':0.24,
        'Североморские горожане пегасы богатеи':0.01,
        '+--3 Жители городков':1,
        }

metadict_army['Североморские пегасы (селения)'] = {
        # Редкие погодники земнопоньских общин.
        'Североморские селяне пегасы бедняки':0.80,
        'Североморские селяне пегасы середняки':0.19,
        'Североморские селяне пегасы богатеи':0.01,
        '+--4 Жители селений':1,
        }

metadict_army['Североморские пегасы (деревни)'] = {
        'Североморские селяне пегасы бедняки':0.80,
        'Североморские селяне пегасы середняки':0.19,
        'Североморские селяне пегасы богатеи':0.01,
        '+--5 Жители деревень':1,
        }

metadict_army['Североморские пегасы (фермы)'] = {
        # Наймиты, с чисто пегасьей бестолковости работающие не на себя.
        'Североморские селяне пегасы бедняки':0.85,
        'Североморские селяне пегасы середняки':0.14,
        'Североморские селяне пегасы богатеи':0.01,
        '+--6 Жители ферм':1,
        }

#----
# Благосостояние (Среднеземные единороги):

metadict_army['Среднеземные единороги (мегаполисы)'] = {
        # Работники на швейных фабриках, ремесленники, владельцы магазинов.
        # Гармоничное общество, где рогатые не выше и не ниже других.
        'Среднеземные горожане единороги бедняки':0.55,
        'Среднеземные горожане единороги середняки':0.40,
        'Среднеземные горожане единороги богатеи':0.05,
        '+--1 Жители мегаполисов':1,
        }

metadict_army['Среднеземные единороги (города)'] = {
        'Среднеземные горожане единороги бедняки':0.60,
        'Среднеземные горожане единороги середняки':0.37,
        'Среднеземные горожане единороги богатеи':0.03,
        '+--2 Жители городов':1,
        }

metadict_army['Среднеземные единороги (городки)'] = {
        'Среднеземные горожане единороги бедняки':0.70,
        'Среднеземные горожане единороги середняки':0.28,
        'Среднеземные горожане единороги богатеи':0.02,
        '+--3 Жители городков':1,
        }

metadict_army['Среднеземные единороги (селения)'] = {
        # Сельские простогривые единорожки, гордые собой.
        'Среднеземные селяне единороги бедняки':0.85,
        'Среднеземные селяне единороги середняки':0.14,
        'Среднеземные селяне единороги богатеи':0.01,
        '+--4 Жители селений':1,
        }

metadict_army['Среднеземные единороги (деревни)'] = {
        'Среднеземные селяне единороги бедняки':0.85,
        'Среднеземные селяне единороги середняки':0.14,
        'Среднеземные селяне единороги богатеи':0.01,
        '+--5 Жители деревень':1,
        }

metadict_army['Среднеземные единороги (фермы)'] = {
        # Среднеземные фермеры, это небогатые переселенцы на фронтир.
        'Среднеземные селяне единороги бедняки':0.80,
        'Среднеземные селяне единороги середняки':0.18,
        'Среднеземные селяне единороги богатеи':0.02,
        '+--6 Жители ферм':1,
        }

#----
# Благосостояние (Среднеземные земные):

metadict_army['Среднеземные земнопони (мегаполисы)'] = {
        # Переселенцы из деревень и торговцы.
        'Среднеземные горожане земнопони бедняки':0.70,
        'Среднеземные горожане земнопони середняки':0.27,
        'Среднеземные горожане земнопони богатеи':0.03,
        '+--1 Жители мегаполисов':1,
        }

metadict_army['Среднеземные земнопони (города)'] = {
        'Среднеземные горожане земнопони бедняки':0.70,
        'Среднеземные горожане земнопони середняки':0.27,
        'Среднеземные горожане земнопони богатеи':0.03,
        '+--2 Жители городов':1,
        }

metadict_army['Среднеземные земнопони (городки)'] = {
        'Среднеземные горожане земнопони бедняки':0.75,
        'Среднеземные горожане земнопони середняки':0.23,
        'Среднеземные горожане земнопони богатеи':0.02,
        '+--3 Жители городков':1,
        }

metadict_army['Среднеземные земнопони (селения)'] = {
        'Среднеземные селяне земнопони бедняки':0.85,
        'Среднеземные селяне земнопони середняки':0.14,
        'Среднеземные селяне земнопони богатеи':0.01,
        '+--4 Жители селений':1,
        }

metadict_army['Среднеземные земнопони (деревни)'] = {
        # Общины беднеют, уступая место фермам.
        'Среднеземные селяне земнопони бедняки':0.85,
        'Среднеземные селяне земнопони середняки':0.14,
        'Среднеземные селяне земнопони богатеи':0.01,
        '+--5 Жители деревень':1,
        }

metadict_army['Среднеземные земнопони (фермы)'] = {
        # Владельцы ферм и их бестолковые родственники.
        'Среднеземные селяне земнопони бедняки':0.80,
        'Среднеземные селяне земнопони середняки':0.18,
        'Среднеземные селяне земнопони богатеи':0.02,
        '+--6 Жители ферм':1,
        }

#----
# Благосостояние (Среднеземные пегасы):

metadict_army['Среднеземные пегасы (мегаполисы)'] = {
        # Погодники, фабричные рабочие, почтальоны и торговцы.
        # Пегасы беднеют со строительством железных дорог.
        'Среднеземные горожане пегасы бедняки':0.85,
        'Среднеземные горожане пегасы середняки':0.13,
        'Среднеземные горожане пегасы богатеи':0.02,
        '+--1 Жители мегаполисов':1,
        }

metadict_army['Среднеземные пегасы (города)'] = {
        'Среднеземные горожане пегасы бедняки':0.85,
        'Среднеземные горожане пегасы середняки':0.14,
        'Среднеземные горожане пегасы богатеи':0.01,
        '+--2 Жители городов':1,
        }

metadict_army['Среднеземные пегасы (городки)'] = {
        'Среднеземные горожане пегасы бедняки':0.85,
        'Среднеземные горожане пегасы середняки':0.14,
        'Среднеземные горожане пегасы богатеи':0.01,
        '+--3 Жители городков':1,
        }

metadict_army['Среднеземные пегасы (селения)'] = {
        # Редкие погодники земнопоньских общин.
        'Среднеземные селяне пегасы бедняки':0.80,
        'Среднеземные селяне пегасы середняки':0.19,
        'Среднеземные селяне пегасы богатеи':0.01,
        '+--4 Жители селений':1,
        }

metadict_army['Среднеземные пегасы (деревни)'] = {
        'Среднеземные селяне пегасы бедняки':0.80,
        'Среднеземные селяне пегасы середняки':0.19,
        'Среднеземные селяне пегасы богатеи':0.01,
        '+--5 Жители деревень':1,
        }

metadict_army['Среднеземные пегасы (фермы)'] = {
        # Наёмные работники.
        'Среднеземные селяне пегасы бедняки':0.85,
        'Среднеземные селяне пегасы середняки':0.14,
        'Среднеземные селяне пегасы богатеи':0.01,
        '+--6 Жители ферм':1,
        }

#----
# Благосостояние (Южноморские единороги):

metadict_army['Южноморские единороги (мегаполисы)'] = {
        # Ремесленники, владельцы своих мастерских, редкие судовладельцы.
        # Южноморье -- культура земных. Задирающие нос рогатые там не приживаются.
        'Южноморские горожане единороги бедняки':0.65,
        'Южноморские горожане единороги середняки':0.33,
        'Южноморские горожане единороги богатеи':0.02,
        '+--1 Жители мегаполисов':1,
        }

metadict_army['Южноморские единороги (города)'] = {
        'Южноморские горожане единороги бедняки':0.70,
        'Южноморские горожане единороги середняки':0.28,
        'Южноморские горожане единороги богатеи':0.02,
        '+--2 Жители городов':1,
        }

metadict_army['Южноморские единороги (городки)'] = {
        'Южноморские горожане единороги бедняки':0.75,
        'Южноморские горожане единороги середняки':0.23,
        'Южноморские горожане единороги богатеи':0.02,
        '+--3 Жители городков':1,
        }

metadict_army['Южноморские единороги (селения)'] = {
        # Сельские простогривые единорожки, не очень гордые собой.
        'Южноморские селяне единороги бедняки':0.80,
        'Южноморские селяне единороги середняки':0.18,
        'Южноморские селяне единороги богатеи':0.02,
        '+--4 Жители селений':1,
        }

metadict_army['Южноморские единороги (деревни)'] = {
        'Южноморские селяне единороги бедняки':0.80,
        'Южноморские селяне единороги середняки':0.18,
        'Южноморские селяне единороги богатеи':0.02,
        '+--5 Жители деревень':1,
        }

metadict_army['Южноморские единороги (фермы)'] = {
        # Единороги на земнопоньских фермах Балтимэра исчезающе редки.
        # В основном это наёмные специалисты, кузнецы и механики.
        'Южноморские селяне единороги бедняки':0.50,
        'Южноморские селяне единороги середняки':0.48,
        'Южноморские селяне единороги богатеи':0.02,
        '+--6 Жители ферм':1,
        }

#----
# Благосостояние (Южноморские земные):

metadict_army['Южноморские земнопони (мегаполисы)'] = {
        # Богатеют на торговле сахаром, конкурируя с североморцами Мэйнхеттена.
        'Южноморские горожане земнопони бедняки':0.65,
        'Южноморские горожане земнопони середняки':0.32,
        'Южноморские горожане земнопони богатеи':0.03,
        '+--1 Жители мегаполисов':1,
        }

metadict_army['Южноморские земнопони (города)'] = {
        'Южноморские горожане земнопони бедняки':0.70,
        'Южноморские горожане земнопони середняки':0.28,
        'Южноморские горожане земнопони богатеи':0.02,
        '+--2 Жители городов':1,
        }

metadict_army['Южноморские земнопони (городки)'] = {
        'Южноморские горожане земнопони бедняки':0.70,
        'Южноморские горожане земнопони середняки':0.28,
        'Южноморские горожане земнопони богатеи':0.02,
        '+--3 Жители городков':1,
        }

metadict_army['Южноморские земнопони (селения)'] = {
        # Балтимэрский полуостров перенаселён. Когда-то сильные общины беднеют.
        'Южноморские селяне земнопони бедняки':0.85,
        'Южноморские селяне земнопони середняки':0.14,
        'Южноморские селяне земнопони богатеи':0.01,
        '+--4 Жители селений':1,
        }

metadict_army['Южноморские земнопони (деревни)'] = {
        'Южноморские селяне земнопони бедняки':0.85,
        'Южноморские селяне земнопони середняки':0.14,
        'Южноморские селяне земнопони богатеи':0.01,
        '+--5 Жители деревень':1,
        }

metadict_army['Южноморские земнопони (фермы)'] = {
        # Земля дорогая, фермеров мало. Но те кто есть приспособились.
        'Южноморские селяне земнопони бедняки':0.70,
        'Южноморские селяне земнопони середняки':0.28,
        'Южноморские селяне земнопони богатеи':0.02,
        '+--6 Жители ферм':1,
        }

#----
# Благосостояние (Южноморские пегасы):

metadict_army['Южноморские пегасы (мегаполисы)'] = {
        # Погодники, почтальоны и моряки. Много моряков с неплохими доходами.
        # В Балтимэре живут самые ленивые пегасы на свете.
        'Южноморские горожане пегасы бедняки':0.65,
        'Южноморские горожане пегасы середняки':0.33,
        'Южноморские горожане пегасы богатеи':0.02,
        '+--1 Жители мегаполисов':1,
        }

metadict_army['Южноморские пегасы (города)'] = {
        'Южноморские горожане пегасы бедняки':0.70,
        'Южноморские горожане пегасы середняки':0.29,
        'Южноморские горожане пегасы богатеи':0.01,
        '+--2 Жители городов':1,
        }

metadict_army['Южноморские пегасы (городки)'] = {
        'Южноморские горожане пегасы бедняки':0.70,
        'Южноморские горожане пегасы середняки':0.29,
        'Южноморские горожане пегасы богатеи':0.01,
        '+--3 Жители городков':1,
        }

metadict_army['Южноморские пегасы (селения)'] = {
        # Наёмные работники земнопоньских общин.
        'Южноморские селяне пегасы бедняки':0.75,
        'Южноморские селяне пегасы середняки':0.24,
        'Южноморские селяне пегасы богатеи':0.01,
        '+--4 Жители селений':1,
        }

metadict_army['Южноморские пегасы (деревни)'] = {
        'Южноморские селяне пегасы бедняки':0.75,
        'Южноморские селяне пегасы середняки':0.24,
        'Южноморские селяне пегасы богатеи':0.01,
        '+--5 Жители деревень':1,
        }

metadict_army['Южноморские пегасы (фермы)'] = {
        'Южноморские селяне пегасы бедняки':0.70,
        'Южноморские селяне пегасы середняки':0.29,
        'Южноморские селяне пегасы богатеи':0.01,
        '+--6 Жители ферм':1,
        }

#----
# Распределение видов и сословий (по регионам)

metadict_army['Североморские горожане единороги бедняки'] = {
        # От "горожан бедняков" вычисляются потребности в needs.
        # От "единорогов бедняков" идёт распределение полов, возрастов и доступных нормо-часов.
        'Североморские горожане бедняки':1,
        'Североморские единороги бедняки':1,
        }

metadict_army['Североморские горожане единороги богатеи'] = {
        'Североморские горожане богатеи':1,
        'Североморские единороги богатеи':1,
        }

metadict_army['Североморские горожане единороги середняки'] = {
        'Североморские горожане середняки':1,
        'Североморские единороги середняки':1,
        }

metadict_army['Североморские горожане земнопони бедняки'] = {
        'Североморские горожане бедняки':1,
        'Североморские земнопони бедняки':1,
        }

metadict_army['Североморские горожане земнопони богатеи'] = {
        'Североморские горожане богатеи':1,
        'Североморские земнопони богатеи':1,
        }

metadict_army['Североморские горожане земнопони середняки'] = {
        'Североморские горожане середняки':1,
        'Североморские земнопони середняки':1,
        }

metadict_army['Североморские горожане пегасы бедняки'] = {
        'Североморские горожане бедняки':1,
        'Североморские пегасы бедняки':1,
        }

metadict_army['Североморские горожане пегасы богатеи'] = {
        'Североморские горожане богатеи':1,
        'Североморские пегасы богатеи':1,
        }

metadict_army['Североморские горожане пегасы середняки'] = {
        'Североморские горожане середняки':1,
        'Североморские пегасы середняки':1,
        }

metadict_army['Североморские селяне единороги бедняки'] = {
        'Североморские селяне бедняки':1,
        'Североморские единороги бедняки':1,
        }

metadict_army['Североморские селяне единороги богатеи'] = {
        'Североморские селяне богатеи':1,
        'Североморские единороги богатеи':1,
        }

metadict_army['Североморские селяне единороги середняки'] = {
        'Североморские селяне середняки':1,
        'Североморские единороги середняки':1,
        }

metadict_army['Североморские селяне земнопони бедняки'] = {
        'Североморские селяне бедняки':1,
        'Североморские земнопони бедняки':1,
        }

metadict_army['Североморские селяне земнопони богатеи'] = {
        'Североморские селяне богатеи':1,
        'Североморские земнопони богатеи':1,
        }

metadict_army['Североморские селяне земнопони середняки'] = {
        'Североморские селяне середняки':1,
        'Североморские земнопони середняки':1,
        }

metadict_army['Североморские селяне пегасы бедняки'] = {
        'Североморские селяне бедняки':1,
        'Североморские пегасы бедняки':1,
        }

metadict_army['Североморские селяне пегасы богатеи'] = {
        'Североморские селяне богатеи':1,
        'Североморские пегасы богатеи':1,
        }

metadict_army['Североморские селяне пегасы середняки'] = {
        'Североморские селяне середняки':1,
        'Североморские пегасы середняки':1,
        }

metadict_army['Среднеземные горожане единороги бедняки'] = {
        'Среднеземные горожане бедняки':1,
        'Среднеземные единороги бедняки':1,
        }

metadict_army['Среднеземные горожане единороги богатеи'] = {
        'Среднеземные горожане богатеи':1,
        'Среднеземные единороги богатеи':1,
        }

metadict_army['Среднеземные горожане единороги середняки'] = {
        'Среднеземные горожане середняки':1,
        'Среднеземные единороги середняки':1,
        }

metadict_army['Среднеземные горожане земнопони бедняки'] = {
        'Среднеземные горожане бедняки':1,
        'Среднеземные земнопони бедняки':1,
        }

metadict_army['Среднеземные горожане земнопони богатеи'] = {
        'Среднеземные горожане богатеи':1,
        'Среднеземные земнопони богатеи':1,
        }

metadict_army['Среднеземные горожане земнопони середняки'] = {
        'Среднеземные горожане середняки':1,
        'Среднеземные земнопони середняки':1,
        }

metadict_army['Среднеземные горожане пегасы бедняки'] = {
        'Среднеземные горожане бедняки':1,
        'Среднеземные пегасы бедняки':1,
        }

metadict_army['Среднеземные горожане пегасы богатеи'] = {
        'Среднеземные горожане богатеи':1,
        'Среднеземные пегасы богатеи':1,
        }

metadict_army['Среднеземные горожане пегасы середняки'] = {
        'Среднеземные горожане середняки':1,
        'Среднеземные пегасы середняки':1,
        }

metadict_army['Среднеземные селяне единороги бедняки'] = {
        'Среднеземные селяне бедняки':1,
        'Среднеземные единороги бедняки':1,
        }

metadict_army['Среднеземные селяне единороги богатеи'] = {
        'Среднеземные селяне богатеи':1,
        'Среднеземные единороги богатеи':1,
        }

metadict_army['Среднеземные селяне единороги середняки'] = {
        'Среднеземные селяне середняки':1,
        'Среднеземные единороги середняки':1,
        }

metadict_army['Среднеземные селяне земнопони бедняки'] = {
        'Среднеземные селяне бедняки':1,
        'Среднеземные земнопони бедняки':1,
        }

metadict_army['Среднеземные селяне земнопони богатеи'] = {
        'Среднеземные селяне богатеи':1,
        'Среднеземные земнопони богатеи':1,
        }

metadict_army['Среднеземные селяне земнопони середняки'] = {
        'Среднеземные селяне середняки':1,
        'Среднеземные земнопони середняки':1,
        }

metadict_army['Среднеземные селяне пегасы бедняки'] = {
        'Среднеземные селяне бедняки':1,
        'Среднеземные пегасы бедняки':1,
        }

metadict_army['Среднеземные селяне пегасы богатеи'] = {
        'Среднеземные селяне богатеи':1,
        'Среднеземные пегасы богатеи':1,
        }

metadict_army['Среднеземные селяне пегасы середняки'] = {
        'Среднеземные селяне середняки':1,
        'Среднеземные пегасы середняки':1,
        }

metadict_army['Южноморские горожане единороги бедняки'] = {
        'Южноморские горожане бедняки':1,
        'Южноморские единороги бедняки':1,
        }

metadict_army['Южноморские горожане единороги богатеи'] = {
        'Южноморские горожане богатеи':1,
        'Южноморские единороги богатеи':1,
        }

metadict_army['Южноморские горожане единороги середняки'] = {
        'Южноморские горожане середняки':1,
        'Южноморские единороги середняки':1,
        }

metadict_army['Южноморские горожане земнопони бедняки'] = {
        'Южноморские горожане бедняки':1,
        'Южноморские земнопони бедняки':1,
        }

metadict_army['Южноморские горожане земнопони богатеи'] = {
        'Южноморские горожане богатеи':1,
        'Южноморские земнопони богатеи':1,
        }

metadict_army['Южноморские горожане земнопони середняки'] = {
        'Южноморские горожане середняки':1,
        'Южноморские земнопони середняки':1,
        }

metadict_army['Южноморские горожане пегасы бедняки'] = {
        'Южноморские горожане бедняки':1,
        'Южноморские пегасы бедняки':1,
        }

metadict_army['Южноморские горожане пегасы богатеи'] = {
        'Южноморские горожане богатеи':1,
        'Южноморские пегасы богатеи':1,
        }

metadict_army['Южноморские горожане пегасы середняки'] = {
        'Южноморские горожане середняки':1,
        'Южноморские пегасы середняки':1,
        }

metadict_army['Южноморские селяне единороги бедняки'] = {
        'Южноморские селяне бедняки':1,
        'Южноморские единороги бедняки':1,
        }

metadict_army['Южноморские селяне единороги богатеи'] = {
        'Южноморские селяне богатеи':1,
        'Южноморские единороги богатеи':1,
        }

metadict_army['Южноморские селяне единороги середняки'] = {
        'Южноморские селяне середняки':1,
        'Южноморские единороги середняки':1,
        }

metadict_army['Южноморские селяне земнопони бедняки'] = {
        'Южноморские селяне бедняки':1,
        'Южноморские земнопони бедняки':1,
        }

metadict_army['Южноморские селяне земнопони богатеи'] = {
        'Южноморские селяне богатеи':1,
        'Южноморские земнопони богатеи':1,
        }

metadict_army['Южноморские селяне земнопони середняки'] = {
        'Южноморские селяне середняки':1,
        'Южноморские земнопони середняки':1,
        }

metadict_army['Южноморские селяне пегасы бедняки'] = {
        'Южноморские селяне бедняки':1,
        'Южноморские пегасы бедняки':1,
        }

metadict_army['Южноморские селяне пегасы богатеи'] = {
        'Южноморские селяне богатеи':1,
        'Южноморские пегасы богатеи':1,
        }

metadict_army['Южноморские селяне пегасы середняки'] = {
        'Южноморские селяне середняки':1,
        'Южноморские пегасы середняки':1,
        }

#----
# Распределение видов и сословий (обобщение)

metadict_army['Североморские единороги бедняки'] = {
        # "Единороги" идут на распределение полов и возрастов.
        # "--Единороги бедняки" дают нам процент бедных в output.
        '--Единороги бедняки':1,
        '--Бедняки':1,
        'Единороги':1,
        }

metadict_army['Североморские единороги богатеи'] = {
        '--Единороги богатеи':1,
        '--Богатеи':1,
        'Единороги':1,
        }

metadict_army['Североморские единороги середняки'] = {
        '--Единороги середняки':1,
        '--Середняки':1,
        'Единороги':1,
        }

metadict_army['Среднеземные единороги бедняки'] = {
        '--Единороги бедняки':1,
        '--Бедняки':1,
        'Единороги':1,
        }

metadict_army['Среднеземные единороги богатеи'] = {
        '--Единороги богатеи':1,
        '--Богатеи':1,
        'Единороги':1,
        }

metadict_army['Среднеземные единороги середняки'] = {
        '--Единороги середняки':1,
        '--Середняки':1,
        'Единороги':1,
        }

metadict_army['Южноморские единороги бедняки'] = {
        '--Единороги бедняки':1,
        '--Бедняки':1,
        'Единороги':1,
        }

metadict_army['Южноморские единороги богатеи'] = {
        '--Единороги богатеи':1,
        '--Богатеи':1,
        'Единороги':1,
        }

metadict_army['Южноморские единороги середняки'] = {
        '--Единороги середняки':1,
        '--Середняки':1,
        'Единороги':1,
        }

metadict_army['Североморские земнопони бедняки'] = {
        '--Земнопони бедняки':1,
        '--Бедняки':1,
        'Земнопони':1,
        }

metadict_army['Североморские земнопони богатеи'] = {
        '--Земнопони богатеи':1,
        '--Богатеи':1,
        'Земнопони':1,
        }

metadict_army['Североморские земнопони середняки'] = {
        '--Земнопони середняки':1,
        '--Середняки':1,
        'Земнопони':1,
        }

metadict_army['Среднеземные земнопони бедняки'] = {
        '--Земнопони бедняки':1,
        '--Бедняки':1,
        'Земнопони':1,
        }

metadict_army['Среднеземные земнопони богатеи'] = {
        '--Земнопони богатеи':1,
        '--Богатеи':1,
        'Земнопони':1,
        }

metadict_army['Среднеземные земнопони середняки'] = {
        '--Земнопони середняки':1,
        '--Середняки':1,
        'Земнопони':1,
        }

metadict_army['Южноморские земнопони бедняки'] = {
        '--Земнопони бедняки':1,
        '--Бедняки':1,
        'Земнопони':1,
        }

metadict_army['Южноморские земнопони богатеи'] = {
        '--Земнопони богатеи':1,
        '--Богатеи':1,
        'Земнопони':1,
        }

metadict_army['Южноморские земнопони середняки'] = {
        '--Земнопони середняки':1,
        '--Середняки':1,
        'Земнопони':1,
        }

metadict_army['Североморские пегасы бедняки'] = {
        '--Пегасы бедняки':1,
        '--Бедняки':1,
        'Пегасы':1,
        }

metadict_army['Североморские пегасы богатеи'] = {
        '--Пегасы богатеи':1,
        '--Богатеи':1,
        'Пегасы':1,
        }

metadict_army['Североморские пегасы середняки'] = {
        '--Пегасы середняки':1,
        '--Середняки':1,
        'Пегасы':1,
        }

metadict_army['Среднеземные пегасы бедняки'] = {
        '--Пегасы бедняки':1,
        '--Бедняки':1,
        'Пегасы':1,
        }

metadict_army['Среднеземные пегасы богатеи'] = {
        '--Пегасы богатеи':1,
        '--Богатеи':1,
        'Пегасы':1,
        }

metadict_army['Среднеземные пегасы середняки'] = {
        '--Пегасы середняки':1,
        '--Середняки':1,
        'Пегасы':1,
        }

metadict_army['Южноморские пегасы бедняки'] = {
        '--Пегасы бедняки':1,
        '--Бедняки':1,
        'Пегасы':1,
        }

metadict_army['Южноморские пегасы богатеи'] = {
        '--Пегасы богатеи':1,
        '--Богатеи':1,
        'Пегасы':1,
        }

metadict_army['Южноморские пегасы середняки'] = {
        '--Пегасы середняки':1,
        '--Середняки':1,
        'Пегасы':1,
        }

#----
# Распределение полов

metadict_army['Земнопони'] = {
        'Кобылки-земнопони':0.58333,
        'Жеребцы-земнопони':0.41667,
        '++-- Земнопони':1,
        '-Пони':1,
        }

metadict_army['Пегасы'] = {
        'Кобылки-пегаски':0.65,
        'Жеребцы-пегасы':0.35,
        '++-- Пегасы':1,
        '-Пони':1,
        }

metadict_army['Единороги'] = {
        'Кобылки-единорожки':0.587,
        'Жеребцы-единороги':0.413,
        '++-- Единороги':1,
        '-Пони':1,
        }

#----
# Распределение возрастов:
    # Англия, без Шотландии (1891 год, 20.2 млн)
        # Средний возраст популяции: 26.7
        # возраст | мужчин | женщин | всего
        # ------- | ------ | ------ | -----
        # <5 лет  | 6.9%   | 6.5%   | 13.4%
        # 5-15    | 12.5   | 11.0   | 23.5
        # 15-25   | 9.3    | 9.3    | 18.6
        # 25-45   | 12.2   | 13.0   | 25.2
        # 45-65   | 6.9    | 7.3    | 14.2
        # >65     | 2.6    | 2.4    | 5
        # "Household and family structure in England and Wales, 1851-1911"
        # https://sci-hub.st/https://doi.org/10.1017/S0268416018000243
        # https://ru.wikisource.org/wiki/ЭСБЕ/Великобритания/Географический_очерк
    # Эквестрия, только пони (22 млн)
        # Средний возраст популяции: 35
        # 0-4 -- 1636037 (7.5%) -- в 1.8 раза меньше
        # 5-14 -- 3182528 (14.5%) -- в 1.6 раза меньше
        # 15-24 -- 3060760 (13.9%)
        # 25-44 -- 5706047 (26.0%)
        # 45-64 -- 4849389 (22.1%)
        # >65 -- 3524310 (16.1%)
        # war-economy-analyser.py

metadict_army['Жеребцы-единороги'] = {
        'Жеребцы-единороги (0 лет)':0.01501,
        'Жеребцы-единороги (1-10 лет)':0.14711,
        'Жеребцы-единороги (11-20 лет)':0.14163,
        'Жеребцы-единороги (21-30 лет)':0.13589,
        'Жеребцы-единороги (31-40 лет)':0.12941,
        'Жеребцы-единороги (41-50 лет)':0.12127,
        'Жеребцы-единороги (51-60 лет)':0.10976,
        'Жеребцы-единороги (61-70 лет)':0.09218,
        'Жеребцы-единороги (71-80 лет)':0.06588,
        'Жеребцы-единороги (81-90 лет)':0.03334,
        'Жеребцы-единороги (91-100 лет)':0.00811,
        'Жеребцы-единороги (101-110 лет)':0.00042,
        }

metadict_army['Жеребцы-земнопони'] = {
        'Жеребцы-земнопони (0 лет)':0.01501,
        'Жеребцы-земнопони (1-10 лет)':0.14711,
        'Жеребцы-земнопони (11-20 лет)':0.14163,
        'Жеребцы-земнопони (21-30 лет)':0.13589,
        'Жеребцы-земнопони (31-40 лет)':0.12941,
        'Жеребцы-земнопони (41-50 лет)':0.12127,
        'Жеребцы-земнопони (51-60 лет)':0.10976,
        'Жеребцы-земнопони (61-70 лет)':0.09218,
        'Жеребцы-земнопони (71-80 лет)':0.06588,
        'Жеребцы-земнопони (81-90 лет)':0.03334,
        'Жеребцы-земнопони (91-100 лет)':0.00811,
        'Жеребцы-земнопони (101-110 лет)':0.00042,
        }

metadict_army['Жеребцы-пегасы'] = {
        'Жеребцы-пегасы (0 лет)':0.01501,
        'Жеребцы-пегасы (1-10 лет)':0.14711,
        'Жеребцы-пегасы (11-20 лет)':0.14163,
        'Жеребцы-пегасы (21-30 лет)':0.13589,
        'Жеребцы-пегасы (31-40 лет)':0.12941,
        'Жеребцы-пегасы (41-50 лет)':0.12127,
        'Жеребцы-пегасы (51-60 лет)':0.10976,
        'Жеребцы-пегасы (61-70 лет)':0.09218,
        'Жеребцы-пегасы (71-80 лет)':0.06588,
        'Жеребцы-пегасы (81-90 лет)':0.03334,
        'Жеребцы-пегасы (91-100 лет)':0.00811,
        'Жеребцы-пегасы (101-110 лет)':0.00042,
        }

metadict_army['Кобылки-единорожки'] = {
        'Кобылки-единорожки (0 лет)':0.01501,
        'Кобылки-единорожки (1-10 лет)':0.14711,
        'Кобылки-единорожки (11-20 лет)':0.14163,
        'Кобылки-единорожки (21-30 лет)':0.13589,
        'Кобылки-единорожки (31-40 лет)':0.12941,
        'Кобылки-единорожки (41-50 лет)':0.12127,
        'Кобылки-единорожки (51-60 лет)':0.10976,
        'Кобылки-единорожки (61-70 лет)':0.09218,
        'Кобылки-единорожки (71-80 лет)':0.06588,
        'Кобылки-единорожки (81-90 лет)':0.03334,
        'Кобылки-единорожки (91-100 лет)':0.00811,
        'Кобылки-единорожки (101-110 лет)':0.00042,
        }

metadict_army['Кобылки-земнопони'] = {
        'Кобылки-земнопони (0 лет)':0.01501,
        'Кобылки-земнопони (1-10 лет)':0.14711,
        'Кобылки-земнопони (11-20 лет)':0.14163,
        'Кобылки-земнопони (21-30 лет)':0.13589,
        'Кобылки-земнопони (31-40 лет)':0.12941,
        'Кобылки-земнопони (41-50 лет)':0.12127,
        'Кобылки-земнопони (51-60 лет)':0.10976,
        'Кобылки-земнопони (61-70 лет)':0.09218,
        'Кобылки-земнопони (71-80 лет)':0.06588,
        'Кобылки-земнопони (81-90 лет)':0.03334,
        'Кобылки-земнопони (91-100 лет)':0.00811,
        'Кобылки-земнопони (101-110 лет)':0.00042,
        }

metadict_army['Кобылки-пегаски'] = {
        'Кобылки-пегаски (0 лет)':0.01501,
        'Кобылки-пегаски (1-10 лет)':0.14711,
        'Кобылки-пегаски (11-20 лет)':0.14163,
        'Кобылки-пегаски (21-30 лет)':0.13589,
        'Кобылки-пегаски (31-40 лет)':0.12941,
        'Кобылки-пегаски (41-50 лет)':0.12127,
        'Кобылки-пегаски (51-60 лет)':0.10976,
        'Кобылки-пегаски (61-70 лет)':0.09218,
        'Кобылки-пегаски (71-80 лет)':0.06588,
        'Кобылки-пегаски (81-90 лет)':0.03334,
        'Кобылки-пегаски (91-100 лет)':0.00811,
        'Кобылки-пегаски (101-110 лет)':0.00042,
        }

#----
# Профессии

metadict_army['Жеребцы-единороги (0 лет)'] = {                       
        'Единороги-младенцы':1,
        }

metadict_army['Жеребцы-единороги (1-10 лет)'] = {
        'Единороги-дети (1-6 лет)':6/10,
        'Единороги-школьники (7-10 лет)':4/10,
        }

metadict_army['Жеребцы-единороги (11-20 лет)'] = {
        'Единороги-школьники (11-14 лет)':4/10,
        'Единороги-подмастерья (15-18 лет)':4/10,
        'Единороги-рабочие':2/10,
        }

metadict_army['Жеребцы-единороги (21-30 лет)'] = {
        'Единороги-рабочие':1,
        }

metadict_army['Жеребцы-единороги (31-40 лет)'] = {
        'Единороги-рабочие':1,
        }

metadict_army['Жеребцы-единороги (41-50 лет)'] = {
        'Единороги-рабочие':1,
        }

metadict_army['Жеребцы-единороги (51-60 лет)'] = {
        'Единороги-рабочие':1,
        }

metadict_army['Жеребцы-единороги (61-70 лет)'] = {
        'Единороги-старики':1,
        }

metadict_army['Жеребцы-единороги (71-80 лет)'] = {
        'Единороги-старики':1,
        }

metadict_army['Жеребцы-единороги (81-90 лет)'] = {
        'Единороги-старики':1,
        }

metadict_army['Жеребцы-единороги (91-100 лет)'] = {
        'Единороги-старики':1,
        }

metadict_army['Жеребцы-единороги (101-110 лет)'] = {
        'Единороги-старики':1,
        }

metadict_army['Жеребцы-земнопони (0 лет)'] = {
        'Земнопони-младенцы':1,
        }

metadict_army['Жеребцы-земнопони (1-10 лет)'] = {
        'Земнопони-дети (1-6 лет)':6/10,
        'Земнопони-школьники (7-10 лет)':4/10,
        }

metadict_army['Жеребцы-земнопони (11-20 лет)'] = {
        'Земнопони-школьники (11-14 лет)':4/10,
        'Земнопони-подмастерья (15-18 лет)':4/10,
        'Земнопони-рабочие':2/10,
        }

metadict_army['Жеребцы-земнопони (21-30 лет)'] = {
        'Земнопони-рабочие':1,
        }

metadict_army['Жеребцы-земнопони (31-40 лет)'] = {
        'Земнопони-рабочие':1,
        }

metadict_army['Жеребцы-земнопони (41-50 лет)'] = {
        'Земнопони-рабочие':1,
        }

metadict_army['Жеребцы-земнопони (51-60 лет)'] = {
        'Земнопони-рабочие':1,
        }

metadict_army['Жеребцы-земнопони (61-70 лет)'] = {
        'Земнопони-старики':1,
        }

metadict_army['Жеребцы-земнопони (71-80 лет)'] = {
        'Земнопони-старики':1,
        }

metadict_army['Жеребцы-земнопони (81-90 лет)'] = {
        'Земнопони-старики':1,
        }

metadict_army['Жеребцы-земнопони (91-100 лет)'] = {
        'Земнопони-старики':1,
        }

metadict_army['Жеребцы-земнопони (101-110 лет)'] = {
        'Земнопони-старики':1,
        }

metadict_army['Жеребцы-пегасы (0 лет)'] = {
        'Пегасы-младенцы':1,
        }

metadict_army['Жеребцы-пегасы (1-10 лет)'] = {
        'Пегасы-дети (1-6 лет)':6/10,
        'Пегасы-школьники (7-10 лет)':4/10,
        }

metadict_army['Жеребцы-пегасы (11-20 лет)'] = {
        'Пегасы-школьники (11-14 лет)':4/10,
        'Пегасы-подмастерья (15-18 лет)':4/10,
        'Пегасы-рабочие':2/10,
        }

metadict_army['Жеребцы-пегасы (21-30 лет)'] = {
        'Пегасы-рабочие':1,
        }

metadict_army['Жеребцы-пегасы (31-40 лет)'] = {
        'Пегасы-рабочие':1,
        }

metadict_army['Жеребцы-пегасы (41-50 лет)'] = {
        'Пегасы-рабочие':1,
        }

metadict_army['Жеребцы-пегасы (51-60 лет)'] = {
        'Пегасы-рабочие':1,
        }

metadict_army['Жеребцы-пегасы (61-70 лет)'] = {
        'Пегасы-старики':1,
        }

metadict_army['Жеребцы-пегасы (71-80 лет)'] = {
        'Пегасы-старики':1,
        }

metadict_army['Жеребцы-пегасы (81-90 лет)'] = {
        'Пегасы-старики':1,
        }

metadict_army['Жеребцы-пегасы (91-100 лет)'] = {
        'Пегасы-старики':1,
        }

metadict_army['Жеребцы-пегасы (101-110 лет)'] = {
        'Пегасы-старики':1,
        }

metadict_army['Кобылки-единорожки (0 лет)'] = {                           
        'Единороги-младенцы':1,
        }

metadict_army['Кобылки-единорожки (1-10 лет)'] = {
        'Единороги-дети (1-6 лет)':6/10,
        'Единороги-школьники (7-10 лет)':4/10,
        }

metadict_army['Кобылки-единорожки (11-20 лет)'] = {
        'Единороги-школьники (11-14 лет)':4/10,
        'Единороги-подмастерья (15-18 лет)':4/10,
        'Единороги-рабочие':2/10,
        }

metadict_army['Кобылки-единорожки (21-30 лет)'] = {
        'Единороги-рабочие':1,
        }

metadict_army['Кобылки-единорожки (31-40 лет)'] = {
        'Единороги-рабочие':1,
        }

metadict_army['Кобылки-единорожки (41-50 лет)'] = {
        'Единороги-рабочие':1,
        }

metadict_army['Кобылки-единорожки (51-60 лет)'] = {
        'Единороги-рабочие':1,
        }

metadict_army['Кобылки-единорожки (61-70 лет)'] = {
        'Единороги-старики':1,
        }

metadict_army['Кобылки-единорожки (71-80 лет)'] = {
        'Единороги-старики':1,
        }

metadict_army['Кобылки-единорожки (81-90 лет)'] = {
        'Единороги-старики':1,
        }

metadict_army['Кобылки-единорожки (91-100 лет)'] = {
        'Единороги-старики':1,
        }

metadict_army['Кобылки-единорожки (101-110 лет)'] = {
        'Единороги-старики':1,
        }

metadict_army['Кобылки-земнопони (0 лет)'] = {
        'Земнопони-младенцы':1,
        }

metadict_army['Кобылки-земнопони (1-10 лет)'] = {
        'Земнопони-дети (1-6 лет)':6/10,
        'Земнопони-школьники (7-10 лет)':4/10,
        }

metadict_army['Кобылки-земнопони (11-20 лет)'] = {
        'Земнопони-школьники (11-14 лет)':4/10,
        'Земнопони-подмастерья (15-18 лет)':4/10,
        'Земнопони-рабочие':2/10,
        }

metadict_army['Кобылки-земнопони (21-30 лет)'] = {
        'Земнопони-рабочие':1,
        }

metadict_army['Кобылки-земнопони (31-40 лет)'] = {
        'Земнопони-рабочие':1,
        }

metadict_army['Кобылки-земнопони (41-50 лет)'] = {
        'Земнопони-рабочие':1,
        }

metadict_army['Кобылки-земнопони (51-60 лет)'] = {
        'Земнопони-рабочие':1,
        }

metadict_army['Кобылки-земнопони (61-70 лет)'] = {
        'Земнопони-старики':1,
        }

metadict_army['Кобылки-земнопони (71-80 лет)'] = {
        'Земнопони-старики':1,
        }

metadict_army['Кобылки-земнопони (81-90 лет)'] = {
        'Земнопони-старики':1,
        }

metadict_army['Кобылки-земнопони (91-100 лет)'] = {
        'Земнопони-старики':1,
        }

metadict_army['Кобылки-земнопони (101-110 лет)'] = {
        'Земнопони-старики':1,
        }

metadict_army['Кобылки-пегаски (0 лет)'] = {
        'Пегасы-младенцы':1,
        }

metadict_army['Кобылки-пегаски (1-10 лет)'] = {
        'Пегасы-дети (1-6 лет)':6/10,
        'Пегасы-школьники (7-10 лет)':4/10,
        }

metadict_army['Кобылки-пегаски (11-20 лет)'] = {
        'Пегасы-школьники (11-14 лет)':4/10,
        'Пегасы-подмастерья (15-18 лет)':4/10,
        'Пегасы-рабочие':2/10,
        }

metadict_army['Кобылки-пегаски (21-30 лет)'] = {
        'Пегасы-рабочие':1,
        }

metadict_army['Кобылки-пегаски (31-40 лет)'] = {
        'Пегасы-рабочие':1,
        }

metadict_army['Кобылки-пегаски (41-50 лет)'] = {
        'Пегасы-рабочие':1,
        }

metadict_army['Кобылки-пегаски (51-60 лет)'] = {
        'Пегасы-рабочие':1,
        }

metadict_army['Кобылки-пегаски (61-70 лет)'] = {
        'Пегасы-старики':1,
        }

metadict_army['Кобылки-пегаски (71-80 лет)'] = {
        'Пегасы-старики':1,
        }

metadict_army['Кобылки-пегаски (81-90 лет)'] = {
        'Пегасы-старики':1,
        }

metadict_army['Кобылки-пегаски (91-100 лет)'] = {
        'Пегасы-старики':1,
        }

metadict_army['Кобылки-пегаски (101-110 лет)'] = {
        'Пегасы-старики':1,
        }

#----
# Трудовые ресурсы
    # Коэффициент едока и работника (чаяновская модель):
    # | Возраст | Мужчины-едоки | Мужчины-работники | Женщины-едоки | Женщины-работники
    # | ------- | ------------- | ----------------- | ------------- | -----------------
    # | 0       | 0.1           | -                 | 0.1           | -
    # | 1-3     | 0.3           | -                 | 0.3           | -
    # | 4-6     | 0.4           | -                 | 0.4           | -
    # | 7-11    | 0.5           | -                 | 0.5           | -
    # | 12      | 0.5           | 0.1               | 0.5           | 0.1
    # | 13      | 0.7           | 0.3               | 0.7           | 0.3
    # | 14      | 0.7           | 0.4               | 0.7           | 0.4
    # | 15      | 0.7           | 0.5               | 0.7           | 0.5
    # | 16      | 0.7           | 0.6               | 0.7           | 0.6
    # | 17      | 0.7           | 0.7               | 0.7           | 0.7
    # | 18      | 0.9           | 0.8               | 0.8           | 0.8
    # | 19      | 0.9           | 0.9               | 0.8           | 0.8
    # | 20-49   | 1.0           | 1.0               | 0.8           | 0.8
    # | 50-51   | 1.0           | 0.9               | 0.8           | 0.7
    # | 52-54   | 0.9           | 0.8               | 0.7           | 0.6
    # | 55-56   | 0.8           | 0.7               | 0.7           | 0.6
    # | 57-58   | 0.7           | 0.6               | 0.6           | 0.5
    # | 59-60   | 0.7           | 0.5               | 0.6           | 0.4
    # | 61-64   | 0.6           | 0.3               | 0.5           | 0.2
    # | 65-68   | 0.6           | 0.2               | 0.5           | 0.1
    # | 69-70   | 0.5           | 0.1               | 0.5           | 0.1
    # | 71+     | 0.4           | -                 | 0.4           | -
    # http://vln.by/node/215
    # http://02.rospotrebnadzor.ru/content/191/27147/
    # https://istmat.org/node/21873
    # https://istmat.org/node/21905

metadict_army['Единороги-младенцы'] = {
        '-Младенцы':1,
        '-Едоки':0.1,
        }

metadict_army['Единороги-дети (1-6 лет)'] = {
        '-Дети (1-6 лет)':1,
        '-Едоки':0.4,
        }

metadict_army['Единороги-школьники (7-10 лет)'] = {
        # Детей рано запрягают помощью по хозяйству, но они не очень стараются.
        '-Школьники (7-10 лет)':1,
        '_Работа единорога, дом (дней/год)':300 / 2,
        '-Едоки':0.6,
        }

metadict_army['Единороги-школьники (11-14 лет)'] = {
        # В 1900 году около 26 % мальчиков 10–15 лет работали (Whaples 2005).
        '-Школьники (11-14 лет)':1,
        '_Работа единорога, дом (дней/год)':300 / 1.5,
        '-Едоки':0.7,
        }

metadict_army['Единороги-подмастерья (15-18 лет)'] = {
        # Герои, это пони с DnD-шным классом. Их менее 1/100 населения (0.84%)
        # Твайки обучаются в кантерлотской школе волшебства.
        '_Работа единорога (дней/год)':200 / 2,
        '_Работа единорога, дом (дней/год)':300,
        '-Подмастерья-единороги (15-18 лет)':1,
        '-Герои-единороги':1 / 100,
        '-Едоки':0.8,
        }

metadict_army['Единороги-рабочие'] = {
        '_Работа единорога (дней/год)':200,
        '_Работа единорога, дом (дней/год)':300,
        '-Рабочие-единороги':1,
        '-Герои-единороги':1 / 100,
        '-Едоки':1.0,
        }

metadict_army['Единороги-старики'] = {
        '_Работа единорога (дней/год)':200 / 2,
        '_Работа единорога, дом (дней/год)':300 / 1.5,
        '-Герои-единороги':1 / 100,
        '-Старики':1,
        '-Едоки':0.7,
        }

metadict_army['Земнопони-младенцы'] = {
        '-Младенцы':1,
        '-Едоки':0.1,
        }

metadict_army['Земнопони-дети (1-6 лет)'] = {
        '-Дети (1-6 лет)':1,
        '-Едоки':0.4,
        }

metadict_army['Земнопони-школьники (7-10 лет)'] = {
        '-Школьники (7-10 лет)':1,
        '_Работа земнопони, дом (дней/год)':300 / 2,
        '-Едоки':0.6,
        }

metadict_army['Земнопони-школьники (11-14 лет)'] = {
        # В сельском хозяйстве были заняты 75% детей, в основном девочки (1900 год, США)
        '-Школьники (11-14 лет)':1,
        '_Работа земнопони, дом (дней/год)':300 / 1.5,
        '-Едоки':0.7,
        }

metadict_army['Земнопони-подмастерья (15-18 лет)'] = {
        # Земные совсем не склонны к приключениям.
        # Героев меньше 1/300 популяции.
        '_Работа земнопони (дней/год)':200 / 2,
        '_Работа земнопони, дом (дней/год)':300,
        '-Герои-земнопони':1 / 300,
        '-Подмастерья (15-18 лет)':1,
        '-Едоки':0.8,
        }

metadict_army['Земнопони-рабочие'] = {
        '_Работа земнопони (дней/год)':200,
        '_Работа земнопони, дом (дней/год)':300,
        '-Герои-земнопони':1 / 300,
        '-Рабочие':1,
        '-Едоки':1.0,
        }

metadict_army['Земнопони-старики'] = {
        '_Работа земнопони (дней/год)':200 / 2,
        '_Работа земнопони, дом (дней/год)':300 / 1.5,
        '-Герои-земнопони':1 / 300,
        '-Старики':1,
        '-Едоки':0.7,
        }

metadict_army['Пегасы-младенцы'] = {
        '-Младенцы':1,
        '-Едоки':0.1,
        }

metadict_army['Пегасы-дети (1-6 лет)'] = {
        '-Дети (1-6 лет)':1,
        '-Едоки':0.4,
        }

metadict_army['Пегасы-школьники (7-10 лет)'] = {
        '-Школьники (7-10 лет)':1,
        '_Работа пегаса, дом (дней/год)':300 / 2,
        '-Едоки':0.6,
        }

metadict_army['Пегасы-школьники (11-14 лет)'] = {
        '-Школьники (11-14 лет)':1,
        '_Работа пегаса, дом (дней/год)':300 / 1.5,
        '-Едоки':0.7,
        }

metadict_army['Пегасы-подмастерья (15-18 лет)'] = {
        # Пегасы обожают приключения. В своих гонках они облетают весь свет.
        # Героев 1 / 30 популяции.
        '_Работа пегаса (дней/год)':200 / 2,
        '_Работа пегаса, дом (дней/год)':300,
        '-Герои-пегасы':1 / 30,
        '-Подмастерья (15-18 лет)':1,
        '-Едоки':0.8,
        }

metadict_army['Пегасы-рабочие'] = {
        '_Работа пегаса (дней/год)':200,
        '_Работа пегаса, дом (дней/год)':300,
        '-Герои-пегасы':1 / 30,
        '-Рабочие':1,
        '-Едоки':1.0,
        }

metadict_army['Пегасы-старики'] = {
        '_Работа пегаса (дней/год)':200 / 2,
        '_Работа пегаса, дом (дней/год)':300 / 1.5,
        '-Герои-пегасы':1 / 30,
        '-Старики':1,
        '-Едоки':0.7,
        }

#----
# Герои (по классам DnD 5e)

metadict_army['-Герои-единороги'] = {
        # В абсолютном большинстве единороги, это чародеи и волшебники.
        # Покровитель колдунов в мире "Янтаря", это сама Селестия.
        # Наконец, есть и барды, которые сами по себе.
        '-Герои-единороги (чародеи)':0.45,
        '-Герои-единороги (волшебники)':0.35,
        '-Герои-единороги (колдуны)':0.17,
        '-Герои-единороги (барды)':0.03,
        }

metadict_army['-Герои-земнопони'] = {
        # У земных есть культура атлетизма и борьбы (панкратион).
        # Живущие на фронтире земные хорошо знают местное зверьё.
        # Наконец, есть реликтовая организация пуритан.
        '-Герои-земнопони (монахи)':0.70,
        '-Герои-земнопони (друиды)':0.14,
        '-Герои-земнопони (следопыты)':0.12,
        '-Герои-земнопони (паладины)':0.04,
        }

metadict_army['-Герои-пегасы'] = {
        # Жрецы (клирики), это погодная служба Эквестрии.
        # Варвары и бойцы -- гвардия и ополчение
        # Плуты -- торгаши и кругосветчики
        '-Герои-пегасы (жрецы)':0.65,
        '-Герои-пегасы (бойцы)':0.18,
        '-Герои-пегасы (плуты)':0.10,
        '-Герои-пегасы (варвары)':0.07,
        }

#----
# Герои (уровни)

metadict_army['-Герои-единороги (чародеи)'] = {
        '-Герои-единороги (чародеи) (1 lvl)':1 / (2 ** 1),
        '-Герои-единороги (чародеи) (2 lvl)':1 / (2 ** 2),
        '-Герои-единороги (чародеи) (3 lvl)':1 / (2 ** 3),
        '-Герои-единороги (чародеи) (4 lvl)':1 / (2 ** 4),
        '-Герои-единороги (чародеи) (5 lvl)':1 / (2 ** 5),
        '-Герои-единороги (чародеи) (6 lvl)':1 / (2 ** 6),
        '-Герои-единороги (чародеи) (7 lvl)':1 / (2 ** 7),
        '-Герои-единороги (чародеи) (8 lvl)':1 / (2 ** 8),
        '-Герои-единороги (чародеи) (9+ lvl)':1 / (2 ** 9) * 2,
        }

metadict_army['-Герои-единороги (волшебники)'] = {
        '-Герои-единороги (волшебники) (1 lvl)':1 / (2 ** 1),
        '-Герои-единороги (волшебники) (2 lvl)':1 / (2 ** 2),
        '-Герои-единороги (волшебники) (3 lvl)':1 / (2 ** 3),
        '-Герои-единороги (волшебники) (4 lvl)':1 / (2 ** 4),
        '-Герои-единороги (волшебники) (5 lvl)':1 / (2 ** 5),
        '-Герои-единороги (волшебники) (6 lvl)':1 / (2 ** 6),
        '-Герои-единороги (волшебники) (7 lvl)':1 / (2 ** 7),
        '-Герои-единороги (волшебники) (8 lvl)':1 / (2 ** 8),
        '-Герои-единороги (волшебники) (9+ lvl)':1 / (2 ** 9) * 2,
        }

metadict_army['-Герои-единороги (колдуны)'] = {
        '-Герои-единороги (колдуны) (1 lvl)':1 / (2 ** 1),
        '-Герои-единороги (колдуны) (2 lvl)':1 / (2 ** 2),
        '-Герои-единороги (колдуны) (3 lvl)':1 / (2 ** 3),
        '-Герои-единороги (колдуны) (4 lvl)':1 / (2 ** 4),
        '-Герои-единороги (колдуны) (5 lvl)':1 / (2 ** 5),
        '-Герои-единороги (колдуны) (6 lvl)':1 / (2 ** 6),
        '-Герои-единороги (колдуны) (7 lvl)':1 / (2 ** 7),
        '-Герои-единороги (колдуны) (8 lvl)':1 / (2 ** 8),
        '-Герои-единороги (колдуны) (9+ lvl)':1 / (2 ** 9) * 2,
        }

metadict_army['-Герои-единороги (барды)'] = {
        '-Герои-единороги (барды) (1 lvl)':1 / (2 ** 1),
        '-Герои-единороги (барды) (2 lvl)':1 / (2 ** 2),
        '-Герои-единороги (барды) (3 lvl)':1 / (2 ** 3),
        '-Герои-единороги (барды) (4 lvl)':1 / (2 ** 4),
        '-Герои-единороги (барды) (5 lvl)':1 / (2 ** 5),
        '-Герои-единороги (барды) (6 lvl)':1 / (2 ** 6),
        '-Герои-единороги (барды) (7 lvl)':1 / (2 ** 7),
        '-Герои-единороги (барды) (8 lvl)':1 / (2 ** 8),
        '-Герои-единороги (барды) (9+ lvl)':1 / (2 ** 9) * 2,
        }

metadict_army['-Герои-земнопони (следопыты)'] = {
        '-Герои-земнопони (следопыты) (1 lvl)':1 / (2 ** 1),
        '-Герои-земнопони (следопыты) (2 lvl)':1 / (2 ** 2),
        '-Герои-земнопони (следопыты) (3 lvl)':1 / (2 ** 3),
        '-Герои-земнопони (следопыты) (4 lvl)':1 / (2 ** 4),
        '-Герои-земнопони (следопыты) (5 lvl)':1 / (2 ** 5),
        '-Герои-земнопони (следопыты) (6 lvl)':1 / (2 ** 6),
        '-Герои-земнопони (следопыты) (7 lvl)':1 / (2 ** 7),
        '-Герои-земнопони (следопыты) (8 lvl)':1 / (2 ** 8),
        '-Герои-земнопони (следопыты) (9+ lvl)':1 / (2 ** 9) * 2,
        }

metadict_army['-Герои-земнопони (друиды)'] = {
        '-Герои-земнопони (друиды) (1 lvl)':1 / (2 ** 1),
        '-Герои-земнопони (друиды) (2 lvl)':1 / (2 ** 2),
        '-Герои-земнопони (друиды) (3 lvl)':1 / (2 ** 3),
        '-Герои-земнопони (друиды) (4 lvl)':1 / (2 ** 4),
        '-Герои-земнопони (друиды) (5 lvl)':1 / (2 ** 5),
        '-Герои-земнопони (друиды) (6 lvl)':1 / (2 ** 6),
        '-Герои-земнопони (друиды) (7 lvl)':1 / (2 ** 7),
        '-Герои-земнопони (друиды) (8 lvl)':1 / (2 ** 8),
        '-Герои-земнопони (друиды) (9+ lvl)':1 / (2 ** 9) * 2,
        }

metadict_army['-Герои-земнопони (монахи)'] = {
        '-Герои-земнопони (монахи) (1 lvl)':1 / (2 ** 1),
        '-Герои-земнопони (монахи) (2 lvl)':1 / (2 ** 2),
        '-Герои-земнопони (монахи) (3 lvl)':1 / (2 ** 3),
        '-Герои-земнопони (монахи) (4 lvl)':1 / (2 ** 4),
        '-Герои-земнопони (монахи) (5 lvl)':1 / (2 ** 5),
        '-Герои-земнопони (монахи) (6 lvl)':1 / (2 ** 6),
        '-Герои-земнопони (монахи) (7 lvl)':1 / (2 ** 7),
        '-Герои-земнопони (монахи) (8 lvl)':1 / (2 ** 8),
        '-Герои-земнопони (монахи) (9+ lvl)':1 / (2 ** 9) * 2,
        }

metadict_army['-Герои-земнопони (паладины)'] = {
        '-Герои-земнопони (паладины) (1 lvl)':1 / (2 ** 1),
        '-Герои-земнопони (паладины) (2 lvl)':1 / (2 ** 2),
        '-Герои-земнопони (паладины) (3 lvl)':1 / (2 ** 3),
        '-Герои-земнопони (паладины) (4 lvl)':1 / (2 ** 4),
        '-Герои-земнопони (паладины) (5 lvl)':1 / (2 ** 5),
        '-Герои-земнопони (паладины) (6 lvl)':1 / (2 ** 6),
        '-Герои-земнопони (паладины) (7 lvl)':1 / (2 ** 7),
        '-Герои-земнопони (паладины) (8 lvl)':1 / (2 ** 8),
        '-Герои-земнопони (паладины) (9+ lvl)':1 / (2 ** 9) * 2,
        }

metadict_army['-Герои-пегасы (жрецы)'] = {
        # В Эквестрии уйма высокоуровневых пегасов, поэтому до 15 lvl.
        # Погодников в 3 раза больше, чем волшебников, чародеев и колдунов вместе взятых.
        '-Герои-пегасы (жрецы) (1 lvl)':1 / (2 ** 1),
        '-Герои-пегасы (жрецы) (2 lvl)':1 / (2 ** 2),
        '-Герои-пегасы (жрецы) (3 lvl)':1 / (2 ** 3),
        '-Герои-пегасы (жрецы) (4 lvl)':1 / (2 ** 4),
        '-Герои-пегасы (жрецы) (5 lvl)':1 / (2 ** 5),
        '-Герои-пегасы (жрецы) (6 lvl)':1 / (2 ** 6),
        '-Герои-пегасы (жрецы) (7 lvl)':1 / (2 ** 7),
        '-Герои-пегасы (жрецы) (8 lvl)':1 / (2 ** 8),
        '-Герои-пегасы (жрецы) (9 lvl)':1 / (2 ** 9),
        '-Герои-пегасы (жрецы) (10 lvl)':1 / (2 ** 10),
        '-Герои-пегасы (жрецы) (11 lvl)':1 / (2 ** 11),
        '-Герои-пегасы (жрецы) (12 lvl)':1 / (2 ** 12),
        '-Герои-пегасы (жрецы) (13 lvl)':1 / (2 ** 13),
        '-Герои-пегасы (жрецы) (14 lvl)':1 / (2 ** 14),
        '-Герои-пегасы (жрецы) (15+ lvl)':1 / (2 ** 15) * 2,
        }

metadict_army['-Герои-пегасы (бойцы)'] = {
        '-Герои-пегасы (бойцы) (1 lvl)':1 / (2 ** 1),
        '-Герои-пегасы (бойцы) (2 lvl)':1 / (2 ** 2),
        '-Герои-пегасы (бойцы) (3 lvl)':1 / (2 ** 3),
        '-Герои-пегасы (бойцы) (4 lvl)':1 / (2 ** 4),
        '-Герои-пегасы (бойцы) (5 lvl)':1 / (2 ** 5),
        '-Герои-пегасы (бойцы) (6 lvl)':1 / (2 ** 6),
        '-Герои-пегасы (бойцы) (7 lvl)':1 / (2 ** 7),
        '-Герои-пегасы (бойцы) (8 lvl)':1 / (2 ** 8),
        '-Герои-пегасы (бойцы) (9+ lvl)':1 / (2 ** 9) * 2,
        }

metadict_army['-Герои-пегасы (варвары)'] = {
        '-Герои-пегасы (варвары) (1 lvl)':1 / (2 ** 1),
        '-Герои-пегасы (варвары) (2 lvl)':1 / (2 ** 2),
        '-Герои-пегасы (варвары) (3 lvl)':1 / (2 ** 3),
        '-Герои-пегасы (варвары) (4 lvl)':1 / (2 ** 4),
        '-Герои-пегасы (варвары) (5 lvl)':1 / (2 ** 5),
        '-Герои-пегасы (варвары) (6 lvl)':1 / (2 ** 6),
        '-Герои-пегасы (варвары) (7 lvl)':1 / (2 ** 7),
        '-Герои-пегасы (варвары) (8 lvl)':1 / (2 ** 8),
        '-Герои-пегасы (варвары) (9+ lvl)':1 / (2 ** 9) * 2,
        }

metadict_army['-Герои-пегасы (плуты)'] = {
        '-Герои-пегасы (плуты) (1 lvl)':1 / (2 ** 1),
        '-Герои-пегасы (плуты) (2 lvl)':1 / (2 ** 2),
        '-Герои-пегасы (плуты) (3 lvl)':1 / (2 ** 3),
        '-Герои-пегасы (плуты) (4 lvl)':1 / (2 ** 4),
        '-Герои-пегасы (плуты) (5 lvl)':1 / (2 ** 5),
        '-Герои-пегасы (плуты) (6 lvl)':1 / (2 ** 6),
        '-Герои-пегасы (плуты) (7 lvl)':1 / (2 ** 7),
        '-Герои-пегасы (плуты) (8 lvl)':1 / (2 ** 8),
        '-Герои-пегасы (плуты) (9+ lvl)':1 / (2 ** 9) * 2,
        }
