#----
# Леса Эквестрии:
    # http://botsad.ru/menu/mir-rastenii/rastitelnost-mira/lesa-severnoj-ameriki/
    # http://www.slate.com/blogs/the_vault/2015/01/09/history_of_american_forests_tree_maps_made_for_1884_census.html
    # https://www.thoughtco.com/current-us-forest-type-density-maps-1343455

metadict_detail['|-Лиственные леса (гектар)'] = {
        # Запасы валежа в естественных насаждениях хвойно-широколиственных лесов южного Приморья
            # Тестовый участок: 28 830 га, 100-600 метров над уровнем моря
            # Среднегодовая температура: 2.5°C. Осадки: 620-890 мм. Влажность воздуха 75-80&.
            # Дуб монгольский: 36.4%; хвойные: 38.2% (кедровые 23.7%)
            # Учитывались фрагменты древесины более 2 сантиметров.
        # От 15 кубометров/гектар в лесохозяйствах, до 50-80 кубометров/гектар в старых лесах.
            # Возраст лесов: 121-165 лет (валежа 35-40 м³/га). 80 лет (валежа 80 м³/га) 
            # Распределение: 61% -- валеж, 39% -- сухостой.
            # Без гнили: 1-2 стадии разложения -- 30% валежа.
        # Леса России (2015 год)
            # Запас углерода: 123.77 ±18.93 Гт C/га
            # Сток углерода: 0.546 ±120 Гт C/га (1/227 запаса год)
        # Сбор валежника в farming, лесничества
        '|-Лиственные леса северного района (гектар)':0.2,
        '|-Широколиственные леса центрального района (гектар)':0.3,
        '|-Берёзовые леса центрального района (гектар)':0.15,
        '|-Дубовые леса центрального района (гектар)':0.3,
        '|-Ивняки центрального района (гектар)':0.05,
        #'+Валежник (доступно/кубометр)':80 / 200 * 0.5,
        }

metadict_detail['|-Хвойные леса (гектар)'] = {
        '|-Хвойные леса северо-западного района (гектар)':0.2,
        '|-Хвойные леса северо-восточного района (гектар)':0.3,
        '|-Сосновые леса южного субтропического района (гектар)':0.5,
        #'+Валежник (доступно/кубометр)':80 / 200 * 0.5,
        }

metadict_detail['|-Травяные луга (гектар)'] = {
        '|-Травяные луга северного района (гектар)':0.6,
        '|-Травяные луга центрального района (гектар)':0.4,
        }

#----
# Рощи:

metadict_detail['|-Хвойные леса северо-западного района (гектар)'] = {
        # Состав указан очень приблизительно.
        '|-Сосна веймутовая (Pinus strobus) (гектар)':0.7,
        '|-Сосна жёсткая (Pinus rigida) (гектар)':0.3,
        }

metadict_detail['|-Хвойные леса северо-восточного района (гектар)'] = {
        '|-Пихта бальзамическая (Abies balsamea) (гектар)':0.7,
        '|-Туя западная (Thuja occidentalis) (гектар)':0.3,
        }

metadict_detail['|-Сосновые леса южного субтропического района (гектар)'] = {
        '|-Сосна ладанная (Pinus taeda) (гектар)':0.6,
        '|-Сосна длиннохвостая (Pinus palustris) (гектар)':0.25,
        '|-Сосна озёрная (Pinus serotina) (гектар)':0.11,
        '|-Сосна ежовая (Pinus echinata) (гектар)':0.04,
        }

metadict_detail['|-Лиственные леса северного района (гектар)'] = {
        '|-Дуб горный (Quércus montana) (гектар)':0.2,
        '|-Дуб северный (Quércus borealis) (гектар)':0.15,
        '|-Дуб бархатистый (Quércus velutina) (гектар)':0.11,
        '|-Клён серебристый (Ácer sacchárinum) (гектар)':0.21,
        '|-Бук крупнолистный (Fagus grandifolia) (гектар)':0.2,
        '|-Каштан зубчатый (Castaner dentata) (гектар)':0.09,
        '|-Кария овальная (Carya ovalis) (гектар)':0.04,
        }

metadict_detail['|-Берёзовые леса центрального района (гектар)'] = {
        '|-Берёза жёлтая (Betula lutea) (гектар)':0.6,
        '|-Черёмуха поздняя (Prúnus serotina) (гектар)':0.16,
        '|-Ильм эквианский (Ulmus equesriana) (гектар)':0.15,
        '|-Хмелеграб обыкновенный (Ostrya carpinifolia) (гектар)':0.05,
        '|-Рябина Эквестрийская (Sorbus Equestriana) (гектар)':0.04,
        }

metadict_detail['|-Дубовые леса центрального района (гектар)'] = {
        '|-Дуб белый (Quércus álba) (гектар)':0.6,
        '|-Дуб кашатоновый (Quércus prinus) (гектар)':0.18,
        '|-Дуб серповидный (Quércus falcata) (гектар)':0.12,
        '|-Дуб красный (Quércus rubra) (гектар)':0.07,
        '|-Дуб чёрный (Quércus nigra) (гектар)':0.03,
        }

metadict_detail['|-Широколиственные леса центрального района (гектар)'] = {
        '|-Клён серебристый (Ácer sacchárinum) (гектар)':0.43,
        '|-Бук крупнолистный (Fagus grandifolia) (гектар)':0.18,
        '|-Белая акация (Robonia pseudoacacia) (гектар)':0.11,
        '|-Клён ясенелистый (Ácer negundo) (гектар)':0.08,
        '|-Кария гладкая (Carya glabra) (гектар)':0.07,
        '|-Кария белая (Carya alba) (гектар)':0.05,
        '|-Кария пекан (Carya illinoinensis) (гектар)':0.05,
        '|-Каштан посевной (Castaner sativa) (гектар)':0.04,
        }

metadict_detail['|-Ивняки центрального района (гектар)'] = {
        '|-Ива чёрная (Salix nigra) (гектар)':1,
        }

metadict_detail['|-Травяные луга северного района (гектар)'] = {
        # Редколесье, лесостепи, отдельные деревья.
        # Плотность деревьев 1/100 от лесной.
        '|-Дуб горный (Quércus montana) (гектар)':0.002,
        '|-Дуб северный (Quércus borealis) (гектар)':0.0015,
        '|-Дуб бархатистый (Quércus velutina) (гектар)':0.0011,
        '|-Клён серебристый (Ácer sacchárinum) (гектар)':0.0021,
        '|-Бук крупнолистный (Fagus grandifolia) (гектар)':0.002,
        '|-Каштан зубчатый (Castaner dentata) (гектар)':0.0009,
        '|-Кария овальная (Carya ovalis) (гектар)':0.0004,
        }

metadict_detail['|-Травяные луга центрального района (гектар)'] = {
        '|-Клён серебристый (Ácer sacchárinum) (гектар)':0.0043,
        '|-Бук крупнолистный (Fagus grandifolia) (гектар)':0.0018,
        '|-Белая акация (Robonia pseudoacacia) (гектар)':0.0011,
        '|-Клён ясенелистый (Ácer negundo) (гектар)':0.0008,
        '|-Кария гладкая (Carya glabra) (гектар)':0.0007,
        '|-Кария белая (Carya alba) (гектар)':0.0005,
        '|-Кария пекан (Carya illinoinensis) (гектар)':0.0005,
        '|-Каштан посевной (Castaner sativa) (гектар)':0.0004,
        }

#----
# Растения:

metadict_detail['|-Белая акация (Robonia pseudoacacia) (гектар)'] = {
        # TODO:.
            # Вообще-то густота растений на гектар очень разная.
            # Но пока пусть будет средней.
            # Кстати, можно посчитать медоносы.
            # Можно разделить растения на взрослые и молодые.
        '|-Белая акация (Robonia pseudoacacia)':250,
        }

metadict_detail['|-Берёза жёлтая (Betula lutea) (гектар)'] = {
        '|-Берёза жёлтая (Betula lutea)':250,
        }

metadict_detail['|-Бук крупнолистный (Fagus grandifolia) (гектар)'] = {
        '|-Бук крупнолистный (Fagus grandifolia)':250,
        }

metadict_detail['|-Дуб бархатистый (Quércus velutina) (гектар)'] = {
        '|-Дуб бархатистый (Quércus velutina)':250,
        }

metadict_detail['|-Дуб белый (Quércus álba) (гектар)'] = {
        '|-Дуб белый (Quércus álba)':250,
        }

metadict_detail['|-Дуб горный (Quércus montana) (гектар)'] = {
        '|-Дуб горный (Quércus montana)':250,
        }

metadict_detail['|-Дуб кашатоновый (Quércus prinus) (гектар)'] = {
        '|-Дуб кашатоновый (Quércus prinus)':250,
        }

metadict_detail['|-Дуб красный (Quércus rubra) (гектар)'] = {
        '|-Дуб красный (Quércus rubra)':250,
        }

metadict_detail['|-Дуб северный (Quércus borealis) (гектар)'] = {
        '|-Дуб северный (Quércus borealis)':250,
        }

metadict_detail['|-Дуб серповидный (Quércus falcata) (гектар)'] = {
        '|-Дуб серповидный (Quércus falcata)':250,
        }

metadict_detail['|-Дуб чёрный (Quércus nigra) (гектар)'] = {
        '|-Дуб чёрный (Quércus nigra)':250,
        }

metadict_detail['|-Ива чёрная (Salix nigra) (гектар)'] = {
        '|-Ива чёрная (Salix nigra)':250,
        }

metadict_detail['|-Ильм эквианский (Ulmus equesriana) (гектар)'] = {
        '|-Ильм эквианский (Ulmus equesriana)':250,
        }

metadict_detail['|-Кария белая (Carya alba) (гектар)'] = {
        '|-Кария белая (Carya alba)':250,
        }

metadict_detail['|-Кария пекан (Carya illinoinensis) (гектар)'] = {
        '|-Кария пекан (Carya illinoinensis)':250,
        }

metadict_detail['|-Кария гладкая (Carya glabra) (гектар)'] = {
        '|-Кария гладкая (Carya glabra)':250,
        }

metadict_detail['|-Каштан зубчатый (Castaner dentata) (гектар)'] = {
        '|-Каштан зубчатый (Castaner dentata)':250,
        }

metadict_detail['|-Каштан посевной (Castaner sativa) (гектар)'] = {
        '|-Каштан посевной (Castaner sativa)':250,
        }

metadict_detail['|-Кария овальная (Carya ovalis) (гектар)'] = {
        '|-Кария овальная (Carya ovalis)':250,
        }

metadict_detail['|-Клён серебристый (Ácer sacchárinum) (гектар)'] = {
        '|-Клён серебристый (Ácer sacchárinum)':250,
        }

metadict_detail['|-Клён ясенелистый (Ácer negundo) (гектар)'] = {
        '|-Клён ясенелистый (Ácer negundo)':250,
        }

metadict_detail['|-Пихта бальзамическая (Abies balsamea) (гектар)'] = {
        '|-Пихта бальзамическая (Abies balsamea)':250,
        }

metadict_detail['|-Сосна веймутовая (Pinus strobus) (гектар)'] = {
        '|-Сосна веймутовая (Pinus strobus)':250,
        }

metadict_detail['|-Сосна длиннохвостая (Pinus palustris) (гектар)'] = {
        '|-Сосна длиннохвостая (Pinus palustris)':250,
        }

metadict_detail['|-Сосна ежовая (Pinus echinata) (гектар)'] = {
        '|-Сосна ежовая (Pinus echinata)':250,
        }

metadict_detail['|-Сосна жёсткая (Pinus rigida) (гектар)'] = {
        '|-Сосна жёсткая (Pinus rigida)':250,
        }

metadict_detail['|-Сосна ладанная (Pinus taeda) (гектар)'] = {
        '|-Сосна ладанная (Pinus taeda)':250,
        }

metadict_detail['|-Сосна озёрная (Pinus serotina) (гектар)'] = {
        '|-Сосна озёрная (Pinus serotina)':250,
        }

metadict_detail['|-Туя западная (Thuja occidentalis) (гектар)'] = {
        '|-Туя западная (Thuja occidentalis)':250,
        }

metadict_detail['|-Хмелеграб обыкновенный (Ostrya carpinifolia) (гектар)'] = {
        '|-Хмелеграб обыкновенный (Ostrya carpinifolia)':250,
        }

metadict_detail['|-Черёмуха поздняя (Prúnus serotina) (гектар)'] = {
        '|-Черёмуха поздняя (Prúnus serotina)':250,
        }

metadict_detail['|-Рябина Эквестрийская (Sorbus Equestriana) (гектар)'] = {
        '|-Рябина Эквестрийская (Sorbus Equestriana)':250,
        }

#----
# Растения (упрощение):

metadict_detail['|-Белая акация (Robonia pseudoacacia)'] = {
        '|--Дровяные деревья':1 / 10,
        }

metadict_detail['|-Берёза жёлтая (Betula lutea)'] = {
        '|--Дровяные деревья':1 / 10,
        }

metadict_detail['|-Бук крупнолистный (Fagus grandifolia)'] = {
        '|--Дровяные деревья':1 / 10,
        }

metadict_detail['|-Дуб бархатистый (Quércus velutina)'] = {
        '|--Строевые деревья':1 / 50,
        }

metadict_detail['|-Дуб белый (Quércus álba)'] = {
        '|--Строевые деревья':1 / 50,
        }

metadict_detail['|-Дуб горный (Quércus montana)'] = {
        '|--Строевые деревья':1 / 50,
        }

metadict_detail['|-Дуб кашатоновый (Quércus prinus)'] = {
        '|--Строевые деревья':1 / 50,
        }

metadict_detail['|-Дуб красный (Quércus rubra)'] = {
        '|--Строевые деревья':1 / 50,
        }

metadict_detail['|-Дуб северный (Quércus borealis)'] = {
        '|--Строевые деревья':1 / 50,
        }

metadict_detail['|-Дуб серповидный (Quércus falcata)'] = {
        '|--Строевые деревья':1 / 50,
        }

metadict_detail['|-Дуб чёрный (Quércus nigra)'] = {
        '|--Строевые деревья':1 / 50,
        }

metadict_detail['|-Ива чёрная (Salix nigra)'] = {
        '|--Прутовые деревья':1 / 5,
        }

metadict_detail['|-Ильм эквианский (Ulmus equesriana)'] = {
        '|--Дровяные деревья':1 / 10,
        }

metadict_detail['|-Кария белая (Carya alba)'] = {
        '|--Дровяные деревья':1 / 10,
        }

metadict_detail['|-Кария пекан (Carya illinoinensis)'] = {
        '|-Кария пекан (Carya illinoinensis) (орехи)':1,
        '|--Дровяные деревья':1 / 10,
        }

metadict_detail['|-Кария гладкая (Carya glabra)'] = {
        '|--Дровяные деревья':1 / 10,
        }

metadict_detail['|-Кария овальная (Carya ovalis)'] = {
        '|--Дровяные деревья':1 / 10,
        }

metadict_detail['|-Каштан зубчатый (Castaner dentata)'] = {
        '|--Дровяные деревья':1 / 10,
        }

metadict_detail['|-Каштан посевной (Castaner sativa)'] = {
        '|-Каштан посевной (Castaner sativa) (орехи)':1,
        '|--Дровяные деревья':1 / 10,
        }

metadict_detail['|-Клён серебристый (Ácer sacchárinum)'] = {
        # 10% деревьев ранят для сбора сока.
        '|--Клён серебристый (Ácer sacchárinum) (кленовый сок)':1 / 10,
        '|--Дровяные деревья':1 / 10,
        }

metadict_detail['|-Клён ясенелистый (Ácer negundo)'] = {
        '|--Дровяные деревья':1 / 10,
        }

metadict_detail['|-Пихта бальзамическая (Abies balsamea)'] = {
        '|--Дровяные деревья':1 / 10,
        }

metadict_detail['|-Сосна веймутовая (Pinus strobus)'] = {
        '|--Строевые деревья':1 / 50,
        }

metadict_detail['|-Сосна длиннохвостая (Pinus palustris)'] = {
        '|--Строевые деревья':1 / 50,
        }

metadict_detail['|-Сосна ежовая (Pinus echinata)'] = {
        '|--Строевые деревья':1 / 50,
        }

metadict_detail['|-Сосна жёсткая (Pinus rigida)'] = {
        '|--Строевые деревья':1 / 50,
        }

metadict_detail['|-Сосна ладанная (Pinus taeda)'] = {
        '|--Строевые деревья':1 / 50,
        }

metadict_detail['|-Сосна озёрная (Pinus serotina)'] = {
        '|--Строевые деревья':1 / 50,
        }

metadict_detail['|-Туя западная (Thuja occidentalis)'] = {
        '|--Дровяные деревья':1 / 10,
        }

metadict_detail['|-Хмелеграб обыкновенный (Ostrya carpinifolia)'] = {
        '|--Дровяные деревья':1 / 10,
        }

metadict_detail['|-Черёмуха поздняя (Prúnus serotina)'] = {
        # Испраивить
            # Плодовое дерево, дикорос
        '|--Дровяные деревья':1 / 10,
        }

metadict_detail['|-Яблоня карликовая (Malus pumila)'] = {
        '|--Плодовые деревья':1 / 1.1,
        }

metadict_detail['|-Кофе робуста (Coffea robusta)'] = {
        '|--Плодовые деревья':1 / 1.1,
        }

metadict_detail['|-Фисташка (Pistácia)'] = {
        '|--Плодовые деревья':1 / 1.1,
        }

metadict_detail['|-Миндаль обыкновенный (Prunus dulcis)'] = {
        '|--Плодовые деревья':1 / 1.1,
        }

metadict_detail['|-Виноград культурный (Vítis vinífera)'] = {
        # Молодых деревьев примерно 10% от общего числа.
        '|--Плодовые деревья':1 / 1.1,
        }

metadict_detail['|-Рябина Эквестрийская (Sorbus Equestriana)'] = {
        # Плодоносит 75% сада.
        '|--Плодовые деревья':1 / 1.25,
        }

metadict_detail['|-Груша обыкновенная (Pýrus commúnis)'] = {
        '|--Плодовые деревья':1 / 1.1,
        }

metadict_detail['|-Хурма Эквестрийская (Diospyros Virginiana)'] = {
        '|--Плодовые деревья':1 / 1.1,
        }

metadict_detail['|-Айва Эквестрийская (Cydōnia Equestriana)'] = {
        '|--Плодовые деревья':1 / 1.1,
        }

metadict_detail['|-Олива Эквестрийская (Olea Equestriana)'] = {
        '|--Плодовые деревья':1 / 1.1,
        }

metadict_detail['|-Лимон (Cítrus límon)'] = {
        '|--Плодовые деревья':1 / 1.1,
        }

metadict_detail['|-Вишня обыкновенная (Prúnus cérasus)'] = {
        '|--Плодовые деревья':1 / 1.1,
        }

metadict_detail['|-Черешня (Prúnus ávium)'] = {
        '|--Плодовые деревья':1 / 1.1,
        }

metadict_detail['|-Абрикос Эквестрийский (Prúnus Equestriana)'] = {
        '|--Плодовые деревья':1 / 1.1,
        }

metadict_detail['|-Персик Эквестрийский (Prúnus Equestriana)'] = {
        '|--Плодовые деревья':1 / 1.1,
        }

metadict_detail['|-Слива домашняя (Prúnus doméstica)'] = {
        '|--Плодовые деревья':1 / 1.1,
        }

metadict_detail['|-Фиговое дерево (Fícus cárica)'] = {
        '|--Плодовые деревья':1 / 1.1,
        }

metadict_detail['|-Финик пальчатый (Phoenix dactylifera)'] = {
        '|--Плодовые деревья':1 / 1.1,
        }

metadict_detail['|-Гранат (Punica)'] = {
        '|--Плодовые деревья':1 / 1.1,
        }

#----
# Растения (ресурсы):

metadict_detail['|--Клён серебристый (Ácer sacchárinum) (кленовый сок)'] = {
        # Сезон длится 15 дней (март-апрель),
        # с дерева 40 литров; 4 отверстия, 2 литра/день (5 дней, 1/3 сезона).
        '+Сок кленовый (доступно/килограмм)':40,
        }

metadict_army['|-Кария пекан (Carya illinoinensis) (орехи)'] = {
        '+Дикорастущие орехи (пекан) (доступно/килограмм)':50,
        }

metadict_army['|-Каштан посевной (Castaner sativa) (орехи)'] = {
        # Урожайность одного взрослого каштанового дерева в среднем 100—200 кг.
        # Общий запас стволовой древесины каштанников 350 - 600 м³/га
        # Средний урожай плодов в каштановом лесу — до 1 т/га
        '+Дикорастущие орехи (каштан) (доступно/килограмм)':50,
        }
