#----
# Североморский рацион:
    # МР 2.3.1.2432-08 Нормы физиологических потребностей в энергии и пищевых веществах
        # http://rospotrebnadzor.ru/documents/details.php?ELEMENT_ID=4583
        # http://files.stroyinf.ru/Data2/1/4293756/4293756229.pdf
    # Климат на параллели Сталлионград-Мэйнхеттен подобен канадскому Онтарио
        # https://ru.wikipedia.org/wiki/Влажный_континентальный_климат
    # Typical Crop Availability - When to Pick in Ontario, Canada
        # http://www.pickyourown.org/CAONharvestcalendar.htm
    # Великорусский пахарь и особенности российского исторического процесса -- глава 11
        # https://www.gumer.info/bibliotek_Buks/History/milov/01_11.php
    # Питание русских крестьян Верхнего Приобья (конец XIX — первая треть XX вв.)
        # http://zaimka.ru/mainicheva-russians/
    # Питание переселенцев из Белоруссии в Сибири (конец XIX — первая треть XX вв.)
        # http://zaimka.ru/mainicheva-belorussians/
    # Питание колхозников Свердловской области в 1946,1947 гг. (сезонность фруктов/овощей)
        # http://istmat.info/node/22066

metadict_detail['Североморский рацион (пони/год)'] = {
        'Североморский весенний рацион (пони/день)':90,
        'Североморский летний рацион (пони/день)':90,
        'Североморский осенний рацион (пони/день)':90,
        'Североморский зимний рацион (пони/день)':90,
        }

#----
# Североморский рацион (времена года):

metadict_detail['Североморский весенний рацион (пони/день)'] = {
        # В эквестрийской неделе -- 6 дней
        'Североморский весенний повседневный рацион (пони/день)':5 / 6,
        'Североморский весенний праздничный рацион (пони/день)':1 / 6,
        }

metadict_detail['Североморский летний рацион (пони/день)'] = {
        'Североморский летний повседневный рацион (пони/день)':5 / 6,
        'Североморский летний праздничный рацион (пони/день)':1 / 6,
        }

metadict_detail['Североморский зимний рацион (пони/день)'] = {
        'Североморский зимний повседневный рацион (пони/день)':5 / 6,
        'Североморский зимний праздничный рацион (пони/день)':1 / 6,
        }

metadict_detail['Североморский осенний рацион (пони/день)'] = {
        'Североморский осенний повседневный рацион (пони/день)':5 / 6,
        'Североморский осенний праздничный рацион (пони/день)':1 / 6,
        }

#----
# Североморский рацион (дни недели):

metadict_detail['Североморский весенний повседневный рацион (пони/день)'] = {
        'Североморский весенний повседневный завтрак':1,
        'Североморский весенний повседневный обед':1,
        'Североморский весенний повседневный ужин':1,
        'Североморское весеннее повседневное питьё v1':3 / 3,
        'Североморское весеннее повседневное питьё v2':3 / 3,
        'Североморское весеннее повседневное питьё v3':3 / 3,
        }

metadict_detail['Североморский весенний праздничный рацион (пони/день)'] = {
        'Североморский весенний праздничный завтрак':1,
        'Североморский весенний праздничный обед':1,
        'Североморский весенний праздничный ужин':1,
        'Североморское весеннее праздничное питьё v1':3 / 3,
        'Североморское весеннее праздничное питьё v2':3 / 3,
        'Североморское весеннее праздничное питьё v3':3 / 3,
        }

metadict_detail['Североморский зимний повседневный рацион (пони/день)'] = {
        'Североморский зимний повседневный завтрак':1,
        'Североморский зимний повседневный обед':1,
        'Североморский зимний повседневный ужин':1,
        'Североморское зимнее повседневное питьё v1':3 / 3,
        'Североморское зимнее повседневное питьё v2':3 / 3,
        'Североморское зимнее повседневное питьё v3':3 / 3,
        }

metadict_detail['Североморский зимний праздничный рацион (пони/день)'] = {
        'Североморский зимний праздничный завтрак':1,
        'Североморский зимний праздничный обед':1,
        'Североморский зимний праздничный ужин':1,
        'Североморское зимнее праздничное питьё v1':3 / 3,
        'Североморское зимнее праздничное питьё v2':3 / 3,
        'Североморское зимнее праздничное питьё v3':3 / 3,
        }

metadict_detail['Североморский летний повседневный рацион (пони/день)'] = {
        'Североморский летний повседневный завтрак':1,
        'Североморский летний повседневный обед':1,
        'Североморский летний повседневный ужин':1,
        'Североморское летнее повседневное питьё v1':3 / 3,
        'Североморское летнее повседневное питьё v2':3 / 3,
        'Североморское летнее повседневное питьё v3':3 / 3,
        }

metadict_detail['Североморский летний праздничный рацион (пони/день)'] = {
        'Североморский летний праздничный завтрак':1,
        'Североморский летний праздничный обед':1,
        'Североморский летний праздничный ужин':1,
        'Североморское летнее праздничное питьё v1':3 / 3,
        'Североморское летнее праздничное питьё v2':3 / 3,
        'Североморское летнее праздничное питьё v3':3 / 3,
        }

metadict_detail['Североморский осенний повседневный рацион (пони/день)'] = {
        'Североморский осенний повседневный завтрак':1,
        'Североморский осенний повседневный обед':1,
        'Североморский осенний повседневный ужин':1,
        'Североморское осеннее повседневное питьё v1':3 / 3,
        'Североморское осеннее повседневное питьё v2':3 / 3,
        'Североморское осеннее повседневное питьё v3':3 / 3,
        }

metadict_detail['Североморский осенний праздничный рацион (пони/день)'] = {
        'Североморский осенний праздничный завтрак':1,
        'Североморский осенний праздничный обед':1,
        'Североморский осенний праздничный ужин':1,
        'Североморское осеннее праздничное питьё v1':3 / 3,
        'Североморское осеннее праздничное питьё v2':3 / 3,
        'Североморское осеннее праздничное питьё v3':3 / 3,
        }

#----
# Североморский рацион (весна):
    # Март, апрель, май

metadict_detail['Североморский весенний повседневный завтрак'] = {
        'Хлеб ячменный домашний (грамм)':50 * 2,
        'Тюря с одуванчиком (грамм)':200,
        'Каша гороховая (грамм)':200,
        'Пюре картофельно-редисовое (грамм)':100,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо первое холодное (200-грамм/порция)':1,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        }

metadict_detail['Североморский весенний повседневный обед'] = {
        'Хлеб ржаной домашний (грамм)':50 * 4,
        'Похлёбка чечевичная (грамм)':200,
        'Топинамбур печёный с чесноком (грамм)':200,
        'Салат из печёной свёклы со спаржей и редисом (грамм)':100,
        '||Хлеб (50-грамм/порция)':4,
        '||Блюдо первое горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе холодное (100-грамм/порция)':1,
        }

metadict_detail['Североморский весенний повседневный ужин'] = {
        'Блины ржаные (грамм)':50 * 2,
        'Каша гречневая (грамм)':200,
        'Фрукты мочёные североморские (грамм)':100,
        '||Выпечка (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Фрукты консервированные (100-грамм/порция)':1,
        }

metadict_detail['Североморское весеннее повседневное питьё v1'] = {
        'Чай чёрный (грамм)':200 * 2,
        'Пирожки с картофелем и спаржей (грамм)':50,
        'Пирожки морковные (грамм)':50,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':2,
        }

metadict_detail['Североморское весеннее повседневное питьё v2'] = {
        'Квас ржаной солодовый (грамм)':200 * 2,
        'Пастила яблочная (грамм)':10 * 2,
        '||Питьё холодное (200-грамм/порция)':2,
        '||Сладости (10-грамм/порция)':2,
        }

metadict_detail['Североморское весеннее повседневное питьё v3'] = {
        'Чай травяной (грамм)':200 * 2,
        'Оладьи овсяные с вишнёвым вареньем (грамм)':50 * 2,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка жареная (50-грамм/порция)':2,
        }

metadict_detail['Североморский весенний праздничный завтрак'] = {
        'Блины пшенично-ореховые со сморчками (грамм)':50 * 2,
        'Похлёбка репяная (грамм)':200,
        'Фасоль тушёная с луком (грамм)':200,
        'Винегрет с боровиками (грамм)':200,
        '||Выпечка жареная (50-грамм/порция)':2,
        '||Блюдо первое горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе холодное (200-грамм/порция)':1,
        }

metadict_detail['Североморский весенний праздничный обед'] = {
        'Оладьи гречневые (грамм)':50 * 2,
        'Щи из квашеной капусты с грибами (грамм)':200,
        'Картофель тушёный со спаржей (грамм)':200,
        'Сморчки тушёные (грамм)':100,
        'Закуска из квашеной капусты (грамм)':100,
        'Пудинг хлебный с земляникой (грамм)':100,
        '||Выпечка жареная (50-грамм/порция)':2,
        '||Блюдо первое горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        '||Антреме холодное (100-грамм/порция)':1,
        '||Десерт горячий (100-грамм/порция)':1,
        }

metadict_detail['Североморский весенний праздничный ужин'] = {
        'Пирожки картофельные со сморчками (грамм)':50 * 2,
        'Каша горохово-гречневая (грамм)':200,
        'Морошка мочёная (грамм)':100,
        '||Выпечка (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Фрукты консервированные (100-грамм/порция)':1,
        }

metadict_detail['Североморское весеннее праздничное питьё v1'] = {
        'Чай травяной с кленовым сиропом (грамм)':200 * 2,
        'Оладьи овсяные с одуванчиковым вареньем (грамм)':50 * 2,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка жареная (50-грамм/порция)':2,
        }

metadict_detail['Североморское весеннее праздничное питьё v2'] = {
        'Медовуха вишнёвая (грамм)':200,
        'Пирожки жареные с маком (грамм)':50 * 2,
        '||Питьё холодное (200-грамм/порция)':1,
        '||Выпечка жареная (50-грамм/порция)':2,
        }

metadict_detail['Североморское весеннее праздничное питьё v3'] = {
        'Чай травяной (грамм)':200 * 2,
        'Оладьи овсяные с кленовым сиропом (грамм)':50 * 2,
        '||Питьё холодное (200-грамм/порция)':1,
        '||Выпечка жареная (50-грамм/порция)':2,
        }

#----
# Североморский рацион (лето):
    # Июнь, июль, август

metadict_detail['Североморский летний повседневный завтрак'] = {
        # Лето, это страда, 130 дней работы по 10-12 часов для большинства северян-земнопони.
        # Питание должно быть усиленным и неизбежно простым.
        'Хлеб ячменный домашний (грамм)':50 * 2,
        'Окрошка с варёными грибами (грамм)':200,
        'Каша чечевичная (грамм)':200,
        'Капуста тушёная (грамм)':100,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо первое холодное (200-грамм/порция)':1,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        }

metadict_detail['Североморский летний повседневный обед'] = {
        'Хлеб ржаной домашний (грамм)':50 * 4,
        'Похлёбка гороховая (грамм)':200,
        'Картофель печёный (грамм)':200,
        'Салат из печёной репы с черникой (грамм)':100,
        '||Хлеб (50-грамм/порция)':4,
        '||Блюдо первое горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе холодное (100-грамм/порция)':1,
        }

metadict_detail['Североморский летний повседневный ужин'] = {
        'Блины пшенично-гречневые (грамм)':50 * 2,
        'Каша ячнево-гороховая (грамм)':200,
        'Фрукты летние североморские (грамм)':200,
        '||Выпечка (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Фрукты свежие (200-грамм/порция)':1,
        }

metadict_detail['Североморское летнее повседневное питьё v1'] = {
        'Чай травяной (грамм)':200 * 2,
        'Пирожки с ревенем (грамм)':50 * 2,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':2,
        }

metadict_detail['Североморское летнее повседневное питьё v2'] = {
        'Квас ржаной солодовый (грамм)':200 * 2,
        'Пирожки черничные (грамм)':50 * 2,
        '||Питьё холодное (200-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':2,
        }

metadict_detail['Североморское летнее повседневное питьё v3'] = {
        'Кисель овсяной жидкий (грамм)':200 * 2,
        'Орешки кедровые (грамм)':10 * 2,
        '||Питьё холодное (200-грамм/порция)':2,
        '||Орешки (10-грамм/порция)':2,
        }

metadict_detail['Североморский летний праздничный завтрак'] = {
        'Блины пшенично-ореховые с боровиками (грамм)':50 * 2,
        'Ботвинья-свекольник (грамм)':200,
        'Лечо со сладким перцем (грамм)':200,
        'Салат зелёный огуречно-томатный (грамм)':200,
        '||Выпечка жареная (50-грамм/порция)':2,
        '||Блюдо первое холодное (200-грамм/порция)':1,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе холодное (200-грамм/порция)':1,
        }

metadict_detail['Североморский летний праздничный обед'] = {
        'Хлеб ржаной с семечками и клюквой (грамм)':50 * 2,
        'Щи зелёные с гречкой (грамм)':200,
        'Картофель тушёный с яблоками (грамм)':200,
        'Перец фаршированный овощами (грамм)':100,
        'Салат из свежей свёклы (грамм)':100,
        'Суфле сливово-медовое (грамм)':50,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо первое горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        '||Антреме холодное (100-грамм/порция)':1,
        '||Десерт горячий (50-грамм/порция)':1,
        }

metadict_detail['Североморский летний праздничный ужин'] = {
        'Пирожки с боровиками (грамм)':50 * 2,
        'Каша перловая с овощами (грамм)':200,
        'Смородина отборная (грамм)':100,
        '||Выпечка (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Фрукты свежие (100-грамм/порция)':1,
        }

metadict_detail['Североморское летнее праздничное питьё v1'] = {
        'Чай травяной (грамм)':200 * 2,
        'Оладьи овсяные со смородиновым вареньем (грамм)':50 * 2,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка жареная (50-грамм/порция)':2,
        }

metadict_detail['Североморское летнее праздничное питьё v2'] = {
        'Сок вишнёвый (грамм)':200,
        'Пирожки земляничные (грамм)':50 * 2,
        '||Питьё холодное (200-грамм/порция)':1,
        '||Выпечка (50-грамм/порция)':2,
        }

metadict_detail['Североморское летнее праздничное питьё v3'] = {
        'Квас ржаной имбирно-яблочный (грамм)':200 * 2,
        'Кисель из ревеня (грамм)':100,
        '||Питьё холодное (200-грамм/порция)':2,
        '||Десерт холодный (100-грамм/порция)':1,
        }


#----
# Североморский рацион (осень):
    # Сентябрь, октябрь, ноябрь

metadict_detail['Североморский осенний повседневный завтрак'] = {
        'Лепёшки ржаные с жареным луком (грамм)':50 * 2,
        'Тюря томатная с сельдереем (грамм)':200,
        'Топинамбур тушёный с фасолью (грамм)':200,
        'Капуста тушёная (грамм)':100,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо первое холодное (200-грамм/порция)':1,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        }

metadict_detail['Североморский осенний повседневный обед'] = {
        'Хлеб ржаной домашний (грамм)':50 * 4,
        'Борщ с фасолью и томатами (грамм)':200,
        'Тыква фаршированная лечо и чечевицей (грамм)':200,
        'Салат из печёной брюквы с кедровыми орешками (грамм)':100,
        '||Хлеб (50-грамм/порция)':4,
        '||Блюдо первое горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе холодное (100-грамм/порция)':1,
        }

metadict_detail['Североморский осенний повседневный ужин'] = {
        'Оладьи картофельные (грамм)':50 * 2,
        'Каша овсяная (грамм)':100,
        'Кулага с калиной (грамм)':100,
        'Фрукты осенние североморские (грамм)':200,
        '||Выпечка жареная (50-грамм/порция)':2,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        '||Десерт горячий (100-грамм/порция)':1,
        '||Фрукты свежие (200-грамм/порция)':1,
        }

metadict_detail['Североморское осеннее повседневное питьё v1'] = {
        'Чай травяной с мёдом (грамм)':200 * 2,
        'Пирожки с капустой (грамм)':50,
        'Пирожки яблочные (грамм)':50,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':2,
        }

metadict_detail['Североморское осеннее повседневное питьё v2'] = {
        'Чай травяной (грамм)':200 * 2,
        'Кисель овсяной с мёдом (грамм)':100,
        'Пастила сливовая (грамм)':10 * 2,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Десерт холодный (100-грамм/порция)':1,
        '||Сладости (10-грамм/порция)':2,
        }

metadict_detail['Североморское осеннее повседневное питьё v3'] = {
        'Сок яблочный (грамм)':200,
        'Пирожки с грушей (грамм)':50 * 2,
        '||Питьё холодное (200-грамм/порция)':1,
        '||Выпечка (50-грамм/порция)':2,
        }

metadict_detail['Североморский осенний праздничный завтрак'] = {
        'Оладьи овсяные с клюквенным вареньем (грамм)':50 * 2,
        'Похлёбка картофельная со свежей зеленью (грамм)':200,
        'Тыква фаршированная гречкой и грибами (грамм)':200,
        'Салат зелёный томатный со сладким перцем (грамм)':200,
        '||Выпечка жареная (50-грамм/порция)':2,
        '||Блюдо первое горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе холодное (200-грамм/порция)':1,
        }

metadict_detail['Североморский осенний праздничный обед'] = {
        'Оладьи кабачковые (грамм)':50 * 4,
        'Щи томатно-луковые с грибами (грамм)':200,
        'Картофель тушёный с морковью (грамм)':200,
        'Голубцы фаршированные овощами (грамм)':100,
        'Винегрет с зелёным горошком (грамм)':100,
        'Яблоко печёное с мёдом (грамм)':100,
        '||Выпечка жареная (50-грамм/порция)':4,
        '||Блюдо первое горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        '||Антреме холодное (100-грамм/порция)':1,
        '||Десерт горячий (100-грамм/порция)':1,
        }

metadict_detail['Североморский осенний праздничный ужин'] = {
        'Пирожки картофельные с боровиками (грамм)':50 * 2,
        'Каша перловая на ореховом молоке (грамм)':200,
        'Морошка отборная (грамм)':100,
        '||Выпечка жареная (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Фрукты свежие (100-грамм/порция)':1,
        }

metadict_detail['Североморское осеннее праздничное питьё v1'] = {
        'Чай травяной (грамм)':200 * 2,
        'Оладьи овсяные с рябиновым вареньем (грамм)':50 * 2,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка жареная (50-грамм/порция)':2,
        }

metadict_detail['Североморское осеннее праздничное питьё v2'] = {
        'Морс клюквенный (грамм)':200,
        'Булочки пшеничные с маком (грамм)':50 * 2,
        '||Питьё холодное (200-грамм/порция)':1,
        '||Выпечка (50-грамм/порция)':2,
        }

metadict_detail['Североморское осеннее праздничное питьё v3'] = {
        'Компот из сушёной черники (грамм)':200,
        'Суфле яблочно-медовое (грамм)':50,
        '||Питьё горячее (200-грамм/порция)':1,
        '||Десерт горячий (50-грамм/порция)':1,
        }

#----
# Североморский рацион (зима):
    # Декабрь, январь, февраль

metadict_detail['Североморский зимний повседневный завтрак'] = {
        'Хлеб ячменный домашний (грамм)':50 * 2,
        'Тюря с редькой (грамм)':200,
        'Каша фасолевая (грамм)':200,
        'Пюре брюквенное (грамм)':100,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо первое холодное (200-грамм/порция)':1,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        }

metadict_detail['Североморский зимний повседневный обед'] = {
        # TODO:
            # Фаршированная репа, это весьма трудоёмкое блюдо. Для праздников.
        'Хлеб ржаной домашний (грамм)':50 * 4,
        'Щи из квашеной капусты (грамм)':200 * 2,
        'Репа фаршированная горохом (грамм)':200,
        'Винегрет с чечевицей (грамм)':100,
        '||Хлеб (50-грамм/порция)':4,
        '||Блюдо первое горячее (200-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе холодное (100-грамм/порция)':1,
        }

metadict_detail['Североморский зимний повседневный ужин'] = {
        'Оладьи картофельные (грамм)':50 * 2,
        'Каша ячневая (грамм)':200,
        'Фрукты мочёные североморские (грамм)':100,
        '||Выпечка жареная (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Фрукты консервированные (100-грамм/порция)':1,
        }

metadict_detail['Североморское зимнее повседневное питьё v1'] = {
        'Чай травяной с мёдом (грамм)':200 * 2,
        'Пирожки с картофелем (грамм)':50,
        'Пирожки морковные (грамм)':50,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':2,
        }

metadict_detail['Североморское зимнее повседневное питьё v2'] = {
        'Молоко из орехов карии с мёдом (грамм)':200,
        'Пастила яблочная (грамм)':10 * 2,
        '||Питьё горячее (200-грамм/порция)':1,
        '||Сладости (10-грамм/порция)':2,
        }

metadict_detail['Североморское зимнее повседневное питьё v3'] = {
        'Чай травяной (грамм)':200 * 2,
        'Пирожки тыквенные (грамм)':50 * 2,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':2,
        }

metadict_detail['Североморский зимний праздничный завтрак'] = {
        'Оладьи овсяные с мёдом (грамм)':50 * 2,
        'Похлёбка луковая (грамм)':200,
        'Запеканка картофельная с боровиками (грамм)':200,
        'Винегрет с мочёными фруктами (грамм)':200,
        '||Выпечка жареная (50-грамм/порция)':2,
        '||Блюдо первое горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе холодное (200-грамм/порция)':1,
        }

metadict_detail['Североморский зимний праздничный обед'] = {
        'Хлеб ржаной с семечками и клюквой (грамм)':50 * 2,
        'Щи из квашеной репы (грамм)':200,
        'Картофель тушёный с боровиками (грамм)':200,
        'Голубцы с гречкой и луком (грамм)':100,
        'Салат из солёных кабачков (грамм)':100,
        'Яблоко печёное с мёдом (грамм)':100,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо первое горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        '||Антреме холодное (100-грамм/порция)':1,
        '||Десерт горячий (100-грамм/порция)':1,
        }

metadict_detail['Североморский зимний праздничный ужин'] = {
        'Пирожки гороховые (грамм)':50 * 2,
        'Каша гречневая с грибами (грамм)':200,
        'Слива мочёная (грамм)':100,
        '||Выпечка (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Фрукты консервированные (100-грамм/порция)':1,
        }

metadict_detail['Североморское зимнее праздничное питьё v1'] = {
        'Чай травяной (грамм)':200 * 2,
        'Оладьи овсяные с яблочным сиропом (грамм)':50 * 2,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка жареная (50-грамм/порция)':2,
        }

metadict_detail['Североморское зимнее праздничное питьё v2'] = {
        # TODO:
            # Мёд к мёду, а ещё намазать на мёд.
            # Но заварное тесто для пряников готовится месяцы! Ферментация же.
        'Медовуха вишнёвая (грамм)':200,
        'Пряники медовые (грамм)':50,
        '||Питьё холодное (200-грамм/порция)':1,
        '||Выпечка (50-грамм/порция)':1,
        }

metadict_detail['Североморское зимнее праздничное питьё v3'] = {
        'Компот из сушёной смородины (грамм)':200,
        'Мусс из орехов карии с мёдом (грамм)':100,
        '||Питьё горячее (200-грамм/порция)':1,
        '||Десерт холодный (100-грамм/порция)':1,
        }
