#----
# Среднеземный рацион:

metadict_detail['Среднеземный рацион (пони/год)'] = {
        'Среднеземный весенний рацион (пони/день)':90,
        'Среднеземный летний рацион (пони/день)':90,
        'Среднеземный осенний рацион (пони/день)':90,
        'Среднеземный зимний рацион (пони/день)':90,
        }

#----
# Среднеземный рацион (времена года):

metadict_detail['Среднеземный весенний рацион (пони/день)'] = {
        # В эквестрийской неделе -- 6 дней
        'Среднеземный весенний повседневный рацион (пони/день)':5 / 6,
        'Среднеземный весенний праздничный рацион (пони/день)':1 / 6,
        }

metadict_detail['Среднеземный летний рацион (пони/день)'] = {
        'Среднеземный летний повседневный рацион (пони/день)':5 / 6,
        'Среднеземный летний праздничный рацион (пони/день)':1 / 6,
        }

metadict_detail['Среднеземный зимний рацион (пони/день)'] = {
        'Среднеземный зимний повседневный рацион (пони/день)':5 / 6,
        'Среднеземный зимний праздничный рацион (пони/день)':1 / 6,
        }

metadict_detail['Среднеземный осенний рацион (пони/день)'] = {
        'Среднеземный осенний повседневный рацион (пони/день)':5 / 6,
        'Среднеземный осенний праздничный рацион (пони/день)':1 / 6,
        }

#----
# Среднеземный рацион (дни недели):

metadict_detail['Среднеземный весенний повседневный рацион (пони/день)'] = {
        'Среднеземный весенний повседневный завтрак':1,
        'Среднеземный весенний повседневный обед':1,
        'Среднеземный весенний повседневный ужин':1,
        'Среднеземное весеннее повседневное питьё v1':3 / 3,
        'Среднеземное весеннее повседневное питьё v2':3 / 3,
        'Среднеземное весеннее повседневное питьё v3':3 / 3,
        }

metadict_detail['Среднеземный весенний праздничный рацион (пони/день)'] = {
        'Среднеземный весенний праздничный завтрак':1,
        'Среднеземный весенний праздничный обед':1,
        'Среднеземный весенний праздничный ужин':1,
        'Среднеземное весеннее праздничное питьё v1':3 / 3,
        'Среднеземное весеннее праздничное питьё v2':3 / 3,
        'Среднеземное весеннее праздничное питьё v3':3 / 3,
        }

metadict_detail['Среднеземный зимний повседневный рацион (пони/день)'] = {
        'Среднеземный зимний повседневный завтрак':1,
        'Среднеземный зимний повседневный обед':1,
        'Среднеземный зимний повседневный ужин':1,
        'Среднеземное зимнее повседневное питьё v1':3 / 3,
        'Среднеземное зимнее повседневное питьё v2':3 / 3,
        'Среднеземное зимнее повседневное питьё v3':3 / 3,
        }

metadict_detail['Среднеземный зимний праздничный рацион (пони/день)'] = {
        'Среднеземный зимний праздничный завтрак':1,
        'Среднеземный зимний праздничный обед':1,
        'Среднеземный зимний праздничный ужин':1,
        'Среднеземное зимнее праздничное питьё v1':3 / 3,
        'Среднеземное зимнее праздничное питьё v2':3 / 3,
        'Среднеземное зимнее праздничное питьё v3':3 / 3,
        }

metadict_detail['Среднеземный летний повседневный рацион (пони/день)'] = {
        'Среднеземный летний повседневный завтрак':1,
        'Среднеземный летний повседневный обед':1,
        'Среднеземный летний повседневный ужин':1,
        'Среднеземное летнее повседневное питьё v1':3 / 3,
        'Среднеземное летнее повседневное питьё v2':3 / 3,
        'Среднеземное летнее повседневное питьё v3':3 / 3,
        }

metadict_detail['Среднеземный летний праздничный рацион (пони/день)'] = {
        'Среднеземный летний праздничный завтрак':1,
        'Среднеземный летний праздничный обед':1,
        'Среднеземный летний праздничный ужин':1,
        'Среднеземное летнее праздничное питьё v1':3 / 3,
        'Среднеземное летнее праздничное питьё v2':3 / 3,
        'Среднеземное летнее праздничное питьё v3':3 / 3,
        }

metadict_detail['Среднеземный осенний повседневный рацион (пони/день)'] = {
        'Среднеземный осенний повседневный завтрак':1,
        'Среднеземный осенний повседневный обед':1,
        'Среднеземный осенний повседневный ужин':1,
        'Среднеземное осеннее повседневное питьё v1':3 / 3,
        'Среднеземное осеннее повседневное питьё v2':3 / 3,
        'Среднеземное осеннее повседневное питьё v3':3 / 3,
        }

metadict_detail['Среднеземный осенний праздничный рацион (пони/день)'] = {
        'Среднеземный осенний праздничный завтрак':1,
        'Среднеземный осенний праздничный обед':1,
        'Среднеземный осенний праздничный ужин':1,
        'Среднеземное осеннее праздничное питьё v1':3 / 3,
        'Среднеземное осеннее праздничное питьё v2':3 / 3,
        'Среднеземное осеннее праздничное питьё v3':3 / 3,
        }

#----
# Среднеземный рацион (весна):
    # Март, апрель, май

metadict_detail['Среднеземный весенний повседневный завтрак'] = {
        'Сэндвич с арахисовой пастой (грамм)':50 * 2,
        'Картофель тушёный со спаржей (грамм)':250,
        'Фасоль тушёная (грамм)':250,
        }

metadict_detail['Среднеземный весенний повседневный обед'] = {
        'Хлеб кукурузный домашний (грамм)':25 * 4,
        'Похлёбка фасолевая (грамм)':250,
        'Лапша с песто и шампиньонами (грамм)':250,
        'Салат из варёной спаржи (грамм)':125,
        }

metadict_detail['Среднеземный весенний повседневный ужин'] = {
        'Хлеб кукурузный домашний (грамм)':25 * 4,
        'Каша овсяная с кленовым сиропом (грамм)':250,
        'Морковь тушёная (грамм)':250,
        }

metadict_detail['Среднеземное весеннее повседневное питьё v1'] = {
        'Чай чёрный (грамм)':250 * 2,
        'Маффины морковные (грамм)':50,
        }

metadict_detail['Среднеземное весеннее повседневное питьё v2'] = {
        'Чай травяной с кленовым сиропом (грамм)':250 * 2,
        'Маффины с сухофруктами (грамм)':50,
        }

metadict_detail['Среднеземное весеннее повседневное питьё v3'] = {
        'Сидр яблочный (грамм)':250,
        }

metadict_detail['Среднеземный весенний праздничный завтрак'] = {
        'Сэндвич с пекановой пастой (грамм)':50 * 2,
        'Рис варёный с кукурузой (грамм)':250,
        'Сморчки тушёные (грамм)':125,
        }

metadict_detail['Среднеземный весенний праздничный обед'] = {
        'Пицца с шампиньонами (грамм)':50 * 2,
        'Суп-пюре свекольный с кремом (грамм)':250,
        'Корень сельдерея жареный в масле (грамм)':250,
        'Лечо со сладким перцем консервированное (грамм)':125,
        }

metadict_detail['Среднеземный весенний праздничный ужин'] = {
        'Оладьи кукурузные с кленовым сиропом (грамм)':50 * 2,
        'Пюре картофельное (грамм)':250,
        'Одуванчики обжаренные (грамм)':125,
        }

metadict_detail['Среднеземное весеннее праздничное питьё v1'] = {
        'Чай одуванчиковый (грамм)':250 * 2,
        'Пирог открытый кленовый (грамм)':50 * 2,
        }

metadict_detail['Среднеземное весеннее праздничное питьё v2'] = {
        'Компот из сухофруктов (грамм)':250 * 2,
        }

metadict_detail['Среднеземное весеннее праздничное питьё v3'] = {
        'Вино белое сухое (грамм)':250,
        'Пирог открытый пекановый (грамм)':50,
        }

#----
# Среднеземный рацион (лето):
    # Июнь, июль, август

metadict_detail['Среднеземный летний повседневный завтрак'] = {
        'Сэндвич с арахисовой пастой (грамм)':50 * 2,
        'Картофель печёный дольками (грамм)':250,
        'Рис варёный с фасолью (грамм)':250,
        }

metadict_detail['Среднеземный летний повседневный обед'] = {
        'Хлеб кукурузный домашний (грамм)':25 * 4,
        'Похлёбка томатная с чечевицей (грамм)':250,
        'Лапша с песто и овощами (грамм)':250,
        'Салат из брокколи (грамм)':125,
        }

metadict_detail['Среднеземный летний повседневный ужин'] = {
        # Исправить
            # Полента сама по себе скучна.
        'Хлеб пшеничный домашний (грамм)':25 * 4,
        'Каша кукурузно-мучная (грамм)':250,
        'Среднеземные летние фрукты (грамм)':250,
        }

metadict_detail['Среднеземное летнее повседневное питьё v1'] = {
        'Чай чёрный (грамм)':250 * 2,
        'Маффины вишнёвые (грамм)':50,
        }

metadict_detail['Среднеземное летнее повседневное питьё v2'] = {
        'Чай травяной с кленовым сиропом (грамм)':250 * 2,
        'Шарлотка земляничная (грамм)':50,
        }

metadict_detail['Среднеземное летнее повседневное питьё v3'] = {
        'Вино красное сухое (грамм)':250,
        }

metadict_detail['Среднеземный летний праздничный завтрак'] = {
        # Исправить.
            # Что-нибудь вместо шампиньонов (которые в паэлье есть)
        'Сэндвич с пекановой пастой (грамм)':50 * 2,
        'Рис варёный с овощами (грамм)':250,
        'Шампиньоны тушёные (грамм)':250,
        }

metadict_detail['Среднеземный летний праздничный обед'] = {
        # Исправить
            # Лапша с томатами? Не очень-то празднично
        'Пицца с брокколи (грамм)':50 * 2,
        'Суп-пюре картофельный с шампиньонами (грамм)':250,
        'Лапша с томатным соусом (грамм)':250,
        'Рагу овощное (грамм)':250,
        }

metadict_detail['Среднеземный летний праздничный ужин'] = {
        'Оладьи кукурузные с кленовым сиропом (грамм)':50 * 2,
        'Пюре картофельное (грамм)':250,
        'Брокколи обжаренные (грамм)':125,
        }

metadict_detail['Среднеземное летнее праздничное питьё v1'] = {
        'Чай травяной с кленовым сиропом (грамм)':250 * 2,
        'Пирог открытый вишнёвый (грамм)':50 * 2,
        }

metadict_detail['Среднеземное летнее праздничное питьё v2'] = {
        'Компот из свежего ревеня (грамм)':250 * 2,
        }

metadict_detail['Среднеземное летнее праздничное питьё v3'] = {
        'Эль имбирный (грамм)':250,
        'Пончики с глазурью (грамм)':25 * 2,
        }


#----
# Среднеземный рацион (осень):
    # Сентябрь, октябрь, ноябрь

metadict_detail['Среднеземный осенний повседневный завтрак'] = {
        'Сэндвич с арахисовой пастой (грамм)':50 * 2,
        'Картофель тушёный с горошком и пряностями (грамм)':250,
        'Тыква фаршированная лечо и чечевицей (грамм)':250,
        }

metadict_detail['Среднеземный осенний повседневный обед'] = {
        'Хлеб кукурузный домашний (грамм)':25 * 4,
        'Похлёбка фасолево-кукурузная с пастернаком (грамм)':250,
        'Лапша с песто и овощами (грамм)':250,
        'Салат из варёной свёклы (грамм)':125,
        }

metadict_detail['Среднеземный осенний повседневный ужин'] = {
        'Хлеб кукурузный домашний (грамм)':25 * 4,
        'Каша овсяная с мёдом (грамм)':250,
        'Среднеземные осенние фрукты (грамм)':250,
        }

metadict_detail['Среднеземное осеннее повседневное питьё v1'] = {
        'Чай чёрный (грамм)':250 * 2,
        'Маффины тыквенные (грамм)':50,
        }

metadict_detail['Среднеземное осеннее повседневное питьё v2'] = {
        'Чай травяной с мёдом (грамм)':250 * 2,
        'Шарлотка яблочная (грамм)':50,
        }

metadict_detail['Среднеземное осеннее повседневное питьё v3'] = {
        'Сок яблочный (грамм)':250 * 2,
        }

metadict_detail['Среднеземный осенний праздничный завтрак'] = {
        'Сэндвич с пекановой пастой (грамм)':50 * 2,
        'Рис варёный с овощами (грамм)':250,
        'Артишоки обжаренные (грамм)':250,
        }

metadict_detail['Среднеземный осенний праздничный обед'] = {
        'Пицца с артишоками (грамм)':50 * 2,
        'Суп-пюре из корня сельдерея (грамм)':250,
        'Шарики фасолевые в панировке (грамм)':250,
        'Рагу овощное (грамм)':250,
        }

metadict_detail['Среднеземный осенний праздничный ужин'] = {
        'Оладьи кукурузные с мёдом (грамм)':50 * 2,
        'Пюре картофельное (грамм)':250,
        'Морковь в медовой глазури (грамм)':250,
        }

metadict_detail['Среднеземное осеннее праздничное питьё v1'] = {
        'Чай травяной с мёдом (грамм)':250 * 2,
        'Пирог открытый лимонный (грамм)':50,
        }

metadict_detail['Среднеземное осеннее праздничное питьё v2'] = {
        'Компот из свежей вишни (грамм)':250 * 2,
        }

metadict_detail['Среднеземное осеннее праздничное питьё v3'] = {
        'Вино белое сухое (грамм)':250,
        'Орешки кедровые (грамм)':20,
        }

#----
# Среднеземный рацион (зима):
    # Декабрь, январь, февраль

metadict_detail['Среднеземный зимний повседневный завтрак'] = {
        'Сэндвич с арахисовой пастой (грамм)':50 * 2,
        'Картофель тушёный с оливками и лимоном (грамм)':250,
        'Рис варёный со свекольным кремом (грамм)':250,
        }

metadict_detail['Среднеземный зимний повседневный обед'] = {
        'Хлеб кукурузный домашний (грамм)':25 * 4,
        'Похлёбка чечевичная (грамм)':250,
        'Лапша с соусом песто (грамм)':250,
        'Капуста тушёная (грамм)':125,
        }

metadict_detail['Среднеземный зимний повседневный ужин'] = {
        'Хлеб пшеничный домашний (грамм)':25 * 4,
        'Каша кукурузно-мучная (грамм)':250,
        'Тыква тушёная (грамм)':250,
        }

metadict_detail['Среднеземное зимнее повседневное питьё v1'] = {
        'Чай чёрный (грамм)':250 * 2,
        'Маффины с яблочным джемом (грамм)':50,
        }

metadict_detail['Среднеземное зимнее повседневное питьё v2'] = {
        'Чай травяной с мёдом (грамм)':250 * 2,
        'Маффины с сухофруктами (грамм)':50,
        }

metadict_detail['Среднеземное зимнее повседневное питьё v3'] = {
        'Сидр грушевый (грамм)':250,
        }

metadict_detail['Среднеземный зимний праздничный завтрак'] = {
        'Сэндвич с пекановой пастой (грамм)':50 * 2,
        'Рис варёный с тыквой и кукурузой (грамм)':250,
        'Салат из консервированных кабачков (грамм)':250,
        }

metadict_detail['Среднеземный зимний праздничный обед'] = {
        'Пицца с кабачками (грамм)':50 * 2,
        'Суп-пюре картофельный с гренками (грамм)':250,
        'Шарики чечевичные в панировке (грамм)':250,
        'Лечо со сладким перцем (грамм)':250,
        }

metadict_detail['Среднеземный зимний праздничный ужин'] = {
        'Оладьи кукурузные с яблочным сиропом (грамм)':50 * 2,
        'Пюре картофельное (грамм)':250,
        'Капуста обжаренная в сухарях (грамм)':250,
        }

metadict_detail['Среднеземное зимнее праздничное питьё v1'] = {
        'Чай травяной с мёдом (грамм)':250 * 2,
        'Пирог открытый тыквенный (грамм)':50 * 2,
        }

metadict_detail['Среднеземное зимнее праздничное питьё v2'] = {
        'Компот из сухофруктов (грамм)':250 * 2,
        }

metadict_detail['Среднеземное зимнее праздничное питьё v3'] = {
        'Эль имбирный (грамм)':250,
        'Орешки кедровые (грамм)':20,
        }
