#----
# Потребности (возрастные):

metadict_detail['-Младенцы'] = {
        # Исправить
            # Родильные дома, школы, больницы.
        'Основные потребности (пони)':1,
        }

metadict_detail['-Дети'] = {
        'Основные потребности (пони)':1,
        }

metadict_detail['-Школьники'] = {
        'Основные потребности (пони)':1,
        }

metadict_detail['-Подмастерья'] = {
        'Основные потребности (пони)':1,
        }

metadict_detail['-Рабочие'] = {
        'Основные потребности (пони)':1,
        }

metadict_detail['-Старики'] = {
        'Основные потребности (пони)':1,
        }

#----
# Потребности (национальные):

metadict_detail['|-Североморские горожане-бедняки'] = {
        # Исправить
            # Не нравится мне такой подход.
            # Но не пилить же десятки вариаций рационов?
        'Североморский рацион (пони/год)':0.25,
        'Городской рацион (пони/год)':0.75,
        'Расход воды горожанами (пони/день)':360,
        'Североморское городское жильё (квадратный метр)':15,
        'Культурные потребности горожан (пони/день)':360 / 30,
        }

metadict_detail['|-Североморские горожане-середняки'] = {
        # Исправить
            # "Изысканный рацион", это ресторанное питание и заказ пищи.
            # Смесь национальных кухонь.
        'Североморский рацион (пони/год)':0.25,
        'Городской рацион (пони/год)':0.50,
        'Изысканный рацион (пони/год)':0.25,
        'Расход воды горожанами (пони/день)':360,
        'Частное городское жильё (квадратный метр)':30,
        'Культурные потребности горожан (пони/день)':360 / 6,
        }

metadict_detail['|-Североморские горожане-богатеи'] = {
        'Североморский рацион (пони/год)':0.50,
        'Изысканный рацион (пони/год)':0.50,
        'Расход воды городскими богатеями (пони/день)':360,
        'Богатое городское жильё (квадратный метр)':60,
        'Культурные потребности богемы (пони/день)':360 / 3,
        }

metadict_detail['|-Североморские селяне-бедняки'] = {
        'Североморский рацион (пони/год)':1,
        'Расход воды селянами (пони/день)':360,
        'Североморское сельское жильё (квадратный метр)':15,
        'Культурные потребности селян (пони/день)':360 / 30,
        }

metadict_detail['|-Североморские селяне-середняки'] = {
        'Североморский рацион (пони/год)':0.75,
        'Изысканный рацион (пони/год)':0.25,
        'Расход воды селянами (пони/день)':360,
        'Частное сельское жильё (квадратный метр)':30,
        'Культурные потребности селян (пони/день)':360 / 6,
        }

metadict_detail['|-Североморские селяне-богатеи'] = {
        'Североморский рацион (пони/год)':0.50,
        'Изысканный рацион (пони/год)':0.50,
        'Расход воды сельскими богатеями (пони/день)':360,
        'Богатое сельское жильё (квадратный метр)':60,
        'Культурные потребности богемы (пони/день)':360 / 3,
        }

metadict_detail['|-Среднеземные горожане-бедняки'] = {
        'Среднеземный рацион (пони/год)':0.25,
        'Городской рацион (пони/год)':0.75,
        'Расход воды горожанами (пони/день)':360,
        'Среднеземное городское жильё (квадратный метр)':15,
        'Культурные потребности горожан (пони/день)':360 / 30,
        }

metadict_detail['|-Среднеземные горожане-середняки'] = {
        'Среднеземный рацион (пони/год)':0.25,
        'Городской рацион (пони/год)':0.50,
        'Изысканный рацион (пони/год)':0.25,
        'Расход воды горожанами (пони/день)':360,
        'Частное городское жильё (квадратный метр)':30,
        'Культурные потребности горожан (пони/день)':360 / 6,
        }

metadict_detail['|-Среднеземные горожане-богатеи'] = {
        'Среднеземный рацион (пони/год)':0.50,
        'Изысканный рацион (пони/год)':0.50,
        'Расход воды городскими богатеями (пони/день)':360,
        'Богатое городское жильё (квадратный метр)':60,
        'Культурные потребности богемы (пони/день)':360 / 3,
        }

metadict_detail['|-Среднеземные селяне-бедняки'] = {
        'Среднеземный рацион (пони/год)':1,
        'Расход воды селянами (пони/день)':360,
        'Среднеземное сельское жильё (квадратный метр)':15,
        'Культурные потребности селян (пони/день)':360 / 30,
        }

metadict_detail['|-Среднеземные селяне-середняки'] = {
        'Среднеземный рацион (пони/год)':0.75,
        'Изысканный рацион (пони/год)':0.25,
        'Расход воды селянами (пони/день)':360,
        'Частное сельское жильё (квадратный метр)':30,
        'Культурные потребности селян (пони/день)':360 / 6,
        }

metadict_detail['|-Среднеземные селяне-богатеи'] = {
        'Среднеземный рацион (пони/год)':0.50,
        'Изысканный рацион (пони/год)':0.50,
        'Расход воды сельскими богатеями (пони/день)':360,
        'Богатое сельское жильё (квадратный метр)':60,
        'Культурные потребности богемы (пони/день)':360 / 3,
        }

metadict_detail['|-Южноморские горожане-бедняки'] = {
        'Южноморский рацион (пони/год)':0.25,
        'Городской рацион (пони/год)':0.75,
        'Расход воды горожанами (пони/день)':360,
        'Южноморское городское жильё (квадратный метр)':15,
        'Культурные потребности горожан (пони/день)':360 / 30,
        }

metadict_detail['|-Южноморские горожане-середняки'] = {
        'Южноморский рацион (пони/год)':0.25,
        'Городской рацион (пони/год)':0.50,
        'Изысканный рацион (пони/год)':0.25,
        'Расход воды горожанами (пони/день)':360,
        'Частное городское жильё (квадратный метр)':30,
        'Культурные потребности горожан (пони/день)':360 / 6,
        }

metadict_detail['|-Южноморские горожане-богатеи'] = {
        'Южноморский рацион (пони/год)':0.50,
        'Изысканный рацион (пони/год)':0.50,
        'Расход воды городскими богатеями (пони/день)':360,
        'Богатое городское жильё (квадратный метр)':60,
        'Культурные потребности богемы (пони/день)':360 / 3,
        }

metadict_detail['|-Южноморские селяне-бедняки'] = {
        'Южноморский рацион (пони/год)':1,
        'Расход воды селянами (пони/день)':360,
        'Южноморское сельское жильё (квадратный метр)':15,
        'Культурные потребности селян (пони/день)':360 / 30,
        }

metadict_detail['|-Южноморские селяне-середняки'] = {
        'Южноморский рацион (пони/год)':0.75,
        'Изысканный рацион (пони/год)':0.25,
        'Расход воды селянами (пони/день)':360,
        'Частное сельское жильё (квадратный метр)':30,
        'Культурные потребности селян (пони/день)':360 / 6,
        }

metadict_detail['|-Южноморские селяне-богатеи'] = {
        'Южноморский рацион (пони/год)':0.50,
        'Изысканный рацион (пони/год)':0.50,
        'Расход воды сельскими богатеями (пони/день)':360,
        'Богатое сельское жильё (квадратный метр)':60,
        'Культурные потребности богемы (пони/день)':360 / 3,
        }

#----
# Потребности (хозяйственная вода):

metadict_detail['Расход воды городскими богатеями (пони/день)'] = {
        'Вода для ванны (литр)':150,
        'Вода для смыва (литр)':10 * 3,
        'Вода для умывания (литр)':3 * 3,
        'Вода для мытья копыт (литр)':3 * 6,
        'Вода для уборки (литр)':60 / 6,
        'Вода для мытья вещей (литр)':(12 * 3) / 6,
        '-Городское водоснабжение (литр)':250,
        }

metadict_detail['Расход воды горожанами (пони/день)'] = {
        'Вода для душа (литр)':25,
        'Вода для бани (литр)':25 / 6,
        'Вода для смыва (литр)':10 * 3,
        'Вода для умывания (литр)':3 * 3,
        'Вода для мытья копыт (литр)':3 * 6,
        'Вода для уборки (литр)':30 / 6,
        'Вода для мытья вещей (литр)':(12 * 3) / 30,
        '-Городское водоснабжение (литр)':120,
        }

metadict_detail['Расход воды сельскими богатеями (пони/день)'] = {
        'Вода для душа (литр)':25,
        'Вода для бани (литр)':25 / 6,
        'Вода для смыва (литр)':10 * 3,
        'Вода для умывания (литр)':3 * 3,
        'Вода для мытья копыт (литр)':3 * 6,
        'Вода для уборки (литр)':30 / 6,
        'Вода для мытья вещей (литр)':(12 * 3) / 30,
        '-Сельское водоснабжение (литр)':120,
        }

metadict_detail['Расход воды селянами (пони/день)'] = {
        'Вода для бани (литр)':25 / 6,
        'Вода для умывания (литр)':3,
        'Вода для мытья копыт (литр)':1 * 3,
        'Вода для уборки (литр)':15 / 6,
        'Вода для мытья вещей (литр)':(12 * 3) / 30,
        '-Сельское водоснабжение (литр)':30,
        }

#----
# Потребности (жильё):

metadict_detail['Богатое городское жильё (квадратный метр)'] = {
        # Исправить
            # И опять всё одинаково, особняков пока что нет.
        'Городское жильё (квадратный метр)':1,
        }

metadict_detail['Богатое сельское жильё (квадратный метр)'] = {
        'Сельское жильё (квадратный метр)':1,
        }

metadict_detail['Североморское городское жильё (квадратный метр)'] = {
        'Городское жильё (квадратный метр)':1,
        }

metadict_detail['Североморское сельское жильё (квадратный метр)'] = {
        'Сельское жильё (квадратный метр)':1,
        }

metadict_detail['Среднеземное городское жильё (квадратный метр)'] = {
        'Городское жильё (квадратный метр)':1,
        }

metadict_detail['Среднеземное сельское жильё (квадратный метр)'] = {
        'Сельское жильё (квадратный метр)':1,
        }

metadict_detail['Частное городское жильё (квадратный метр)'] = {
        'Городское жильё (квадратный метр)':1,
        }

metadict_detail['Частное сельское жильё (квадратный метр)'] = {
        'Сельское жильё (квадратный метр)':1,
        }

metadict_detail['Южноморское городское жильё (квадратный метр)'] = {
        'Городское жильё (квадратный метр)':1,
        }

metadict_detail['Южноморское сельское жильё (квадратный метр)'] = {
        'Сельское жильё (квадратный метр)':1,
        }

#----
# Потребности (основные):

metadict_detail['Основные потребности (пони)'] = {
        'Потребность в дорогах (метр)':20,
        }

#----
# Потребности (прочие):

metadict_detail['Культурные потребности горожан (пони/день)'] = {
        # Исправить
            # Книги, газеты, театр, путешествия.
        }

metadict_detail['Культурные потребности селян (пони/день)'] = {
        }

metadict_detail['Культурные потребности богемы (пони/день)'] = {
        }
