#----
# Южноморский рацион:

metadict_detail['Южноморский рацион (пони/год)'] = {
        'Южноморский весенний рацион (пони/день)':90,
        'Южноморский летний рацион (пони/день)':90,
        'Южноморский осенний рацион (пони/день)':90,
        'Южноморский зимний рацион (пони/день)':90,
        'Южноморские запасы еды (пони/день)':360,
        }

#----
# Южноморский рацион (времена года):

metadict_detail['Южноморский весенний рацион (пони/день)'] = {
        # В эквестрийской неделе -- 6 дней
        'Южноморский весенний повседневный рацион (пони/день)':5 / 6,
        'Южноморский весенний праздничный рацион (пони/день)':1 / 6,
        }

metadict_detail['Южноморский летний рацион (пони/день)'] = {
        'Южноморский летний повседневный рацион (пони/день)':5 / 6,
        'Южноморский летний праздничный рацион (пони/день)':1 / 6,
        }

metadict_detail['Южноморский зимний рацион (пони/день)'] = {
        'Южноморский зимний повседневный рацион (пони/день)':5 / 6,
        'Южноморский зимний праздничный рацион (пони/день)':1 / 6,
        }

metadict_detail['Южноморский осенний рацион (пони/день)'] = {
        'Южноморский осенний повседневный рацион (пони/день)':5 / 6,
        'Южноморский осенний праздничный рацион (пони/день)':1 / 6,
        }

#----
# Южноморский рацион (дни недели):

metadict_detail['Южноморский весенний повседневный рацион (пони/день)'] = {
        'Южноморский весенний повседневный завтрак':1,
        'Южноморский весенний повседневный обед':1,
        'Южноморский весенний повседневный ужин':1,
        'Южноморское весеннее повседневное питьё v1':3 / 3,
        'Южноморское весеннее повседневное питьё v2':3 / 3,
        'Южноморское весеннее повседневное питьё v3':3 / 3,
        }

metadict_detail['Южноморский весенний праздничный рацион (пони/день)'] = {
        'Южноморский весенний праздничный завтрак':1,
        'Южноморский весенний праздничный обед':1,
        'Южноморский весенний праздничный ужин':1,
        'Южноморское весеннее праздничное питьё v1':3 / 3,
        'Южноморское весеннее праздничное питьё v2':3 / 3,
        'Южноморское весеннее праздничное питьё v3':3 / 3,
        }

metadict_detail['Южноморский зимний повседневный рацион (пони/день)'] = {
        'Южноморский зимний повседневный завтрак':1,
        'Южноморский зимний повседневный обед':1,
        'Южноморский зимний повседневный ужин':1,
        'Южноморское зимнее повседневное питьё v1':3 / 3,
        'Южноморское зимнее повседневное питьё v2':3 / 3,
        'Южноморское зимнее повседневное питьё v3':3 / 3,
        }

metadict_detail['Южноморский зимний праздничный рацион (пони/день)'] = {
        'Южноморский зимний праздничный завтрак':1,
        'Южноморский зимний праздничный обед':1,
        'Южноморский зимний праздничный ужин':1,
        'Южноморское зимнее праздничное питьё v1':3 / 3,
        'Южноморское зимнее праздничное питьё v2':3 / 3,
        'Южноморское зимнее праздничное питьё v3':3 / 3,
        }

metadict_detail['Южноморский летний повседневный рацион (пони/день)'] = {
        'Южноморский летний повседневный завтрак':1,
        'Южноморский летний повседневный обед':1,
        'Южноморский летний повседневный ужин':1,
        'Южноморское летнее повседневное питьё v1':3 / 3,
        'Южноморское летнее повседневное питьё v2':3 / 3,
        'Южноморское летнее повседневное питьё v3':3 / 3,
        }

metadict_detail['Южноморский летний праздничный рацион (пони/день)'] = {
        'Южноморский летний праздничный завтрак':1,
        'Южноморский летний праздничный обед':1,
        'Южноморский летний праздничный ужин':1,
        'Южноморское летнее праздничное питьё v1':3 / 3,
        'Южноморское летнее праздничное питьё v2':3 / 3,
        'Южноморское летнее праздничное питьё v3':3 / 3,
        }

metadict_detail['Южноморский осенний повседневный рацион (пони/день)'] = {
        'Южноморский осенний повседневный завтрак':1,
        'Южноморский осенний повседневный обед':1,
        'Южноморский осенний повседневный ужин':1,
        'Южноморское осеннее повседневное питьё v1':3 / 3,
        'Южноморское осеннее повседневное питьё v2':3 / 3,
        'Южноморское осеннее повседневное питьё v3':3 / 3,
        }

metadict_detail['Южноморский осенний праздничный рацион (пони/день)'] = {
        'Южноморский осенний праздничный завтрак':1,
        'Южноморский осенний праздничный обед':1,
        'Южноморский осенний праздничный ужин':1,
        'Южноморское осеннее праздничное питьё v1':3 / 3,
        'Южноморское осеннее праздничное питьё v2':3 / 3,
        'Южноморское осеннее праздничное питьё v3':3 / 3,
        }

#----
# Южноморский рацион (весна):
    # Март, апрель, май

metadict_detail['Южноморский весенний повседневный завтрак'] = {
        # Исправить
            # Рацион бедный. Нужно больше разных салатов, солений и выпечки к чаю.
        'Хлеб соевый домашний (грамм)':25 * 4,
        'Рис обжаренный с капустой и спаржей (грамм)':250,
        'Салат из морской капусты (грамм)':250,
        }

metadict_detail['Южноморский весенний повседневный обед'] = {
        'Рис варёный с соевым соусом (грамм)':250,
        'Суп-пюре чечевичный с пряностями (грамм)':250,
        'Суп-лапша с бататом и солёными томатами (грамм)':125,
        'Капуста квашеная с соевым соусом (грамм)':125,
        'Похлёбка с морской капустой (грамм)':125,
        'Батат печёный дольками (грамм)':125,
        }

metadict_detail['Южноморский весенний повседневный ужин'] = {
        'Хлеб соевый домашний (грамм)':25 * 4,
        'Каша ячневая (грамм)':250,
        'Пюре бататное (грамм)':250,
        }

metadict_detail['Южноморское весеннее повседневное питьё v1'] = {
        'Чай чёрный (грамм)':250 * 2,
        'Оладьи рисовые с яблочным сиропом (грамм)':50 * 2,
        }

metadict_detail['Южноморское весеннее повседневное питьё v2'] = {
        'Чай чёрный с сахаром (грамм)':250 * 2,
        'Темпе обжаренный (грамм)':50,
        }

metadict_detail['Южноморское весеннее повседневное питьё v3'] = {
        'Сидр яблочный (грамм)':250,
        'Арахис обжаренный (грамм)':20,
        }

metadict_detail['Южноморский весенний праздничный завтрак'] = {
        'Хлеб пшеничный домашний (грамм)':25 * 4,
        'Рис варёный с консервированными овощами (грамм)':250,
        'Картофель жареный соломкой (грамм)':125,
        'Пудинг морковный (грамм)':125,
        }

metadict_detail['Южноморский весенний праздничный обед'] = {
        'Рис варёный с соевым соусом (грамм)':250,
        'Пюре гороховое с пряностями (грамм)':125,
        'Суп-пюре из корня сельдерея (грамм)':125,
        'Морская капуста обжаренная (грамм)':125,
        'Шарики фасолевые в панировке (грамм)':125,
        'Вёшенки тушёные (грамм)':125,
        }

metadict_detail['Южноморский весенний праздничный ужин'] = {
        'Хлеб пшеничный домашний (грамм)':25 * 4,
        'Каша рисовая с чечевицей и спаржей (грамм)':250,
        'Картофель тушёный в соевом соусе (грамм)':250,
        }

metadict_detail['Южноморское весеннее праздничное питьё v1'] = {
        'Чай чёрный с мёдом (грамм)':250 * 2,
        'Желе из ревеня (грамм)':250,
        }

metadict_detail['Южноморское весеннее праздничное питьё v2'] = {
        # Исправить
            # Как насчёт рогаликов?
        'Компот из свежего ревеня (грамм)':250 * 2,
        }

metadict_detail['Южноморское весеннее праздничное питьё v3'] = {
        'Вино красное сухое (грамм)':250,
        }

#----
# Южноморский рацион (лето):
    # Июнь, июль, август

metadict_detail['Южноморский летний повседневный завтрак'] = {
        'Хлеб соевый домашний (грамм)':25 * 4,
        'Рис обжаренный с капустой и овощами (грамм)':250,
        'Салат огуречный с соевым соусом (грамм)':250,
        }

metadict_detail['Южноморский летний повседневный обед'] = {
        'Рис варёный с томатным соусом (грамм)':250,
        'Суп-пюре фасолевый с пряностями (грамм)':250,
        'Суп-лапша с кабачком и свежими томатами (грамм)':125,
        'Капуста варёная с пряностями (грамм)':125,
        'Похлёбка томатная с фасолью (грамм)':125,
        'Батат печёный дольками (грамм)':125,
        }

metadict_detail['Южноморский летний повседневный ужин'] = {
        'Хлеб соевый домашний (грамм)':25 * 4,
        'Каша кукурузно-мучная (грамм)':250,
        'Южноморские летние фрукты (грамм)':250,
        }

metadict_detail['Южноморское летнее повседневное питьё v1'] = {
        'Чай чёрный (грамм)':250 * 2,
        'Оладьи рисовые с лимонным сиропом (грамм)':50 * 2,
        }

metadict_detail['Южноморское летнее повседневное питьё v2'] = {
        'Чай чёрный с сахаром (грамм)':250 * 2,
        'Темпе обжаренный (грамм)':50,
        }

metadict_detail['Южноморское летнее повседневное питьё v3'] = {
        'Вино красное сухое (грамм)':250,
        'Арахис обжаренный (грамм)':20,
        }

metadict_detail['Южноморский летний праздничный завтрак'] = {
        'Хлеб пшеничный домашний (грамм)':25 * 4,
        'Рис варёный с консервированными овощами (грамм)':250,
        'Картофель жареный соломкой (грамм)':125,
        'Пудинг тыквенный (грамм)':125,
        }

metadict_detail['Южноморский летний праздничный обед'] = {
        'Рис варёный с томатным соусом (грамм)':250,
        'Пюре гороховое с пряностями (грамм)':125,
        'Суп-пюре из батата со сладким перцем (грамм)':125,
        'Баклажан обжаренный с овощами (грамм)':125,
        'Шарики чечевичные в панировке (грамм)':125,
        'Вёшенки жареные (грамм)':125,
        }

metadict_detail['Южноморский летний праздничный ужин'] = {
        'Хлеб пшеничный домашний (грамм)':25 * 4,
        'Каша рисовая с чечевицей и овощами (грамм)':250,
        'Картофель тушёный с горошком и пряностями (грамм)':250,
        }

metadict_detail['Южноморское летнее праздничное питьё v1'] = {
        'Чай чёрный с мёдом (грамм)':250 * 2,
        'Желе лимонное (грамм)':250,
        }

metadict_detail['Южноморское летнее праздничное питьё v2'] = {
        'Компот из свежих персиков (грамм)':250 * 2,
        }

metadict_detail['Южноморское летнее праздничное питьё v3'] = {
        'Вино красное сухое (грамм)':250,
        }


#----
# Южноморский рацион (осень):
    # Сентябрь, октябрь, ноябрь

metadict_detail['Южноморский осенний повседневный завтрак'] = {
        'Хлеб соевый домашний (грамм)':25 * 4,
        'Рис обжаренный с капустой и овощами (грамм)':250,
        'Салат огуречный с соевым соусом (грамм)':250,
        }

metadict_detail['Южноморский осенний повседневный обед'] = {
        'Рис варёный с томатным соусом (грамм)':250,
        'Суп-пюре гороховый с пряностями (грамм)':250,
        'Суп-лапша с кабачком и свежими томатами (грамм)':125,
        'Капуста варёная с пряностями (грамм)':125,
        'Похлёбка томатная с чечевицей (грамм)':125,
        'Батат печёный дольками (грамм)':125,
        }

metadict_detail['Южноморский осенний повседневный ужин'] = {
        'Хлеб соевый домашний (грамм)':25 * 4,
        'Каша ячневая (грамм)':250,
        'Южноморские осенние фрукты (грамм)':250,
        }

metadict_detail['Южноморское осеннее повседневное питьё v1'] = {
        'Чай чёрный (грамм)':250 * 2,
        'Оладьи рисовые с яблочным сиропом (грамм)':50 * 2,
        }

metadict_detail['Южноморское осеннее повседневное питьё v2'] = {
        'Чай чёрный с мёдом (грамм)':250 * 2,
        'Темпе обжаренный (грамм)':50,
        }

metadict_detail['Южноморское осеннее повседневное питьё v3'] = {
        'Сок яблочный (грамм)':250 * 2,
        'Арахис обжаренный (грамм)':20,
        }

metadict_detail['Южноморский осенний праздничный завтрак'] = {
        'Хлеб пшеничный домашний (грамм)':25 * 4,
        'Рис варёный с консервированными овощами (грамм)':250,
        'Картофель жареный соломкой (грамм)':125,
        'Пудинг тыквенный (грамм)':125,
        }

metadict_detail['Южноморский осенний праздничный обед'] = {
        'Рис варёный с томатным соусом (грамм)':250,
        'Пюре гороховое с пряностями (грамм)':125,
        'Суп-пюре морковный с пряностями (грамм)':125,
        'Кукуруза печёная с соевым соусом (грамм)':125,
        'Шарики чечевичные в панировке (грамм)':125,
        'Вёшенки тушёные (грамм)':125,
        }

metadict_detail['Южноморский осенний праздничный ужин'] = {
        'Хлеб пшеничный домашний (грамм)':25 * 4,
        'Каша рисовая с чечевицей и горошком (грамм)':250,
        'Тыква фаршированная картофелем с пряностями (грамм)':250,
        }

metadict_detail['Южноморское осеннее праздничное питьё v1'] = {
        'Чай чёрный с мёдом (грамм)':250 * 2,
        'Желе яблочное (грамм)':250,
        }

metadict_detail['Южноморское осеннее праздничное питьё v2'] = {
        'Компот из свежей вишни (грамм)':250 * 2,
        }

metadict_detail['Южноморское осеннее праздничное питьё v3'] = {
        'Вино красное сухое (грамм)':250,
        }

#----
# Южноморский рацион (зима):
    # Декабрь, январь, февраль

metadict_detail['Южноморский зимний повседневный завтрак'] = {
        'Хлеб соевый домашний (грамм)':25 * 4,
        'Рис обжаренный с капустой и грибами (грамм)':250,
        'Салат из морской капусты (грамм)':250,
        }

metadict_detail['Южноморский зимний повседневный обед'] = {
        'Рис варёный с соевым соусом (грамм)':250,
        'Суп-пюре чечевичный с пряностями (грамм)':250,
        'Суп-лапша с бататом и солёными томатами (грамм)':125,
        'Капуста квашеная с соевым соусом (грамм)':125,
        'Похлёбка с морской капустой (грамм)':125,
        'Батат печёный дольками (грамм)':125,
        }

metadict_detail['Южноморский зимний повседневный ужин'] = {
        'Хлеб соевый домашний (грамм)':25 * 4,
        'Каша кукурузно-мучная (грамм)':250,
        'Пюре тыквенное (грамм)':250,
        }

metadict_detail['Южноморское зимнее повседневное питьё v1'] = {
        'Чай чёрный (грамм)':250 * 2,
        'Оладьи рисовые с лимонным сиропом (грамм)':50 * 2,
        }

metadict_detail['Южноморское зимнее повседневное питьё v2'] = {
        'Чай чёрный с мёдом (грамм)':250 * 2,
        'Темпе обжаренный (грамм)':50,
        }

metadict_detail['Южноморское зимнее повседневное питьё v3'] = {
        'Сидр грушевый (грамм)':250,
        'Арахис обжаренный (грамм)':20,
        }

metadict_detail['Южноморский зимний праздничный завтрак'] = {
        'Хлеб пшеничный домашний (грамм)':25 * 4,
        'Рис варёный с консервированными овощами (грамм)':250,
        'Картофель жареный соломкой (грамм)':125,
        'Пудинг морковный (грамм)':125,
        }

metadict_detail['Южноморский зимний праздничный обед'] = {
        'Рис варёный с соевым соусом (грамм)':250,
        'Пюре гороховое с пряностями (грамм)':125,
        'Суп-пюре из корня сельдерея (грамм)':125,
        'Корень сельдерея жареный (грамм)':125,
        'Шарики фасолевые в панировке (грамм)':125,
        'Вёшенки жареные (грамм)':125,
        }

metadict_detail['Южноморский зимний праздничный ужин'] = {
        'Хлеб пшеничный домашний (грамм)':25 * 4,
        'Каша рисовая с чечевицей (грамм)':250,
        'Картофель тушёный с оливками и лимоном (грамм)':250,
        }

metadict_detail['Южноморское зимнее праздничное питьё v1'] = {
        'Чай чёрный с мёдом (грамм)':250 * 2,
        'Желе виноградное (грамм)':250,
        }

metadict_detail['Южноморское зимнее праздничное питьё v2'] = {
        'Компот из сухофруктов (грамм)':250 * 2,
        }

metadict_detail['Южноморское зимнее праздничное питьё v3'] = {
        'Вино красное сухое (грамм)':250,
        }

#----
# Южноморские запасы еды:

metadict_detail['Южноморские запасы еды (пони/день)'] = {
        'Морская капуста сушёная (грамм)':10,
        'Арахис в стручках (грамм)':25,
        'Сухофрукты разные (грамм)':25,
        'Чечевица сухая (грамм)':50,
        'Фасоль сухая (грамм)':25,
        'Зерно пшеницы (грамм)':150,
        'Зерно кукурузы (грамм)':100,
        'Зерно риса посевного (грамм)':100,
        'Семена подсолнечника (грамм)':50,
        'Масло оливковое (грамм)':25,
        }
