#----
# Герои (ячейки заклинаний) (волшебники)

metadict_detail['-Герои-единороги (волшебники) (1 lvl)'] = {
        '0 lvl (заговоры волшебника)':3,
        '1 lvl (заклинания волшебника)':2,
        '1 lvl (ритуальные заклинания волшебника)':1,
        }

metadict_detail['-Герои-единороги (волшебники) (2 lvl)'] = {
        '0 lvl (заговоры волшебника)':3,
        '1 lvl (заклинания волшебника)':3,
        '1 lvl (ритуальные заклинания волшебника)':1,
        }

metadict_detail['-Герои-единороги (волшебники) (3 lvl)'] = {
        '0 lvl (заговоры волшебника)':4,
        '1 lvl (заклинания волшебника)':4,
        '2 lvl (заклинания волшебника)':2,
        '2 lvl (ритуальные заклинания волшебника)':1,
        }

metadict_detail['-Герои-единороги (волшебники) (4 lvl)'] = {
        '0 lvl (заговоры волшебника)':4,
        '1 lvl (заклинания волшебника)':4,
        '2 lvl (заклинания волшебника)':3,
        '2 lvl (ритуальные заклинания волшебника)':1,
        }

metadict_detail['-Герои-единороги (волшебники) (5 lvl)'] = {
        '0 lvl (заговоры волшебника)':4,
        '1 lvl (заклинания волшебника)':4,
        '2 lvl (заклинания волшебника)':3,
        '3 lvl (заклинания волшебника)':2,
        '3 lvl (ритуальные заклинания волшебника)':1,
        }

metadict_detail['-Герои-единороги (волшебники) (6 lvl)'] = {
        '0 lvl (заговоры волшебника)':4,
        '1 lvl (заклинания волшебника)':4,
        '2 lvl (заклинания волшебника)':3,
        '3 lvl (заклинания волшебника)':2,
        '3 lvl (ритуальные заклинания волшебника)':1,
        }

metadict_detail['-Герои-единороги (волшебники) (7 lvl)'] = {
        '0 lvl (заговоры волшебника)':4,
        '1 lvl (заклинания волшебника)':4,
        '2 lvl (заклинания волшебника)':3,
        '3 lvl (заклинания волшебника)':3,
        '4 lvl (заклинания волшебника)':1,
        '4 lvl (ритуальные заклинания волшебника)':1,
        }

metadict_detail['-Герои-единороги (волшебники) (8 lvl)'] = {
        '0 lvl (заговоры волшебника)':4,
        '1 lvl (заклинания волшебника)':4,
        '2 lvl (заклинания волшебника)':3,
        '3 lvl (заклинания волшебника)':3,
        '4 lvl (заклинания волшебника)':2,
        '4 lvl (ритуальные заклинания волшебника)':1,
        }

metadict_detail['-Герои-единороги (волшебники) (9+ lvl)'] = {
        '0 lvl (заговоры волшебника)':4,
        '1 lvl (заклинания волшебника)':4,
        '2 lvl (заклинания волшебника)':3,
        '3 lvl (заклинания волшебника)':3,
        '4 lvl (заклинания волшебника)':2,
        '5 lvl (заклинания волшебника)':1,
        '5 lvl (ритуальные заклинания волшебника)':1,
        }

#----
# Герои (ячейки заклинаний) (чародеи)

metadict_detail['-Герои-единороги (чародеи) (1 lvl)'] = {                                                   
        '0 lvl (заговоры чародея)':4,
        '1 lvl (заклинания чародея)':2,
        '1 lvl (ритуальные заклинания чародея)':1,
        }

metadict_detail['-Герои-единороги (чародеи) (2 lvl)'] = {
        '0 lvl (заговоры чародея)':4,
        '1 lvl (заклинания чародея)':3,
        '1 lvl (ритуальные заклинания чародея)':1,
        }

metadict_detail['-Герои-единороги (чародеи) (3 lvl)'] = {
        '0 lvl (заговоры чародея)':4,
        '1 lvl (заклинания чародея)':4,
        '2 lvl (заклинания чародея)':2,
        '2 lvl (ритуальные заклинания чародея)':1,
        }

metadict_detail['-Герои-единороги (чародеи) (4 lvl)'] = {
        '0 lvl (заговоры чародея)':5,
        '1 lvl (заклинания чародея)':4,
        '2 lvl (заклинания чародея)':3,
        '2 lvl (ритуальные заклинания чародея)':1,
        }

metadict_detail['-Герои-единороги (чародеи) (5 lvl)'] = {
        '0 lvl (заговоры чародея)':5,
        '1 lvl (заклинания чародея)':4,
        '2 lvl (заклинания чародея)':3,
        '3 lvl (заклинания чародея)':2,
        '3 lvl (ритуальные заклинания чародея)':1,
        }

metadict_detail['-Герои-единороги (чародеи) (6 lvl)'] = {
        '0 lvl (заговоры чародея)':5,
        '1 lvl (заклинания чародея)':4,
        '2 lvl (заклинания чародея)':3,
        '3 lvl (заклинания чародея)':3,
        '3 lvl (ритуальные заклинания чародея)':1,
        }

metadict_detail['-Герои-единороги (чародеи) (7 lvl)'] = {
        '0 lvl (заговоры чародея)':5,
        '1 lvl (заклинания чародея)':4,
        '2 lvl (заклинания чародея)':3,
        '3 lvl (заклинания чародея)':3,
        '4 lvl (заклинания чародея)':1,
        '4 lvl (ритуальные заклинания чародея)':1,
        }

metadict_detail['-Герои-единороги (чародеи) (8 lvl)'] = {
        '0 lvl (заговоры чародея)':5,
        '1 lvl (заклинания чародея)':4,
        '2 lvl (заклинания чародея)':3,
        '3 lvl (заклинания чародея)':3,
        '4 lvl (заклинания чародея)':2,
        '4 lvl (ритуальные заклинания чародея)':1,
        }

metadict_detail['-Герои-единороги (чародеи) (9+ lvl)'] = {
        '0 lvl (заговоры чародея)':5,
        '1 lvl (заклинания чародея)':4,
        '2 lvl (заклинания чародея)':3,
        '3 lvl (заклинания чародея)':3,
        '4 lvl (заклинания чародея)':3,
        '5 lvl (заклинания чародея)':1,
        '5 lvl (ритуальные заклинания чародея)':1,
        }

#----
# Герои (ячейки заклинаний) (колдуны)

metadict_detail['-Герои-единороги (колдуны) (1 lvl)'] = {
        '0 lvl (заговоры колдуна)':2,
        '1 lvl (заклинания колдуна)':1,
        '1 lvl (ритуальные заклинания колдуна)':1,
        }

metadict_detail['-Герои-единороги (колдуны) (2 lvl)'] = {
        '0 lvl (заговоры колдуна)':2,
        '1 lvl (заклинания колдуна)':2,
        '1 lvl (ритуальные заклинания колдуна)':1,
        }

metadict_detail['-Герои-единороги (колдуны) (3 lvl)'] = {
        '0 lvl (заговоры колдуна)':2,
        '2 lvl (заклинания колдуна)':2,
        '2 lvl (ритуальные заклинания колдуна)':1,
        }

metadict_detail['-Герои-единороги (колдуны) (4 lvl)'] = {
        '0 lvl (заговоры колдуна)':3,
        '2 lvl (заклинания колдуна)':2,
        '2 lvl (ритуальные заклинания колдуна)':1,
        }

metadict_detail['-Герои-единороги (колдуны) (5 lvl)'] = {
        '0 lvl (заговоры колдуна)':3,
        '3 lvl (заклинания колдуна)':2,
        '3 lvl (ритуальные заклинания колдуна)':1,
        }

metadict_detail['-Герои-единороги (колдуны) (6 lvl)'] = {
        '0 lvl (заговоры колдуна)':3,
        '3 lvl (заклинания колдуна)':2,
        '3 lvl (ритуальные заклинания колдуна)':1,
        }

metadict_detail['-Герои-единороги (колдуны) (7 lvl)'] = {
        '0 lvl (заговоры колдуна)':3,
        '4 lvl (заклинания колдуна)':2,
        '4 lvl (ритуальные заклинания колдуна)':1,
        }

metadict_detail['-Герои-единороги (колдуны) (8 lvl)'] = {
        '0 lvl (заговоры колдуна)':3,
        '4 lvl (заклинания колдуна)':2,
        '4 lvl (ритуальные заклинания колдуна)':1,
        }

metadict_detail['-Герои-единороги (колдуны) (9+ lvl)'] = {
        '0 lvl (заговоры колдуна)':3,
        '5 lvl (заклинания колдуна)':2,
        '5 lvl (ритуальные заклинания колдуна)':1,
        }

#----
# Герои (ячейки заклинаний) (барды)

metadict_detail['-Герои-единороги (барды) (1 lvl)'] = {
        '0 lvl (заговоры барда)':2,
        '1 lvl (заклинания барда)':2,
        '1 lvl (ритуальные заклинания барда)':1,
        }

metadict_detail['-Герои-единороги (барды) (2 lvl)'] = {
        '0 lvl (заговоры барда)':2,
        '1 lvl (заклинания барда)':3,
        '1 lvl (ритуальные заклинания барда)':1,
        }

metadict_detail['-Герои-единороги (барды) (3 lvl)'] = {
        '0 lvl (заговоры барда)':2,
        '1 lvl (заклинания барда)':4,
        '2 lvl (заклинания барда)':2,
        '2 lvl (ритуальные заклинания барда)':1,
        }

metadict_detail['-Герои-единороги (барды) (4 lvl)'] = {
        '0 lvl (заговоры барда)':3,
        '1 lvl (заклинания барда)':4,
        '2 lvl (заклинания барда)':3,
        '2 lvl (ритуальные заклинания барда)':1,
        }

metadict_detail['-Герои-единороги (барды) (5 lvl)'] = {
        '0 lvl (заговоры барда)':3,
        '1 lvl (заклинания барда)':4,
        '2 lvl (заклинания барда)':3,
        '3 lvl (заклинания барда)':2,
        '3 lvl (ритуальные заклинания барда)':1,
        }

metadict_detail['-Герои-единороги (барды) (6 lvl)'] = {
        '0 lvl (заговоры барда)':3,
        '1 lvl (заклинания барда)':4,
        '2 lvl (заклинания барда)':3,
        '3 lvl (заклинания барда)':3,
        '3 lvl (ритуальные заклинания барда)':1,
        }

metadict_detail['-Герои-единороги (барды) (7 lvl)'] = {
        '0 lvl (заговоры барда)':3,
        '1 lvl (заклинания барда)':4,
        '2 lvl (заклинания барда)':3,
        '3 lvl (заклинания барда)':3,
        '4 lvl (заклинания барда)':1,
        '4 lvl (ритуальные заклинания барда)':1,
        }

metadict_detail['-Герои-единороги (барды) (8 lvl)'] = {
        '0 lvl (заговоры барда)':3,
        '1 lvl (заклинания барда)':4,
        '2 lvl (заклинания барда)':3,
        '3 lvl (заклинания барда)':3,
        '4 lvl (заклинания барда)':2,
        '4 lvl (ритуальные заклинания барда)':1,
        }

metadict_detail['-Герои-единороги (барды) (9+ lvl)'] = {
        '0 lvl (заговоры барда)':3,
        '1 lvl (заклинания барда)':4,
        '2 lvl (заклинания барда)':3,
        '3 lvl (заклинания барда)':3,
        '4 lvl (заклинания барда)':3,
        '5 lvl (заклинания барда)':1,
        '5 lvl (ритуальные заклинания барда)':1,
        }

#----
# Герои (ячейки заклинаний) (друиды)

metadict_detail['-Герои-земнопони (друиды) (1 lvl)'] = {
        '0 lvl (заговоры друида)':2,
        '1 lvl (заклинания друида)':3,
        '1 lvl (ритуальные заклинания друида)':1,
        }

metadict_detail['-Герои-земнопони (друиды) (2 lvl)'] = {
        '0 lvl (заговоры друида)':2,
        '1 lvl (заклинания друида)':3,
        '1 lvl (ритуальные заклинания друида)':1,
        }

metadict_detail['-Герои-земнопони (друиды) (3 lvl)'] = {
        '0 lvl (заговоры друида)':2,
        '1 lvl (заклинания друида)':4,
        '2 lvl (заклинания друида)':2,
        '2 lvl (ритуальные заклинания друида)':1,
        }

metadict_detail['-Герои-земнопони (друиды) (4 lvl)'] = {
        '0 lvl (заговоры друида)':3,
        '1 lvl (заклинания друида)':4,
        '2 lvl (заклинания друида)':3,
        '2 lvl (ритуальные заклинания друида)':1,
        }

metadict_detail['-Герои-земнопони (друиды) (5 lvl)'] = {
        '0 lvl (заговоры друида)':3,
        '1 lvl (заклинания друида)':4,
        '2 lvl (заклинания друида)':3,
        '3 lvl (заклинания друида)':2,
        '3 lvl (ритуальные заклинания друида)':1,
        }

metadict_detail['-Герои-земнопони (друиды) (6 lvl)'] = {
        '0 lvl (заговоры друида)':3,
        '1 lvl (заклинания друида)':4,
        '2 lvl (заклинания друида)':3,
        '3 lvl (заклинания друида)':3,
        '3 lvl (ритуальные заклинания друида)':1,
        }

metadict_detail['-Герои-земнопони (друиды) (7 lvl)'] = {
        '0 lvl (заговоры друида)':3,
        '1 lvl (заклинания друида)':4,
        '2 lvl (заклинания друида)':3,
        '3 lvl (заклинания друида)':3,
        '4 lvl (заклинания друида)':1,
        '4 lvl (ритуальные заклинания друида)':1,
        }

metadict_detail['-Герои-земнопони (друиды) (8 lvl)'] = {
        '0 lvl (заговоры друида)':3,
        '1 lvl (заклинания друида)':4,
        '2 lvl (заклинания друида)':3,
        '3 lvl (заклинания друида)':3,
        '4 lvl (заклинания друида)':2,
        '4 lvl (ритуальные заклинания друида)':1,
        }

metadict_detail['-Герои-земнопони (друиды) (9+ lvl)'] = {
        '0 lvl (заговоры друида)':3,
        '1 lvl (заклинания друида)':4,
        '2 lvl (заклинания друида)':3,
        '3 lvl (заклинания друида)':3,
        '4 lvl (заклинания друида)':3,
        '5 lvl (заклинания друида)':1,
        '5 lvl (ритуальные заклинания друида)':1,
        }

#----
# Герои (ячейки заклинаний) (жрецы)

metadict_detail['-Герои-пегасы (жрецы) (1 lvl)'] = {
        '0 lvl (заговоры жреца)':3,
        '1 lvl (заклинания жреца)':2,
        '1 lvl (ритуальные заклинания жреца)':1,
        }

metadict_detail['-Герои-пегасы (жрецы) (2 lvl)'] = {
        '0 lvl (заговоры жреца)':3,
        '1 lvl (заклинания жреца)':3,
        '1 lvl (ритуальные заклинания жреца)':1,
        }

metadict_detail['-Герои-пегасы (жрецы) (3 lvl)'] = {
        '0 lvl (заговоры жреца)':3,
        '1 lvl (заклинания жреца)':4,
        '2 lvl (заклинания жреца)':2,
        '2 lvl (ритуальные заклинания жреца)':1,
        }

metadict_detail['-Герои-пегасы (жрецы) (4 lvl)'] = {
        '0 lvl (заговоры жреца)':4,
        '1 lvl (заклинания жреца)':4,
        '2 lvl (заклинания жреца)':3,
        '2 lvl (ритуальные заклинания жреца)':1,
        }

metadict_detail['-Герои-пегасы (жрецы) (5 lvl)'] = {
        '0 lvl (заговоры жреца)':4,
        '1 lvl (заклинания жреца)':4,
        '2 lvl (заклинания жреца)':3,
        '3 lvl (заклинания жреца)':2,
        '3 lvl (ритуальные заклинания жреца)':1,
        }

metadict_detail['-Герои-пегасы (жрецы) (6 lvl)'] = {
        '0 lvl (заговоры жреца)':4,
        '1 lvl (заклинания жреца)':4,
        '2 lvl (заклинания жреца)':3,
        '3 lvl (заклинания жреца)':3,
        '3 lvl (ритуальные заклинания жреца)':1,
        }

metadict_detail['-Герои-пегасы (жрецы) (7 lvl)'] = {
        '0 lvl (заговоры жреца)':4,
        '1 lvl (заклинания жреца)':4,
        '2 lvl (заклинания жреца)':3,
        '3 lvl (заклинания жреца)':3,
        '4 lvl (заклинания жреца)':1,
        '4 lvl (ритуальные заклинания жреца)':1,
        }

metadict_detail['-Герои-пегасы (жрецы) (8 lvl)'] = {
        '0 lvl (заговоры жреца)':4,
        '1 lvl (заклинания жреца)':4,
        '2 lvl (заклинания жреца)':3,
        '3 lvl (заклинания жреца)':3,
        '4 lvl (заклинания жреца)':2,
        '4 lvl (ритуальные заклинания жреца)':1,
        }

metadict_detail['-Герои-пегасы (жрецы) (9+ lvl)'] = {
        '0 lvl (заговоры жреца)':4,
        '1 lvl (заклинания жреца)':4,
        '2 lvl (заклинания жреца)':3,
        '3 lvl (заклинания жреца)':3,
        '4 lvl (заклинания жреца)':3,
        '5 lvl (заклинания жреца)':1,
        '5 lvl (ритуальные заклинания жреца)':1,
        }

#----
# Герои (ячейки заклинаний) (паладины)

metadict_detail['-Герои-земнопони (паладины) (1 lvl)'] = {
        # Полукастеры
        }

metadict_detail['-Герои-земнопони (паладины) (2 lvl)'] = {
        '1 lvl (заклинания паладина)':2,
        '1 lvl (ритуальные заклинания паладина)':1,
        }

metadict_detail['-Герои-земнопони (паладины) (3 lvl)'] = {
        '1 lvl (заклинания паладина)':3,
        '1 lvl (ритуальные заклинания паладина)':1,
        }

metadict_detail['-Герои-земнопони (паладины) (4 lvl)'] = {
        '1 lvl (заклинания паладина)':3,
        '1 lvl (ритуальные заклинания паладина)':1,
        }

metadict_detail['-Герои-земнопони (паладины) (5 lvl)'] = {
        '1 lvl (заклинания паладина)':4,
        '2 lvl (заклинания паладина)':2,
        '2 lvl (ритуальные заклинания паладина)':1,
        }

metadict_detail['-Герои-земнопони (паладины) (6 lvl)'] = {
        '1 lvl (заклинания паладина)':4,
        '2 lvl (заклинания паладина)':2,
        '2 lvl (ритуальные заклинания паладина)':1,
        }

metadict_detail['-Герои-земнопони (паладины) (7 lvl)'] = {
        '1 lvl (заклинания паладина)':4,
        '2 lvl (заклинания паладина)':3,
        '2 lvl (ритуальные заклинания паладина)':1,
        }

metadict_detail['-Герои-земнопони (паладины) (8 lvl)'] = {
        '1 lvl (заклинания паладина)':4,
        '2 lvl (заклинания паладина)':3,
        '2 lvl (ритуальные заклинания паладина)':1,
        }

metadict_detail['-Герои-земнопони (паладины) (9+ lvl)'] = {
        '1 lvl (заклинания паладина)':4,
        '2 lvl (заклинания паладина)':3,
        '3 lvl (заклинания паладина)':2,
        '3 lvl (ритуальные заклинания паладина)':1,
        }

#----
# Герои (ячейки заклинаний) (следопыты)

metadict_detail['-Герои-земнопони (следопыты) (1 lvl)'] = {
        }

metadict_detail['-Герои-земнопони (следопыты) (2 lvl)'] = {
        '1 lvl (заклинания следопыта)':2,
        '1 lvl (ритуальные заклинания следопыта)':1,
        }

metadict_detail['-Герои-земнопони (следопыты) (3 lvl)'] = {
        '1 lvl (заклинания следопыта)':3,
        '1 lvl (ритуальные заклинания следопыта)':1,
        }

metadict_detail['-Герои-земнопони (следопыты) (4 lvl)'] = {
        '1 lvl (заклинания следопыта)':3,
        '1 lvl (ритуальные заклинания следопыта)':1,
        }

metadict_detail['-Герои-земнопони (следопыты) (5 lvl)'] = {
        '1 lvl (заклинания следопыта)':4,
        '2 lvl (заклинания следопыта)':2,
        '2 lvl (ритуальные заклинания следопыта)':1,
        }

metadict_detail['-Герои-земнопони (следопыты) (6 lvl)'] = {
        '1 lvl (заклинания следопыта)':4,
        '2 lvl (заклинания следопыта)':2,
        '2 lvl (ритуальные заклинания следопыта)':1,
        }

metadict_detail['-Герои-земнопони (следопыты) (7 lvl)'] = {
        '1 lvl (заклинания следопыта)':4,
        '2 lvl (заклинания следопыта)':3,
        '2 lvl (ритуальные заклинания следопыта)':1,
        }

metadict_detail['-Герои-земнопони (следопыты) (8 lvl)'] = {
        '1 lvl (заклинания следопыта)':4,
        '2 lvl (заклинания следопыта)':3,
        '2 lvl (ритуальные заклинания следопыта)':1,
        }

metadict_detail['-Герои-земнопони (следопыты) (9+ lvl)'] = {
        '1 lvl (заклинания следопыта)':4,
        '2 lvl (заклинания следопыта)':3,
        '3 lvl (заклинания следопыта)':2,
        '3 lvl (ритуальные заклинания следопыта)':1,
        }

#----
# Герои (ячейки заклинаний) (монахи)

metadict_detail['-Герои-земнопони (монахи) (1 lvl)'] = {
        }

metadict_detail['-Герои-земнопони (монахи) (2 lvl)'] = {
        }

metadict_detail['-Герои-земнопони (монахи) (3 lvl)'] = {
        }

metadict_detail['-Герои-земнопони (монахи) (4 lvl)'] = {
        }

metadict_detail['-Герои-земнопони (монахи) (5 lvl)'] = {
        }

metadict_detail['-Герои-земнопони (монахи) (6 lvl)'] = {
        }

metadict_detail['-Герои-земнопони (монахи) (7 lvl)'] = {
        }

metadict_detail['-Герои-земнопони (монахи) (8 lvl)'] = {
        }

metadict_detail['-Герои-земнопони (монахи) (9+ lvl)'] = {
        }

#----
# Герои (ячейки заклинаний) (бойцы)

metadict_detail['-Герои-пегасы (бойцы) (1 lvl)'] = {
        }

metadict_detail['-Герои-пегасы (бойцы) (2 lvl)'] = {
        }

metadict_detail['-Герои-пегасы (бойцы) (3 lvl)'] = {
        }

metadict_detail['-Герои-пегасы (бойцы) (4 lvl)'] = {
        }

metadict_detail['-Герои-пегасы (бойцы) (5 lvl)'] = {
        }

metadict_detail['-Герои-пегасы (бойцы) (6 lvl)'] = {
        }

metadict_detail['-Герои-пегасы (бойцы) (7 lvl)'] = {
        }

metadict_detail['-Герои-пегасы (бойцы) (8 lvl)'] = {
        }

metadict_detail['-Герои-пегасы (бойцы) (9+ lvl)'] = {
        }

#----
# Герои (ячейки заклинаний) (варвары)

metadict_detail['-Герои-пегасы (варвары) (1 lvl)'] = {
        }

metadict_detail['-Герои-пегасы (варвары) (2 lvl)'] = {
        }

metadict_detail['-Герои-пегасы (варвары) (3 lvl)'] = {
        }

metadict_detail['-Герои-пегасы (варвары) (4 lvl)'] = {
        }

metadict_detail['-Герои-пегасы (варвары) (5 lvl)'] = {
        }

metadict_detail['-Герои-пегасы (варвары) (6 lvl)'] = {
        }

metadict_detail['-Герои-пегасы (варвары) (7 lvl)'] = {
        }

metadict_detail['-Герои-пегасы (варвары) (8 lvl)'] = {
        }

metadict_detail['-Герои-пегасы (варвары) (9+ lvl)'] = {
        }

#----
# Герои (ячейки заклинаний) (плуты)

metadict_detail['-Герои-пегасы (плуты) (1 lvl)'] = {
        }

metadict_detail['-Герои-пегасы (плуты) (2 lvl)'] = {
        }

metadict_detail['-Герои-пегасы (плуты) (3 lvl)'] = {
        }

metadict_detail['-Герои-пегасы (плуты) (4 lvl)'] = {
        }

metadict_detail['-Герои-пегасы (плуты) (5 lvl)'] = {
        }

metadict_detail['-Герои-пегасы (плуты) (6 lvl)'] = {
        }

metadict_detail['-Герои-пегасы (плуты) (7 lvl)'] = {
        }

metadict_detail['-Герои-пегасы (плуты) (8 lvl)'] = {
        }

metadict_detail['-Герои-пегасы (плуты) (9+ lvl)'] = {
        }

#----
# Герои (заклинания)

metadict_detail['0 lvl (заговоры барда)'] = {
        # Число известных заговоров отражает способность их применять.
        # 600 заговоров/час и 3 известных заговора = 3 часа работы = 1800 заговоров/день
        '+0 lvl (заговоры барда) (заклинаний/год)':600 * 300,
        }

metadict_detail['0 lvl (заговоры волшебника)'] = {
        '+0 lvl (заговоры волшебника) (заклинаний/год)':600 * 300,
        }

metadict_detail['0 lvl (заговоры друида)'] = {
        '+0 lvl (заговоры друида) (заклинаний/год)':600 * 300,
        }

metadict_detail['0 lvl (заговоры жреца)'] = {
        '+0 lvl (заговоры жреца) (заклинаний/год)':600 * 300,
        }

metadict_detail['0 lvl (заговоры колдуна)'] = {
        '+0 lvl (заговоры колдуна) (заклинаний/год)':600 * 300,
        }

metadict_detail['0 lvl (заговоры чародея)'] = {
        '+0 lvl (заговоры чародея) (заклинаний/год)':600 * 300,
        }

metadict_detail['1 lvl (заклинания колдуна)'] = {
        # Восстановление ячеек на коротком отдыхе. 4 восстановления/день.
        '+1 lvl (заклинания колдуна) (заклинаний/год)':4 * 300,
        }

metadict_detail['2 lvl (заклинания колдуна)'] = {
        '+2 lvl (заклинания колдуна) (заклинаний/год)':4 * 300,
        }

metadict_detail['3 lvl (заклинания колдуна)'] = {
        '+3 lvl (заклинания колдуна) (заклинаний/год)':4 * 300,
        }

metadict_detail['4 lvl (заклинания колдуна)'] = {
        '+4 lvl (заклинания колдуна) (заклинаний/год)':4 * 300,
        }

metadict_detail['5 lvl (заклинания колдуна)'] = {
        '+5 lvl (заклинания колдуна) (заклинаний/год)':4 * 300,
        }

metadict_detail['1 lvl (заклинания барда)'] = {
        # Слоты заклинаний на число рабочих дней в году.
        '+1 lvl (заклинания барда) (заклинаний/год)':300,
        }

metadict_detail['1 lvl (заклинания волшебника)'] = {
        '+1 lvl (заклинания волшебника) (заклинаний/год)':300,
        }

metadict_detail['1 lvl (заклинания друида)'] = {
        '+1 lvl (заклинания друида) (заклинаний/год)':300,
        }

metadict_detail['1 lvl (заклинания жреца)'] = {
        '+1 lvl (заклинания жреца) (заклинаний/год)':300,
        }

metadict_detail['1 lvl (заклинания паладина)'] = {
        '+1 lvl (заклинания паладина) (заклинаний/год)':300,
        }

metadict_detail['1 lvl (заклинания следопыта)'] = {
        '+1 lvl (заклинания следопыта) (заклинаний/год)':300,
        }

metadict_detail['1 lvl (заклинания чародея)'] = {
        '+1 lvl (заклинания чародея) (заклинаний/год)':300,
        }

metadict_detail['2 lvl (заклинания барда)'] = {
        '+2 lvl (заклинания барда) (заклинаний/год)':300,
        }

metadict_detail['2 lvl (заклинания волшебника)'] = {
        '+2 lvl (заклинания волшебника) (заклинаний/год)':300,
        }

metadict_detail['2 lvl (заклинания друида)'] = {
        '+2 lvl (заклинания друида) (заклинаний/год)':300,
        }

metadict_detail['2 lvl (заклинания жреца)'] = {
        '+2 lvl (заклинания жреца) (заклинаний/год)':300,
        }

metadict_detail['2 lvl (заклинания паладина)'] = {
        '+2 lvl (заклинания паладина) (заклинаний/год)':300,
        }

metadict_detail['2 lvl (заклинания следопыта)'] = {
        '+2 lvl (заклинания следопыта) (заклинаний/год)':300,
        }

metadict_detail['2 lvl (заклинания чародея)'] = {
        '+2 lvl (заклинания чародея) (заклинаний/год)':300,
        }

metadict_detail['3 lvl (заклинания барда)'] = {
        '+3 lvl (заклинания барда) (заклинаний/год)':300,
        }

metadict_detail['3 lvl (заклинания волшебника)'] = {
        '+3 lvl (заклинания волшебника) (заклинаний/год)':300,
        }

metadict_detail['3 lvl (заклинания друида)'] = {
        '+3 lvl (заклинания друида) (заклинаний/год)':300,
        }

metadict_detail['3 lvl (заклинания жреца)'] = {
        '+3 lvl (заклинания жреца) (заклинаний/год)':300,
        }

metadict_detail['3 lvl (заклинания паладина)'] = {
        '+3 lvl (заклинания паладина) (заклинаний/год)':300,
        }

metadict_detail['3 lvl (заклинания следопыта)'] = {
        '+3 lvl (заклинания следопыта) (заклинаний/год)':300,
        }

metadict_detail['3 lvl (заклинания чародея)'] = {
        '+3 lvl (заклинания чародея) (заклинаний/год)':300,
        }

metadict_detail['4 lvl (заклинания барда)'] = {
        '+4 lvl (заклинания барда) (заклинаний/год)':300,
        }

metadict_detail['4 lvl (заклинания волшебника)'] = {
        '+4 lvl (заклинания волшебника) (заклинаний/год)':300,
        }

metadict_detail['4 lvl (заклинания друида)'] = {
        '+4 lvl (заклинания друида) (заклинаний/год)':300,
        }

metadict_detail['4 lvl (заклинания жреца)'] = {
        '+4 lvl (заклинания жреца) (заклинаний/год)':300,
        }

metadict_detail['4 lvl (заклинания чародея)'] = {
        '+4 lvl (заклинания чародея) (заклинаний/год)':300,
        }

metadict_detail['5 lvl (заклинания барда)'] = {
        '+5 lvl (заклинания барда) (заклинаний/год)':300,
        }

metadict_detail['5 lvl (заклинания волшебника)'] = {
        '+5 lvl (заклинания волшебника) (заклинаний/год)':300,
        }

metadict_detail['5 lvl (заклинания друида)'] = {
        '+5 lvl (заклинания друида) (заклинаний/год)':300,
        }

metadict_detail['5 lvl (заклинания жреца)'] = {
        '+5 lvl (заклинания жреца) (заклинаний/год)':300,
        }

metadict_detail['5 lvl (заклинания чародея)'] = {
        '+5 lvl (заклинания чародея) (заклинаний/год)':300,
        }

metadict_detail['1 lvl (ритуальные заклинания барда)'] = {
        # Ритуальные заклинания требуют 10 минут. 4 часа = 24 заклинания.
        '+1 lvl (ритуальные заклинания барда) (заклинаний/год)':24 * 300,
        }

metadict_detail['1 lvl (ритуальные заклинания волшебника)'] = {
        '+1 lvl (ритуальные заклинания волшебника) (заклинаний/год)':24 * 300,
        }

metadict_detail['1 lvl (ритуальные заклинания друида)'] = {
        '+1 lvl (ритуальные заклинания друида) (заклинаний/год)':24 * 300,
        }

metadict_detail['1 lvl (ритуальные заклинания колдуна)'] = {
        '+1 lvl (ритуальные заклинания колдуна) (заклинаний/год)':24 * 300,
        }

metadict_detail['1 lvl (ритуальные заклинания паладина)'] = {
        '+1 lvl (ритуальные заклинания паладина) (заклинаний/год)':24 * 300,
        }

metadict_detail['1 lvl (ритуальные заклинания следопыта)'] = {
        '+1 lvl (ритуальные заклинания следопыта) (заклинаний/год)':24 * 300,
        }

metadict_detail['1 lvl (ритуальные заклинания чародея)'] = {
        '+1 lvl (ритуальные заклинания чародея) (заклинаний/год)':24 * 300,
        }

metadict_detail['2 lvl (ритуальные заклинания барда)'] = {
        '+2 lvl (ритуальные заклинания барда) (заклинаний/год)':24 * 300,
        }

metadict_detail['2 lvl (ритуальные заклинания волшебника)'] = {
        '+2 lvl (ритуальные заклинания волшебника) (заклинаний/год)':24 * 300,
        }

metadict_detail['2 lvl (ритуальные заклинания друида)'] = {
        '+2 lvl (ритуальные заклинания друида) (заклинаний/год)':24 * 300,
        }

metadict_detail['2 lvl (ритуальные заклинания колдуна)'] = {
        '+2 lvl (ритуальные заклинания колдуна) (заклинаний/год)':24 * 300,
        }

metadict_detail['2 lvl (ритуальные заклинания паладина)'] = {
        '+2 lvl (ритуальные заклинания паладина) (заклинаний/год)':24 * 300,
        }

metadict_detail['2 lvl (ритуальные заклинания следопыта)'] = {
        '+2 lvl (ритуальные заклинания следопыта) (заклинаний/год)':24 * 300,
        }

metadict_detail['2 lvl (ритуальные заклинания чародея)'] = {
        '+2 lvl (ритуальные заклинания чародея) (заклинаний/год)':24 * 300,
        }

metadict_detail['3 lvl (ритуальные заклинания барда)'] = {
        '+3 lvl (ритуальные заклинания барда) (заклинаний/год)':24 * 300,
        }

metadict_detail['3 lvl (ритуальные заклинания волшебника)'] = {
        '+3 lvl (ритуальные заклинания волшебника) (заклинаний/год)':24 * 300,
        }

metadict_detail['3 lvl (ритуальные заклинания друида)'] = {
        '+3 lvl (ритуальные заклинания друида) (заклинаний/год)':24 * 300,
        }

metadict_detail['3 lvl (ритуальные заклинания колдуна)'] = {
        '+3 lvl (ритуальные заклинания колдуна) (заклинаний/год)':24 * 300,
        }

metadict_detail['3 lvl (ритуальные заклинания паладина)'] = {
        '+3 lvl (ритуальные заклинания паладина) (заклинаний/год)':24 * 300,
        }

metadict_detail['3 lvl (ритуальные заклинания следопыта)'] = {
        '+3 lvl (ритуальные заклинания следопыта) (заклинаний/год)':24 * 300,
        }

metadict_detail['3 lvl (ритуальные заклинания чародея)'] = {
        '+3 lvl (ритуальные заклинания чародея) (заклинаний/год)':24 * 300,
        }

metadict_detail['4 lvl (ритуальные заклинания барда)'] = {
        '+4 lvl (ритуальные заклинания барда) (заклинаний/год)':24 * 300,
        }

metadict_detail['4 lvl (ритуальные заклинания волшебника)'] = {
        '+4 lvl (ритуальные заклинания волшебника) (заклинаний/год)':24 * 300,
        }

metadict_detail['4 lvl (ритуальные заклинания друида)'] = {
        '+4 lvl (ритуальные заклинания друида) (заклинаний/год)':24 * 300,
        }

metadict_detail['4 lvl (ритуальные заклинания колдуна)'] = {
        '+4 lvl (ритуальные заклинания колдуна) (заклинаний/год)':24 * 300,
        }

metadict_detail['4 lvl (ритуальные заклинания чародея)'] = {
        '+4 lvl (ритуальные заклинания чародея) (заклинаний/год)':24 * 300,
        }

metadict_detail['5 lvl (ритуальные заклинания барда)'] = {
        '+5 lvl (ритуальные заклинания барда) (заклинаний/год)':24 * 300,
        }

metadict_detail['5 lvl (ритуальные заклинания волшебника)'] = {
        '+5 lvl (ритуальные заклинания волшебника) (заклинаний/год)':24 * 300,
        }

metadict_detail['5 lvl (ритуальные заклинания друида)'] = {
        '+5 lvl (ритуальные заклинания друида) (заклинаний/год)':24 * 300,
        }

metadict_detail['5 lvl (ритуальные заклинания колдуна)'] = {
        '+5 lvl (ритуальные заклинания колдуна) (заклинаний/год)':24 * 300,
        }

metadict_detail['5 lvl (ритуальные заклинания чародея)'] = {
        '+5 lvl (ритуальные заклинания чародея) (заклинаний/год)':24 * 300,
        }

metadict_detail['1 lvl (ритуальные заклинания жреца)'] = {
        '+1 lvl (ритуальные заклинания жреца) (заклинаний/год)':24 * 300,
        }

metadict_detail['2 lvl (ритуальные заклинания жреца)'] = {
        '+2 lvl (ритуальные заклинания жреца) (заклинаний/год)':24 * 300,
        }

metadict_detail['3 lvl (ритуальные заклинания жреца)'] = {
        '+3 lvl (ритуальные заклинания жреца) (заклинаний/год)':24 * 300,
        }

metadict_detail['4 lvl (ритуальные заклинания жреца)'] = {
        '+4 lvl (ритуальные заклинания жреца) (заклинаний/год)':24 * 300,
        }

metadict_detail['5 lvl (ритуальные заклинания жреца)'] = {
        '+5 lvl (ритуальные заклинания жреца) (заклинаний/год)':24 * 300,
        }

#----
# Заговоры (книга заклинаний, spellbok)

metadict_detail['+0 lvl (заговоры волшебника) (заклинаний/год)'] = {
        '+0 lvl Лепка земли (0 lvl Mold_Earth)':0.4,
        '+0 lvl Формирование воды (0 lvl Shape_Water)':0.2,
        '+0 lvl Сотворение костра (0 lvl Create_Bonfire)':0.2,
        '+0 lvl Склеить предмет (0 lvl Mending)':0.1,
        #'+0 lvl Прочесть магию (0 lvl Read_Magic)':0.1,
        #'+0 lvl Левитация предмета (0 lvl Mage_Hand)':0.1,
        #'+0 lvl Магическая надпись (0 lvl Arcane_Mark)':0.1,
        #'+0 lvl Малая иллюзия (0 lvl Minor_Illusion)':0.1,
        #'+0 lvl Склеить предмет (0 lvl Mending)':0.1,
        #'+0 lvl Электрошок (0 lvl Shocking_Grasp)':0.1,
        #'+0 lvl Летящие иглы (0 lvl Homing_Needles)':0.1,
        #'+0 lvl Мистический заряд (0 lvl Eldritch_Blast)':0.1,
        #'+0 lvl Власть над огнём (0 lvl Control_Flames)':0.1,
        #'+0 lvl Формирование воды (0 lvl Shape_Water)':0.1,
        #'+0 lvl Ударная волна (0 lvl Windblast)':0.1,
        #'+0 lvl Лепка земли (0 lvl Mold_Earth)':0.1,
        #'+0 lvl Осветить (0 lvl Light)':0.1,
        '+0 lvl (заклинаний/год) (доступно)':1,
        }

metadict_detail['+0 lvl (заговоры чародея) (заклинаний/год)'] = {
        # Магия чародеев-самоучек. металлургия, земляные работы, холодильники, мелкий ремонт
        '+0 lvl Лепка земли (0 lvl Mold_Earth)':0.3,
        '+0 lvl Формирование воды (0 lvl Shape_Water)':0.2,
        '+0 lvl Сотворение костра (0 lvl Create_Bonfire)':0.2,
        '+0 lvl Магическая надпись (0 lvl Arcane_Mark)':0.1,
        '+0 lvl Склеить предмет (0 lvl Mending)':0.1,
        #'+0 lvl Левитация предмета (0 lvl Mage_Hand)':0.1,
        #'+0 lvl Магическая надпись (0 lvl Arcane_Mark)':0.1,
        #'+0 lvl Малая иллюзия (0 lvl Minor_Illusion)':0.1,
        #'+0 lvl Склеить предмет (0 lvl Mending)':0.1,
        #'+0 lvl Электрошок (0 lvl Shocking_Grasp)':0.1,
        #'+0 lvl Мистический заряд (0 lvl Eldritch_Blast)':0.1,
        #'+0 lvl Сотворение костра (0 lvl Create_Bonfire)':0.1,
        #'+0 lvl Власть над огнём (0 lvl Control_Flames)':0.1,
        #'+0 lvl Формирование воды (0 lvl Shape_Water)':0.1,
        #'+0 lvl Ударная волна (0 lvl Windblast)':0.1,
        #'+0 lvl Лепка земли (0 lvl Mold_Earth)':0.1,
        #'+0 lvl Осветить (0 lvl Light)':0.1,
        '+0 lvl (заклинаний/год) (доступно)':1,
        }

metadict_detail['+0 lvl (заговоры колдуна) (заклинаний/год)'] = {
        # Магия кристальных сердец. Энергия, металлургия.
        '+0 lvl Сотворение костра (0 lvl Create_Bonfire)':0.9,
        #'+0 lvl Левитация предмета (0 lvl Mage_Hand)':0.1,
        #'+0 lvl Мистический заряд (0 lvl Eldritch_Blast)':0.1,
        #'+0 lvl Сотворение костра (0 lvl Create_Bonfire)':0.1,
        #'+0 lvl Власть над огнём (0 lvl Control_Flames)':0.1,
        #'+0 lvl Слово сияния (0 lvl Word_of_Radiance)':0.1,
        #'+0 lvl Священное пламя (0 lvl Sacred_Flame)':0.1,
        #'+0 lvl Защита от оружия (0 lvl Blade_Ward)':0.1,
        #'+0 lvl Огненный снаряд (0 lvl Fire_Bolt)':0.1,
        #'+0 lvl Вспышка мечей (0 lvl Sword_Burst)':0.1,
        '+0 lvl (заклинаний/год) (доступно)':1,
        }

metadict_detail['+0 lvl (заговоры барда) (заклинаний/год)'] = {
        # Магия ленивых Динки. Представления, украшательство городов.
        '+0 lvl Магическая надпись (0 lvl Arcane_Mark)':0.5,
        '+0 lvl Малая иллюзия (0 lvl Minor_Illusion)':0.3,
        '+0 lvl Пляшущие огоньки (0 lvl Dancing_Lights)':0.1,
        #'+0 lvl Левитация предмета (0 lvl Mage_Hand)':0.1,
        #'+0 lvl Говорящая книга (0 lvl Speaking_Tome)':0.1,
        #'+0 lvl Пляшущие огоньки (0 lvl Dancing_Lights)':0.1,
        #'+0 lvl Невидимые чернила (0 lvl Invisible_Ink)':0.1,
        #'+0 lvl Слово силы «Мяу» (0 lvl Power_Word_Meow)':0.1,
        #'+0 lvl Магическая надпись (0 lvl Arcane_Mark)':0.1,
        #'+0 lvl Малая иллюзия (0 lvl Minor_Illusion)':0.1,
        #'+0 lvl Направленный звук (0 lvl Sonic_Beam)':0.1,
        #'+0 lvl Сообщение (0 lvl Message)':0.1,
        #'+0 lvl Хитрости барда (0 lvl Bardcraft)':0.1,
        #'+0 lvl Пушистость (0 lvl Downy)':0.1,
        #'+0 lvl Дружба (0 lvl Friends)':0.1,
        '+0 lvl (заклинаний/год) (доступно)':1,
        }

metadict_detail['+0 lvl (заговоры друида) (заклинаний/год)'] = {
        # Магия трудолюбивых земных. Огороды, цветочки, земляные работы.
        '+0 lvl Исскуство друидов (0 lvl Druidcraft)':0.6,
        '+0 lvl Лепка земли (0 lvl Mold_Earth)':0.3,
        #'+0 lvl Исскуство друидов (0 lvl Druidcraft)':0.1,
        #'+0 lvl Пляшущие огоньки (0 lvl Dancing_Lights)':0.1,
        #'+0 lvl Волшебный камень (0 lvl Magic_Stone)':0.1,
        #'+0 lvl Подозвать пчелу (0 lvl Summon_Bee)':0.1,
        #'+0 lvl Терновый кнут (0 lvl Thorn_Whip)':0.1,
        #'+0 lvl Сопротивление (0 lvl Resistance)':0.1,
        #'+0 lvl Лепка земли (0 lvl Mold_Earth)':0.1,
        #'+0 lvl Руководство (0 lvl Guidance)':0.1,
        #'+0 lvl Осветить (0 lvl Light)':0.1,
        '+0 lvl (заклинаний/год) (доступно)':1,
        }

metadict_detail['+0 lvl (заговоры жреца) (заклинаний/год)'] = {
        # Пегасьи трюки. Работа погодной службы. Ветер и охлаждение воды.
        '+0 lvl Шквал (0 lvl Gust)':0.8,
        '+0 lvl Формирование воды (0 lvl Shape_Water)':0.1,
        '+0 lvl Трауматургия (0 lvl Thaumaturgy)':0.01,
        '+0 lvl Сообщение (0 lvl Message)':0.01,
        #'+0 lvl Трауматургия (0 lvl Thaumaturgy)':0.1,
        #'+0 lvl Сообщение (0 lvl Message)':0.1,
        #'+0 lvl Направленный звук (0 lvl Sonic_Beam)':0.1,
        #'+0 lvl Пляшущие огоньки (0 lvl Dancing_Lights)':0.1,
        #'+0 lvl Формирование воды (0 lvl Shape_Water)':0.1,
        #'+0 lvl Лассо молнии (0 lvl Lightning_Lure)':0.1,
        #'+0 lvl Компас (0 lvl Know_Direction)':0.1,
        #'+0 lvl Вспышка (0 lvl Flare)':0.1,
        #'+0 lvl Шквал (0 lvl Gust)':0.1,
        '+0 lvl (заклинаний/год) (доступно)':1,
        }

#----
# Заклинания 1 круга

metadict_detail['+1 lvl (заклинания волшебника) (заклинаний/год)'] = {
        '+1 lvl Безмолвный образ (1 lvl Silent_Image)':0.5,
        '+1 lvl Ходьба по облакам (1 lvl Air Walk)':0.2,
        '+1 lvl Доспехи мага (1 lvl Mage_Armor)':0.2,
        #'+1 lvl Доспехи мага (1 lvl Mage_Armor)':0.1,
        #'+1 lvl Мембранный барьер (1 lvl Barrier_Membrane)':0.1,
        #'+1 lvl Безмолвный образ (1 lvl Silent_Image)':0.1,
        #'+1 lvl Поглощение стихий (1 lvl Absorb_Elements)':0.1,
        #'+1 lvl Огонь фей (1 lvl Faerie_Fire)':0.1,
        #'+1 lvl Поиск фамильяра (1 lvl Find_Familiar)':0.1,
        #'+1 lvl Очарование личности (1 lvl Charm_Person)':0.1,
        #'+1 lvl Ходьба по облакам (4 lvl Air Walk)':0.1,
        #'+1 lvl Маскировка себя (1 lvl Disguise_Self)':0.1,
        #'+1 lvl Сумеречное зрение (1 lvl Low-light Vision)':0.1,
        #'+1 lvl Усыпление (1 lvl Sleep)':0.1,
        #'+1 lvl Магическая стрела (1 lvl Mage Arrow)':0.1,
        '+1 lvl (заклинаний/год) (доступно)':1,
        }

metadict_detail['+1 lvl (заклинания чародея) (заклинаний/год)'] = {
        '+1 lvl Безмолвный образ (1 lvl Silent_Image)':0.6,
        '+1 lvl Доспехи мага (1 lvl Mage_Armor)':0.2,
        '+1 lvl Ходьба по облакам (1 lvl Air Walk)':0.1,
        #'+1 lvl Мембранный барьер (1 lvl Barrier_Membrane)':0.1,
        #'+1 lvl Магическое лезвие (1 lvl Persistent Blade)':0.1,
        '+1 lvl (заклинаний/год) (доступно)':1,
        }

metadict_detail['+1 lvl (заклинания колдуна) (заклинаний/год)'] = {
        '+1 lvl Лечебный сон (1 lvl Healthful_Rest)':0.9,
        #'+1 lvl Героизм (1 lvl Heroism)':0.1,
        #'+1 lvl Лечебный сон (1 lvl Healthful_Rest)':0.1,
        #'+1 lvl Магическое лезвие (1 lvl Persistent Blade)':0.1,
        #'+1 lvl Прах к праху (1 lvl Dust_to_Dust)':0.1,
        '+1 lvl (заклинаний/год) (доступно)':1,
        }

metadict_detail['+1 lvl (заклинания барда) (заклинаний/год)'] = {
        '+1 lvl Лечебный сон (1 lvl Healthful_Rest)':0.9,
        #'+1 lvl Сверкающие брызги (1 lvl Color_Spray)':0.1,
        #'+1 lvl Лечебный сон (1 lvl Healthful_Rest)':0.1,
        #'+1 lvl Живая верёвка (1 lvl Animate_Rope)':0.1,
        #'+1 lvl Диссонирующий шёпот (1 lvl Dissonant_Whispers)':0.1,
        '+1 lvl (заклинаний/год) (доступно)':1,
        }

metadict_detail['+1 lvl (заклинания друида) (заклинаний/год)'] = {
        '+1 lvl Добряника (1 lvl Goodberry)':0.7,
        '+1 lvl Очаровать зверя (1 lvl Charm_Animal)':0.2,
        #'+1 lvl Деревянный прислужник (1 lvl Wood_Wose)':0.1,
        #'+1 lvl Оживить деревянный предмет (1 lvl Animate_Wood)':0.1,
        #'+1 lvl Очаровать зверя (1 lvl Charm_Animal)':0.1,
        #'+1 lvl Успокоить зверя (1 lvl Calm_Animals)':0.1,
        #'+1 lvl Найти живого (1 lvl Detect_Animals_Or_Plants)':0.1,
        #'+1 lvl Опутывание (1 lvl Entangle)':0.1,
        '+1 lvl (заклинаний/год) (доступно)':1,
        }

metadict_detail['+1 lvl (заклинания жреца) (заклинаний/год)'] = {
        # Жрецы эквестрии, это пегасы-погодники. Они не владеют лечебными заклинаниями.
        # Левитация пегаса создаёт магнитное кольцо с окружающей тело мембраной.
        # Эта мембрана во всём подобна защите от заклинания Barrier_Membrane.
        '+1 lvl Туманное облако (1 lvl Fog_Cloud)':0.6,
        '+1 lvl Падение пёрышком (1 lvl Feather_Fall)':0.1,
        '+1 lvl Поглощение стихий (1 lvl Absorb_Elements)':0.1,
        #'+1 lvl Волна грома (1 lvl Thunderwave)':0.1,
        #'+1 lvl Найти воду (1 lvl Locate_Water)':0.1,
        #'+1 lvl Ледяной кинжал (1 lvl Ice_Knife)':0.1,
        #'+1 lvl Падение пёрышком (1 lvl Feather_Fall)':0.1,
        #'+1 lvl Поглощение стихий (1 lvl Absorb_Elements)':0.1,
        #'+1 lvl Мембранный барьер (1 lvl Barrier_Membrane)':0.1,
        #'+1 lvl Сотворение или уничтожение воды (1 lvl Create_or_Destroy_Water)':0.1,
        #'+1 lvl Призвать молниевое облачко (1 lvl Thunderhead)':0.1,
        #'+1 lvl Призвать дождевое облачко (1 lvl Cloudburst)':0.1,
        #'+1 lvl Сформировать снег (1 lvl Snowdrift)':0.1,
        #'+1 lvl Туманное облако (1 lvl Fog_Cloud)':0.1,
        '+1 lvl (заклинаний/год) (доступно)':1,
        }

metadict_detail['+1 lvl (заклинания паладина) (заклинаний/год)'] = {
        '+1 lvl Героизм (1 lvl Heroism)':0.9,
        #'+1 lvl Поглощение стихий (1 lvl Absorb_Elements)':0.1,
        #'+1 lvl Благословение (1 lvl Bless)':0.1,
        #'+1 lvl Героизм (1 lvl Heroism)':0.1,
        '+1 lvl (заклинаний/год) (доступно)':1,
        }

metadict_detail['+1 lvl (заклинания следопыта) (заклинаний/год)'] = {
        '+1 lvl Очаровать зверя (1 lvl Charm_Animal)':0.6,
        '+1 lvl Добряника (1 lvl Goodberry)':0.3,
        #'+1 lvl Очаровать зверя (1 lvl Charm_Animal)':0.1,
        #'+1 lvl Успокоить зверя (1 lvl Calm_Animals)':0.1,
        #'+1 lvl Найти воду (1 lvl Locate_Water)':0.1,
        #'+1 lvl Поглощение стихий (1 lvl Absorb_Elements)':0.1,
        #'+1 lvl Крепкая шкура (1 lvl Force_Skin)':0.1,
        '+1 lvl (заклинаний/год) (доступно)':1,
        }

#----
# Заклинания 2 круга

metadict_detail['+2 lvl (заклинания барда) (заклинаний/год)'] = {
        '+2 lvl Внушение (2 lvl Suggestion)':0.9,
        #'+2 lvl Внушение (2 lvl Suggestion)':0.1,
        #'+2 lvl Воображаемая сила (2 lvl Phantasmal_Force)':0.1,
        '+2 lvl (заклинаний/год) (доступно)':1,
        }

metadict_detail['+2 lvl (заклинания волшебника) (заклинаний/год)'] = {
        # Те самые яркосветы, которые повсюду в городах.
        '+2 lvl Вечный огонь (2 lvl Continual_Flame)':0.7,
        '+2 lvl Волшебный замок (2 lvl Arcane_Lock)':0.2,
        #'+2 lvl Туманный шаг (2 lvl Misty_Step)':0.1,
        #'+2 lvl Левитация (2 lvl Levitate)':0.1,
        #'+2 lvl Открывание (2 lvl Knock)':0.1,
        #'+2 lvl Вечный огонь (2 lvl Continual_Flame)':0.1,
        #'+2 lvl Поиск предмета (2 lvl Locate_Object)':0.1,
        #'+2 lvl Улучшение характеристики (2 lvl Enhance_Ability)':0.1,
        #'+2 lvl Видение невидимого (2 lvl See_Invisibility)':0.1,
        #'+2 lvl Невидимость (2 lvl Invisibility)':0.1,
        #'+2 lvl Волшебный замок (2 lvl Arcane_Lock)':0.1,
        #'+2 lvl Тёмное зрение (2 lvl Darkvision)':0.1,
        #'+2 lvl Тьма (2 lvl Darkness)':0.1,
        #'+2 lvl Отражения (2 lvl Mirror_Image)':0.1,
        #'+2 lvl Размытый образ (2 lvl Blur)':0.1,
        '+2 lvl (заклинаний/год) (доступно)':1,
        }

metadict_detail['+2 lvl (заклинания чародея) (заклинаний/год)'] = {
        '+2 lvl Вечный огонь (2 lvl Continual_Flame)':0.7,
        '+2 lvl Волшебный замок (2 lvl Arcane_Lock)':0.2,
        #'+2 lvl Туманный шаг (2 lvl Misty_Step)':0.1,
        '+2 lvl (заклинаний/год) (доступно)':1,
        }

metadict_detail['+2 lvl (заклинания друида) (заклинаний/год)'] = {
        '+2 lvl Малое восстановление (2 lvl Lesser_Restoration)':0.9,
        #'+2 lvl Исцеляющий дух (2 lvl Healing_Spirit)':0.1,
        #'+2 lvl Малое восстановление (2 lvl Lesser_Restoration)':0.1,
        #'+2 lvl Защита от яда (2 lvl Protection_from_Poison)':0.1,
        #'+2 lvl Шипы (2 lvl Spike_Growth)':0.1,
        '+2 lvl (заклинаний/год) (доступно)':1,
        }

metadict_detail['+2 lvl (заклинания жреца) (заклинаний/год)'] = {
        '+2 lvl Порыв ветра (2 lvl Gust_of_Wind)':0.8,
        '+2 lvl Охраняющая связь (2 lvl Warding_Bond)':0.1,
        #'+2 lvl Порыв ветра (2 lvl Gust_of_Wind)':0.1,
        #'+2 lvl Защитный ветер (2 lvl Warding_Wind)':0.1,
        #'+2 lvl Охраняющая связь (2 lvl Warding_Bond)':0.1,
        #'+2 lvl Умиротворение (2 lvl Calm_Emotions)':0.1,
        #'+2 lvl Поиск ловушек (2 lvl Find_Traps)':0.1,
        '+2 lvl (заклинаний/год) (доступно)':1,
        }

metadict_detail['+2 lvl (заклинания колдуна) (заклинаний/год)'] = {
        '+2 lvl Малое восстановление (2 lvl Lesser_Restoration)':0.9,
        #'+2 lvl Малое восстановление (2 lvl Lesser_Restoration)':0.1,
        #'+2 lvl Область истины (2 lvl Zone_of_Truth)':0.1,
        #'+2 lvl Подмога (2 lvl Aid)':0.1,
        '+2 lvl (заклинаний/год) (доступно)':1,
        }

metadict_detail['+2 lvl (заклинания паладина) (заклинаний/год)'] = {
        '+2 lvl Малое восстановление (2 lvl Lesser_Restoration)':0.9,
        '+2 lvl (заклинаний/год) (доступно)':1,
        }

metadict_detail['+2 lvl (заклинания следопыта) (заклинаний/год)'] = {
        '+2 lvl Малое восстановление (2 lvl Lesser_Restoration)':0.9,
        '+2 lvl (заклинаний/год) (доступно)':1,
        }

#----
# Заклинания 3 круга

metadict_detail['+3 lvl (заклинания барда) (заклинаний/год)'] = {
        '+3 lvl (заклинаний/год) (доступно)':1,
        }

metadict_detail['+3 lvl (заклинания волшебника) (заклинаний/год)'] = {
        '+3 lvl Послание (3 lvl Sending)':0.6,
        '+3 lvl Охранные руны (3 lvl Glyph_of_Warding)':0.2,
        '+3 lvl Рассеивание магии (3 lvl Dispel_Magic)':0.1,
        #'+3 lvl Передача жизни (3 lvl Life_Transference)':0.1,
        #'+3 lvl Охранные руны (3 lvl Glyph_of_Warding)':0.1,
        #'+3 lvl Гипнотический узор (3 lvl Hypnotic_Pattern)':0.1,
        #'+3 lvl Магический круг (3 lvl Magic_Circle)':0.1,
        #'+3 lvl Необнаружимость (3 lvl Nondetection)':0.1,
        #'+3 lvl Образ (3 lvl Major_Image)':0.1,
        #'+3 lvl Полёт (3 lvl Fly)':0.1,
        #'+3 lvl Мерцание (3 lvl Blink)':0.1,
        #'+3 lvl Дрёма (3 lvl Catnap)':0.1,
        #'+3 lvl Защита от энергии (3 lvl Protection_from_Energy)':0.1,
        #'+3 lvl Подсматривание (3 lvl Clairvoyance)':0.1,
        #'+3 lvl Рассеивание магии (3 lvl Dispel_Magic)':0.1,
        #'+3 lvl Крошечный слуга (3 lvl Tiny_Servant)':0.1,
        #'+3 lvl Огненный шар (3 lvl Fireball)':0.1,
        #'+3 lvl Ужас (3 lvl Fear)':0.1,
        '+3 lvl (заклинаний/год) (доступно)':1,
        }

metadict_detail['+3 lvl (заклинания чародея) (заклинаний/год)'] = {
        '+3 lvl Послание (3 lvl Sending)':0.5,
        '+3 lvl Охранные руны (3 lvl Glyph_of_Warding)':0.3,
        '+3 lvl Рассеивание магии (3 lvl Dispel_Magic)':0.1,
        '+3 lvl (заклинаний/год) (доступно)':1,
        }

metadict_detail['+3 lvl (заклинания колдуна) (заклинаний/год)'] = {
        '+3 lvl Аура живучести (3 lvl Aura_of_Vitality)':0.9,
        #'+3 lvl Мантия крестоносца (3 lvl Crusaders_Mantle)':0.1,
        #'+3 lvl Маяк надежды (3 lvl Beacon_of_Hope)':0.1,
        #'+3 lvl Дневной свет (3 lvl Daylight)':0.1,
        '+3 lvl (заклинаний/год) (доступно)':1,
        }

metadict_detail['+3 lvl (заклинания друида) (заклинаний/год)'] = {
        '+3 lvl Рост растений (3 lvl Plant_Growth)':0.9,
        #'+3 lvl Призыв животных (3 lvl Conjure_Animals)':0.1,
        #'+3 lvl Духовные стражи (3 lvl Spirit_Guardians)':0.1,
        #'+3 lvl Разговор с растениями (3 lvl Speak_with_Plants)':0.1,
        '+3 lvl (заклинаний/год) (доступно)':1,
        }

metadict_detail['+3 lvl (заклинания жреца) (заклинаний/год)'] = {
        '+3 lvl Метель (3 lvl Sleet_Storm)':0.9,
        #'+3 lvl Дневной свет (3 lvl Daylight)':0.1,
        #'+3 lvl Молния (3 lvl Lightning_Bolt)':0.1,
        #'+3 lvl Громовой шаг (3 lvl Thunder_Step)':0.1,
        #'+3 lvl Приливная волна (3 lvl Tidal_Wave)':0.1,
        #'+3 lvl Водяная стена (3 lvl Wall_of_Water)':0.1,
        #'+3 lvl Метель (3 lvl Sleet_Storm)':0.1,
        '+3 lvl (заклинаний/год) (доступно)':1,
        }

metadict_detail['+3 lvl (заклинания паладина) (заклинаний/год)'] = {
        '+3 lvl Аура живучести (3 lvl Aura_of_Vitality)':0.9,
        #'+3 lvl Мантия крестоносца (3 lvl Crusaders_Mantle)':0.1,
        #'+3 lvl Маяк надежды (3 lvl Beacon_of_Hope)':0.1,
        #'+3 lvl Аура живучести (3 lvl Aura_of_Vitality)':0.1,
        '+3 lvl (заклинаний/год) (доступно)':1,
        }

metadict_detail['+3 lvl (заклинания следопыта) (заклинаний/год)'] = {
        '+3 lvl (заклинаний/год) (доступно)':1,
        }

#----
# Заклинания 4 круга

metadict_detail['+4 lvl (заклинания барда) (заклинаний/год)'] = {
        #'+4 lvl Очарование монстра (4 lvl Charm_Monster)':0.1,
        #'+4 lvl Мираж (4 lvl Hallucinatory_Terrain)':0.1,
        '+4 lvl (заклинаний/год) (доступно)':1,
        }

metadict_detail['+4 lvl (заклинания волшебника) (заклинаний/год)'] = {
        '+4 lvl Леомундов потайной сундук (4 lvl Leomund_Secret_Chest)':0.6,
        '+4 lvl Изготовление (4 lvl Fabricate)':0.2,
        '+4 lvl Превращение (4 lvl Polymorph)':0.1,
        #'+4 lvl Изготовление (4 lvl Fabricate)':0.1,
        #'+4 lvl Магический глаз (4 lvl Arcane_Eye)':0.1,
        #'+4 lvl Изменение формы камня (4 lvl Stone_Shape)':0.1,
        #'+4 lvl Леомундов потайной сундук (4 lvl Leomund_Secret_Chest)':0.1,
        #'+4 lvl Призыв малых элементалей (4 lvl Conjure_Minor_Elementals)':0.1,
        #'+4 lvl Власть над водами (4 lvl Control_Water)':0.1,
        #'+4 lvl Переносящая дверь (4 lvl Dimension_Door)':0.1,
        #'+4 lvl Высшая невидимость (4 lvl Greater_Invisibility)':0.1,
        #'+4 lvl Поиск существа (4 lvl Locate_Creature)':0.1,
        #'+4 lvl Каменная кожа (4 lvl Stoneskin)':0.1,
        #'+4 lvl Отилюков упругий шар (4 lvl Otiluke_Resilent_Sphere)':0.1,
        #'+4 lvl Превращение (4 lvl Polymorph)':0.1,
        '+4 lvl (заклинаний/год) (доступно)':1,
        }

metadict_detail['+4 lvl (заклинания чародея) (заклинаний/год)'] = {
        '+4 lvl Леомундов потайной сундук (4 lvl Leomund_Secret_Chest)':0.6,
        '+4 lvl Изготовление (4 lvl Fabricate)':0.2,
        '+4 lvl Превращение (4 lvl Polymorph)':0.1,
        '+4 lvl (заклинаний/год) (доступно)':1,
        }

metadict_detail['+4 lvl (заклинания колдуна) (заклинаний/год)'] = {
        '+4 lvl Леомундов потайной сундук (4 lvl Leomund_Secret_Chest)':0.6,
        '+4 lvl Магический глаз (4 lvl Arcane_Eye)':0.3,
        #'+4 lvl Изгнание (4 lvl Banishment)':0.1,
        #'+4 lvl Магический глаз (4 lvl Arcane_Eye)':0.1,
        #'+4 lvl Поиск существа (4 lvl Locate_Creature)':0.1,
        '+4 lvl (заклинаний/год) (доступно)':1,
        }

metadict_detail['+4 lvl (заклинания друида) (заклинаний/год)'] = {
        '+4 lvl Защита от смерти (4 lvl Death_Ward)':0.7,
        '+4 lvl Призыв лесных обитателей (4 lvl Conjure_Woodlands_Beings)':0.2,
        #'+4 lvl Призыв лесных обитателей (4 lvl Conjure_Woodlands_Beings)':0.1,
        #'+4 lvl Защита от смерти (4 lvl Death_Ward)':0.1,
        '+4 lvl (заклинаний/год) (доступно)':1,
        }

metadict_detail['+4 lvl (заклинания жреца) (заклинаний/год)'] = {
        '+4 lvl Призыв малых элементалей (4 lvl Conjure_Minor_Elementals)':0.9,
        #'+4 lvl Призыв малых элементалей (4 lvl Conjure_Minor_Elementals)':0.1,
        #'+4 lvl Власть над водами (4 lvl Control_Water)':0.1,
        #'+4 lvl Сфера бури (4 lvl Storm_Sphere)':0.1,
        #'+4 lvl Град (4 lvl Ice_Storm)':0.1,
        '+4 lvl (заклинаний/год) (доступно)':1,
        }

#----
# Заклинания 5 круга

metadict_detail['+5 lvl (заклинания барда) (заклинаний/год)'] = {
        '+5 lvl Усиление навыка (5 lvl Skill_Empowerment)':0.8,
        '+5 lvl Обет (5 lvl Geas)':0.1,
        '+5 lvl (заклинаний/год) (доступно)':1,
        }

metadict_detail['+5 lvl (заклинания волшебника) (заклинаний/год)'] = {
        '+5 lvl Круг телепортации (5 lvl Teleportation_Circle)':0.7,
        '+5 lvl Планарные узы (5 lvl Planar_Binding)':0.1,
        '+5 lvl Наблюдение (5 lvl Scrying)':0.1,
        #'+5 lvl Вещий сон (5 lvl Dream)':0.1,
        #'+5 lvl Наблюдение (5 lvl Scrying)':0.1,
        #'+5 lvl Планарные узы (5 lvl Planar_Binding)':0.1,
        #'+5 lvl Круг телепортации (5 lvl Teleportation_Circle)':0.1,
        #'+5 lvl Призыв элементалей (5 lvl Conjure_Elemental)':0.1,
        #'+5 lvl Оживление вещей (5 lvl Animate_Objects)':0.1,
        #'+5 lvl Далёкий шаг (5 lvl Far_Step)':0.1,
        #'+5 lvl Знание легенд (5 lvl Legend_Lore)':0.1,
        #'+5 lvl Создание прохода (5 lvl Passwall)':0.1,
        #'+5 lvl Планарные узы (5 lvl Planar_Binding)':0.1,
        #'+5 lvl Телекинез (5 lvl Telekinesis)':0.1,
        #'+5 lvl Силовая стена (5 lvl Wall_of_Force)':0.1,
        #'+5 lvl Конус холода (5 lvl Cone_of_Cold)':0.1,
        '+5 lvl (заклинаний/год) (доступно)':1,
        }

metadict_detail['+5 lvl (заклинания чародея) (заклинаний/год)'] = {
        '+5 lvl Круг телепортации (5 lvl Teleportation_Circle)':0.6,
        '+5 lvl Планарные узы (5 lvl Planar_Binding)':0.3,
        '+5 lvl (заклинаний/год) (доступно)':1,
        }

metadict_detail['+5 lvl (заклинания друида) (заклинаний/год)'] = {
        '+5 lvl Пробуждённый разум (5 lvl Awaken)':0.5,
        '+5 lvl Высшее восстановление (5 lvl Greater_Restoration)':0.4,
        #'+5 lvl Удержание монстра (5 lvl Hold_Monster)':0.1,
        #'+5 lvl Преобразование камня (5 lvl Transmute_Rock)':0.1,
        #'+5 lvl Каменная стена (5 lvl Wall_of_Stone)':0.1,
        #'+5 lvl Гнев природы (5 lvl Wrath_of_Nature)':0.1,
        #'+5 lvl Древесный путь (5 lvl Tree_Stride)':0.1,
        '+5 lvl (заклинаний/год) (доступно)':1,
        }

metadict_detail['+5 lvl (заклинания жреца) (заклинаний/год)'] = {
        '+5 lvl Святилище (5 lvl Hallow)':0.1,
        #'+5 lvl Святилище (5 lvl Hallow)':0.1,
        #'+5 lvl Призыв залпа (5 Conjure_Volley)':0.1,
        #'+5 lvl Круг силы (5 lvl Circle_of_Power)':0.1,
        '+5 lvl (заклинаний/год) (доступно)':1,
        }

metadict_detail['+5 lvl (заклинания колдуна) (заклинаний/год)'] = {
        '+5 lvl Высшее восстановление (5 lvl Greater_Restoration)':0.9,
        #'+5 lvl Обет (5 lvl Geas)':0.1,
        #'+5 lvl Вещий сон (5 lvl Dream)':0.1,
        #'+5 lvl Святилище (5 lvl Hallow)':0.1,
        #'+5 lvl Высшее восстановление (5 lvl Greater_Restoration)':0.1,
        #'+5 lvl Подчинение личности (5 lvl Dominate_Person)':0.1,
        #'+5 lvl Изменение памяти (5 lvl Modify_Memory)':0.1,
        '+5 lvl (заклинаний/год) (доступно)':1,
        }

#----
# Ритуалы 1 круга

metadict_detail['+1 lvl (ритуальные заклинания барда) (заклинаний/год)'] = {
        '+1 lvl Невидимый слуга (1 lvl Unseen_Servant)':0.7,
        '+1 lvl Обнаружение болезней и ядов (1 lvl Detect_Poison_and_Disease)':0.2,
        #'+1 lvl Сигнал тревоги (1 lvl Alarm)':0.1,
        #'+1 lvl Обнаружение болезней и ядов (0 lvl Detect_Poison_and_Disease)':0.7,
        #'+1 lvl Очищение пищи и питья (0 lvl Purify_Food_and_Drink)':0.2,
        #'+1 lvl Невидимый слуга (1 lvl Unseen_Servant)':0.1,
        #'+1 lvl Парящий диск (1 lvl Floating_Disk)':0.1,
        '+1 lvl (ритуальных заклинаний/год) (доступно)':1,
        }

metadict_detail['+1 lvl (ритуальные заклинания волшебника) (заклинаний/год)'] = {
        # Добрая половина волшебников знает заклинание обнаружения болезней.
        # Это против глубинных правил DnD, но таков понячий мир.
        '+1 lvl Обнаружение болезней и ядов (1 lvl Detect_Poison_and_Disease)':0.4,
        '+1 lvl Невидимый слуга (1 lvl Unseen_Servant)':0.3,
        '+1 lvl Скопировать текст (1 lvl Amanuensis)':0.1,
        '+1 lvl Парящий диск (1 lvl Floating_Disk)':0.1,
        #'+1 lvl Сигнал тревоги (1 lvl Alarm)':0.1,
        #'+1 lvl Опознание (1 lvl Identify)':0.1,
        #'+1 lvl Обнаружение магии (1 lvl Detect_Magic)':0.1,
        #'+1 lvl Скопировать текст (1 lvl Amanuensis)':0.1,
        #'+1 lvl Невидимый слуга (1 lvl Unseen_Servant)':0.1,
        #'+1 lvl Парящий диск (1 lvl Floating_Disk)':0.1,
        '+1 lvl (ритуальных заклинаний/год) (доступно)':1,
        }

metadict_detail['+1 lvl (ритуальные заклинания чародея) (заклинаний/год)'] = {
        '+1 lvl Невидимый слуга (1 lvl Unseen_Servant)':0.6,
        '+1 lvl Парящий диск (1 lvl Floating_Disk)':0.3,
        '+1 lvl (ритуальных заклинаний/год) (доступно)':1,
        }

metadict_detail['+1 lvl (ритуальные заклинания друида) (заклинаний/год)'] = {
        '+1 lvl Обнаружение болезней и ядов (1 lvl Detect_Poison_and_Disease)':0.5,
        '+1 lvl Очищение пищи и питья (1 lvl Purify_Food_and_Drink)':0.3,
        '+1 lvl (ритуальных заклинаний/год) (доступно)':1,
        }

metadict_detail['+1 lvl (ритуальные заклинания жреца) (заклинаний/год)'] = {
        # Пегаски тоже умеют призывать духов воздуха. Но они бестолковые.
        '+1 lvl Парящий диск (1 lvl Floating_Disk)':0.2,
        #'+1 lvl Невидимый слуга (1 lvl Unseen_Servant)':0.1,
        #'+1 lvl Сигнал тревоги (1 lvl Alarm)':0.1,
        '+1 lvl (ритуальных заклинаний/год) (доступно)':1,
        }

metadict_detail['+1 lvl (ритуальные заклинания колдуна) (заклинаний/год)'] = {
        '+1 lvl Обнаружение болезней и ядов (1 lvl Detect_Poison_and_Disease)':0.7,
        '+1 lvl Очищение пищи и питья (1 lvl Purify_Food_and_Drink)':0.2,
        '+1 lvl (ритуальных заклинаний/год) (доступно)':1,
        }

metadict_detail['+1 lvl (ритуальные заклинания паладина) (заклинаний/год)'] = {
        '+1 lvl Церемония (1 lvl Ceremony)':0.9,
        '+1 lvl (ритуальных заклинаний/год) (доступно)':1,
        }

metadict_detail['+1 lvl (ритуальные заклинания следопыта) (заклинаний/год)'] = {
        '+1 lvl Обнаружение болезней и ядов (1 lvl Detect_Poison_and_Disease)':0.2,
        '+1 lvl (ритуальных заклинаний/год) (доступно)':1,
        }

#----
# Ритуалы 2 круга

metadict_detail['+2 lvl (ритуальные заклинания барда) (заклинаний/год)'] = {
        '+2 lvl Волшебные уста (2 lvl Magic_Mouth)':0.7,
        #'+2 lvl Тишина (2 lvl Silence)':0.1,
        '+2 lvl (ритуальных заклинаний/год) (доступно)':1,
        }

metadict_detail['+2 lvl (ритуальные заклинания волшебника) (заклинаний/год)'] = {
        '+2 lvl Волшебные уста (2 lvl Magic_Mouth)':0.7,
        '+2 lvl Нетленные останки (2 lvl Gentle_Repose)':0.1,
        '+2 lvl (ритуальных заклинаний/год) (доступно)':1,
        }

metadict_detail['+2 lvl (ритуальные заклинания чародея) (заклинаний/год)'] = {
        '+2 lvl Волшебные уста (2 lvl Magic_Mouth)':0.7,
        '+2 lvl Нетленные останки (2 lvl Gentle_Repose)':0.1,
        '+2 lvl (ритуальных заклинаний/год) (доступно)':1,
        }

metadict_detail['+2 lvl (ритуальные заклинания друида) (заклинаний/год)'] = {
        '+2 lvl Животное посланник (2 lvl Animal_Messenger)':0.7,
        '+2 lvl Взгляд глазами животного (2 lvl Beast_Sense)':0.1,
        '+2 lvl (ритуальных заклинаний/год) (доступно)':1,
        }

metadict_detail['+2 lvl (ритуальные заклинания жреца) (заклинаний/год)'] = {
        '+2 lvl Небесные письмена (2 lvl Skywrite)':0.2,
        '+2 lvl (ритуальных заклинаний/год) (доступно)':1,
        }

metadict_detail['+2 lvl (ритуальные заклинания колдуна) (заклинаний/год)'] = {
        # Gentle_Repose -- Местная крионика.
        '+2 lvl Нетленные останки (2 lvl Gentle_Repose)':0.7,
        '+2 lvl (ритуальных заклинаний/год) (доступно)':1,
        }

metadict_detail['+2 lvl (ритуальные заклинания паладина) (заклинаний/год)'] = {
        '+2 lvl Нетленные останки (2 lvl Gentle_Repose)':0.7,
        '+2 lvl (ритуальных заклинаний/год) (доступно)':1,
        }

metadict_detail['+2 lvl (ритуальные заклинания следопыта) (заклинаний/год)'] = {
        '+2 lvl Животное посланник (2 lvl Animal_Messenger)':0.7,
        '+2 lvl Взгляд глазами животного (2 lvl Beast_Sense)':0.1,
        '+2 lvl (ритуальных заклинаний/год) (доступно)':1,
        }

#----
# Ритуалы 3 круга

metadict_detail['+3 lvl (ритуальные заклинания барда) (заклинаний/год)'] = {
        '+3 lvl (ритуальных заклинаний/год) (доступно)':1,
        }

metadict_detail['+3 lvl (ритуальные заклинания волшебника) (заклинаний/год)'] = {
        '+3 lvl Водное дыхание (3 lvl Water_Breathing)':0.2,
        #'+3 lvl Леомундова хижина (3 lvl Leomund_Tiny_Hut)':0.1,
        #'+3 lvl Притворная смерть (3 lvl Feign_Death)':0.1,
        '+3 lvl (ритуальных заклинаний/год) (доступно)':1,
        }

metadict_detail['+3 lvl (ритуальные заклинания чародея) (заклинаний/год)'] = {
        '+3 lvl Водное дыхание (3 lvl Water_Breathing)':0.2,
        '+3 lvl (ритуальных заклинаний/год) (доступно)':1,
        }

metadict_detail['+3 lvl (ритуальные заклинания друида) (заклинаний/год)'] = {
        #'+3 lvl Слияние с камнем (3 lvl Meld_into_Stone)':0.1,
        '+3 lvl (ритуальных заклинаний/год) (доступно)':1,
        }

metadict_detail['+3 lvl (ритуальные заклинания жреца) (заклинаний/год)'] = {
        '+3 lvl Хождение по воде (3 lvl Water_Walk)':0.2,
        '+3 lvl (ритуальных заклинаний/год) (доступно)':1,
        }

metadict_detail['+3 lvl (ритуальные заклинания колдуна) (заклинаний/год)'] = {
        '+3 lvl (ритуальных заклинаний/год) (доступно)':1,
        }

metadict_detail['+3 lvl (ритуальные заклинания паладина) (заклинаний/год)'] = {
        '+3 lvl (ритуальных заклинаний/год) (доступно)':1,
        }

metadict_detail['+3 lvl (ритуальные заклинания следопыта) (заклинаний/год)'] = {
        '+3 lvl (ритуальных заклинаний/год) (доступно)':1,
        }

#----
# Ритуалы 4 круга

metadict_detail['+4 lvl (ритуальные заклинания барда) (заклинаний/год)'] = {
        '+4 lvl (ритуальных заклинаний/год) (доступно)':1,
        }

metadict_detail['+4 lvl (ритуальные заклинания волшебника) (заклинаний/год)'] = {
        '+4 lvl (ритуальных заклинаний/год) (доступно)':1,
        }

metadict_detail['+4 lvl (ритуальные заклинания друида) (заклинаний/год)'] = {
        '+4 lvl (ритуальных заклинаний/год) (доступно)':1,
        }

metadict_detail['+4 lvl (ритуальные заклинания жреца) (заклинаний/год)'] = {
        '+4 lvl (ритуальных заклинаний/год) (доступно)':1,
        }

metadict_detail['+4 lvl (ритуальные заклинания колдуна) (заклинаний/год)'] = {
        '+4 lvl (ритуальных заклинаний/год) (доступно)':1,
        }

metadict_detail['+4 lvl (ритуальные заклинания чародея) (заклинаний/год)'] = {
        '+4 lvl (ритуальных заклинаний/год) (доступно)':1,
        }

#----
# Ритуалы 5 круга

metadict_detail['+5 lvl (ритуальные заклинания барда) (заклинаний/год)'] = {
        '+5 lvl (ритуальных заклинаний/год) (доступно)':1,
        }

metadict_detail['+5 lvl (ритуальные заклинания волшебника) (заклинаний/год)'] = {
        '+5 lvl Ментальная связь Рэри (5 lvl Rary_Telepathic_Bond)':0.9,
        #'+5 lvl Связь с иным миром (5 lvl Contact_Other_Plane)':0.1,
        '+5 lvl (ритуальных заклинаний/год) (доступно)':1,
        }

metadict_detail['+5 lvl (ритуальные заклинания друида) (заклинаний/год)'] = {
        #'+5 lvl Общение с природой (5 lvl Commune_with_Nature)':0.1,
        '+5 lvl (ритуальных заклинаний/год) (доступно)':1,
        }

metadict_detail['+5 lvl (ритуальные заклинания жреца) (заклинаний/год)'] = {
        #'+5 lvl Общение (5 lvl Commune)':0.1,
        '+5 lvl (ритуальных заклинаний/год) (доступно)':1,
        }

metadict_detail['+5 lvl (ритуальные заклинания колдуна) (заклинаний/год)'] = {
        '+5 lvl (ритуальных заклинаний/год) (доступно)':1,
        }

metadict_detail['+5 lvl (ритуальные заклинания чародея) (заклинаний/год)'] = {
        '+5 lvl (ритуальных заклинаний/год) (доступно)':1,
        }

#----
# Заклинания (доступные И необходимые)

metadict_detail['+0 lvl Исскуство друидов (0 lvl Druidcraft)'] = {
        # * "Искусство друидов" (Druidcraft) [Tra|-|-] — предсказание погоды на 24 часа. Это ключевое. Это меняет мир.
        }

metadict_detail['+0 lvl Лепка земли (0 lvl Mold_Earth)'] = {
        # * "Лепка земли" (Mold_Earth) [Tra|-|-] (C) — 30 футов, 5-футовый куб земли. 30 кубометров грунта за минуту, 900 метров траншеи в час. Один маг способен заменить 2000 землекопов. Надо ли говорить, насколько это упрощает строительные работы? Ирригация в сельском хозяйстве, осушение болот, "римские" дороги, водопровод и канализация городов. С магией всё это становится в разы дешевле.
        # Расчётная мощность -- 16 кВт.
            # Передвижение 3.375 куб.метра земли на 1.5 метра за 6 секунд.
            # Или 0.25 метра/секунду, или 0.84 кубометра на метр/секунду.
            # Плотность песчанного грунта -- ~1800 кг/кубометр. Стало быть 1500 кгс*м/с.
            # Мощность Mold_Earth: 1500*9.8=14700 Ватт (15 кВт)
            # https://ru.wikipedia.org/wiki/Килограмм-сила-метр
        # 1 час = 600 раундов, то есть 600 применений этого заговора
        #'+Земляные работы магией (кубометр)':3.375,
        '+0 lvl Лепка земли (0 lvl Mold_Earth) (%)':[
            '(value / x) * 100',
            '0 lvl Лепка земли (0 lvl Mold_Earth) (требуется)',
            ],
        }

metadict_detail['0 lvl Лепка земли (0 lvl Mold_Earth) (требуется)'] = {
        # На сам кантрип волшебник тратит 0.1 минуты, но нужно и отдыхать, поэтому коэффициент 2.
        # Получается 300 кантрипов/час
        '-Работа волшебника (0 lvl Mold_Earth) (нормо-часов)':(0.1 / 60) * 2,
        '-Механическая энергия, заклинания (киловатт-час)':16 / 600,
        }

metadict_detail['+0 lvl Формирование воды (0 lvl Shape_Water)'] = {
        # * "Формирование воды" (Shape_Water) [Tra|-|-] (C) — 30 футов, 5-футовый куб воды. Смена формы, движение. Заморозка, давление расширяющегося льда. Разрушить кладку крепостной стены? Просто сделай трещину и заморозь. Пробить шахту в скале? Просто залей воду в скважину и заморозь. Уничтожить дверной замок? Ты знаешь ответ. Фактически, это замена пороха в инженерных работах, и поэтому магов владеющих Shape_Water ценят все.
        # Передвижение 0.84 кубометра на метр/секунду
        # Плотность воды -- 1000 кг/кубометр. Стало быть 840 кгс*м/с.
        # Мощность Shape_Water: 844*9.8=8271 Втт (8 кВт)
        '+0 lvl Формирование воды (0 lvl Shape_Water) (%)':[
            '(value / x) * 100',
            '0 lvl Формирование воды (0 lvl Shape_Water) (требуется)',
            ],
        }

metadict_detail['0 lvl Формирование воды (0 lvl Shape_Water) (требуется)'] = {
        '-Работа волшебника (0 lvl Shape_Water) (нормо-часов)':(0.1 / 60) * 2,
        '-Механическая энергия, заклинания (киловатт-час)':8 / 600,
        }

metadict_detail['+0 lvl Сотворение костра (0 lvl Create_Bonfire)'] = {
        # * +++ "Сотворение костра" (Create_Bonfire) [Cnj|Dex|fire] (C) —  60 футов, минута концентрации, 5-футовый куб, 1d8 урона, спасбросок ловкости полный.
        # Это зона в 2.25 квадратных метров заклинания, но не больше 0.5 кв.метра открытого пламени.
            # Сила воздействия  | кВт/м2
            # ----------------- | -------
            # Ожоги III степени | 49
            # Ожоги II степени  | 27.4
            # Ожоги I степени   | 9.6
            # Болевой порог     | 1.4
        # Расчётная мощность -- 14 кВт.
            # Температура плавления чугуна -- 1200 °C (железа -- 1500 °C)
            # Температура (°С) | теплоёмкость (кДж/кг*градус)
            # ---------------- | ----------------------------
            # 200              | 0.46
            # 300              | 0.49
            # 400              | 0.51
            # 500              | 0.52
            # 600              | 0.53
            # 700              | 0.6
            # 800              | 0.66
            # 900              | 0.68
            # 1000             | 0.68
            # 1100             | 0.67
            # 1200             | 0.87
            # Чтобы расплавить килограмм чугуна понадобится -- 713 кДж/килограмм
                # При 100% КПД выплавки -- 51 секунда (8.5 заклинаний)
                # При 85% КПД выплавки -- 60 секунд (10 заклинаний)
            # Маги Эквестрии могут расплавить -- 600 000 тонн чугуна (27 кг на каждую пони)
            # Кузнечное дело в Эквестрии почти целиком волшебное.
        '-Тепловая энергия, заклинания (киловатт-час)':14 / 600,
        }

metadict_detail['+0 lvl Защита от оружия (0 lvl Blade_Ward)'] = {
        # * "Защита от оружия" (Blade_Ward) [Abj|-|-] — раунд каста, тот же раунд действия. Даёт сопротивляемость обычному урону. Эффективно, когда вас обстреливают лучники и есть возможность залечь. Это даст одновременно и помеху на атаки врага и сопротивляемость урону.
        }

metadict_detail['+0 lvl Шквал (0 lvl Gust)'] = {
        # "Шквал" (Gust) [Tra|Str|-] — 30 футов, отталкивает на 5 футов, спасбросок силы.
        # Скорость ветра:
            # 8 км/час - Сдувает газеты
            # 16 км/час - Выворачивает зонты
            # 32 км/час - Сдувает шезлонги
            # 72 км/час - Ломает заборы, трудно идти
            # 88 км/час - Сдувает черепицу
            # 118 км/час - Ураганный ветер, 12 Бофорта
            # 200 км/час - Ломаются деревянные здания
            # 257 км/час - Переворачивает машины
            # 324 км/час - Сильнейший ураган
            # 486 км/час - Сильнейший торнадо
            # https://ru.wikipedia.org/wiki/Шкала_Бофорта
        # Давление на поверхность тела, создаваемое потоком воздуха:
            # Р = 1/2 (плотность воздуха) × (скорость ветра) ^ 2
            # Плотность воздуха -- 1.2 кг/м3
            # V = 1 м/с Р = 0,6 Па = 0,6 Н/м2 = 0,06 кг/м2
            # V = 10 м/с Р = 6 кг/м2
            # V = 30 м/с Р = 54 кг/м2 (устоять несложно)
            # V = 40 м/с Р = 96 кг/м2 (устоять возможно)
            # V = 50 м/с Р = 150 кг/м2 (устоять невозможно)
            # V = 60 м/с Р = 220 кг/м2
            # Парашютист в группировке размером S=0,7м х 0,7м=0,5 м2 весом 80 кг
                # - получаем скорость около 50 м/с
            # Парашютист парит раскрытым - пусть S=1,0 м2 вес 80 кг
                # - получаем скорость около 35 м/с
        # Давление на поверхность тела, создаваемое потоком воздуха:
            # Р = 1/2 (плотность воздуха) × (скорость ветра) ^ 2
            # Плотность воздуха -- 1.2 кг/м³
            # Скорость потока -- 35 м/с (126 км/час, 12 по шкале Бофорта, ураганный ветер)
            # Давление воздуха -- 73.5 кг/м²
        # Объём воздуха:
            # Радиус цилиндра -- 0.75 метра, длина -- 10 метров.
            # Объём цилиндра: V = Pi × R ^ 2 × h
            # Объём воздуха: 3.14 * 0.75 ^ 2 * 10 = 17.7 кубометров
        # Работа заклинания:
            # Передвижение 17.7 куб.метра воздуха на 35 метров/секунду
            # По плотности воздуха: 743 килограмм*метр/секунду
            # Мощность Gust: 743 * 9.8 = 7281 Ватт (7.3 кВт)
        # Этой мощности достаточно, чтобы поднять планёр (300 кг, 13 км² крыло) с 220 метровой полосы.
            # Но только при условии, что Gust действует полные 6 секунд раунда. Вероятно вдвое меньше.
            # pegasus-flight-simulation.py
        '-Механическая энергия, заклинания (киловатт-час)':7.3 / 600,
        }

metadict_detail['+0 lvl Магическая надпись (0 lvl Arcane_Mark)'] = {
        # * "Магическая надпись" (Arcane_Mark) [Ilu|-|-] — раунд каста, дистанция касания, немного угля. Позволяет писать, рисовать, красить предметы стойкими чернилами любого цвета. Не больше квадратного фута за раз (0.1 кв.метра). Эти чернила развеиваются с помощью Dispel_Magic, разрушаются кислотой.
        # В понячьем мире этим заклинанием единорожки рисуют и окрашивают произведения искусства, но с 6-секундным раундом каста это не быстрее работы маляра, поэтому масляные и аниловые краски тоже производят тысячами тонн.
        # Годовое производство текстиля -- 11 кв.метров/пони, 58 Arcane_Mark/пони (53% тканей)
        }

metadict_detail['+0 lvl Малая иллюзия (0 lvl Minor_Illusion)'] = {
        # * "Малая иллюзия" (Minor_Illusion) [Ilu|-|-] — известное средство маскировки и имитации. Также подделывает голос.
        }

metadict_detail['+0 lvl Сообщение (0 lvl Message)'] = {
        # * !!! "Сообщение" (Message) [Tra|-|-] — 1200 футов (400 метров), маг должен видеть цель послания. Оно неслышимо для других. Цель может ответить.
        }

metadict_detail['+0 lvl Пляшущие огоньки (0 lvl Dancing_Lights)'] = {
        # * "Пляшущие огоньки" (Dancing_Lights) [Evo|-|-] (C) — 120 футов, минута концентрации. Четыре разноцветных огонька. Резервное средство связи. Если дым и туман от Fog_Cloud не позволяет нацелить "Послание", то можно отправить огоньки на ту же дистанцию. Какой-нибудь адресата да найдёт. А их форма и цвет передаст закодированное сообщение.  
        }

metadict_detail['+0 lvl Трауматургия (0 lvl Thaumaturgy)'] = {
        # * "Трауматургия" (Thaumaturgy) [Tra|-|-] — 30 футов, минута действия. Множество возможных эффектов: 1) Усиливает голос. 2) Ослабляет/усиливает пламя, меняет его цвет. 3) Вызывает лёгкую дрожь земли 4) Вызывает звуки в радиусе заклинания. 5) Открывает незапертую дверь/окно. 6) Меняет цвет глаз. Можно поддерживать до 3 эффектов одновременно.
        }

metadict_detail['+0 lvl Склеить предмет (0 lvl Mending)'] = {
        # * !!! "Починка" (Mending) [Tra|-|-] — минута на каст заклинания. Чинит повреждения менее 1 футов (трещины, выбоины, проколы). Можно чинить участки обшивки корабля (а также каменные стены, частоколы), всё на 1 hp/минута. Пока хиты повреждённого предмета не опустились ниже нуля. Последнее значит, что повреждения крайне серьёзные, но полностью разрушается объект только при минусовом максимуме хитов.
        # Этим заклинанием пони заменяют сварку и изредка используют вместо клея.
        '+0 lvl Склеить предмет (0 lvl Mending) (%)':[
            '(value / x) * 100',
            '0 lvl Склеить предмет (0 lvl Mending) (требуется)',
            ],
        }

metadict_detail['0 lvl Склеить предмет (0 lvl Mending) (требуется)'] = {
        '-Работа волшебника (0 lvl Mending) (нормо-часов)':(0.1 / 60) * 2,
        '-Механическая энергия, заклинания (киловатт-час)':4 / 600,
        }

metadict_detail['+1 lvl Безмолвный образ (1 lvl Silent_Image)'] = {
        }

metadict_detail['+1 lvl Доспехи мага (1 lvl Mage_Armor)'] = {
        # * +++ "Доспехи мага" (Mage_Armor) [Abj|-|-] — раунд каста, дистанция касания, 8 часов действия. Даёт базовую защиту в 13 AC + Dex. Что лучше любой лёгкой брони.
        # Золотые доспехи гвардии.
        }

metadict_detail['+1 lvl Поглощение стихий (1 lvl Absorb_Elements)'] = {
        }

metadict_detail['+1 lvl Добряника (1 lvl Goodberry)'] = {
        # Калорийность ягоды -- 220 килокалорий (40 грамм, 0.1 lb).
        # Диссоциация ингредиентов (воздух и вода):
            # Энергия химических связей грамма углеводов/белков -- 4.1 килокалории (17.2 кДж).
            # Энергия химических связей грамма жиров (триглицеринов) -- 9.3 килокалорий (38.9 кДж).
            # ----
            # Энергия диссоциации углекислого газа — 1 506 кДж/моль
            # Молярная масса углекислого газа — 16*2+12=44 г/моль
            # На каждый грамм углерода понадобится 126.5 кДж энергии, при 100% КПД реакции.
            # ----
            # Энергия диссоциации азота — 941.64 кДж/моль
            # Молярная масса азота — 14*2=28 г/моль
            # Энергия диссоциации воды — 285 кДж/моль
            # ----
            # На грамм азота потребуется 33.63 кДж энергии.
            # Молярная масса воды — 16+2=18 г/моль
            # На каждый грамм водород-кислородной смеси (гремучего газа), понадобится 15.83 кДж энергии.
            # ----
            # Синтез грамма белка потребует 101.161 кДж энергии, при близком к 100% КПД процесса.
            # Грам жиров (элементарный состав схожий, энергия триглициринов вдвое больше) -- 118 кДж
            # ----
            # Для синтеза грамма глюкозы растения тратят от 1 до 15.8 МДж энергии (КПД 0.64-10%)
            # Заклинание срабатывает за 6 секунд и не сжигает добрянику, так что КПД близок к 100%
        # В 40-граммовой ягоде (берём состав арахиса):
            # Белки -- 10.5 грамм (1.06 МДж)
            # Жиры -- 18.1 грамм (2.14 МДж), 
            # Углеводы -- 4.0 грамм (0.4 МДж)
            # Вода и прочие вещества -- 7.4 грамма (18% влажности, плотная такая ягода)
        # Необходимо 3.6 МДж (энергия 1/10 литра бензина)
        # Заклинание создаёт 10 ягод, это требует 36 МДж энергии.
        # Заклинание должно занимать хотя бы 1 час (поток 10 кВт, 1 кВт/ягоду).
        '+1 lvl Добряника (1 lvl Goodberry) (%)':[
            '(value / x) * 100',
            '1 lvl Добряника (1 lvl Goodberry) (требуется)',
            ],
        }

metadict_detail['1 lvl Добряника (1 lvl Goodberry) (требуется)'] = {
        # 1 час каста. Энергоёмкое заклинание.
        '-Работа волшебника (1 lvl Goodberry) (нормо-часов)':60 / 60,
        '-Энергия биосинтеза, заклинания (киловатт-час)':1 * 10,
        }

metadict_detail['+1 lvl Лечебный сон (1 lvl Healthful_Rest)'] = {
        '+1 lvl Лечебный сон (1 lvl Healthful_Rest) (%)':[
            '(value / x) * 100',
            '1 lvl Лечебный сон (1 lvl Healthful_Rest) (требуется)',
            ],
        }

metadict_detail['1 lvl Лечебный сон (1 lvl Healthful_Rest) (требуется)'] = {
        # 10 минут каста. Колыбельная же.
        '-Работа волшебника (1 lvl Healthful_Rest) (нормо-часов)':10 / 60,
        '-Энергия биосинтеза, заклинания (киловатт-час)':10 / 6,
        }

metadict_detail['+1 lvl Невидимый слуга (1 lvl Unseen_Servant)'] = {
        # * "Невидимый слуга" (Unseen_Servant) [Cnj|-|-] (R) — дистанция 60-футов, раунд каста, ритуал, час действия. Управление бонусным действием. Слуга уязвим, имеет 1 hp и 10 AC. Может исполнять сложные команды: ткать, чистить овощи, прибираться в доме. Главный недостаток в том, что слуга не может отдалиться от мага далее 60 футов (20 метров).
        # С этим заклинанием в форме ритуала, 1 час работы мага = 6 нормо-часов.
        # Используется для чистки городской канализации, химпрома и тому подобных вредных работ.
        # Даёт 70 млн. рабочих часов, что сравнимо с работой 45 000 пони (0.3% трудовых ресурсов)
        }

metadict_detail['+1 lvl Падение пёрышком (1 lvl Feather_Fall)'] = {
        }

metadict_detail['+1 lvl Парящий диск (1 lvl Floating_Disk)'] = {
        }

metadict_detail['+1 lvl Ходьба по облакам (1 lvl Air Walk)'] = {
        }

metadict_detail['+1 lvl Туманное облако (1 lvl Fog_Cloud)'] = {
        }

metadict_detail['+1 lvl Обнаружение болезней и ядов (1 lvl Detect_Poison_and_Disease)'] = {
        # * "Обнаружение болезней и яда" (Detect_Poison_and_Disease) — основа здравоохранения.
        '+1 lvl Обнаружение болезней и ядов (1 lvl Detect_Poison_and_Disease) (%)':[
            '(value / x) * 100',
            '1 lvl Обнаружение болезней и ядов (1 lvl Detect_Poison_and_Disease) (требуется)',
            ],
        }

metadict_detail['+1 lvl Очищение пищи и питья (1 lvl Purify_Food_and_Drink)'] = {
        # * "Очищение пищи и питья" (Purify_Food_and_Drink) — вторая основа здравоохранения.
        }

metadict_detail['1 lvl Обнаружение болезней и ядов (1 lvl Detect_Poison_and_Disease) (требуется)'] = {
        # 10 минут каста. Ритуальное заклинание.
        '-Работа волшебника (1 lvl Detect_Poison_and_Disease) (нормо-часов)':10 / 60,
        }

metadict_detail['+1 lvl Очаровать зверя (1 lvl Charm_Animal)'] = {
        }

metadict_detail['+1 lvl Мембранный барьер (1 lvl Barrier_Membrane)'] = {
        # * !!! "Мембранный барьер" (Barrier_Membrane) [Tra|-|-] — 120 бит (крупная жемчужина), только на себя, раунд каста, минута концентрации, соматический компонент. Каждый раунд даёт временные хиты, равные 1 + круг_заклинания. Пока эти хиты есть, даёт сопротивляемость к урону ядом, защищает от эффектов отравления, газа, не пропускает жидкости. Выглядит как 5-футовая полупрозрачная оболочка произвольной формы, вырастающая из позвоночника. Не сковывает движения. Реакцией можно усилить барьер до 5 hp на каждый круг заклинания против единственного удара, но после этого он полностью разрушается.
        # Часто упоминаемое в "Янтаре" заклинание щита. Мыльный пузырь вокруг единорожки, которая не хочет ранить себя по собственной дурости. В отличии от прочих заклинателей, рогатые обходятся без жемчужины, её заменяет часть костной ткани единорожьего рога. Но это нифига не полезно.
        }

metadict_detail['+1 lvl Героизм (1 lvl Heroism)'] = {
        # * +++ "Героизм" (Heroism) — +3-5 бонусных хитпоинтов каждый раунд, это 30-50 хитов/минута. Кроме того даёт бесстрашие.  
        }

metadict_detail['+1 lvl Церемония (1 lvl Ceremony)'] = {
        }

metadict_detail['+1 lvl Скопировать текст (1 lvl Amanuensis)'] = {
        }

metadict_detail['+2 lvl Вечный огонь (2 lvl Continual_Flame)'] = {
        # Сравнение источников света:
            # 1 люкс = 1 люмен/кв.метр
                # https://ru.wikipedia.org/wiki/Люкс
                # Тип помещения/условий            | Норма освещенности, люкс
                # -------------------------------- | ------------------------
                # Полдень, прямой свет Солнца      | 32-130 тысяч
                # Полдень в декабре-январе         | 4000
                # Восход и закат в ясный день      | 400
                # Обычный офис                     | 300
                # Рабочий кабинет                  | 300
                # Зал для конференций              | 200
                # Детская комната                  | 200
                # Жилая комната, кухня             | 150
                # Холл, коридор                    | 75
                # Ванная комната, душевая, санузел | 50
                # Уличное освещение                | 1-10
                # Цветовой порог человека          | 3
                # Полнолуние при ясном небе        | 0.3
                # Молодой месяц (четверть луны)    | 0.01
                # Звёзды, безлунная ночь           | 0.001
                # Тёмная облачная ночь             | 0.0001
            # Факел
                # 1 факел = 14 кандел = 176 люмен
                # 1 факел = 20-ваттная лампа накаливания
                # Мощность горения факела (0.45 кг, 50% сгорание) -- 920 ватт
                # Чем выше температура горения факела, тем больше доля видимого света.
                # Ветки можжевельника, связанные плющом, сосновая смола, 61 минута горения, 633°C
                # Средняя освещённость на дистанции 40 см -- 22 люкса (44 люмен?)
                # Радиус света (до темноты менее 1 люкс) -- 2.5 метра (сфера 78.5 кв.метров)
            # Факел (правила DnD 5e)
                # Площадь сферы: S = 4 * Pi * r ^ 2
                # Яркий свет на 10 футов (2.8 метра, 98 м²) -- 1.8 люкса
                # Тусклый свет на 20 футов (7 метров, 615 м²) -- 0.3 люкса (полнолуние при ясном небе)
                # https://www.dandwiki.com/wiki/5e_SRD:Torch
            # Свеча
                # 1 свеча = 1 кандела = 12.6 люмен
                # Мощность горения стеариновой свечи -- 50 ватт
                # https://ru.wikipedia.org/wiki/Люкс
                # https://ru.wikipedia.org/wiki/Люмен
                # https://ru.wikipedia.org/wiki/Кандела
                # На расстоянии 40 см -- 6.3 люкс.
                # Площадь сферы: 4 * 3.14 * 0.4^2 = 2 кв.метра
            # Масляная лампа
                # 1 лампа = 0.6 кандел = 7.5 люмен
                # Мощность горения топлёного сала (37 МДж/кг, 3.3 МДж в плошке, два часа) -- 460 ватт
                # Плошка 150 миллилитров, животный жир, более часа горения, 176°C
                # https://www.townsends.us/collections/food-drink/products/redware-grease-lamp-lantern-p4142-p-864
                # Средняя освещённость на дистанции 40 см -- 3.71 люкса
            # Очаг
                # 1 маленький очаг = 3.1 кандел = 39 люмен
                # Ветки можжевельника и дуба. Диаметр костра -- 23 см. Высота пламени -- 40 см.
                # Площадь этого очага в 12 раз меньше, чем у Create_Bonfire, мощность 1 кВт.
                # Средняя освещённость на дистанции 40 см -- 19.2 люкса
        # Световой поток -- 200 люмен; мощность -- 3 ватта (люминесцентная лампа)
        '+2 lvl Вечный огонь (2 lvl Continual_Flame) (%)':[
            '(value / x) * 100',
            '2 lvl Вечный огонь (2 lvl Continual_Flame) (требуется)',
            ],
        }

metadict_detail['2 lvl Вечный огонь (2 lvl Continual_Flame) (требуется)'] = {
        # TODO: внезапно, светокристальных ламп не хватает.
            # Заклинаний хватает только на 51% ламп.
            # Либо увеличивай число магов, либо уменьшай освещение.
        # 1 action, но мы возьмём 10 минут каста.
        '-Работа волшебника (2 lvl Continual_Flame) (нормо-часов)':10 / 60,
        }        

metadict_detail['+2 lvl Взгляд глазами животного (2 lvl Beast_Sense)'] = {
        }

metadict_detail['+2 lvl Внушение (2 lvl Suggestion)'] = {
        }

metadict_detail['+2 lvl Волшебные уста (2 lvl Magic_Mouth)'] = {
        # Говорящие открытки.
        }

metadict_detail['+2 lvl Волшебный замок (2 lvl Arcane_Lock)'] = {
        # Укрепление материалов.
        }

metadict_detail['+2 lvl Животное посланник (2 lvl Animal_Messenger)'] = {
        }

metadict_detail['+2 lvl Малое восстановление (2 lvl Lesser_Restoration)'] = {
        # * !!! "Малое восстановление" (Lesser_Restoration) — лечит слепоту, глухоту, паралич, яд, ранения костей, сухожилий, внутренних органов. Не убирает шрамы. Не восстанавливает утраченные органы и члены.
        '+2 lvl Малое восстановление (2 lvl Lesser_Restoration) (%)':[
            '(value / x) * 100',
            '2 lvl Малое восстановление (2 lvl Lesser_Restoration) (требуется)',
            ],
        }

metadict_detail['2 lvl Малое восстановление (2 lvl Lesser_Restoration) (требуется)'] = {
        # 10 минут каста.
        '-Работа волшебника (2 lvl Lesser_Restoration) (нормо-часов)':10 / 60,
        '-Энергия биосинтеза, заклинания (киловатт-час)':100 / 6,
        }

metadict_detail['+2 lvl Небесные письмена (2 lvl Skywrite)'] = {
        # * "Небесные письмена" Skywrite (Ritual) — это связь для флота в составе десятков, сотен судов. Такие колонны растягиваются на многие мили, а с помощью облаков можно ставить навигационные метки для отстающих кораблей.
        # В Эквестрии используется погодной службой, флотом, да и просто для красоты.
        }

metadict_detail['+2 lvl Нетленные останки (2 lvl Gentle_Repose)'] = {
        # Понячья крионика.
        }

metadict_detail['+2 lvl Туманный шаг (2 lvl Misty_Step)'] = {
        # * "Туманный шаг" (Misty_Step) — бонусное действие, только вербальный компонент. Телепортирует на 30 футов.
        # Это понячий "Переход" в его элементарной форме.
        }

metadict_detail['+2 lvl Охраняющая связь (2 lvl Warding_Bond)'] = {
        # * "Охраняющая связь" (Warding_Bond) — 2 эфеса, час действия. Даёт союзнику +1 AC и +1 к спасброскам. Даёт союзнику сопротивляемость всем видам урона. Если союзник получает ранение, переносит такое же ранение на жреца. Заклинание дейсвует, пока цель в 60 футах.
        }

metadict_detail['+2 lvl Порыв ветра (2 lvl Gust_of_Wind)'] = {
        # * "Порыв ветра" (Gust_of_Wind) — управляемый поток сильного ветра 60x10 футов, минута действия.
        # Давление на поверхность тела, создаваемое потоком воздуха:
            # Р = 1/2 (плотность воздуха) × (скорость ветра) ^ 2
            # Плотность воздуха -- 1.2 кг/м³
            # Скорость потока -- 35 м/с (126 км/час, 12 по шкале Бофорта, ураганный ветер)
            # Давление воздуха -- 73.5 кг/м²
        # Объём воздуха:
            # Радиус цилиндра -- 1.6 метра, длина -- 20 метров.
            # Объём цилиндра: V = Pi × R ^ 2 × h
            # Объём воздуха: 3.14 * 1.6 ^ 2 * 20 = 161 кубометр
        # Работа заклинания:
            # Передвижение 161 куб.метра воздуха на 35 метров/секунду
            # По плотности воздуха: 6762 килограмм*метр/секунду
            # Мощность Gust_of_Wind: 6762 * 9.8 = 66 267 Ватт (66 кВт)
        '-Механическая энергия, заклинания (киловатт-час)':66 / 60,
        }

metadict_detail['+3 lvl Аура живучести (3 lvl Aura_of_Vitality)'] = {
        # * "Аура живучести" (Aura_of_Vitality) — радиус 30 футов, минута действия, лечение на 2d6 бонусным действием.
        }

metadict_detail['+3 lvl Водное дыхание (3 lvl Water_Breathing)'] = {
        # * "Водное дыхание" (Water_Breathing) — 10 целей за 10 минут ритуала, 120 целей за 2 часа, длительность 24 часа.
        }

metadict_detail['+3 lvl Метель (3 lvl Sleet_Storm)'] = {
        }

metadict_detail['+3 lvl Охранные руны (3 lvl Glyph_of_Warding)'] = {
        }

metadict_detail['+3 lvl Послание (3 lvl Sending)'] = {
        # * "Послание" (Sending) — бесценное средство связи. Это жалкое подобие телеграфа, но тем не менее оно объединяет огромные страны.
        }

metadict_detail['+3 lvl Рассеивание магии (3 lvl Dispel_Magic)'] = {
        # * +++ "Рассеивание магии" (Dispel_Magic) — сильно недооценено. Оно может развеивать мины, созданные с помощью "Glyph_of_Warding". Может развеять "Сферу неуязвимости" (всего-то надо пройти бросок базовой характеристики: 1d20 + INT против DC 16, то есть 45% шанс). И, наконец, его можно использовать в сочетании с действием "Подготовка" (Ready_Action) как импровизированное контрзаклинание. И если Counterspell помешает магу создать огнешар, то Dispel_Magic остановит его в полёте (на дальности менее 120 футов от вас). Но да, вы по прежнему должны видеть цель, иначе просто не успеете среагировать.
        }

metadict_detail['+3 lvl Рост растений (3 lvl Plant_Growth)'] = {
        # * "Рост растений" (Plant_Growth) — радиус 100 футов, если есть растения местность становится крайне сложной (1 фут движения за 4 фута хода). Второй вариант использования: удвоение урожайности 270 гектаров полей, или 20 000 участков 100-футового радиуса за 8 часов работы. Это еда для 300 человек на полный год (или на сотню тысяч за год работы друида).
        # Эквестрии доступно -- 115 000  Plant_Growth, 31 млн. гектаров (52% площади страны)
        # Все поля, сады и огороды поддерживаются этим заклинанием. Оно же растит дровяные леса.
        }

metadict_detail['+3 lvl Хождение по воде (3 lvl Water_Walk)'] = {
        # * "Хождение по воде" (Water_Walk) — 10 целей за 10 минут ритуала, час действия. До 60 целей за час подготовки.
        }

metadict_detail['+4 lvl Защита от смерти (4 lvl Death_Ward)'] = {
        }

metadict_detail['+4 lvl Изготовление (4 lvl Fabricate)'] = {
        # * !!! "Изготовление" (Fabricate) — 30 кубометров дерева, или 3.4 кубометра камня/стали. Созданный объект должен умещаться в куб 1.5x1.5x1.5 метра. Время "изготовления" — 10 минут. Ставим ограничение по человеко-часам. Это заклинание позволяет изготовить за 10 минут то, с чем опытный ремесленник провозился бы 100 дней.
        }

metadict_detail['+4 lvl Леомундов потайной сундук (4 lvl Leomund_Secret_Chest)'] = {
        # * "Леомундов потайной сундук" (Leomund_Secret_Chest) — 10 200 бит (5 кило золота!) на сундук и реплику. Хранит 12 кубических футов вещей (0.4 кубометра). Сундук можно призвать, коснувшись реплики. Спустя 60 дней нужно повторить заклинание, но без затраты компонентов, иначе есть риск потерять сундук со всем содержимым. Это заклинание меняет облик мировой торговли, поскольку позволяет перенести уйму маленьких сундучков через "Круг телепортации" (Teleportation_Circle). Цена сундуков огромна, но оправдана. Почта нужна.
        # Доступно 160 000 заклинаний, требуется 6 заклинаний/сундук-год (720 бит/год-сундук)
        # В торговом обороте до 26 000 сундуков, их объём -- 10 400 кубометров (~5000 тонн груза)
        # Суммарная стоимость сундучного капитала -- 284 млн. бит (5-9% годового ВВП Эквестрии)
        # Стоимость поддержки (при 30 лет службы) -- 28 млн. бит (0.5-0.9% ВВП Эквестрии)
        # Одна пересылка сундука (300 пересылок/год) -- 3.6 бит/сундук-день
        # Перевозка тонны грузов (0.5 тонны/кубометр) --- 18 бит/тонна
        }

metadict_detail['+4 lvl Превращение (4 lvl Polymorph)'] = {
        }

metadict_detail['+4 lvl Призыв лесных обитателей (4 lvl Conjure_Woodlands_Beings)'] = {
        }

metadict_detail['+4 lvl Призыв малых элементалей (4 lvl Conjure_Minor_Elementals)'] = {
        }

metadict_detail['+4 lvl Магический глаз (4 lvl Arcane_Eye)'] = {
        }

metadict_detail['+5 lvl Высшее восстановление (5 lvl Greater_Restoration)'] = {
        # * !!! "Высшее восстановление" (Greater_Restoration) — 2 эфеса. Снимает окаменение, очарование, проклятия, истощение. Убирает шрамы. Не восстанавливает утраченные органы и члены.
        '+5 lvl Высшее восстановление (5 lvl Greater_Restoration) (%)':[
            '(value / x) * 100',
            '5 lvl Высшее восстановление (5 lvl Greater_Restoration) (требуется)',
            ],
        }

metadict_detail['5 lvl Высшее восстановление (5 lvl Greater_Restoration) (требуется)'] = {
        # 60 минут каста.
        '-Работа волшебника (5 lvl Greater_Restoration) (нормо-часов)':60 / 60,
        '-Энергия биосинтеза, заклинания (киловатт-час)':1000 / 60,
        }

metadict_detail['+5 lvl Круг телепортации (5 lvl Teleportation_Circle)'] = {
        # * !!! "Круг телепортации" (Teleportation_Circle) — 120 бит компонентов, минута каста, 10-футовый круг, раунд действия. Перемещение до 100 существ, успевших забежать в круг, или предметов суммарным весом до 20 тонн. Точка назначения — постоянный круг телепортации. Постоянный круг создаётся за 360 дней повторений этого заклинания (43 200 бит + 160 000 бит оплата волшебника 9+ lvl)
        # TODO: круг телепортации выгоднее воздушных перевозок.
            # Маршрут от Балтимэра к Зевере -- 53-89 бит/тонна
            # Маршрут от Ванхувера к Маэт-Кэру -- 317-528 бит/тонна
        # Доступно 12 700 заклинаний/год, 794 круга/мегаполис, 2.2 круга/мегаполис-день
        # Это перевозка 254 000 тонн грузов в год, 15 800 тонн/мегаполис, 44 тонны/мегаполис-день
        # С леомундовыми сундуками 1 560 000 тонн/год, 97 500 тонн/мегаполис, 271 тонна/мегаполис-день
        # 1 тонна грузов (без сундуков) -- 30 бит
        # 1 тонна грузов (в сундуках) -- 9 + 18 = 27 бит
        #----
        # Можно перевозить всю почту и 58% промышленных товаров (0.3% всего грузооборота):
        # |====Грузов произведено (тонн).................. | 255,719,262
        # |===Грузов перевезено (тонн).................... | 522,346,094
        # |==Почта (тонн)................................. | 182,815
        # |==Продовольствие (тонн)........................ | 14,224,117
        # |==Промышленные товары (тонн)................... | 2,490,681
        #----
        # Для сравнения (торговый путь к киринам):
        # Маршрут международный-воздушный, Ванхувер <-> Маэт-Кэр (тонн).. | 8,310
        # Маршрут международный-морской, Ванхувер <-> Маэт-Кэр (тонн).... | 455,652
        # ||Транспорт воздушный грузовой (5-тонный планёр, 3 тонны груза) | 183
        # ||Транспорт морской грузовой (барк, 3000 тонн, 1400 тонн груза) | 75
        #----
        # Морской маршрут в Маэт-Кэр -- 25% всей морской торговли:
        # Морские грузоперевозки (тонно-километр)................................ | 23,231,243,691
        # Маршрут международный-морской, Ванхувер <-> Маэт-Кэр (тонно-километров) | 5,755,605,420
        #----
        # Воздушный маршрут в Маэт-Кэр -- 36% всей воздушной торговли:
        # Воздушные грузоперевозки (тонно-километр)................................ | 289,333,974
        # Маршрут международный-воздушный, Ванхувер <-> Маэт-Кэр (тонно-километров) | 104,965,445
        #----
        # Пассажирооборот кругов телепортации -- 1.27 пассажиров/год (8.4% межрегиональных перевозок)
        # |===Пассажиронапряжённость заграничных воздушных путей (пони/год).......... | 454,170
        # |===Пассажиронапряжённость заграничных морских путей (пони/год)............ | 681,256
        # |===Пассажиронапряжённость межрегиональных воздушных путей (пони/год)...... | 1,524,187
        # |===Пассажиронапряжённость межрегиональных железнодорожных путей (пони/год) | 12,193,497
        # |===Пассажиронапряжённость межрегиональных речных путей (пони/год)......... | 304,837
        # |===Пассажиронапряжённость региональных воздушных путей (пони/год)......... | 87,854,739
        # |===Пассажиронапряжённость региональных железнодорожных путей (пони/год)... | 109,818,424
        # |===Пассажиронапряжённость региональных речных путей (пони/год)............ | 7,321,228
        }

metadict_detail['+5 lvl Наблюдение (5 lvl Scrying)'] = {
        # * "Наблюдение" (Scrying) — 10 минут каста, 10 минут концентрации. Создаёт невидимый сенсор в 10 футах от цели. Целью может быть место, или существо. Сенсор можно обнаружить с помощью "Видения невидимого".
        }

metadict_detail['+5 lvl Планарные узы (5 lvl Planar_Binding)'] = {
        # * "Планарные узы" (Planar_Binding) — 2040 бит, час каста, 24 часа действия (7 дней/6_круг, 30 дней/7_круг, 180 дней/8_круг, 360 дней/9_круг). Спасбросок харизмы, или цель подчинена заклинанием. Время призыва продлевается на время каста "Планарных уз". Все маги 13+ lvl имеют нескольких "планарных" слуг. Есть у этого заклинания крошечный недостаток, "Рассеивание магии" (Dispel_Magic) уничтожает "Планарные узы", если использовано кем-то, кроме порабощённого существа.
        }

metadict_detail['+5 lvl Ментальная связь Рэри (5 lvl Rary_Telepathic_Bond)'] = {
        # * "Ментальная связь Рэри" (Rary_Telepathic_Bond) — ритуал, час действия. 8 существ. Неограниченная дальность связи.
        }

metadict_detail['+5 lvl Обет (5 lvl Geas)'] = {
        }

metadict_detail['+5 lvl Пробуждённый разум (5 lvl Awaken)'] = {
        # * !!! "Пробуждённый разум" (Awaken) — 2040 эфесов, 8 часов каста. Даёт неразумному интеллект 10 и знание одного языка. Деревья начинают ходить. Звери меняются (в пределах CR 2). Существо очаровано создателем заклинания на 30 дней, далее самостоятельно.
        }

metadict_detail['+5 lvl Общение (5 lvl Commune)'] = {
        # * "Общение" (Commune) — ритуал, минута действия. Три вопроса божеству, на которые то отвечает "да", либо "нет". Накопительный 25% шанс ложных ответов, если кастовать повторно.
        }

metadict_detail['+5 lvl Общение с природой (5 lvl Commune_with_Nature)'] = {
        # * "Общение с природой" (Commune_with_Nature) — ритуал, 3 мили радиус. Даёт знания об окрестностях. Показывает местонахождение могущественной нежити, элементаля, тому подобного создания.
        }

metadict_detail['+5 lvl Связь с иным миром (5 lvl Contact_Other_Plane)'] = {
        # * "Связь с иным миром" (Contact_Other_Plane) — ритуал, минута действия. Можно спросить 5 вопросов с краткими ответами в одно слово. Нужен спасбросок интеллекта СЛ 15, иначе 6d6 урона и слабоумие на сутки.
        }

metadict_detail['+5 lvl Святилище (5 lvl Hallow)'] = {
        # * "Святилище" (Hallow) — 17 эфес, 24 часа каста, 60-футовый радиус. Постоянное. Существует пока не уберут "Рассеиванием магии" (Dispel_Magic). Зона становится запретной для: иномировых созданий, фей, элементалей, нежити. Всех, или любых на выбор заклинателя. Все люди, очарованные/подчинённые этими созданиями, избавляются от чужого влияния. "Святилище" нельзя нанести на корабль, только на неподвижную землю.
        }

metadict_detail['+5 lvl Усиление навыка (5 lvl Skill_Empowerment)'] = {
        # * "Усиление навыка" (Skill_Empowerment) — час концентрации. Удваивает бонус мастерства для выбранного навыка. Не может усилить навыки, бонус мастерства к которым уже удвоен.
        # Магия меток.
        }

#----
# Заклинания (применение)

metadict_detail['+0 lvl Склеить предмет (0 lvl Mending) (%)'] = {
        }

metadict_detail['+0 lvl Лепка земли (0 lvl Mold_Earth) (%)'] = {
        }

metadict_detail['+0 lvl Формирование воды (0 lvl Shape_Water) (%)'] = {
        }

metadict_detail['+1 lvl Добряника (1 lvl Goodberry) (%)'] = {
        }

metadict_detail['+1 lvl Лечебный сон (1 lvl Healthful_Rest) (%)'] = {
        }

metadict_detail['+1 lvl Обнаружение болезней и ядов (1 lvl Detect_Poison_and_Disease) (%)'] = {
        }

metadict_detail['+2 lvl Малое восстановление (2 lvl Lesser_Restoration) (%)'] = {
        }

metadict_detail['+2 lvl Вечный огонь (2 lvl Continual_Flame) (%)'] = {
        }

metadict_detail['+5 lvl Высшее восстановление (5 lvl Greater_Restoration) (%)'] = {
        }
