#----
# Зерновые:
    # Основные культуры:
        # https://en.wikipedia.org/wiki/Staple_food
    # Физико-механические свойства пшеницы, рожи, овеса, ячменя:
        # http://razvitie-pu.ru/?page_id=6665
    # Урожайность сельскохозяйственных культур (1964 год):
        # https://kaz-ekzams.ru/biologiya/uchebnaya-literatura-po-biologii/zhiznennye-resursy-chelovechestva/pishhevye-resursy/7145-urozhajnost-selskohozyajstvennyh-kultur.html
    # Традиционная белорусская деревня в европейской перспективе Земледелие и животноводство
        # http://vln.by/node/217

metadict_detail['Выращивание пшеницы (центнер)'] = {
        # Урожайность: 20 центнеров с гектара.
            # http://razvitie-pu.ru/?page_id=6621
        '|-Поля пшеницы (гектар)':1 / 20,
        }

metadict_detail['Выращивание ржи (центнер)'] = {
        '|-Поля ржи (гектар)':1 / 20,
        }

metadict_detail['Выращивание овса (центнер)'] = {
        '|-Поля овса (гектар)':1 / 20,
        }

metadict_detail['Выращивание ячменя (центнер)'] = {
        # https://ru.wikisource.org/wiki/ЭСБЕ/Ячмень,_в_сельском_хозяйстве_и_торговле
        '|-Поля ячменя (гектар)':1 / 20,
        }

metadict_detail['Выращивание кукурузы (центнер)'] = {
        # Вес зерна составляет 70 — 72% от веса початка
            # Физико-механические свойства кукурузы
            # http://razvitie-pu.ru/?page_id=6639
        '|-Поля кукурузы (гектар)':1 / 40,
        }

metadict_detail['Выращивание риса посевного (центнер)'] = {
        # https://ru.wikisource.org/wiki/ЭСБЕ/Рис,_в_сельском_хозяйстве_и_мировой_экономике
        # Период вегитации 150 дней (100 дней поля затоплены), температура 22-30 градусов.
        '|-Поля риса посевного (гектар)':1 / 30,
        }

metadict_detail['Выращивание гречихи посевной (центнер)'] = {
        '|-Поля гречихи посевной (гектар)':1 / 7,
        }

#----
# Зерновые-масличные:

metadict_detail['Выращивание конопли масличной (центнер)'] = {
        '|-Поля конопли (гектар)':1 / 5,
        }

metadict_detail['Выращивание льна масличного (центнер)'] = {
        '|-Поля льна (гектар)':1 / 5,
        }

metadict_detail['Выращивание горчицы белой (центнер)'] = {
        '|-Поля горчицы белой (гектар)':1 / 5,
        }

metadict_detail['Выращивание подсолнечника (центнер)'] = {
        '|-Поля подсолнечника (гектар)':1 / 10,
        }

metadict_detail['Выращивание кунжута (центнер)'] = {
        '|-Поля кунжута (гектар)':1 / 10,
        }

metadict_detail['Выращивание оливок (центнер)'] = {
        '|-Оливковые сады (гектар)':1 / 20,
        }

#----
# Зерновые-технические:

metadict_detail['Выращивание конопли технической (центнер)'] = {
        '|-Поля конопли (гектар)':1 / 6,
        }

metadict_detail['Выращивание льна технического (центнер)'] = {
        '|-Поля льна (гектар)':1 / 3,
        }

#----
# Бобовые:

metadict_detail['Выращивание Арахис в стручках (центнер)'] = {
        '|-Поля арахиса (гектар)':1 / 15,
        }

metadict_detail['Выращивание Соевые бобы неочищенные (центнер)'] = {
        '|-Поля сои (гектар)':1 / 15,
        }

metadict_detail['Выращивание Фасоль в стручках (центнер)'] = {
        '|-Поля фасоли (гектар)':1 / 20,
        }

metadict_detail['Выращивание гороха посевного (центнер)'] = {
        # Урожайность гороха 5-7 четвертей: 6*0.21*0.7=0.882 тонн/гектар
        # https://ru.wikisource.org/wiki/ЭСБЕ/Горох
        # http://www.activestudy.info/uborka-goroxa-2/
        '|-Поля гороха посевного (гектар)':1 / 15,
        }

metadict_detail['Выращивание чечевицы (центнер)'] = {
        # https://ru.wikisource.org/wiki/ЭСБЕ/Чечевица,_в_сельском_хозяйстве
        '|-Поля чечевицы (гектар)':1 / 15,
        }

#----
# Огородные:

metadict_detail['Выращивание Батат (центнер)'] = {
        '|-Поля батата (гектар)':1 / 200,
        }

metadict_detail['Выращивание Картофель (центнер)'] = {
        # Физико-механические свойства картофеля
            # http://razvitie-pu.ru/?page_id=6639
        # Средний урожай 1000 пудов/десятина (140 центнеров/гектар)
            # https://ru.wikisource.org/wiki/ЭСБЕ/Картофель
        '|-Поля картофеля (гектар)':1 / 140,
        }

metadict_detail['Выращивание Томаты (центнер)'] = {
        '|-Поля томатов (гектар)':1 / 200,
        }

metadict_detail['Выращивание Тыква (центнер)'] = {
        '|-Поля тыквы (гектар)':1 / 200,
        }

metadict_detail['Выращивание Кабачок (центнер)'] = {
        '|-Поля кабачка (гектар)':1 / 200,
        }

metadict_detail['Выращивание баклажанов (центнер)'] = {
        '|-Поля баклажанов (гектар)':1 / 200,
        }

metadict_detail['Выращивание Огурцы (центнер)'] = {
        '|-Поля огурцов (гектар)':1 / 200,
        }

metadict_detail['Выращивание Капуста белокочанная (центнер)'] = {
        '|-Поля капусты (гектар)':1 / 200,
        }

metadict_detail['Выращивание Морковь (центнер)'] = {
        # https://ru.wikisource.org/wiki/ЭСБЕ/Морковь
        # Средний урожай -- 200 центнеров с гектара
        '|-Поля моркови (гектар)':1 / 200,
        }

metadict_detail['Выращивание Репа (центнер)'] = {
        '|-Поля репы (гектар)':1 / 150,
        }

metadict_detail['Выращивание брюквы (центнер)'] = {
        '|-Поля брюквы (гектар)':1 / 150,
        }

metadict_detail['Выращивание Перец сладкий (центнер)'] = {
        '|-Поля перца сладкого (гектар)':1 / 200,
        }

metadict_detail['Выращивание Лук репчатый (центнер)'] = {
        '|-Поля лука репчатого (гектар)':1 / 200,
        }

metadict_detail['Выращивание чеснока (центнер)'] = {
        '|-Поля чеснока (гектар)':1 / 150,
        }

metadict_detail['Выращивание красного перца (центнер)'] = {
        '|-Поля красного перца (гектар)':1 / 150,
        }

metadict_detail['Выращивание свёклы (центнер)'] = {
        # Киевская губерния, конец 19 века:
            # https://ru.wikipedia.org/wiki/Киевская_губерния#Сельское_хозяйство
            # 81 631 гектаров сахарной свёклы (150 центнеров/гектар)
        '|-Поля свёклы (гектар)':1 / 150,
        }

metadict_detail['Выращивание брокколи (центнер)'] = {
        '|-Поля брокколи (гектар)':1 / 150,
        }

metadict_detail['Выращивание артишоков (центнер)'] = {
        '|-Поля артишоков (гектар)':1 / 100,
        }

metadict_detail['Выращивание петрушки (центнер)'] = {
        '|-Поля петрушки (гектар)':1 / 200,
        }

metadict_detail['Выращивание ревеня (центнер)'] = {
        '|-Поля ревеня (гектар)':1 / 200,
        }

metadict_detail['Выращивание латука посевного (центнер)'] = {
        '|-Поля латука посевного (гектар)':1 / 150,
        }

metadict_detail['Выращивание сельдерея (центнер)'] = {
        '|-Поля сельдерея (гектар)':1 / 200,
        }

metadict_detail['Выращивание спаржи (центнер)'] = {
        '|-Поля спаржи (гектар)':1 / 200,
        }

metadict_detail['Выращивание кресс-салата (центнер)'] = {
        '|-Поля кресс-салата (гектар)':1 / 500,
        }

metadict_detail['Выращивание укропа (центнер)'] = {
        '|-Поля укропа (гектар)':1 / 200,
        }

metadict_detail['Выращивание хрена (центнер)'] = {
        '|-Поля хрена (гектар)':1 / 150,
        }

metadict_detail['Выращивание имбиря (центнер)'] = {
        '|-Поля имбиря (гектар)':1 / 150,
        }

metadict_detail['Выращивание тмина (центнер)'] = {
        # http://www.eda-server.ru/prjan/058.shtml
        '|-Поля тмина (гектар)':1 / 5,
        }

metadict_detail['Выращивание арбуза (центнер)'] = {
        '|-Поля арбуза (гектар)':1 / 250,
        }

metadict_detail['Выращивание дыни (центнер)'] = {
        '|-Поля дыни (гектар)':1 / 250,
        }

#----
# Садовые:

metadict_detail['Выращивание Яблоко (центнер)'] = {
        '|-Яблоневые сады (гектар)':1 / 80,
        }

metadict_detail['Выращивание Вишня (центнер)'] = {
        '|-Вишнёвые сады (гектар)':1 / 60,
        }

metadict_detail['Выращивание Груша (центнер)'] = {
        '|-Грушёвые сады (гектар)':1 / 80,
        }

metadict_detail['Выращивание Виноград (центнер)'] = {
        # Пони не мучают виноград густой посадкой:
        # http://vinograd.info/info/vinogradarstvo-po-novomy/gystota-posadki.html
        # https://ru.wikisource.org/wiki/ЭСБЕ/Виноградарство
        '|-Виноградники (гектар)':1 / 80,
        }

metadict_detail['Выращивание лимона (центнер)'] = {
        '|-Лимонные сады (гектар)':1 / 50,
        }

metadict_detail['Выращивание инжира (центнер)'] = {
        '|-Фиговые сады (гектар)':1 / 50,
        }

metadict_detail['Выращивание абрикоса (центнер)'] = {
        '|-Абрикосовые сады (гектар)':1 / 50,
        }

metadict_detail['Выращивание персика (центнер)'] = {
        '|-Персиковые сады (гектар)':1 / 50,
        }

metadict_detail['Выращивание сливы (центнер)'] = {
        '|-Сливовые сады (гектар)':1 / 50,
        }

#----
# Выращивание грибов:

metadict_detail['Выращивание шампиньонов (центнер)'] = {
        # Исправить
            # Учти расход компоста и его состав
            # 250 килограмм с тонны компоста;
            # 50 кг урожай с квадратного метра в год;
            # https://agaricus.ru/statyi-aleksandra-tsareva/gribovodstvo-v-tsifrakh-i-faktakh
        '|-Грядки шампиньонов (квадратный метр)':2,
        }

metadict_detail['Выращивание вёшенок (центнер)'] = {
        # Исправить
            # Уточнить урожайность
            # Учесть расход комоста и его состав
        '|-Грядки вёшенок (квадратный метр)':2,
        }

#----
# Собирательство дикоросов, пчеловодство:

metadict_detail['Сок кленовый (центнер)'] = {
        '|-Кленовые леса (гектар)':1 / 40,
        }

metadict_detail['Сбор лугового мёда (центнер)'] = {
        # Исправить
            # Вообще-то клёны и дубы эквестрийских лесов -- отличные медоносы.
        # 25 кг мёда с гектара луга -- одна семья пчёл на гектар.
        '|-Медоносные луга (гектар)':4,
        }

metadict_detail['Сбор дикорастущих грибов (центнер)'] = {
        # Урожайность белого гриба 50-200 килограмм/гектар
        '|-Сбор дикорастущих грибов (гектар)':1,
        }

metadict_detail['Сбор дикорастущих орехов (центнер)'] = {
        '|-Сбор дикорастущих орехов (гектар)':1,
        }

metadict_detail['Сбор дикорастущих растений (центнер)'] = {
        '|-Сбор дикорастущих растений (гектар)':1,
        }

metadict_detail['Сбор дикорастущих ягод (центнер)'] = {
        '|-Сбор дикорастущих ягод (гектар)':1,
        }

metadict_detail['Сбор морской капусты (центнер)'] = {
        '|-Сбор морских растений (гектар)':1 / 100,
        }

metadict_detail['Сбор красных водорослей (центнер)'] = {
        '|-Сбор морских растений (гектар)':1 / 100,
        }

#----
# Импорт:

metadict_detail['Выращивание чёрного перца (центнер)'] = {
        '|-Плантации чёрного перца (гектар)':1 / 100,
        }

metadict_detail['Выращивание гвоздики (центнер)'] = {
        # 200 деревьев на гектар
        '|-Плантации гвоздики (гектар)':1 / 100,
        }

metadict_detail['Выращивание шафрана (центнер)'] = {
        # 80 000 цветов на гектар
        '|-Плантации шафрана (гектар)':1 / 80,
        }

metadict_detail['Выращивание плодов кофейного дерева (центнер)'] = {
        # https://ru.wikisource.org/wiki/ЭСБЕ/Кофе
        # 900 деревьев/гектар; 1-5 кг кофейных семян с дерева (9-45 центнеров/гектар)
            # Плоды втрое больше по массе:
        '|-Плантации кофейного дерева (гектар)':1 / (15 * 3),
        }

metadict_detail['Выращивание плодов дерева какао (центнер)'] = {
        # Среднемировой уровень -- 4 центнера какао-бобов с гектара (16 центнеров плодов)
        '|-Плантации дерева какао (гектар)':1 / 15,
        }

metadict_detail['Выращивание ванили (центнер)'] = {
        # Паразитирует на какао.
        # 1.5-6 килограмм стручков с растения, 1.5-2 центнера готовой продукции на гектар.
        '|-Плантации ванили (гектар)':1 / 5,
        }

metadict_detail['Выращивание корицы (центнер)'] = {
        # https://ru.wikipedia.org/wiki/Корица_(пряность)
        '|-Плантации корицы (гектар)':1 / 3,
        }

metadict_detail['Выращивание сахарного тростника (центнер)'] = {
        # Культура сахарного тростника в СССР:
            # http://www.activestudy.info/kultura-saxarnogo-trostnika-v-sssr/
        '|-Плантации сахарного тростника (гектар)':1 / 300,
        }

metadict_detail['Выращивание Чайные листья (центнер)'] = {
        '|-Плантации чая (гектар)':1 / 50,
        }

#----
# Древесина:

metadict_detail['Ивовые прутья (тонн)'] = {
        '|-Плантации ивы прутовидной (гектар)':1 / 5,
        }

#----
# Культуры, упрощение:

metadict_detail['|-Плантации ивы прутовидной (гектар)'] = {
        # Исправить
            # Так-то достаточно дикой чёрной ивы.
        # Глава 5. Выращивание сырья для производства лозовых изделий
        # http://splesti.ru/books/item/f00/s00/z0000004/st023.shtml
        '|-Ива прутовидная (Salix viminalis)':10000 / (0.8 * 0.25),
        '|--Лесничества (гектар)':1,
        }

metadict_detail['|-Кленовые леса (гектар)'] = {
        '|-Клён серебристый (Ácer sacchárinum)':250,
        '|--Лесничества (гектар)':1,
        }

metadict_detail['|-Виноградники (гектар)'] = {
        # Трудозатраты -- 100 дней на гектар (один рабочий на гектар).
        # http://vinograd.info/info/vinogradarstvo-po-novomy/zatraty-tryda-pri-vysokoshtambovoi-kyltyre.html
        '|-Виноград культурный (Vítis vinífera)':10000 / (3.5 * 1.2),
        '|--Фруктовые сады (гектар)':1,
        #'_-Работа виноградовода (нормо-часов)':800,
        }

metadict_detail['|-Оливковые сады (гектар)'] = {
        '|--Фруктовые сады (гектар)':1,
        }

metadict_detail['|-Вишнёвые сады (гектар)'] = {
        '|--Фруктовые сады (гектар)':1,
        }

metadict_detail['|-Грушёвые сады (гектар)'] = {
        '|--Фруктовые сады (гектар)':1,
        }

metadict_detail['|-Яблоневые сады (гектар)'] = {
        # Деревья высотой около 3 метров, посадка 3x3
        # https://vignette.wikia.nocookie.net/mlp/images/4/4d/Twilight_bucking_apples_S1E4.png
        # Уход за садом (14 дней/гектар) и уборка яблок (6 дней на гектар):
        # http://mehanik-ua.ru/tekhnologicheskie-karty/1470-tekhnologicheskaya-karta-vyrashchivaniya-yablok.html
        '|-Яблоня карликовая (Malus pumila)':10000 / (3.2 * 3.2),
        '|--Фруктовые сады (гектар)':1,
        }

metadict_detail['|-Лимонные сады (гектар)'] = {
        '|--Фруктовые сады (гектар)':1,
        }

metadict_detail['|-Фиговые сады (гектар)'] = {
        '|--Фруктовые сады (гектар)':1,
        }

metadict_detail['|-Абрикосовые сады (гектар)'] = {
        '|--Фруктовые сады (гектар)':1,
        }

metadict_detail['|-Персиковые сады (гектар)'] = {
        '|--Фруктовые сады (гектар)':1,
        }

metadict_detail['|-Сливовые сады (гектар)'] = {
        '|--Фруктовые сады (гектар)':1,
        }

metadict_detail['|-Плантации кофейного дерева (гектар)'] = {
        # https://ru.wikipedia.org/wiki/Coffea_canephora
        '|-Кофе робуста (Coffea robusta)':10000 / (3.3 * 3.3),
        '|--Плантации в Эверглейдсе (гектар)':1,
        }

metadict_detail['|-Плантации дерева какао (гектар)'] = {
        '|--Плантации в Эверглейдсе (гектар)':1,
        }

metadict_detail['|-Плантации гвоздики (гектар)'] = {
        '|--Плантации в Эверглейдсе (гектар)':1,
        }

metadict_detail['|-Плантации шафрана (гектар)'] = {
        '|--Плантации в Эверглейдсе (гектар)':1,
        }

metadict_detail['|-Плантации чёрного перца (гектар)'] = {
        '|--Плантации в Эверглейдсе (гектар)':1,
        }

metadict_detail['|-Плантации ванили (гектар)'] = {
        '|--Плантации в Эверглейдсе (гектар)':1,
        }

metadict_detail['|-Плантации корицы (гектар)'] = {
        '|--Плантации в Эверглейдсе (гектар)':1,
        }

metadict_detail['|-Плантации чая (гектар)'] = {
        '|--Плантации в Эверглейдсе (гектар)':1,
        }

metadict_detail['|-Плантации сахарного тростника (гектар)'] = {
        '|--Плантации в Эверглейдсе (гектар)':1,
        }

metadict_detail['|-Поля арахиса (гектар)'] = {
        '|--Поля бобовых (гектар)':1,
        }

metadict_detail['|-Поля батата (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля арбуза (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля дыни (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля имбиря (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля капусты (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля картофеля (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля конопли (гектар)'] = {
        '|--Поля технических культур (гектар)':1,
        }

metadict_detail['|-Поля льна (гектар)'] = {
        '|--Поля технических культур (гектар)':1,
        }

metadict_detail['|-Поля горчицы белой (гектар)'] = {
        '|--Поля технических культур (гектар)':1,
        }

metadict_detail['|-Поля тмина (гектар)'] = {
        '|--Поля технических культур (гектар)':1,
        }

metadict_detail['|-Поля моркови (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля риса посевного (гектар)'] = {
        # Исправить
            # Требуется много воды 9400 кубометров/гектар.
            # Хм, по данным ЭСБЕ 5000 куб. саженей (50 000 кубометров/гектар).
            # https://ru.wikisource.org/wiki/ЭСБЕ/Рис,_в_сельском_хозяйстве_и_мировой_экономике
            # https://ru.wikipedia.org/wiki/Производство_риса_в_Таиланде
        '|--Поля зерновых (гектар)':1,
        }

metadict_detail['|-Поля гречихи посевной (гектар)'] = {
        '|--Поля зерновых (гектар)':1,
        }

metadict_detail['|-Поля овса (гектар)'] = {
        '|--Поля зерновых (гектар)':1,
        }

metadict_detail['|-Поля ячменя (гектар)'] = {
        '|--Поля зерновых (гектар)':1,
        }

metadict_detail['|-Поля кукурузы (гектар)'] = {
        # https://vignette.wikia.nocookie.net/mlp/images/b/b2/Applejack_harvesting_corn_S2E01.png
        '|--Поля зерновых (гектар)':1,
        }

metadict_detail['|-Поля подсолнечника (гектар)'] = {
        '|--Поля зерновых (гектар)':1,
        }

metadict_detail['|-Поля кунжута (гектар)'] = {
        '|--Поля зерновых (гектар)':1,
        }

metadict_detail['|-Поля пшеницы (гектар)'] = {
        '|--Поля зерновых (гектар)':1,
        }

metadict_detail['|-Поля ржи (гектар)'] = {
        '|--Поля зерновых (гектар)':1,
        }

metadict_detail['|-Поля репы (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля брюквы (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля перца сладкого (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля лука репчатого (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля чеснока (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля красного перца (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля свёклы (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля брокколи (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля артишоков (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля петрушки (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля ревеня (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля латука посевного (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля сельдерея (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля спаржи (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля кресс-салата (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля укропа (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля хрена (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля сои (гектар)'] = {
        '|--Поля бобовых (гектар)':1,
        }

metadict_detail['|-Поля томатов (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля тыквы (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля кабачка (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля баклажанов (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля огурцов (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля фасоли (гектар)'] = {
        '|--Поля бобовых (гектар)':1,
        }

metadict_detail['|-Поля гороха посевного (гектар)'] = {
        '|--Поля бобовых (гектар)':1,
        }

metadict_detail['|-Поля чечевицы (гектар)'] = {
        '|--Поля бобовых (гектар)':1,
        }

metadict_detail['|-Грядки шампиньонов (квадратный метр)'] = {
        '|--Грядки грибов (квадратный метр)':1,
        }

metadict_detail['|-Грядки вёшенок (квадратный метр)'] = {
        '|--Грядки грибов (квадратный метр)':1,
        }

#----
# Трудозатраты (оценочно):
    # ТИПОВЫЕ НОРМЫ ВЫРАБОТКИ НА РУЧНЫЕ РАБОТЫ В ПОЛЕВОДСТВЕ И ОВОЩЕВОДСТВЕ
    # http://www.libussr.ru/doc_ussr/usr_12301.htm
    # ТИПОВЫЕ НОРМЫ ВЫРАБОТКИ НА МЕХАНИЗИРОВАННЫЕ И РУЧНЫЕ РАБОТЫ В САДОВОДСТВЕ
    # http://www.libussr.ru/doc_ussr/usr_14391.htm

metadict_detail['|--Лесничества (гектар)'] = {
        # Исправить
            # Найти нормативы на уход за лесом.
            # А пока один лесник на 200 гектаров.
        '|---Леса (гектар)':1,
        '|----Обжитые земли (гектар)':1,
        '_-Работа лесника (нормо-часов)':8,
        }

metadict_detail['|--Фруктовые сады (гектар)'] = {
        # Исправить
            # Это только плодоносящие сады. Есть ещё сады молодых растений.
            # На самом деле сад требует куда больше работы.
            # Обрезка деревьев, высадка новых.
        # ТИПОВЫЕ НОРМЫ ВЫРАБОТКИ НА МЕХАНИЗИРОВАННЫЕ И РУЧНЫЕ РАБОТЫ В САДОВОДСТВЕ, ВИНОГРАДАРСТВЕ И ПИТОМНИКОВОДСТВЕ
        # http://www.libussr.ru/doc_ussr/usr_14391.htm
        # Технологическая карта, выращивание яблок:
        # http://mehanik-ua.ru/tekhnologicheskie-karty/1470-tekhnologicheskaya-karta-vyrashchivaniya-yablok.html
        # Уход за садом (14 дней/гектар) и уборка яблок (6 дней на гектар). Всего 20 дней/гектар
        '|---Сады (гектар)':1,
        '|----Обжитые земли (гектар)':1,
        '_-Работа в саду (нормо-часов)':320,
        }

metadict_detail['|--Овощные огороды (гектар)'] = {
        # https://ru.wikisource.org/wiki/ЭСБЕ/Огород
        # Гектар картофеля (без механизации) -- 830 нормо-часов (100 рабочих дней)
        # С минимальной механизацией (плуг, картофелесажалка) -- 500 нормо-часов (60 рабочих дней)
        '|---Огороды (гектар)':1,
        '|----Обжитые земли (гектар)':1,
        '_-Работа на огороде (нормо-часов)':700,
        }

metadict_detail['|--Поля бобовых (гектар)'] = {
        # Исправить.
            # Не учтён обмолот и перевозка урожая.
            # Гектар фасоли (без механизации) -- 465 нормо-часов (58 рабочих дней)
        '|---Пашня (гектар)':1,
        '|----Обжитые земли (гектар)':1,
        '_-Работа на полях бобовых (нормо-часов)':465,
        }

metadict_detail['|--Поля зерновых (гектар)'] = {
        # Гектар зерновых (вспашка с плугом и волами) -- 400 нормо-часов (50 рабочих дней)
        '|---Пашня (гектар)':1,
        '|----Обжитые земли (гектар)':1,
        '_-Работа на полях зерновых (нормо-часов)':400,
        }

metadict_detail['|--Поля технических культур (гектар)'] = {
        '|---Пашня (гектар)':1,
        '|----Обжитые земли (гектар)':1,
        '_-Работа на полях технических культур (нормо-часов)':480,
        }

metadict_detail['|--Плантации в Эверглейдсе (гектар)'] = {
        # Дальние владения Эквестрии, пашут зебры.
        '|---Плантации (гектар)':1,
        '_-Работа зебр на плантациях (нормо-часов)':500,
        }

metadict_detail['|--Грядки грибов (квадратный метр)'] = {
        # Исправить
            # Уточнить, сколько там шампиньонам требуется ухода.
        '_-Работа на грибоводстве (нормо-часов)':5,
        }

metadict_detail['|-Медоносные луга (гектар)'] = {
        # Старые заметки:
            # Один гектар -- одна пчелиная семья.
            # Один пасечник -- 40 пчелосемей (1000 кг мёда); 40 га лугов (5 дней/гектар).
        # ГЛАВА VII. НАУЧНАЯ ОРГАНИЗАЦИЯ ТРУДА В ПЧЕЛОВОДСТВЕ:
            # http://paseka.su/books/item/f00/s00/z0000047/st029.shtml
            # Таблица 21. Нормативы времени овслуживлния в пчеловодстве (по данным госкомтруда СССР, 1976 г.)
            # Одна пчелосемья -- 831 минута/год (14 нормо-часов, 2 дней/гектар)
        '|-Пчелиная семья (Ápis melliféra)':1,
        '|---Луга (гектар)':1,
        '|----Обжитые земли (гектар)':1,
        '_-Работа пчеловода (нормо-часов)':20,
        }

metadict_detail['|-Сбор морских растений (гектар)'] = {
        # В изобилии растут вдоль побережья.
        '_-Работа на сборе морских растений (нормо-часов)':400,
        }

metadict_detail['|-Сбор дикорастущих растений (гектар)'] = {
        # На тех же медоносных лугах и в окресных лесах (5 дней/гектар).
        '_-Работа на сборе дикорастущих трав (нормо-часов)':40,
        }

metadict_detail['|-Сбор дикорастущих грибов (гектар)'] = {
        '_-Работа на сборе дикорастущих грибов (нормо-часов)':40,
        }

metadict_detail['|-Сбор дикорастущих орехов (гектар)'] = {
        '_-Работа на сборе дикорастущих орехов (нормо-часов)':40,
        }

metadict_detail['|-Сбор дикорастущих ягод (гектар)'] = {
        '_-Работа на сборе дикорастущих ягод (нормо-часов)':40,
        }
