#----
# Обработка пищи (домашняя):
    # Кухни народов мира:
        # https://en.wikipedia.org/wiki/Template:Cuisines
    # СБОРНИК РЕЦЕПТУР БЛЮД И КУЛИНАРНЫХ ИЗДЕЛИЙ ДЛЯ ПРЕДПРИЯТИЙ ОБЩЕСТВЕННОГО ПИТАНИЯ (1982)
        # http://interdoka.ru/kulinaria/1982/
    # Большой электронный сборник рецептур для предприятий общественного питания
        # http://www.100menu.ru/pages/foods/miaso/

#----
# Готовые блюда (смеси, растворы, бутерброды):

metadict_detail['Лапша с песто и овощами (килограмм)'] = {
        'Лапша варёная (грамм)':600,
        'Рагу овощное (грамм)':300,
        'Соус песто с томатами (грамм)':100,
        }

metadict_detail['Лапша с песто и сморчками (килограмм)'] = {
        'Лапша варёная (грамм)':700,
        'Сморчки жареные (грамм)':200,
        'Соус песто с томатами (грамм)':100,
        }

metadict_detail['Лапша с песто и шампиньонами (килограмм)'] = {
        'Лапша варёная (грамм)':600,
        'Шампиньоны тушёные (грамм)':300,
        'Соус песто с томатами (грамм)':100,
        }

metadict_detail['Лапша с соусом песто (килограмм)'] = {
        'Лапша варёная (грамм)':900,
        'Соус песто с томатами (грамм)':100,
        }

metadict_detail['Лапша с томатным соусом (килограмм)'] = {
        'Лапша варёная (грамм)':900,
        'Соус томатный (грамм)':100,
        }

metadict_detail['Каша чечевичная (килограмм)'] = {
        # Чечевицу варят отдельно от овощей:
            # http://www.molohovetc.ru/otdel_xxviii/2467_chechevitsa_s_grenkami/
        'Чечевица варёная (грамм)':650,
        'Лук обжаренный (грамм)':150,
        'Соль поваренная (грамм)':5,
        'Уксус яблочный 3% (грамм)':20,
        'Пряности для овощей из пяти растений (грамм)':10,
        'Вода для готовки (грамм)':500,
        }

metadict_detail['Рис варёный с консервированными овощами (килограмм)'] = {
        # Жалкое подобие пибимпапа
        'Рис варёный с соевым соусом (грамм)':500,
        'Капуста квашеная с соевым соусом (грамм)':100,
        'Кабачок консервированный (грамм)':100,
        'Морковь обжаренная (грамм)':100,
        'Оливки солёные (грамм)':50,
        'Ростки соевые (грамм)':50,
        'Лук чищеный (грамм)':50,
        'Семена кунжута (грамм)':5,
        'Масло кунжутное (грамм)':25,
        'Перец красный сушёный (грамм)':2,
        'Соус томатный консервированный (грамм)':25,
        }

metadict_detail['Рис варёный с соевым соусом (килограмм)'] = {
        'Рис варёный (грамм)':950,
        'Соус соевый (грамм)':50,
        }

metadict_detail['Рис варёный с томатным соусом (килограмм)'] = {
        'Рис варёный (грамм)':950,
        'Соус томатный консервированный (грамм)':50,
        }

metadict_detail['Рис обжаренный с капустой и спаржей (килограмм)'] = {
        'Рис обжаренный с квашеной капустой (грамм)':700,
        'Спаржа варёная (грамм)':300,
        }

metadict_detail['Рис обжаренный с капустой и грибами (килограмм)'] = {
        'Рис обжаренный с квашеной капустой (грамм)':600,
        'Вёшенки варёные (грамм)':300,
        'Морковь обжаренная (грамм)':100,
        }

metadict_detail['Рис обжаренный с капустой и овощами (килограмм)'] = {
        'Рис обжаренный с квашеной капустой (грамм)':600,
        'Томаты отборные (грамм)':200,
        'Баклажан печёный (грамм)':100,
        'Кабачок печёный (грамм)':50,
        'Перец печёный (грамм)':50,
        }

metadict_detail['Суп-пюре картофельный с шампиньонами (килограмм)'] = {
        'Суп-пюре картофельный (грамм)':800,
        'Шампиньоны жареные (грамм)':100,
        'Сухари пшеничные (грамм)':100,
        }

metadict_detail['Суп-пюре картофельный с гренками (килограмм)'] = {
        'Суп-пюре картофельный (грамм)':900,
        'Сухари пшеничные (грамм)':100,
        }

metadict_detail['Суп-пюре морковный с кремом (килограмм)'] = {
        'Суп-пюре морковный (грамм)':850,
        'Крем масленый (грамм)':150,
        }

metadict_detail['Суп-пюре свекольный с кремом (килограмм)'] = {
        'Суп-пюре свекольный (грамм)':900,
        'Крем масленый (грамм)':100,
        }

metadict_detail['Суп-пюре томатный с гренками (килограмм)'] = {
        'Суп-пюре томатный (грамм)':900,
        'Сухари пшеничные (грамм)':100,
        }

metadict_detail['Суп-пюре из корня сельдерея с гренками (килограмм)'] = {
        'Суп-пюре из корня сельдерея (грамм)':900,
        'Сухари пшеничные (грамм)':100,
        }

metadict_detail['Чай чёрный с сахаром (килограмм)'] = {
        'Чай чёрный (грамм)':950,
        'Сахар-песок (грамм)':40,
        }

metadict_detail['Чай чёрный с мёдом (килограмм)'] = {
        'Чай чёрный (грамм)':950,
        'Мёд жидкий (грамм)':50,
        }

metadict_detail['Чай чёрный с кленовым сиропом (килограмм)'] = {
        'Чай чёрный (грамм)':950,
        'Сироп кленовый (грамм)':50,
        }

metadict_detail['Чай травяной с сахаром (килограмм)'] = {
        'Чай травяной (грамм)':960,
        'Сахар-песок (грамм)':40,
        }

metadict_detail['Чай травяной с мёдом (килограмм)'] = {
        'Чай травяной (грамм)':950,
        'Мёд жидкий (грамм)':50,
        }

metadict_detail['Чай одуванчиковый с кленовым сиропом (килограмм)'] = {
        'Чай одуванчиковый (грамм)':950,
        'Сироп кленовый (грамм)':50,
        }

metadict_detail['Чай травяной с кленовым сиропом (килограмм)'] = {
        'Чай травяной (грамм)':950,
        'Сироп кленовый (грамм)':50,
        }

metadict_detail['Оладьи овсяные с кленовым сиропом (килограмм)'] = {
        'Оладьи овсяные (грамм)':900,
        'Сироп кленовый (грамм)':100,
        }

metadict_detail['Оладьи овсяные с яблочным сиропом (килограмм)'] = {
        'Оладьи овсяные (грамм)':900,
        'Сироп яблочный (грамм)':100,
        }

metadict_detail['Оладьи овсяные с мёдом (килограмм)'] = {
        'Оладьи овсяные (грамм)':900,
        'Мёд жидкий (грамм)':100,
        }

metadict_detail['Оладьи кукурузные с кленовым сиропом (килограмм)'] = {
        'Оладьи кукурузные (грамм)':900,
        'Сироп кленовый (грамм)':100,
        }

metadict_detail['Оладьи кукурузные с яблочным сиропом (килограмм)'] = {
        'Оладьи кукурузные (грамм)':900,
        'Сироп яблочный (грамм)':100,
        }

metadict_detail['Оладьи кукурузные с мёдом (килограмм)'] = {
        'Оладьи кукурузные (грамм)':900,
        'Мёд жидкий (грамм)':100,
        }

metadict_detail['Оладьи рисовые с яблочным сиропом (килограмм)'] = {
        'Оладьи рисовые (грамм)':900,
        'Сироп яблочный (грамм)':100,
        }

metadict_detail['Оладьи рисовые с лимонным сиропом (килограмм)'] = {
        'Оладьи рисовые (грамм)':900,
        'Сироп лимонный (грамм)':100,
        }

metadict_detail['Сэндвичи с арахисовой пастой (килограмм)'] = {
        # http://interdoka.ru/kulinaria/1982/1_holodnie_bluda/1_buterbrodi/1.html
        'Паста арахисовая (грамм)':400,
        'Хлеб кукурузный домашний (грамм)':600,
        }

metadict_detail['Сэндвичи с пекановой пастой (килограмм)'] = {
        'Паста пекановая (грамм)':400,
        'Хлеб кукурузный домашний (грамм)':600,
        }

metadict_detail['Сэндвичи с яблочным джемом (килограмм)'] = {
        # http://interdoka.ru/kulinaria/1982/1_holodnie_bluda/1_buterbrodi/2.html
        'Паста арахисовая (грамм)':70,
        'Джем яблочный (грамм)':400,
        'Хлеб кукурузный домашний (грамм)':530,
        }

metadict_detail['Сэндвичи с мёдом (килограмм)'] = {
        'Паста арахисовая (грамм)':70,
        'Мёд жидкий (грамм)':400,
        'Хлеб кукурузный домашний (грамм)':530,
        }

metadict_detail['Закуска из боровиков с луком (килограмм)'] = {
        # http://interdoka.ru/kulinaria/1982/1_holodnie_bluda/4_salati_vinegreti/45.html
        'Боровики маринованные (грамм)':860,
        'Масло конопляное (грамм)':50,
        'Лук чищеный (грамм)':100,
        }

metadict_detail['Винегрет с боровиками (килограмм)'] = {
        # http://interdoka.ru/kulinaria/1982/1_holodnie_bluda/4_salati_vinegreti/54.html
        'Винегрет овощной (грамм)':800,
        'Боровики маринованные (грамм)':200,
        }

metadict_detail['Каша овсяная с мёдом (килограмм)'] = {
        'Каша овсяная (грамм)':950,
        'Мёд жидкий (грамм)':50,
        }

metadict_detail['Каша овсяная с кленовым сиропом (килограмм)'] = {
        'Каша овсяная (грамм)':950,
        'Сироп кленовый (грамм)':50,
        }

metadict_detail['Североморские летние фрукты (килограмм)'] = {
        'Вишня отборная (грамм)':300,
        'Черника отборная (грамм)':200,
        'Земляника отборная (грамм)':200,
        'Смородина отборная (грамм)':150,
        'Морошка отборная (грамм)':150,
        }

metadict_detail['Среднеземные летние фрукты (килограмм)'] = {
        'Вишня отборная (грамм)':200,
        'Земляника отборная (грамм)':200,
        'Малина отборная (грамм)':200,
        'Арбуз чищеный (грамм)':200,
        'Дыня чищеная (грамм)':200,
        }

metadict_detail['Южноморские летние фрукты (килограмм)'] = {
        # Исправить
            # Ничем не отличаются от среднеземных
        'Вишня отборная (грамм)':200,
        'Земляника отборная (грамм)':200,
        'Малина отборная (грамм)':200,
        'Арбуз чищеный (грамм)':200,
        'Дыня чищеная (грамм)':200,
        }

metadict_detail['Североморские осенние фрукты (килограмм)'] = {
        'Яблоко чищеное (грамм)':500,
        'Груша чищеная (грамм)':300,
        'Слива отборная (грамм)':200,
        }

metadict_detail['Среднеземные осенние фрукты (килограмм)'] = {
        'Яблоко чищеное (грамм)':200,
        'Груша чищеная (грамм)':200,
        'Виноград отборный (грамм)':200,
        'Слива отборная (грамм)':100,
        'Инжир отборный (грамм)':100,
        'Персик отборный (грамм)':100,
        'Абрикос отборный (грамм)':100,
        }

metadict_detail['Южноморские осенние фрукты (килограмм)'] = {
        # Исправить
            # Ничем не отличаются от среднеземных
        'Яблоко чищеное (грамм)':200,
        'Груша чищеная (грамм)':200,
        'Виноград отборный (грамм)':200,
        'Слива отборная (грамм)':100,
        'Инжир отборный (грамм)':100,
        'Персик отборный (грамм)':100,
        'Абрикос отборный (грамм)':100,
        }

#----
# Готовые блюда (стерилизация):

metadict_detail['Соус песто с томатами (килограмм)'] = {
        'Лист базилика (грамм)':350,
        'Томаты сушёные (грамм)':50,
        'Орешки кедровые (грамм)':180,
        'Чеснок чищеный (грамм)':50,
        'Соль поваренная (грамм)':20,
        'Масло оливковое (грамм)':350,
        '|=Банка соуса песто (килограмм)':1,
        '_-Приготовление соуса (килограмм)':1,
        '_-Стерилизация консервов (килограмм)':1,
        }

metadict_detail['Соус баклажанный (килограмм)'] = {
        # Икра баклажанная
        'Баклажан печёный (грамм)':300 / (1 - 0.20),
        'Томаты отборные (грамм)':220 / (1 - 0.60),
        'Перец печёный (грамм)':250 / (1 - 0.20),
        'Лук обжаренный (грамм)':200,
        'Масло оливковое (грамм)':50,
        'Соль поваренная (грамм)':10,
        'Перец красный сушёный (грамм)':5,
        '|=Банка баклажанного соуса (килограмм)':1,
        '_-Тушение овощей (килограмм)':1,
        '_-Приготовление соуса (килограмм)':1,
        '_-Стерилизация консервов (килограмм)':1,
        }

metadict_detail['Соус соевый (килограмм)'] = {
        # https://koji.su/domashnij-soevyj-sous-kak-prigotovit-klassicheskij-soevyj-sous/
        'Бобы соевые (грамм)':250,
        'Крупа ячневая (грамм)':250,
        'Соль поваренная (грамм)':180,
        'Вода для готовки (грамм)':1000,
        '|=Банка соевого соуса (килограмм)':1,
        '_-Приготовление соевого соуса (килограмм)':1,
        '_-Стерилизация консервов (килограмм)':1,
        'Сусло соевое (фильтрация/грамм)':1000,
        'Сусло соевое (брожение/грамм)':1000,
        }

metadict_detail['Шампиньоны тушёные консервированные (килограмм)'] = {
        'Шампиньоны тушёные (грамм)':1000,
        '|=Банка тушёных шампиньонов (килограмм)':1,
        '_-Стерилизация консервов (килограмм)':1,
        }

metadict_detail['Лечо со сладким перцем консервированное (килограмм)'] = {
        'Лечо со сладким перцем (грамм)':1000,
        '|=Банка лечо (килограмм)':1,
        '_-Стерилизация консервов (килограмм)':1,
        }

metadict_detail['Соус томатный консервированный (килограмм)'] = {
        'Соус томатный (грамм)':1000,
        '|=Банка томатного соуса (килограмм)':1,
        '_-Стерилизация консервов (килограмм)':1,
        }

metadict_detail['Джем яблочный (килограмм)'] = {
        # http://konservirovanie.su/books/item/f00/s00/z0000001/st020.shtml
        'Яблоко чищеное (грамм)':739,
        'Сахар-песок (грамм)':629,
        'Вода для готовки (грамм)':1000,
        '|=Банка яблочного джема (килограмм)':1,
        '_-Варка яблочного джема (килограмм)':1,
        '_-Стерилизация консервов (килограмм)':1,
        }

metadict_detail['Джем из ревеня (килограмм)'] = {
        'Ревень отборный (грамм)':400  / (1 - 0.50),
        'Сахар-песок (грамм)':600,
        'Корень имбиря (грамм)':5,
        'Вода для готовки (грамм)':1000,
        '|=Банка джема из ревеня (килограмм)':1,
        '_-Варка яблочного джема (килограмм)':1,
        '_-Стерилизация консервов (килограмм)':1,
        }

metadict_detail['Варенье одуванчиковое (килограмм)'] = {
        'Одуванчик чищеный (грамм)':400,
        'Сахар-песок (грамм)':600,
        'Вода для готовки (грамм)':1000,
        '|=Банка одуванчикового варенья (килограмм)':1,
        '_-Варка варенья (килограмм)':1,
        '_-Стерилизация консервов (килограмм)':1,
        }

metadict_detail['Варенье земляничное (килограмм)'] = {
        'Земляника отборная (грамм)':400,
        'Сахар-песок (грамм)':600,
        'Вода для готовки (грамм)':1000,
        '|=Банка земляничного варенья (килограмм)':1,
        '_-Варка варенья (килограмм)':1,
        '_-Стерилизация консервов (килограмм)':1,
        }

metadict_detail['Варенье смородиновое (килограмм)'] = {
        'Смородина отборная (грамм)':400,
        'Сахар-песок (грамм)':600,
        'Вода для готовки (грамм)':1000,
        '|=Банка смородинового варенья (килограмм)':1,
        '_-Варка варенья (килограмм)':1,
        '_-Стерилизация консервов (килограмм)':1,
        }

#----
# Готовые блюда (измельчение, нарезка):

metadict_detail['Репа печёная с ягодами (килограмм)'] = {
        # Старые добрые паренки.
        'Репа печёная (грамм)':500,
        'Черника отборная (грамм)':250,
        'Земляника отборная (грамм)':250,
        '_-Шинковка овощей (килограмм)':1,
        }

metadict_detail['Свёкла печёная с ягодами (килограмм)'] = {
        'Свёкла печёная (грамм)':500,
        'Черника отборная (грамм)':250,
        'Земляника отборная (грамм)':250,
        '_-Шинковка овощей (килограмм)':1,
        }

metadict_detail['Свёкла печёная с кресс-салатом (килограмм)'] = {
        'Свёкла печёная (грамм)':600,
        'Спаржа варёная (грамм)':200,
        'Кресс-салат отборный (грамм)':200,
        '_-Шинковка овощей (килограмм)':1,
        }

metadict_detail['Брюква печёная с кедровыми орехами (килограмм)'] = {
        'Брюква печёная (грамм)':800,
        'Орешки кедровые (грамм)':50,
        'Соль поваренная (грамм)':5,
        'Кресс-салат отборный (грамм)':100,
        'Корень петрушки чищеный (грамм)':20,
        'Заправка для салатов медово-горчичная (грамм)':50,
        '_-Шинковка овощей (килограмм)':1,
        }

metadict_detail['Винегрет овощной (килограмм)'] = {
        # http://interdoka.ru/kulinaria/1982/1_holodnie_bluda/4_salati_vinegreti/52.html
        'Картофель печёный (грамм)':210,
        'Свёкла печёная (грамм)':150,
        'Морковь печёная (грамм)':100,
        'Огурцы солёные (грамм)':150,
        'Капуста квашеная (грамм)':150,
        'Лук чищеный (грамм)':150,
        'Заправка для салатов на конопляном масле (грамм)':100,
        '_-Шинковка овощей (килограмм)':1,
        }

metadict_detail['Винегрет фруктово-овощной (килограмм)'] = {
        # http://www.100menu.ru/pages/pages.index/sbornik/hol/salat/93.html
        'Картофель печёный (грамм)':250,
        'Морковь печёная (грамм)':150,
        'Огурцы отборные (грамм)':150,
        'Яблоко чищеное (грамм)':100,
        'Груша чищеная (грамм)':100,
        'Горошек зелёный (грамм)':50,
        'Корень сельдерея (грамм)':50,
        'Зелень петрушки отборная (грамм)':50,
        'Заправка для салатов на конопляном масле (грамм)':100,
        '_-Шинковка овощей (килограмм)':1,
        }

metadict_detail['Салат зелёный с томатами (килограмм)'] = {
        # http://interdoka.ru/kulinaria/1982/1_holodnie_bluda/4_salati_vinegreti/3.html
        'Салат-латук чищеный (грамм)':250,
        'Огурцы отборные (грамм)':300,
        'Томаты отборные (грамм)':250,
        'Заправка для салатов на конопляном масле (грамм)':200,
        '_-Шинковка овощей (килограмм)':1,
        }

metadict_detail['Салат томатный со сладким перцем (килограмм)'] = {
        # http://www.100menu.ru/pages/pages.index/sbornik/hol/salat/51.html
        'Томаты отборные (грамм)':300,
        'Огурцы отборные (грамм)':200,
        'Перец сладкий чищеный (грамм)':200,
        'Лук зелёный отборный (грамм)':100,
        'Заправка для салатов на конопляном масле (грамм)':200,
        '_-Шинковка овощей (килограмм)':1,
        }

metadict_detail['Салат из морской капусты (килограмм)'] = {
        'Морская капуста замоченная (грамм)':500,
        'Лук чищеный (грамм)':200,
        'Морковь чищеная (грамм)':100,
        'Огурцы солёные (грамм)':100,
        'Заправка для салатов на соевом соусе (грамм)':100,
        '_-Шинковка овощей (килограмм)':1,
        }

metadict_detail['Салат огуречный с соевым соусом (килограмм)'] = {
        'Огурцы отборные (грамм)':500,
        'Морковь чищеная (грамм)':300,
        'Лук чищеный (грамм)':100,
        'Семена кунжута (грамм)':10,
        'Перец красный сушёный (грамм)':3,
        'Заправка для салатов на соевом соусе (грамм)':100,
        '_-Шинковка овощей (килограмм)':1,
        }

metadict_detail['Салат из брокколи (килограмм)'] = {
        # Исправить
            # Ну и что, что ты не любишь салаты. Всё равно найди рецепты и почини!
        'Брокколи чищеные (грамм)':500,
        'Огурцы отборные (грамм)':200,
        'Лук зелёный отборный (грамм)':100,
        'Заправка для салатов на оливковом масле (грамм)':200,
        '_-Шинковка овощей (килограмм)':1,
        }

metadict_detail['Салат из варёной спаржи (килограмм)'] = {
        'Спаржа варёная (грамм)':500,
        'Кресс-салат отборный (грамм)':200,
        'Лук чищеный (грамм)':100,
        'Заправка для салатов на оливковом масле (грамм)':200,
        '_-Шинковка овощей (килограмм)':1,
        }

metadict_detail['Салат из варёной свёклы (килограмм)'] = {
        'Свёкла варёная (грамм)':500,
        'Огурцы отборные (грамм)':200,
        'Лук зелёный отборный (грамм)':100,
        'Заправка для салатов на оливковом масле (грамм)':200,
        '_-Шинковка овощей (килограмм)':1,
        }

metadict_detail['Салат из консервированных кабачков (килограмм)'] = {
        # Исправить
            # Динкина вкусовщина. Не взлетит.
        'Кабачок консервированный (грамм)':400,
        'Картофель варёный (грамм)':200,
        'Морковь чищеная (грамм)':100,
        'Лук чищеный (грамм)':100,
        'Сок лимонный (грамм)':50,
        'Перец красный сушёный (грамм)':1,
        'Заправка для салатов на оливковом масле (грамм)':200,
        '_-Шинковка овощей (килограмм)':1,
        }

metadict_detail['Салат из квашеной капусты (килограмм)'] = {
        # http://interdoka.ru/kulinaria/1982/1_holodnie_bluda/4_salati_vinegreti/32.html
        'Капуста квашеная (грамм)':800,
        'Лук чищеный (грамм)':100,
        'Сахар-песок (грамм)':50,
        'Масло конопляное (грамм)':50,
        '_-Шинковка овощей (килограмм)':1,
        '_-Замачивание овощей (килограмм)':1,
        }

metadict_detail['Ботвинья-свекольник (килограмм)'] = {
        # Холодный овощной суп с зеленью и квасом в основе.
            # http://www.rus-food-recipes.ru/P_1/19.htm
            # http://www.rus-food-recipes.ru/P_1/20.htm
            # https://www.russianfood.com/recipes/recipe.php?rid=119166
            # http://interdoka.ru/kulinaria/1982/2_supi/7_xolodnie/16.html
        'Заправка зелёная для ботвиньи (грамм)':200,
        'Заправка овощная для ботвиньи (грамм)':300,
        'Основа квасная для ботвиньи (грамм)':500,
        '_-Приготовление ботвиньи (килограмм)':1,
        }

#----
# Готовые блюда (тепловая обработка):

metadict_detail['Хлеб пшеничный домашний (килограмм)'] = {
        # Исправить
            # Сделай отдельно домашний и фабричный хлеб.
            # Трудозатраты-то отличаются в 5 раз!
        'Тесто пшеничное дрожжевое (грамм)':1000 / (1 - 0.10),
        '_-Выпечка хлеба (килограмм)':1,
        }

metadict_detail['Хлеб ржаной домашний (килограмм)'] = {
        'Тесто ржаное на закваске (грамм)':1000 / (1 - 0.12),
        '_-Выпечка хлеба (килограмм)':1,
        }

metadict_detail['Хлеб кукурузный домашний (килограмм)'] = {
        'Тесто пшенично-кукурузное дрожжевое (грамм)':1000 / (1 - 0.10),
        '_-Выпечка хлеба (килограмм)':1,
        }

metadict_detail['Хлеб соевый домашний (килограмм)'] = {
        'Тесто пшенично-соевое дрожжевое (грамм)':1000 / (1 - 0.10),
        '_-Выпечка хлеба (килограмм)':1,
        }

metadict_detail['Хлеб ячменный домашний (килограмм)'] = {
        'Тесто пшенично-ячменное дрожжевое (грамм)':1000 / (1 - 0.12),
        '_-Выпечка хлеба (килограмм)':1,
        }

metadict_detail['Пицца с брокколи (килограмм)'] = {
        # Исправить
            # Карри здесь неуместен. Пряности для пиццы сделай отдельно.
        'Тесто пшеничное дрожжевое для пирогов (грамм)':300 / (1 - 0.05),
        'Соус томатный (грамм)':200 / (1 - 0.10),
        'Брокколи чищеные (грамм)':250 / (1 - 0.10),
        'Огурцы солёные (грамм)':50 / (1 - 0.10),
        'Оливки солёные (грамм)':50 / (1 - 0.10),
        'Лук чищеный (грамм)':50 / (1 - 0.10),
        'Крем маслено-горчичный (грамм)':100,
        'Душица сушёная (грамм)':3,
        'Лист базилика (грамм)':25,
        'Пряности нежного карри (грамм)':10,
        '_-Выпечка пирога (килограмм)':1,
        }

metadict_detail['Пицца с артишоками (килограмм)'] = {
        'Тесто пшеничное дрожжевое для пирогов (грамм)':300 / (1 - 0.05),
        'Соус томатный (грамм)':200 / (1 - 0.10),
        'Артишоки чищеные (грамм)':250 / (1 - 0.10),
        'Огурцы солёные (грамм)':50 / (1 - 0.10),
        'Оливки солёные (грамм)':50 / (1 - 0.10),
        'Лук чищеный (грамм)':50 / (1 - 0.10),
        'Крем маслено-горчичный (грамм)':100,
        'Душица сушёная (грамм)':3,
        'Лист базилика (грамм)':25,
        'Пряности нежного карри (грамм)':10,
        '_-Выпечка пирога (килограмм)':1,
        }

metadict_detail['Пицца с кабачками (килограмм)'] = {
        'Тесто пшеничное дрожжевое для пирогов (грамм)':300 / (1 - 0.05),
        'Соус томатный консервированный (грамм)':200 / (1 - 0.10),
        'Кабачок консервированный (грамм)':250 / (1 - 0.10),
        'Огурцы солёные (грамм)':50 / (1 - 0.10),
        'Оливки солёные (грамм)':50 / (1 - 0.10),
        'Лук чищеный (грамм)':50 / (1 - 0.10),
        'Крем маслено-горчичный (грамм)':100,
        'Душица сушёная (грамм)':3,
        'Базилик сушёный (грамм)':5,
        'Пряности нежного карри (грамм)':10,
        '_-Выпечка пирога (килограмм)':1,
        }

metadict_detail['Пицца с шампиньонами (килограмм)'] = {
        'Тесто пшеничное дрожжевое для пирогов (грамм)':300 / (1 - 0.05),
        'Соус томатный консервированный (грамм)':200 / (1 - 0.10),
        'Шампиньоны варёные (грамм)':250 / (1 - 0.10),
        'Огурцы солёные (грамм)':50 / (1 - 0.10),
        'Оливки солёные (грамм)':50 / (1 - 0.10),
        'Лук чищеный (грамм)':50 / (1 - 0.10),
        'Крем маслено-горчичный (грамм)':100,
        'Душица сушёная (грамм)':3,
        'Базилик сушёный (грамм)':5,
        'Пряности нежного карри (грамм)':10,
        '_-Выпечка пирога (килограмм)':1,
        }

metadict_detail['Пирожки морковные (килограмм)'] = {
        # http://interdoka.ru/kulinaria/1982/16_muchnie/2_izdelia/15.html
        # Густое тесто -- упёк 5%; упарка моркови -- 5%
        'Тесто пшеничное дрожжевое для пирогов (грамм)':400 / (1 - 0.05),
        'Морковь тушёная (грамм)':550 / (1 - 0.05),
        'Сахарная пудра (грамм)':50,
        '_-Выпечка пирога (килограмм)':1,
        }

metadict_detail['Пирожки с ревенем (килограмм)'] = {
        'Тесто пшеничное дрожжевое для пирогов (грамм)':400 / (1 - 0.05),
        'Ревень отборный (грамм)':500 / (1 - 0.20),
        'Сахарная пудра (грамм)':100,
        '_-Выпечка пирога (килограмм)':1,
        }

metadict_detail['Пирожки с грушей (килограмм)'] = {
        'Тесто пшеничное дрожжевое для пирогов (грамм)':400 / (1 - 0.05),
        'Груша чищеная (грамм)':550 / (1 - 0.15),
        'Сахарная пудра (грамм)':50,
        '_-Выпечка пирога (килограмм)':1,
        }

metadict_detail['Пирожки черничные (килограмм)'] = {
        'Тесто пшеничное дрожжевое для пирогов (грамм)':400 / (1 - 0.05),
        'Черника отборная (грамм)':500 / (1 - 0.15),
        'Крахмал картофельный (грамм)':50,
        'Сахарная пудра (грамм)':50,
        '_-Выпечка пирога (килограмм)':1,
        }

metadict_detail['Пирожки земляничные (килограмм)'] = {
        'Тесто пшеничное дрожжевое для пирогов (грамм)':400 / (1 - 0.05),
        'Земляника отборная (грамм)':500 / (1 - 0.15),
        'Крахмал картофельный (грамм)':50,
        'Сахарная пудра (грамм)':50,
        '_-Выпечка пирога (килограмм)':1,
        }

metadict_detail['Пирожки яблочные (килограмм)'] = {
        # http://www.molohovetc.ru/otdel_xiv/1624_deshevyjj_jablochnyjj_pirog/
        'Тесто пшеничное дрожжевое для пирогов (грамм)':400 / (1 - 0.05),
        'Яблоко чищеное (грамм)':550 / (1 - 0.15),
        'Сахарная пудра (грамм)':50,
        'Корица молотая (грамм)':1,
        '_-Выпечка пирога (килограмм)':1,
        }

metadict_detail['Пирожки с картофелем и спаржей (килограмм)'] = {
        # Пирожок открытый, поэтому начинка ужаривается на 10-15%.
        'Тесто пшеничное дрожжевое для пирогов (грамм)':400 / (1 - 0.05),
        'Картофель тушёный с морковью (грамм)':500 / (1 - 0.05),
        'Спаржа варёная (грамм)':100 / (1 - 0.15),
        '_-Выпечка пирога (килограмм)':1,
        }

metadict_detail['Пирожки с картофелем (килограмм)'] = {
        'Тесто пшеничное дрожжевое для пирогов (грамм)':400 / (1 - 0.05),
        'Картофель тушёный с морковью (грамм)':600 / (1 - 0.05),
        '_-Выпечка пирога (килограмм)':1,
        }

metadict_detail['Пирожки капустные (килограмм)'] = {
        # http://www.molohovetc.ru/otdel_xi/1392_pirog_so_svezhejj_kapustoju/
        'Тесто пшеничное дрожжевое для пирогов (грамм)':400 / (1 - 0.05),
        'Капуста тушёная (грамм)':600 / (1 - 0.05),
        '_-Выпечка пирога (килограмм)':1,
        }

metadict_detail['Пирожки тыквенные (килограмм)'] = {
        'Тесто пшеничное дрожжевое для пирогов (грамм)':400 / (1 - 0.05),
        'Тыква тушёная (грамм)':600 / (1 - 0.05),
        '_-Выпечка пирога (килограмм)':1,
        }

metadict_detail['Пирог открытый тыквенный (килограмм)'] = {
        # Открытые кремовые пироги в американском стиле:
        'Тесто пшеничное дрожжевое для пирогов (грамм)':300 / (1 - 0.05),
        'Тыква тушёная (грамм)':500 / (1 - 0.10),
        'Крем масленый (грамм)':100,
        'Сахарная пудра (грамм)':100,
        'Соль поваренная (грамм)':5,
        'Пряности кондитерские (грамм)':5,
        '_-Выпечка пирога (килограмм)':1,
        }

metadict_detail['Пирог открытый вишнёвый (килограмм)'] = {
        'Тесто пшеничное дрожжевое для пирогов (грамм)':300 / (1 - 0.05),
        'Вишня отборная (грамм)':500 / (1 - 0.10),
        'Крем масленый (грамм)':100,
        'Сахарная пудра (грамм)':100,
        'Соль поваренная (грамм)':5,
        'Пряности кондитерские (грамм)':5,
        '_-Выпечка пирога (килограмм)':1,
        }

metadict_detail['Пирог открытый лимонный (килограмм)'] = {
        'Тесто пшеничное дрожжевое для пирогов (грамм)':300 / (1 - 0.05),
        'Крем лимонный (грамм)':450,
        'Крем масленый (грамм)':200,
        'Сахарная пудра (грамм)':50,
        'Цедра лимонная (грамм)':25,
        'Соль поваренная (грамм)':5,
        'Пряности кондитерские (грамм)':5,
        '_-Выпечка пирога (килограмм)':1,
        }

metadict_detail['Пирог открытый пекановый (килограмм)'] = {
        # Исправить
            # Эй, пони не соблюдают рецепт!
            # Ну и правильно, с измельчёнными орехами вкуснее.
            # Тогда будь последовательной, Блум, и добавь пекановый крем.
        'Тесто пшеничное дрожжевое для пирогов (грамм)':300 / (1 - 0.05),
        'Орех пекана чищенный (грамм)':200,
        'Крем заварной (грамм)':300,
        'Крем масленый (грамм)':100,
        'Сахарная пудра (грамм)':100,
        'Цедра лимонная (грамм)':25,
        'Соль поваренная (грамм)':5,
        'Пряности кондитерские (грамм)':5,
        'Ваниль молотая (грамм)':0.5,
        '_-Выпечка пирога (килограмм)':1,
        }

metadict_detail['Пирог открытый кленовый (килограмм)'] = {
        # http://www.pbs.org/food/kitchen-vignettes/canadian-maple-syrup-pie/
        'Тесто пшеничное дрожжевое для пирогов (грамм)':300 / (1 - 0.05),
        'Крем кленовый (грамм)':450,
        'Крем масленый (грамм)':200,
        'Сахарная пудра (грамм)':50,
        'Пряности кондитерские (грамм)':5,
        '_-Выпечка пирога (килограмм)':1,
        }

metadict_detail['Шарлотка земляничная (килограмм)'] = {
        'Тесто пшеничное бездрожжевое для пирогов (грамм)':500 / (1 - 0.05),
        'Земляника отборная (грамм)':500 / (1 - 0.15),
        'Сахарная пудра (грамм)':20,
        'Пряности кондитерские (грамм)':3,
        '_-Выпечка пирога (килограмм)':1,
        }

metadict_detail['Шарлотка яблочная (килограмм)'] = {
        'Тесто пшеничное бездрожжевое для пирогов (грамм)':500 / (1 - 0.05),
        'Яблоко чищеное (грамм)':500 / (1 - 0.15),
        'Сахарная пудра (грамм)':20,
        'Пряности кондитерские (грамм)':3,
        '_-Выпечка пирога (килограмм)':1,
        }

metadict_detail['Лапша варёная (килограмм)'] = {
        'Лапша сушёная (грамм)':400,
        'Соль поваренная (грамм)':10,
        'Вода для готовки (грамм)':1000,
        '_-Варка лапши (килограмм)':1,
        }

metadict_detail['Суп хлебный с земляникой (килограмм)'] = {
        # На самом деле годная, но непростая, очень рандомная по времени готовки штука:
            # 1) Из свежайшего ржаного хлеба насушить сухари, не обжаривая. Размолоть.
            # 2) Залить крутым кипятком в эмалированной посуде. Оставить на два часа.
            # 3) Поставить этот "студень" на слабый огонь, но до кипения не доводить.
            # 4) В разогретую массу ввести мёд и некислые сухофрукты, сладкое варенье.
            # 5) Ждать полной диффузии, пудингово-фруктового вкуса (пробовать и ждать)
            # 6) Добавить корицы, бадьяна и гвоздики (на кончике ножа)
            # 7) Снять с огня, плотно накрыть крышкой, оставить на полчаса.
        # О Динк, что же мы творим?..
        'Сухари ржаные (грамм)':200,
        'Варенье земляничное (грамм)':200,
        'Мёд жидкий (грамм)':50,
        'Корица молотая (грамм)':0.3,
        'Бадьян сушёный (грамм)':0.3,
        'Гвоздика сушёная (грамм)':0.3,
        'Вода для готовки (грамм)':1000,
        '_-Варка хлебного супа (килограмм)':1,
        }

metadict_detail['Пудинг смородиновый (килограмм)'] = {
        # Исправить
            # Этот пудинг не зря на лярде готовят. С маслом хуже, нужно соду добавлять.
        # Cloutie Dumpling
        # http://www.rampantscotland.com/recipes/blrecipe_cloutie.htm
        'Смородина сушёная (грамм)':200,
        'Мука пшеничная (грамм)':200,
        'Мука овсяная (грамм)':100,
        'Масло льняное (грамм)':75,
        'Сахар-песок (грамм)':75,
        'Сода пищевая (грамм)':5,
        'Сироп яблочный (грамм)':20,
        'Аквафаба чечевичная (грамм)':100,
        'Перец душистый сушёный (грамм)':1,
        'Корень имбиря (грамм)':1,
        'Корица молотая (грамм)':1,
        'Орех мускатный (грамм)':0.3,
        'Вода для готовки (грамм)':250,
        '_-Варка пудинга (килограмм)':1,
        }

metadict_detail['Пудинг кукурузный (килограмм)'] = {
        # Исправить
            # Проверь, уточни пропорции.
        # Pudding corn
        'Кукуруза чищеная (грамм)':700,
        'Мука кукурузная (грамм)':100,
        'Масло оливковое (грамм)':50,
        'Сахар-песок (грамм)':50,
        'Сода пищевая (грамм)':5,
        'Соль поваренная (грамм)':5,
        'Аквафаба чечевичная (грамм)':100,
        'Перец красный сушёный (грамм)':1,
        'Орех мускатный (грамм)':0.3,
        '_-Пюрирование овощей (килограмм)':1,
        '_-Выпечка пирога (килограмм)':1,
        }

metadict_detail['Пудинг морковный (килограмм)'] = {
        # Gajar ka halwa
        'Морковь чищеная (грамм)':800 / (1 - 0.15),
        'Виноград сушёный (грамм)':25,
        'Мука кукурузная (грамм)':25,
        'Масло кунжутное (грамм)':25,
        'Сахар-песок (грамм)':25,
        'Соль поваренная (грамм)':4,
        'Семена кардамона (грамм)':3,
        'Шафран сушёный (грамм)':0.2,
        'Перец красный сушёный (грамм)':1,
        'Аквафаба чечевичная (грамм)':100,
        '_-Пюрирование овощей (килограмм)':1,
        '_-Тушение овощей (килограмм)':1,
        }

metadict_detail['Пудинг тыквенный (килограмм)'] = {
        'Тыква чищеная (грамм)':800 / (1 - 0.15),
        'Виноград сушёный (грамм)':25,
        'Мука кукурузная (грамм)':25,
        'Масло кунжутное (грамм)':25,
        'Сахар-песок (грамм)':25,
        'Соль поваренная (грамм)':4,
        'Семена кардамона (грамм)':3,
        'Шафран сушёный (грамм)':0.2,
        'Перец красный сушёный (грамм)':1,
        'Аквафаба чечевичная (грамм)':100,
        '_-Пюрирование овощей (килограмм)':1,
        '_-Тушение овощей (килограмм)':1,
        }

metadict_detail['Пряники медовые (килограмм)'] = {
        # Исправить
            # Вообще-то это тяжёлое заварное тесто.
            # Аммоний как разрыхлитель используют не зря.
        # http://www.hleb.net/prjanik/350/index-r.html#medovyeprjaniki
        'Тесто пряничное медовое заварное (грамм)':980,
        'Сахарная пудра (грамм)':20,
        'Сода пищевая (грамм)':5.6,
        'Пряности пряничные (грамм)':4,
        '_-Выпечка пряников (килограмм)':1,
        }

metadict_detail['Блины ржаные (килограмм)'] = {
        'Тесто ржаное на закваске (грамм)':950,
        'Масло льняное (грамм)':50,
        '_-Выпечка блинов (килограмм)':1,
        }

metadict_detail['Блины пшенично-гречневые (килограмм)'] = {
        # http://www.rus-food-recipes.ru/P_1/119.htm
        'Тесто пшенично-гречневое для блинов (грамм)':950,
        'Масло льняное (грамм)':50,
        '_-Выпечка блинов (килограмм)':1,
        }

metadict_detail['Оладьи овсяные (килограмм)'] = {
        'Тесто пшенично-овсяное для оладий (грамм)':1000 / (1 - 0.10),
        'Масло подсолнечное (грамм)':25,
        '_-Выпечка оладий (килограмм)':1,
        }

metadict_detail['Оладьи кукурузные (килограмм)'] = {
        # Johnnycake
        'Тесто кукурузное для оладий (грамм)':1000 / (1 - 0.10),
        'Масло оливковое (грамм)':25,
        '_-Выпечка оладий (килограмм)':1,
        }

metadict_detail['Оладьи рисовые (килограмм)'] = {
        'Каша рисовая (грамм)':650 / (1 - 0.15),
        'Мука пшеничная (грамм)':200,
        'Аквафаба чечевичная (грамм)':100,
        'Масло оливковое (грамм)':50,
        '_-Выпечка оладий (килограмм)':1,
        }

metadict_detail['Пончики с глазурью (килограмм)'] = {
        'Тесто пшеничное для пончиков (грамм)':900 / (1 - 0.05),
        'Сироп сахарный (грамм)':75,
        'Масло подсолнечное (грамм)':25,
        'Пряности пряничные (грамм)':4,
        '_-Выпечка пончиков (килограмм)':1,
        }

metadict_detail['Маффины кукурузные (килограмм)'] = {
        'Тесто пшенично-кукурузное для маффинов (грамм)':1000 / (1 - 0.15),
        'Масло подсолнечное (грамм)':25,
        'Пряности кондитерские (грамм)':3,
        '_-Выпечка кексов (килограмм)':1,
        }

metadict_detail['Маффины морковные (килограмм)'] = {
        'Тесто пшенично-кукурузное для маффинов (грамм)':700 / (1 - 0.15),
        'Пюре морковное (грамм)':300,
        'Масло подсолнечное (грамм)':25,
        'Пряности кондитерские (грамм)':3,
        '_-Выпечка кексов (килограмм)':1,
        }

metadict_detail['Маффины тыквенные (килограмм)'] = {
        'Тесто пшенично-кукурузное для маффинов (грамм)':700 / (1 - 0.15),
        'Пюре тыквенное (грамм)':300,
        'Масло подсолнечное (грамм)':25,
        'Пряности кондитерские (грамм)':3,
        '_-Выпечка кексов (килограмм)':1,
        }

metadict_detail['Маффины вишнёвые (килограмм)'] = {
        'Тесто пшенично-кукурузное для маффинов (грамм)':700 / (1 - 0.15),
        'Вишня отборная (грамм)':300,
        'Масло подсолнечное (грамм)':25,
        'Пряности кондитерские (грамм)':3,
        '_-Выпечка кексов (килограмм)':1,
        }

metadict_detail['Маффины с джемом из ревеня (килограмм)'] = {
        'Тесто пшенично-кукурузное для маффинов (грамм)':700 / (1 - 0.15),
        'Джем из ревеня (грамм)':300,
        'Масло подсолнечное (грамм)':25,
        'Пряности кондитерские (грамм)':3,
        '_-Выпечка кексов (килограмм)':1,
        }

metadict_detail['Маффины с яблочным джемом (килограмм)'] = {
        'Тесто пшенично-кукурузное для маффинов (грамм)':700 / (1 - 0.15),
        'Джем яблочный (грамм)':300,
        'Масло подсолнечное (грамм)':25,
        'Пряности кондитерские (грамм)':3,
        '_-Выпечка кексов (килограмм)':1,
        }

metadict_detail['Маффины с сухофруктами (килограмм)'] = {
        'Тесто пшенично-кукурузное для маффинов (грамм)':900 / (1 - 0.15),
        'Сухофрукты разные (грамм)':100,
        'Масло подсолнечное (грамм)':25,
        'Пряности кондитерские (грамм)':3,
        '_-Выпечка кексов (килограмм)':1,
        }

metadict_detail['Репа печёная (килограмм)'] = {
        # Длительное запекание в печи (ужарка на 50%)
        'Репа чищеная (грамм)':1000 / (1 - 0.50),
        '_-Запекание корнеплодов (килограмм)':1,
        }

metadict_detail['Морковь печёная (килограмм)'] = {
        'Морковь чищеная (грамм)':1000  / (1 - 0.50),
        '_-Запекание корнеплодов (килограмм)':1,
        }

metadict_detail['Брюква печёная (килограмм)'] = {
        'Брюква чищеная (грамм)':1000 / (1 - 0.50),
        '_-Запекание корнеплодов (килограмм)':1,
        }

metadict_detail['Свёкла фаршированная боровиками (килограмм)'] = {
        'Свёкла варёная (грамм)':500 / (1 - 0.10),
        'Боровики тушёные (грамм)':400 / (1 - 0.10),
        'Крем маслено-горчичный (грамм)':100,
        '_-Запекание овощей (килограмм)':1,
        }

metadict_detail['Репа фаршированная горохом (килограмм)'] = {
        'Репа варёная (грамм)':500 / (1 - 0.10),
        'Каша гороховая (грамм)':500 / (1 - 0.10),
        '_-Запекание овощей (килограмм)':1,
        }

metadict_detail['Свёкла печёная (килограмм)'] = {
        'Свёкла чищеная (грамм)':1000 / (1 - 0.50),
        '_-Запекание корнеплодов (килограмм)':1,
        }

metadict_detail['Свёкла печёная с фруктами (килограмм)'] = {
        'Свёкла чищеная (грамм)':500 / (1 - 0.30),
        'Яблоко чищеное (грамм)':250 / (1 - 0.30),
        'Груша чищеная (грамм)':250 / (1 - 0.30),
        'Мята сушёная (грамм)':1,
        'Перец красный сушёный (грамм)':0.5,
        'Лавровый лист сушёный (грамм)':0.6,
        '_-Нарезка овощей (килограмм)':1,
        '_-Запекание овощей (килограмм)':1,
        }

metadict_detail['Перец фаршированный овощами (килограмм)'] = {
        # http://www.100menu.ru/pages/foods/veget/11.perecovochi.htm
        'Перец сладкий чищеный (грамм)':400 / (1 - 0.20),
        'Фарш овощной (грамм)':600,
        '_-Запекание овощей (килограмм)':1,
        }

metadict_detail['Перец печёный (килограмм)'] = {
        # Запекание на противене.
        'Перец сладкий чищеный (грамм)':1000 / (1 - 0.30),
        '_-Нарезка овощей (килограмм)':1,
        '_-Запекание овощей (килограмм)':1,
        }

metadict_detail['Перец обжаренный (килограмм)'] = {
        # Соломка, обжаренная в воке.
        'Перец сладкий чищеный (грамм)':900 / (1 - 0.20),
        'Сахар-песок (грамм)':10,
        'Соль поваренная (грамм)':10,
        'Масло ароматизированное для овощей (грамм)':80,
        '_-Шинковка овощей (килограмм)':1,
        '_-Обжаривание овощей (килограмм)':1,
        }

metadict_detail['Баклажан печёный (килограмм)'] = {
        'Баклажан чищеный (грамм)':1000 / (1 - 0.30),
        '_-Нарезка овощей (килограмм)':1,
        '_-Запекание овощей (килограмм)':1,
        }

metadict_detail['Баклажан обжаренный с овощами (килограмм)'] = {
        # Соломка, обжаривается во фритюре.
        'Баклажан чищеный (грамм)':400 / (1 - 0.20),
        'Перец сладкий чищеный (грамм)':200 / (1 - 0.20),
        'Томаты отборные (грамм)':200 / (1 - 0.30),
        'Лук чищеный (грамм)':100 / (1 - 0.20),
        'Масло оливковое (грамм)':50,
        'Соус соевый (грамм)':50,
        'Сахар-песок (грамм)':25,
        'Чеснок чищеный (грамм)':12,
        '_-Шинковка овощей (килограмм)':1,
        '_-Обжаривание овощей (килограмм)':1,
        }

metadict_detail['Кабачок печёный (килограмм)'] = {
        'Кабачок чищеный (грамм)':1000 / (1 - 0.30),
        '_-Нарезка овощей (килограмм)':1,
        '_-Запекание овощей (килограмм)':1,
        }

metadict_detail['Тыква фаршированная лечо и чечевицей (килограмм)'] = {
        # http://www.100menu.ru/pages/foods/veget/17.tikvafarch.htm
        'Тыква чищеная (грамм)':500 / (1 - 0.20),
        'Лечо со сладким перцем (грамм)':250,
        'Чечевица варёная (грамм)':250,
        '_-Запекание овощей (килограмм)':1,
        }

metadict_detail['Тыква фаршированная картофелем с пряностями (килограмм)'] = {
        'Тыква чищеная (грамм)':500 / (1 - 0.20),
        'Картофель тушёный с горошком и пряностями (грамм)':500,
        '_-Запекание овощей (килограмм)':1,
        }

metadict_detail['Тыква фаршированная гречкой (килограмм)'] = {
        'Тыква чищеная (грамм)':500 / (1 - 0.20),
        'Каша гречневая (грамм)':500,
        '_-Запекание овощей (килограмм)':1,
        }

metadict_detail['Батат печёный (килограмм)'] = {
        'Батат чищеный (грамм)':1000 / (1 - 0.20),
        '_-Нарезка овощей (килограмм)':1,
        '_-Запекание корнеплодов (килограмм)':1,
        }

metadict_detail['Батат печёный дольками (килограмм)'] = {
        'Батат чищеный (грамм)':950 / (1 - 0.30),
        'Масло кунжутное (грамм)':50,
        'Соль поваренная (грамм)':5,
        'Перец красный сушёный (грамм)':3,
        'Пряности нежного карри (грамм)':10,
        '_-Нарезка овощей (килограмм)':1,
        '_-Запекание овощей (килограмм)':1,
        }

metadict_detail['Картофель печёный (килограмм)'] = {
        'Картофель чищеный (грамм)':1000 / (1 - 0.40),
        '_-Запекание корнеплодов (килограмм)':1,
        }

metadict_detail['Картофель печёный дольками (килограмм)'] = {
        # Старый добрый "Айдахо"
            # 1) Обварить дольки молодого картофеля -- 3 минуты
            # 2) Выдержать в смеси масла и специй -- 10 минут
            # 3) Запекать в дровяной печи/духовке -- 30 минут
            # http://interdoka.ru/kulinaria/1982/12_bluda_garniri/1_goriachie/2_kartofel/2_4.html
        'Картофель чищеный (грамм)':950 / (1 - 0.40),
        'Масло подсолнечное (грамм)':50,
        'Соль поваренная (грамм)':5,
        'Пряности нежного карри (грамм)':10,
        'Пряности для овощей из трёх растений (грамм)':10,
        '_-Нарезка овощей (килограмм)':1,
        '_-Обваривание овощей (килограмм)':1,
        '_-Запекание овощей (килограмм)':1,
        }

metadict_detail['Картофель жареный соломкой (килограмм)'] = {
        'Картофель чищеный (грамм)':800 / (1 - 0.50),
        'Лук зелёный отборный (грамм)':50,
        'Соус соевый (грамм)':30,
        'Уксус виноградный 6% (грамм)':10,
        'Масло ароматизированное для картофеля (грамм)':100,
        '_-Шинковка овощей (килограмм)':1,
        '_-Бланширование овощей (килограмм)':1,
        '_-Жарение овощей в масле (килограмм)':1,
        }

metadict_detail['Рагу овощное (килограмм)'] = {
        # Старый-добрый рататуй.
        'Перец сладкий чищеный (грамм)':200 / (1 - 0.20),
        'Баклажан чищеный (грамм)':200 / (1 - 0.20),
        'Кабачок чищеный (грамм)':200 / (1 - 0.20),
        'Томаты отборные (грамм)':200 / (1 - 0.30),
        'Лук чищеный (грамм)':100 / (1 - 0.20),
        'Зелень петрушки отборная (грамм)':30,
        'Масло подсолнечное (грамм)':50,
        'Уксус яблочный 3% (грамм)':30,
        'Чеснок чищеный (грамм)':12,
        'Сахар-песок (грамм)':25,
        'Пряности прованские (грамм)':10,
        'Перец чёрный молотый (грамм)':3,
        'Перец красный сушёный (грамм)':3,
        'Лавровый лист сушёный (грамм)':1.2,
        '_-Шинковка овощей (килограмм)':1,
        '_-Тушение овощей (килограмм)':1,
        }

metadict_detail['Лечо со сладким перцем (килограмм)'] = {
        'Перец сладкий чищеный (грамм)':500 / (1 - 0.20),
        'Томаты отборные (грамм)':200 / (1 - 0.20),
        'Лук чищеный (грамм)':200 / (1 - 0.10),
        'Масло подсолнечное (грамм)':50,
        'Соль поваренная (грамм)':5,
        'Чеснок чищеный (грамм)':12,
        'Уксус яблочный 3% (грамм)':30,
        'Зелень петрушки отборная (грамм)':30,
        'Перец чёрный молотый (грамм)':3,
        'Перец красный сушёный (грамм)':3,
        'Лавровый лист сушёный (грамм)':1.2,
        '_-Шинковка овощей (килограмм)':1,
        '_-Тушение овощей (килограмм)':1,
        }

metadict_detail['Картофель тушёный с морковью (килограмм)'] = {
        'Картофель чищеный (грамм)':600 / (1 - 0.10),
        'Морковь чищеная (грамм)':200 / (1 - 0.10),
        'Лук чищеный (грамм)':200 / (1 - 0.10),
        'Масло подсолнечное (грамм)':25,
        'Пряности для овощей из пяти растений (грамм)':10,
        'Вода для готовки (грамм)':200,
        '_-Нарезка овощей (килограмм)':1,
        '_-Тушение овощей (килограмм)':1,
        }

metadict_detail['Картофель тушёный с яблоками (килограмм)'] = {
        'Картофель чищеный (грамм)':600 / (1 - 0.10),
        'Яблоко чищеное (грамм)':200 / (1 - 0.10),
        'Лук чищеный (грамм)':200 / (1 - 0.10),
        'Масло подсолнечное (грамм)':25,
        'Пряности для овощей из пяти растений (грамм)':10,
        'Вода для готовки (грамм)':200,
        '_-Нарезка овощей (килограмм)':1,
        '_-Тушение овощей (килограмм)':1,
        }

metadict_detail['Картофель тушёный со спаржей (килограмм)'] = {
        'Картофель чищеный (грамм)':600 / (1 - 0.10),
        'Спаржа чищеная (грамм)':200 / (1 - 0.10),
        'Лук чищеный (грамм)':200 / (1 - 0.10),
        'Масло подсолнечное (грамм)':25,
        'Пряности для овощей из пяти растений (грамм)':10,
        'Вода для готовки (грамм)':200,
        '_-Нарезка овощей (килограмм)':1,
        '_-Тушение овощей (килограмм)':1,
        }

metadict_detail['Картофель тушёный с горошком и пряностями (килограмм)'] = {
        # Индийский алу матар
        'Картофель чищеный (грамм)':600 / (1 - 0.10),
        'Томаты отборные (грамм)':100 / (1 - 0.10),
        'Горошек зелёный (грамм)':100 / (1 - 0.10),
        'Соль поваренная (грамм)':5,
        'Зелень кориандра сушёная (грамм)':5,
        'Масло ароматизированное для картофеля (грамм)':50,
        'Вода для готовки (грамм)':200,
        '_-Нарезка овощей (килограмм)':1,
        '_-Тушение овощей (килограмм)':1,
        }

metadict_detail['Картофель тушёный с оливками и лимоном (килограмм)'] = {
        'Картофель чищеный (грамм)':650 / (1 - 0.10),
        'Морковь обжаренная (грамм)':150,
        'Лук обжаренный (грамм)':100,
        'Оливки солёные (грамм)':100,
        'Сок лимонный (грамм)':100,
        'Пряности нежного карри (грамм)':10,
        'Вода для готовки (грамм)':200,
        '_-Нарезка овощей (килограмм)':1,
        '_-Тушение овощей (килограмм)':1,
        }

metadict_detail['Картофель тушёный в соевом соусе (килограмм)'] = {
        'Картофель чищеный (грамм)':800 / (1 - 0.10),
        'Морковь обжаренная (грамм)':100,
        'Лук обжаренный (грамм)':50,
        'Чеснок чищеный (грамм)':10,
        'Сахар-песок (грамм)':25,
        'Крахмал картофельный (грамм)':20,
        'Семена кунжута (грамм)':5,
        'Вода для готовки (грамм)':200,
        '_-Нарезка овощей (килограмм)':1,
        '_-Тушение овощей (килограмм)':1,
        }

metadict_detail['Боровики тушёные (килограмм)'] = {
        # http://www.rus-food-recipes.ru/P_1/98.htm
        'Боровики чищеные (грамм)':800 / (1 - 0.20),
        'Лук обжаренный (грамм)':100,
        'Мука пшеничная (грамм)':50,
        'Масло подсолнечное (грамм)':50,
        'Соль поваренная (грамм)':5,
        'Зелень укропа сушёная (грамм)':5,
        'Зелень петрушки сушёная (грамм)':5,
        'Перец чёрный сушёный (грамм)':1,
        'Аквафаба чечевичная (грамм)':100,
        '_-Шинковка овощей (килограмм)':1,
        '_-Тушение грибов (килограмм)':1,
        }

metadict_detail['Шампиньоны тушёные (килограмм)'] = {
        # Исправить
            # Неплохо, но скучно, можно сделать лучше.
        'Шампиньоны отборные (грамм)':700 / (1 - 0.20),
        'Лук обжаренный (грамм)':100,
        'Масло подсолнечное (грамм)':50,
        'Мука пшеничная (грамм)':50,
        'Соль поваренная (грамм)':5,
        'Зелень укропа сушёная (грамм)':5,
        'Зелень петрушки сушёная (грамм)':5,
        'Перец чёрный сушёный (грамм)':1,
        'Аквафаба чечевичная (грамм)':100,
        '_-Шинковка овощей (килограмм)':1,
        '_-Тушение грибов (килограмм)':1,
        }

metadict_detail['Сморчки тушёные (килограмм)'] = {
        'Сморчки чищеные (грамм)':700 / (1 - 0.20),
        'Лук обжаренный (грамм)':100,
        'Масло подсолнечное (грамм)':50,
        'Мука пшеничная (грамм)':50,
        'Соль поваренная (грамм)':5,
        'Зелень укропа сушёная (грамм)':5,
        'Зелень петрушки сушёная (грамм)':5,
        'Перец чёрный сушёный (грамм)':1,
        'Аквафаба чечевичная (грамм)':100,
        '_-Шинковка овощей (килограмм)':1,
        '_-Тушение грибов (килограмм)':1,
        }

metadict_detail['Вёшенки тушёные (килограмм)'] = {
        'Вёшенки отборные (грамм)':800 / (1 - 0.30),
        'Лук обжаренный (грамм)':100,
        'Масло подсолнечное (грамм)':50,
        'Соус соевый (грамм)':50,
        'Перец красный сушёный (грамм)':2,
        'Вода для готовки (грамм)':200,
        '_-Шинковка овощей (килограмм)':1,
        '_-Тушение грибов (килограмм)':1,
        }

metadict_detail['Яблоко печёное с мёдом (килограмм)'] = {
        'Яблоко чищеное (грамм)':800 / (1 - 0.30),
        'Мёд жидкий (грамм)':200,
        '_-Запекание фруктов (килограмм)':1,
        }

metadict_detail['Сморчки жареные (килограмм)'] = {
        # https://honest-food.net/fried-morels-recipe/
        'Сморчки варёные (грамм)':850 / (1 - 0.30),
        'Мука пшеничная (грамм)':100,
        'Масло подсолнечное (грамм)':50,
        'Перец чёрный молотый (грамм)':5,
        '_-Шинковка овощей (килограмм)':1,
        '_-Жарение грибов (килограмм)':1,
        }

metadict_detail['Вёшенки жареные (килограмм)'] = {
        'Вёшенки отборные (грамм)':850 / (1 - 0.30),
        'Лук обжаренный (грамм)':100,
        'Масло подсолнечное (грамм)':50,
        '_-Шинковка овощей (килограмм)':1,
        '_-Жарение грибов (килограмм)':1,
        }

metadict_detail['Шампиньоны жареные (килограмм)'] = {
        'Шампиньоны отборные (грамм)':850 / (1 - 0.30),
        'Лук обжаренный (грамм)':100,
        'Масло подсолнечное (грамм)':50,
        '_-Шинковка овощей (килограмм)':1,
        '_-Жарение грибов (килограмм)':1,
        }

metadict_detail['Боровики жареные (килограмм)'] = {
        'Боровики варёные (грамм)':850 / (1 - 0.30),
        'Лук обжаренный (грамм)':100,
        'Масло подсолнечное (грамм)':50,
        '_-Шинковка овощей (килограмм)':1,
        '_-Жарение грибов (килограмм)':1,
        }

metadict_detail['Вёшенки варёные (килограмм)'] = {
        'Вёшенки отборные (грамм)':1000 / (1 - 0.10),
        'Соль поваренная (грамм)':10,
        'Вода для готовки (грамм)':1000,
        '_-Варка грибов (килограмм)':1,
        }

metadict_detail['Шампиньоны варёные (килограмм)'] = {
        'Шампиньоны отборные (грамм)':1000 / (1 - 0.10),
        'Соль поваренная (грамм)':10,
        'Вода для готовки (грамм)':1000,
        '_-Варка грибов (килограмм)':1,
        }

metadict_detail['Сморчки варёные (килограмм)'] = {
        'Сморчки чищеные (грамм)':1000 / (1 - 0.10),
        'Соль поваренная (грамм)':10,
        '_-Варка грибов (килограмм)':1,
        }

metadict_detail['Боровики варёные (килограмм)'] = {
        'Боровики чищеные (грамм)':1000 / (1 - 0.10),
        'Соль поваренная (грамм)':10,
        'Вода для готовки (грамм)':1000,
        '_-Варка грибов (килограмм)':1,
        }

metadict_detail['Брокколи обжаренные (килограмм)'] = {
        # http://www.100menu.ru/pages/foods/veget/14.brussuxari.htm
        'Брокколи варёные (грамм)':850 / (1 - 0.15),
        'Мука пшеничная (грамм)':100,
        'Масло подсолнечное (грамм)':50,
        'Соль поваренная (грамм)':5,
        'Тимьян сушёный (грамм)':3,
        'Душица сушёная (грамм)':3,
        '_-Бланширование овощей (килограмм)':1,
        '_-Обжаривание овощей (килограмм)':1,
        }

metadict_detail['Артишоки обжаренные (килограмм)'] = {
        'Артишоки чищеные (грамм)':850 / (1 - 0.20),
        'Мука пшеничная (грамм)':100,
        'Масло оливковое (грамм)':50,
        'Сок лимонный (грамм)':50,
        'Соль поваренная (грамм)':5,
        'Тимьян сушёный (грамм)':3,
        'Душица сушёная (грамм)':3,
        'Вода для готовки (грамм)':1000,
        '_-Бланширование овощей (килограмм)':1,
        '_-Обжаривание овощей (килограмм)':1,
        }

metadict_detail['Морская капуста обжаренная (килограмм)'] = {
        # Подсушивают, шинкуют, обжаривают в воке, посыпают корицей и сахаром, подают холодной.
        'Морская капуста отборная (грамм)':900 / (1 - 0.50),
        'Масло оливковое (грамм)':70,
        'Сахар-песок (грамм)':20,
        'Соль поваренная (грамм)':5,
        'Корица молотая (грамм)':3,
        '_-Шинковка овощей (килограмм)':1,
        '_-Обжаривание овощей (килограмм)':1,
        }

metadict_detail['Одуванчики обжаренные (килограмм)'] = {
        # Fried Dandelion Flowers
            # Жарят именно цветы одуванчика, срезая всю горькую зелень.
            # http://www.thedailyspud.com/2010/05/14/dandelions-just-eat-em/
        'Одуванчик чищеный (грамм)':850 / (1 - 0.20),
        'Мука пшеничная (грамм)':100,
        'Масло подсолнечное (грамм)':50,
        'Соль поваренная (грамм)':5,
        'Тимьян сушёный (грамм)':3,
        'Душица сушёная (грамм)':3,
        '_-Бланширование овощей (килограмм)':1,
        '_-Обжаривание овощей (килограмм)':1,
        }

metadict_detail['Запеканка картофельная со свёклой (килограмм)'] = {
        # Исправить
            # Фигня же получается. Запеканка должна форму держать!
        'Картофель варёный (грамм)':600 / (1 - 0.15),
        'Свёкла печёная (грамм)':400,
        'Семена тмина (грамм)':3,
        'Пряности для овощей из восьми растений (грамм)':10,
        '_-Пюрирование овощей (килограмм)':1,
        '_-Запекание овощей (килограмм)':1,
        }

metadict_detail['Запеканка картофельная с боровиками (килограмм)'] = {
        'Картофель варёный (грамм)':600 / (1 - 0.15),
        'Боровики тушёные (грамм)':400,
        'Семена тмина (грамм)':3,
        'Пряности для овощей из восьми растений (грамм)':10,
        '_-Пюрирование овощей (килограмм)':1,
        '_-Запекание овощей (килограмм)':1,
        }

metadict_detail['Зразы картофельные с боровиками (килограмм)'] = {
        'Картофель варёный (грамм)':500 / (1 - 0.20),
        'Боровики тушёные (грамм)':300,
        'Мука пшеничная (грамм)':50,
        'Сухари ржаные (грамм)':50,
        'Масло льняное (грамм)':50,
        'Аквафаба чечевичная (грамм)':50,
        '_-Пюрирование овощей (килограмм)':1,
        '_-Запекание овощей (килограмм)':1,
        }

metadict_detail['Зразы картофельные со сморчками (килограмм)'] = {
        'Картофель варёный (грамм)':500 / (1 - 0.20),
        'Сморчки тушёные (грамм)':300,
        'Мука пшеничная (грамм)':50,
        'Сухари ржаные (грамм)':50,
        'Масло льняное (грамм)':50,
        'Аквафаба чечевичная (грамм)':50,
        '_-Пюрирование овощей (килограмм)':1,
        '_-Запекание овощей (килограмм)':1,
        }

metadict_detail['Пюре картофельное (килограмм)'] = {
        'Картофель варёный (грамм)':800,
        'Масло подсолнечное (грамм)':50,
        'Лук обжаренный (грамм)':50,
        'Соль поваренная (грамм)':5,
        'Вода кипячёная (грамм)':100,
        'Пряности для овощей из пяти растений (грамм)':10,
        '_-Пюрирование овощей (килограмм)':1,
        }

metadict_detail['Пюре морковное (килограмм)'] = {
        'Морковь варёная (грамм)':950,
        'Масло подсолнечное (грамм)':30,
        'Сахар-песок (грамм)':15,
        'Соль поваренная (грамм)':5,
        'Пряности нежного карри (грамм)':10,
        '_-Пюрирование овощей (килограмм)':1,
        }

metadict_detail['Пюре бататное (килограмм)'] = {
        'Батат варёный (грамм)':950,
        'Масло кунжутное (грамм)':30,
        'Сахар-песок (грамм)':15,
        'Соль поваренная (грамм)':5,
        'Пряности нежного карри (грамм)':10,
        '_-Пюрирование овощей (килограмм)':1,
        }

metadict_detail['Пюре тыквенное (килограмм)'] = {
        'Тыква варёная (грамм)':950,
        'Масло подсолнечное (грамм)':30,
        'Сахар-песок (грамм)':15,
        'Соль поваренная (грамм)':5,
        'Пряности нежного карри (грамм)':10,
        '_-Пюрирование овощей (килограмм)':1,
        }

metadict_detail['Пюре брюквенное (килограмм)'] = {
        'Брюква печёная (грамм)':750,
        'Морковь печёная (грамм)':100,
        'Масло подсолнечное (грамм)':50,
        'Соль поваренная (грамм)':5,
        'Вода кипячёная (грамм)':100,
        'Пряности для овощей из пяти растений (грамм)':10,
        '_-Пюрирование овощей (килограмм)':1,
        }

metadict_detail['Пюре гороховое с пряностями (килограмм)'] = {
        'Горох варёный (грамм)':800,
        'Морковь обжаренная (грамм)':100,
        'Лук обжаренный (грамм)':100,
        'Соль поваренная (грамм)':5,
        'Пряности для бобовых v2 (грамм)':15,
        '_-Пюрирование овощей (килограмм)':1,
        }

metadict_detail['Суфле брюквенно-морковное (килограмм)'] = {
        'Брюква печёная (грамм)':600 / (1 - 0.05),
        'Морковь печёная (грамм)':300 / (1 - 0.05),
        'Соль поваренная (грамм)':5,
        'Масло льняное (грамм)':50,
        'Аквафаба чечевичная (грамм)':200,
        'Пряности для овощей из пяти растений (грамм)':10,
        '_-Пюрирование овощей (килограмм)':1,
        '_-Запекание овощей (килограмм)':1,
        }

metadict_detail['Суфле картофельно-тыквенное (килограмм)'] = {
        'Картофель печёный (грамм)':500 / (1 - 0.10),
        'Тыква печёная (грамм)':300 / (1 - 0.10),
        'Морковь печёная (грамм)':100,
        'Соль поваренная (грамм)':5,
        'Масло льняное (грамм)':50,
        'Аквафаба чечевичная (грамм)':200,
        'Пряности для овощей из пяти растений (грамм)':10,
        '_-Пюрирование овощей (килограмм)':1,
        '_-Запекание овощей (килограмм)':1,
        }

metadict_detail['Суфле картофельно-морковное (килограмм)'] = {
        'Картофель печёный (грамм)':500 / (1 - 0.10),
        'Морковь печёная (грамм)':350 / (1 - 0.10),
        'Соль поваренная (грамм)':5,
        'Масло льняное (грамм)':50,
        'Аквафаба чечевичная (грамм)':200,
        'Пряности для овощей из пяти растений (грамм)':10,
        '_-Пюрирование овощей (килограмм)':1,
        '_-Запекание овощей (килограмм)':1,
        }

metadict_detail['Суфле картофельно-гороховое (килограмм)'] = {
        'Картофель печёный (грамм)':500 / (1 - 0.10),
        'Горох варёный (грамм)':300 / (1 - 0.20),
        'Лук обжаренный (грамм)':50,
        'Соль поваренная (грамм)':5,
        'Масло льняное (грамм)':50,
        'Аквафаба чечевичная (грамм)':200,
        'Пряности для бобовых v2 (грамм)':10,
        '_-Пюрирование овощей (килограмм)':1,
        '_-Запекание овощей (килограмм)':1,
        }

metadict_detail['Суфле картофельное (килограмм)'] = {
        'Картофель варёный (грамм)':800 / (1 - 0.10),
        'Лук обжаренный (грамм)':100,
        'Соль поваренная (грамм)':5,
        'Масло льняное (грамм)':50,
        'Аквафаба чечевичная (грамм)':200,
        'Пряности для овощей из пяти растений (грамм)':10,
        '_-Пюрирование овощей (килограмм)':1,
        '_-Запекание овощей (килограмм)':1,
        }

metadict_detail['Суфле гороховое (килограмм)'] = {
        # Исправить
            # А вот это блюдо должно быть простым пюре, или супом-пюре.
        'Горох варёный (грамм)':800 / (1 - 0.20),
        'Лук обжаренный (грамм)':100,
        'Соль поваренная (грамм)':5,
        'Масло льняное (грамм)':50,
        'Аквафаба чечевичная (грамм)':200,
        'Пряности для бобовых v2 (грамм)':10,
        '_-Пюрирование овощей (килограмм)':1,
        '_-Запекание овощей (килограмм)':1,
        }

metadict_detail['Картофель варёный (килограмм)'] = {
        # Продолжительность тепловой обработки овощей и нормы потерь
        # http://www.food24news.ru/warenkunde/234438.html
        'Картофель чищеный (грамм)':1000 / (1 - 0.06),
        'Вода для готовки (грамм)':1000,
        '_-Варка корнеплодов (килограмм)':1,
        }

metadict_detail['Кукуруза варёная (килограмм)'] = {
        'Кукуруза чищеная (грамм)':1000 / (1 - 0.10),
        'Вода для готовки (грамм)':1000,
        '_-Варка корнеплодов (килограмм)':1,
        }

metadict_detail['Кукуруза печёная с соевым соусом (килограмм)'] = {
        'Кукуруза чищеная (грамм)':900 / (1 - 0.20),
        'Чеснок чищеный (грамм)':20,
        'Соус соевый (грамм)':50,
        'Масло оливковое (грамм)':25,
        'Пряности гарам масала (грамм)':10,
        '_-Запекание овощей (килограмм)':1,
        }

metadict_detail['Одуванчик варёный (килограмм)'] = {
        # Зелень одуванчика отваривают в 5% солевом растворе.
        'Одуванчик чищеный (грамм)':1000 / (1 - 0.10),
        'Соль поваренная (грамм)':50,
        'Вода для готовки (грамм)':1000,
        '_-Варка овощей (килограмм)':1,
        }

metadict_detail['Батат варёный (килограмм)'] = {
        'Батат чищеный (грамм)':1000 / (1 - 0.10),
        'Вода для готовки (грамм)':1000,
        '_-Варка корнеплодов (килограмм)':1,
        }

metadict_detail['Морковь варёная (килограмм)'] = {
        'Морковь чищеная (грамм)':1000  / (1 - 0.05),
        'Вода для готовки (грамм)':1000,
        '_-Варка корнеплодов (килограмм)':1,
        }

metadict_detail['Репа варёная (килограмм)'] = {
        # Исправить
            # Зачем варить в большой воде, если лучше на пару?
        'Репа чищеная (грамм)':1000 / (1 - 0.05),
        'Вода для готовки (грамм)':1000,
        '_-Варка корнеплодов (килограмм)':1,
        }

metadict_detail['Корень сельдерея варёный (килограмм)'] = {
        'Корень сельдерея (грамм)':1000 / (1 - 0.05),
        'Вода для готовки (грамм)':1000,
        '_-Варка корнеплодов (килограмм)':1,
        }

metadict_detail['Корень сельдерея жареный (килограмм)'] = {
        'Корень сельдерея (грамм)':900 / (1 - 0.50),
        'Масло подсолнечное (грамм)':100,
        'Соль поваренная (грамм)':5,
        'Пряности нежного карри (грамм)':10,
        '_-Шинковка овощей (килограмм)':1,
        '_-Жарение овощей в масле (килограмм)':1,
        }

metadict_detail['Свёкла варёная (килограмм)'] = {
        'Свёкла чищеная (грамм)':1000  / (1 - 0.05),
        'Вода для готовки (грамм)':1000,
        '_-Варка корнеплодов (килограмм)':1,
        }

metadict_detail['Лук варёный (килограмм)'] = {
        'Лук чищеный (грамм)':1000 / (1 - 0.05),
        'Вода для готовки (грамм)':1000,
        '_-Варка корнеплодов (килограмм)':1,
        }

metadict_detail['Спаржа варёная (килограмм)'] = {
        'Спаржа чищеная (грамм)':1000 / (1 - 0.10),
        'Вода для готовки (грамм)':1000,
        '_-Нарезка овощей (килограмм)':1,
        '_-Варка овощей (килограмм)':1,
        }

metadict_detail['Брокколи варёные (килограмм)'] = {
        'Брокколи чищеные (грамм)':1000 / (1 - 0.10),
        'Вода для готовки (грамм)':1000,
        '_-Нарезка овощей (килограмм)':1,
        '_-Варка овощей (килограмм)':1,
        }

metadict_detail['Артишоки варёные (килограмм)'] = {
        'Артишоки чищеные (грамм)':1000 / (1 - 0.10),
        'Вода для готовки (грамм)':1000,
        '_-Варка овощей (килограмм)':1,
        }

metadict_detail['Тыква печёная (килограмм)'] = {
        'Тыква чищеная (грамм)':1000 / (1 - 0.20),
        '_-Запекание овощей (килограмм)':1,
        }

metadict_detail['Тыква варёная (килограмм)'] = {
        'Тыква чищеная (грамм)':1000 / (1 - 0.10),
        'Вода для готовки (грамм)':1000,
        '_-Нарезка овощей (килограмм)':1,
        '_-Варка овощей (килограмм)':1,
        }

metadict_detail['Тыква тушёная (килограмм)'] = {
        'Тыква чищеная (грамм)':1000 / (1 - 0.20),
        'Пряности для тыквы (грамм)':5,
        'Вода для готовки (грамм)':300,
        '_-Нарезка овощей (килограмм)':1,
        '_-Тушение овощей (килограмм)':1,
        }

metadict_detail['Капуста квашено-тушёная (килограмм)'] = {
        # Исправить
            # Прежде чем тушить кислую капусту вымачивают.
            # http://www.molohovetc.ru/otdel_xxviii/2450_tushonaja_kislaja_kapusta/
        'Капуста квашеная (грамм)':850 / (1 - 0.15),
        'Лук чищеный (грамм)':100 / (1 - 0.15),
        'Масло подсолнечное (грамм)':50,
        'Зелень укропа сушёная (грамм)':5,
        'Вода для готовки (грамм)':300,
        '_-Тушение овощей (килограмм)':1,
        }

metadict_detail['Капуста обжаренная в сухарях (килограмм)'] = {
        # 1) Листы капусты 3 минуты варятся в подсолёной воде с пряностями.
        # 3) Затем сворачиваются конвертами, панируются в сухарях.
        # 4) Обжариваются в перекалёном масле.
        'Капуста чищеная (грамм)':850 / (1 - 0.25),
        'Соль поваренная (грамм)':5,
        'Сухари пшеничные (грамм)':50,
        'Масло подсолнечное (грамм)':50,
        'Аквафаба чечевичная (грамм)':50,
        'Вода для готовки (грамм)':1000,
        'Пряности для овощей из восьми растений (грамм)':10,
        '_-Нарезка овощей (килограмм)':1,
        '_-Бланширование овощей (килограмм)':1,
        '_-Обжаривание овощей (килограмм)':1,
        }

metadict_detail['Голубцы фаршированные овощами (килограмм)'] = {
        'Капуста чищеная (грамм)':300 / (1 - 0.10),
        'Фарш овощной (грамм)':700,
        'Вода для готовки (грамм)':300,
        '_-Нарезка овощей (килограмм)':1,
        '_-Бланширование овощей (килограмм)':0.3,
        '_-Тушение овощей (килограмм)':1,
        }

metadict_detail['Капуста тушёная (килограмм)'] = {
        # http://interdoka.ru/kulinaria/1982/12_bluda_garniri/1_goriachie/2_kartofel/2_17.html
        # http://interdoka.ru/kulinaria/1982/3_bluda_katof_ovosh_gribi/2_tushoniy/6.html
        'Капуста чищеная (грамм)':750 / (1 - 0.25),
        'Морковь обжаренная (грамм)':20,
        'Лук обжаренный (грамм)':40,
        'Масло подсолнечное (грамм)':35,
        'Сахар-песок (грамм)':25,
        'Соль поваренная (грамм)':5,
        'Мука пшеничная (грамм)':12,
        'Томаты сушёные (грамм)':10,
        'Уксус яблочный 3% (грамм)':30,
        'Корень петрушки чищеный (грамм)':20,
        'Пряности для овощей из восьми растений (грамм)':10,
        'Вода для готовки (грамм)':300,
        '_-Нарезка овощей (килограмм)':1,
        '_-Тушение овощей (килограмм)':1,
        }

metadict_detail['Капуста варёная с пряностями (килограмм)'] = {
        # Китайская кухня. Овощи шинкуют, бланшируют и заправляют ароматизированным маслом.
        'Капуста чищеная (грамм)':660 / (1 - 0.10),
        'Морковь чищеная (грамм)':200 / (1 - 0.10),
        'Сахар-песок (грамм)':40,
        'Соль поваренная (грамм)':5,
        'Уксус виноградный 6% (грамм)':20,
        'Масло ароматизированное для овощей (грамм)':75,
        '_-Шинковка овощей (килограмм)':1,
        '_-Бланширование овощей (килограмм)':1,
        }

metadict_detail['Артишоки тушёные с сельдереем (килограмм)'] = {
        # Салат Рашель (весьма странный, кстати говоря)
        'Артишоки чищеные (грамм)':250 / (1 - 0.20),
        'Корень сельдерея (грамм)':250 / (1 - 0.20),
        'Картофель чищеный (грамм)':250 / (1 - 0.20),
        'Крем маслено-горчичный (грамм)':100,
        'Спаржа чищеная (грамм)':150,
        'Соль поваренная (грамм)':3,
        '_-Шинковка овощей (килограмм)':1,
        '_-Тушение овощей (килограмм)':1,
        }

metadict_detail['Морковь тушёная (килограмм)'] = {
        'Морковь чищеная (грамм)':950 / (1 - 0.25),
        'Мука пшеничная (грамм)':20,
        'Масло подсолнечное (грамм)':35,
        'Семена тмина (грамм)':5,
        'Сахар-песок (грамм)':25,
        'Базилик сушёный (грамм)':3,
        'Соль поваренная (грамм)':5,
        'Корень петрушки чищеный (грамм)':50,
        'Вода для готовки (грамм)':300,
        '_-Нарезка овощей (килограмм)':1,
        '_-Тушение овощей (килограмм)':1,
        }

metadict_detail['Морковь в медовой глазури (килограмм)'] = {
        'Морковь печёная (грамм)':850 / (1 - 0.05),
        'Мёд жидкий (грамм)':100,
        'Масло подсолнечное (грамм)':50,
        'Розмарин сушёный (грамм)':3,
        'Орех мускатный (грамм)':0.3,
        'Корица молотая (грамм)':1,
        'Перец чёрный молотый (грамм)':1,
        '_-Нарезка овощей (килограмм)':1,
        '_-Жарение овощей (килограмм)':1,
        }

metadict_detail['Щи из квашеной капусты с грибами (килограмм)'] = {
        # На грибном бульоне и с ароматизированным маслом.
        # http://www.rus-food-recipes.ru/P_1/22.htm
        # http://www.rus-food-recipes.ru/P_1/25.htm
        'Капуста квашеная (грамм)':360,
        'Картофель чищеный (грамм)':50,
        'Морковь чищеная (грамм)':50,
        'Лук чищеный (грамм)':100,
        'Репа чищеная (грамм)':50,
        'Боровики сушёные (грамм)':50,
        'Пряности для щей (грамм)':50,
        'Масло ароматизированное для щей (грамм)':20,
        'Крупа гречневая отборная (грамм)':20,
        'Вода для готовки (грамм)':1000,
        '_-Варка щей (килограмм)':1,
        }

metadict_detail['Щи из квашеной капусты (килограмм)'] = {
        # http://interdoka.ru/kulinaria/1982/2_supi/2_zapravochnie/3_shi/1.html
        'Капуста квашеная (грамм)':360,
        'Картофель чищеный (грамм)':50,
        'Морковь чищеная (грамм)':50,
        'Лук чищеный (грамм)':100,
        'Репа чищеная (грамм)':50,
        'Масло льняное (грамм)':20,
        'Пряности для щей (грамм)':50,
        'Крупа гречневая отборная (грамм)':20,
        'Вода для готовки (грамм)':1000,
        '_-Варка щей (килограмм)':1,
        }

metadict_detail['Суп-пюре из корня сельдерея (килограмм)'] = {
        # С консервированными томатами, поэтому без соли.
        'Корень сельдерея шинкованный (грамм)':350,
        'Томаты солёные (грамм)':200,
        'Лук обжаренный (грамм)':100,
        'Морковь чищеная (грамм)':100,
        'Масло подсолнечное (грамм)':20,
        'Пряности нежного карри (грамм)':10,
        'Вода для готовки (грамм)':500,
        '_-Пюрирование овощей (килограмм)':1,
        '_-Варка похлёбки (килограмм)':1,
        }

metadict_detail['Суп-пюре из батата со сладким перцем (килограмм)'] = {
        'Батат печёный (грамм)':400,
        'Перец сладкий чищеный (грамм)':200,
        'Лук обжаренный (грамм)':100,
        'Масло кунжутное (грамм)':20,
        'Пряности нежного карри (грамм)':10,
        'Вода для готовки (грамм)':500,
        '_-Пюрирование овощей (килограмм)':1,
        '_-Варка похлёбки (килограмм)':1,
        }

metadict_detail['Суп-пюре морковный (килограмм)'] = {
        'Морковь печёная (грамм)':600,
        'Лук обжаренный (грамм)':80,
        'Соль поваренная (грамм)':4,
        'Корень имбиря (грамм)':2,
        'Аквафаба чечевичная (грамм)':100,
        'Пряности нежного карри (грамм)':10,
        'Вода для готовки (грамм)':400,
        '_-Пюрирование овощей (килограмм)':1,
        '_-Варка похлёбки (килограмм)':1,
        }

metadict_detail['Суп-пюре морковный с пряностями (килограмм)'] = {
        'Морковь чищеная (грамм)':600,
        'Перец сладкий чищеный (грамм)':200,
        'Лук обжаренный (грамм)':80,
        'Соль поваренная (грамм)':5,
        'Зелень кориандра отборная (грамм)':60,
        'Масло ароматизированное для картофеля (грамм)':50,
        'Вода для готовки (грамм)':300,
        '_-Пюрирование овощей (килограмм)':1,
        '_-Варка похлёбки (килограмм)':1,
        }

metadict_detail['Суп-пюре свекольный (килограмм)'] = {
        'Свёкла печёная (грамм)':600,
        'Лук обжаренный (грамм)':80,
        'Соль поваренная (грамм)':6,
        'Корень имбиря (грамм)':1,
        'Перец чёрный молотый (грамм)':1,
        'Вода для готовки (грамм)':500,
        'Пряности букета гарни с розмарином (грамм)':20,
        '_-Пюрирование овощей (килограмм)':1,
        '_-Варка похлёбки (килограмм)':1,
        }

metadict_detail['Суп-пюре томатный (килограмм)'] = {
        'Томаты отборные (грамм)':800 / (1 - 0.15),
        'Лук обжаренный (грамм)':100,
        'Морковь обжаренная (грамм)':50,
        'Масло подсолнечное (грамм)':20,
        'Чеснок чищеный (грамм)':10,
        'Соль поваренная (грамм)':5,
        'Перец красный сушёный (грамм)':3,
        'Пряности букета гарни с петрушкой (грамм)':20,
        '_-Пюрирование овощей (килограмм)':1,
        '_-Варка похлёбки (килограмм)':1,
        }

metadict_detail['Суп-лапша с бататом и солёными томатами (килограмм)'] = {
        # Исправить
            # По памяти, проверь, уточни.
            # Слишком густо получается.
        'Лапша сушёная (грамм)':200,
        'Батат чищеный (грамм)':200,
        'Томаты солёные (грамм)':100,
        'Морковь обжаренная (грамм)':50,
        'Перец красный сушёный (грамм)':2,
        'Пряности нежного карри (грамм)':10,
        'Вода для готовки (грамм)':500,
        '_-Варка похлёбки (килограмм)':1,
        }

metadict_detail['Суп-лапша с кабачком и свежими томатами (килограмм)'] = {
        'Лапша сушёная (грамм)':200,
        'Кабачок печёный (грамм)':200,
        'Томаты отборные (грамм)':200,
        'Морковь обжаренная (грамм)':50,
        'Перец красный сушёный (грамм)':2,
        'Пряности нежного карри (грамм)':10,
        'Вода для готовки (грамм)':500,
        '_-Варка похлёбки (килограмм)':1,
        }

metadict_detail['Шарики фасолевые в панировке (килограмм)'] = {
        # Исправить
            # Всё фасоль да фасоль, а фалафель-то делают из нута.
        'Фасоль варёная (грамм)':800,
        'Лук обжаренный (грамм)':50,
        'Чеснок чищеный (грамм)':12,
        'Мука пшеничная (грамм)':20,
        'Масло оливковое (грамм)':25,
        'Соль поваренная (грамм)':5,
        'Семена зиры (грамм)':6,
        'Зелень петрушки сушёная (грамм)':5,
        'Зелень кориандра сушёная (грамм)':5,
        'Перец красный сушёный (грамм)':3,
        'Перец чёрный молотый (грамм)':2,
        'Семена кардамона (грамм)':1,
        'Пряности нежного карри (грамм)':10,
        '_-Пюрирование овощей (килограмм)':1,
        '_-Обжаривание овощей (килограмм)':1,
        }

metadict_detail['Шарики чечевичные в панировке (килограмм)'] = {
        'Чечевица варёная (грамм)':800,
        'Лук обжаренный (грамм)':50,
        'Чеснок чищеный (грамм)':12,
        'Мука пшеничная (грамм)':20,
        'Масло оливковое (грамм)':25,
        'Соль поваренная (грамм)':5,
        'Семена зиры (грамм)':6,
        'Зелень петрушки сушёная (грамм)':5,
        'Зелень кориандра сушёная (грамм)':5,
        'Перец красный сушёный (грамм)':3,
        'Перец чёрный молотый (грамм)':2,
        'Семена кардамона (грамм)':1,
        'Пряности нежного карри (грамм)':10,
        '_-Пюрирование овощей (килограмм)':1,
        '_-Обжаривание овощей (килограмм)':1,
        }

metadict_detail['Пюре из обжаренной фасоли (килограмм)'] = {
        # Refried beans
        'Фасоль варёная (грамм)':900,
        'Сок лимонный (грамм)':50,
        'Семена зиры (грамм)':4,
        'Чеснок чищеный (грамм)':12,
        'Соль поваренная (грамм)':5,
        'Пряности нежного карри (грамм)':10,
        '_-Пюрирование овощей (килограмм)':1,
        '_-Обжаривание овощей (килограмм)':1,
        }

metadict_detail['Суп-пюре картофельный (килограмм)'] = {
        # http://www.molohovetc.ru/supy-pjure_mjasnye_voobshhe/
        'Картофель чищеный (грамм)':600 / (1 - 0.10),
        'Морковь обжаренная (грамм)':50,
        'Лук обжаренный (грамм)':50,
        'Соль поваренная (грамм)':5,
        'Перец красный сушёный (грамм)':3,
        'Пряности букета гарни с петрушкой (грамм)':20,
        'Вода для готовки (грамм)':600,
        '_-Пюрирование овощей (килограмм)':1,
        '_-Варка похлёбки (килограмм)':1,
        }

metadict_detail['Суп-пюре чечевичный с пряностями (килограмм)'] = {
        # Индийский дхал:
            # https://kedem.ru/schoolcook/basis/dal-dhal/
            # «Никто не умеет готовить правильный дал. Я тоже».
        'Чечевица замоченная (грамм)':500,
        'Морковь чищеная (грамм)':100,
        'Лук чищеный (грамм)':100,
        'Чеснок чищеный (грамм)':20,
        'Томаты сушёные (грамм)':20,
        'Соль поваренная (грамм)':3,
        'Зелень кориандра сушёная (грамм)':10,
        'Масло ароматизированное для бобов (грамм)':50,
        'Вода для готовки (грамм)':600,
        '_-Пюрирование овощей (килограмм)':1,
        '_-Варка похлёбки (килограмм)':1,
        }

metadict_detail['Суп-пюре фасолевый с пряностями (килограмм)'] = {
        'Фасоль замоченная (грамм)':500,
        'Томаты отборные (грамм)':200,
        'Морковь чищеная (грамм)':100,
        'Лук чищеный (грамм)':100,
        'Чеснок чищеный (грамм)':20,
        'Соль поваренная (грамм)':3,
        'Зелень кориандра отборная (грамм)':60,
        'Масло ароматизированное для бобов (грамм)':50,
        'Вода для готовки (грамм)':400,
        '_-Пюрирование овощей (килограмм)':1,
        '_-Варка похлёбки (килограмм)':1,
        }

metadict_detail['Суп-пюре гороховый с пряностями (килограмм)'] = {
        'Горох замоченный (грамм)':500,
        'Томаты отборные (грамм)':200,
        'Морковь чищеная (грамм)':100,
        'Лук чищеный (грамм)':100,
        'Чеснок чищеный (грамм)':20,
        'Соль поваренная (грамм)':3,
        'Зелень кориандра отборная (грамм)':60,
        'Масло ароматизированное для бобов (грамм)':50,
        'Вода для готовки (грамм)':400,
        '_-Пюрирование овощей (килограмм)':1,
        '_-Варка похлёбки (килограмм)':1,
        }

metadict_detail['Похлёбка с морской капустой (килограмм)'] = {
        'Морская капуста замоченная (грамм)':250,
        'Картофель чищеный (грамм)':150,
        'Морковь обжаренная (грамм)':100,
        'Лук обжаренный (грамм)':100,
        'Соль поваренная (грамм)':5,
        'Перец чёрный молотый (грамм)':1,
        'Лавровый лист сушёный (грамм)':0.6,
        'Пряности нежного карри (грамм)':10,
        'Вода для готовки (грамм)':1000,
        '_-Варка похлёбки (килограмм)':1,
        }

metadict_detail['Похлёбка картофельная (килограмм)'] = {
        # http://www.rus-food-recipes.ru/P_1/36.htm
        # http://interdoka.ru/kulinaria/1982/2_supi/2_zapravochnie/6_kartofel/1.html
        'Картофель чищеный (грамм)':450 / (1 - 0.10),
        'Лук чищеный (грамм)':100,
        'Чеснок чищеный (грамм)':20,
        'Соль поваренная (грамм)':3,
        'Лавровый лист сушёный (грамм)':0.6,
        'Зелень укропа сушёная (грамм)':10,
        'Перец душистый сушёный (грамм)':1,
        'Вода для готовки (грамм)':1000,
        '_-Варка похлёбки (килограмм)':1,
        }

metadict_detail['Похлёбка чечевичная (килограмм)'] = {
        # http://www.rus-food-recipes.ru/P_1/38.htm
        'Чечевица замоченная (грамм)':500,
        'Морковь чищеная (грамм)':60,
        'Лук чищеный (грамм)':60,
        'Чеснок чищеный (грамм)':20,
        'Корень петрушки чищеный (грамм)':11,
        'Лавровый лист сушёный (грамм)':0.6,
        'Соль поваренная (грамм)':3,
        'Перец душистый сушёный (грамм)':1,
        'Чабер сушёный (грамм)':3,
        'Вода для готовки (грамм)':1000,
        '_-Варка похлёбки (килограмм)':1,
        }

metadict_detail['Похлёбка фасолевая (килограмм)'] = {
        # Chili non Carne
        'Фасоль замоченная (грамм)':500,
        'Морковь обжаренная (грамм)':60,
        'Лук обжаренный (грамм)':60,
        'Чеснок чищеный (грамм)':20,
        'Томаты сушёные (грамм)':20,
        'Перец красный сушёный (грамм)':3,
        'Душица сушёная (грамм)':3,
        'Семена зиры (грамм)':3,
        'Соль поваренная (грамм)':5,
        'Вода для готовки (грамм)':500,
        '_-Варка похлёбки (килограмм)':1,
        }

metadict_detail['Похлёбка томатная с чечевицей (килограмм)'] = {
        'Томаты отборные (грамм)':500 / (1 - 0.15),
        'Чечевица замоченная (грамм)':400,
        'Морковь обжаренная (грамм)':60,
        'Лук обжаренный (грамм)':60,
        'Чеснок чищеный (грамм)':20,
        'Перец красный сушёный (грамм)':3,
        'Розмарин сушёный (грамм)':3,
        'Душица сушёная (грамм)':3,
        'Семена зиры (грамм)':3,
        'Соль поваренная (грамм)':5,
        '_-Варка похлёбки (килограмм)':1,
        }

metadict_detail['Похлёбка томатная с фасолью (килограмм)'] = {
        'Томаты отборные (грамм)':500 / (1 - 0.15),
        'Фасоль замоченная (грамм)':400,
        'Морковь обжаренная (грамм)':60,
        'Лук обжаренный (грамм)':60,
        'Чеснок чищеный (грамм)':20,
        'Перец красный сушёный (грамм)':3,
        'Розмарин сушёный (грамм)':3,
        'Душица сушёная (грамм)':3,
        'Семена зиры (грамм)':3,
        'Соль поваренная (грамм)':5,
        '_-Варка похлёбки (килограмм)':1,
        }

metadict_detail['Рис варёный с фасолью (килограмм)'] = {
        'Рис обжарено-варёный (грамм)':330,
        'Фасоль варёная (грамм)':330,
        'Лук обжаренный (грамм)':100,
        'Морковь обжаренная (грамм)':50,
        'Чеснок чищеный (грамм)':20,
        'Соль поваренная (грамм)':5,
        'Семена зиры (грамм)':4,
        'Душица сушёная (грамм)':2,
        'Семена кориандра (грамм)':2,
        'Перец чёрный молотый (грамм)':2,
        'Лавровый лист сушёный (грамм)':0.6,
        'Бульон фасолевый (грамм)':330,
        '_-Варка риса (килограмм)':1,
        }

metadict_detail['Рис варёный с кукурузой (килограмм)'] = {
        'Рис обжарено-варёный (грамм)':300,
        'Крупа кукурузная (грамм)':130,
        'Морковь обжаренная (грамм)':200,
        'Лук обжаренный (грамм)':100,
        'Чеснок чищеный (грамм)':20,
        'Соль поваренная (грамм)':5,
        'Семена зиры (грамм)':4,
        'Корень куркумы (грамм)':3,
        'Орех мускатный (грамм)':0.3,
        'Перец чёрный молотый (грамм)':1,
        'Перец красный сушёный (грамм)':4,
        'Вода для готовки (грамм)':330,
        '_-Варка риса (килограмм)':1,
        }

metadict_detail['Рис варёный с тыквой и кукурузой (килограмм)'] = {
        'Рис обжарено-варёный (грамм)':230,
        'Крупа кукурузная (грамм)':130,
        'Тыква чищеная (грамм)':230,
        'Морковь обжаренная (грамм)':100,
        'Лук обжаренный (грамм)':100,
        'Чеснок чищеный (грамм)':20,
        'Соль поваренная (грамм)':5,
        'Семена зиры (грамм)':4,
        'Корень куркумы (грамм)':3,
        'Орех мускатный (грамм)':0.3,
        'Перец чёрный молотый (грамм)':1,
        'Перец красный сушёный (грамм)':4,
        'Вода для готовки (грамм)':330,
        '_-Варка риса (килограмм)':1,
        }

metadict_detail['Рис обжаренный с квашеной капустой (килограмм)'] = {
        # Kimchi fried rice
        'Рис варёный (грамм)':700,
        'Капуста квашеная с соевым соусом (грамм)':200,
        'Масло оливковое (грамм)':40,
        'Масло кунжутное (грамм)':20,
        'Чеснок чищеный (грамм)':20,
        'Сахар-песок (грамм)':20,
        '_-Обжаривание овощей (килограмм)':1,
        }

metadict_detail['Рис обжарено-варёный (килограмм)'] = {
        'Рис шлифованный (грамм)':330,
        'Масло подсолнечное (грамм)':30,
        'Вода для готовки (грамм)':2000,
        '_-Обжаривание крупы (килограмм)':1,
        '_-Промывание крупы (килограмм)':1,
        '_-Варка риса (килограмм)':1,
        }

metadict_detail['Рис варёный (килограмм)'] = {
        # 1) Рис промывают в 6 водах (до прозрачности воды)
        # 2) Засыпают в кипящую воду. Варят до полуготовности (килограмм риса на 6 литров воды)
        # 3) Перекладывают в большое сито с влажным полотенцем на дне.
        # 4) Сито ставят на котёл с кипящей водой и доводят до готовности на пару.
        'Рис шлифованный (грамм)':330,
        'Вода для готовки (грамм)':2000,
        '_-Промывание крупы (килограмм)':1,
        '_-Варка риса (килограмм)':1,
        }

metadict_detail['Каша рисовая с чечевицей (килограмм)'] = {
        # Исправить
            # Допилить "Bisi bele bhaath"
            # https://indianhealthyrecipes.com/bisi-bele-bath/
        'Рис варёный (грамм)':500,
        'Суп-пюре чечевичный с пряностями (грамм)':500,
        '_-Варка риса (килограмм)':1,
        }

metadict_detail['Каша рисовая с чечевицей и спаржей (килограмм)'] = {
        'Рис варёный (грамм)':350,
        'Суп-пюре чечевичный с пряностями (грамм)':350,
        'Морковь обжаренная (грамм)':150 / (1 - 0.10),
        'Спаржа варёная (грамм)':150 / (1 - 0.10),
        '_-Тушение овощей (килограмм)':1,
        }

metadict_detail['Каша рисовая с чечевицей и овощами (килограмм)'] = {
        'Рис варёный (грамм)':350,
        'Суп-пюре чечевичный с пряностями (грамм)':350,
        'Перец сладкий чищеный (грамм)':100 / (1 - 0.10),
        'Томаты отборные (грамм)':100 / (1 - 0.15),
        'Кабачок чищеный (грамм)':100 / (1 - 0.15),
        '_-Шинковка овощей (килограмм)':0.3,
        '_-Тушение овощей (килограмм)':1,
        }

metadict_detail['Каша рисовая с чечевицей и горошком (килограмм)'] = {
        'Рис варёный (грамм)':350,
        'Суп-пюре чечевичный с пряностями (грамм)':350,
        'Морковь обжаренная (грамм)':150 / (1 - 0.10),
        'Горошек зелёный (грамм)':150 / (1 - 0.10),
        '_-Тушение овощей (килограмм)':1,
        }

metadict_detail['Каша рисовая (килограмм)'] = {
        'Рис шлифованный (грамм)':250,
        'Соль поваренная (грамм)':5,
        'Вода для готовки (грамм)':1000,
        '_-Варка риса (килограмм)':1,
        }

metadict_detail['Каша овсяная (килограмм)'] = {
        # http://www.food24news.ru/warenkunde/234438.html
        'Крупа овсяная (грамм)':250,
        'Соль поваренная (грамм)':8,
        'Вода для готовки (грамм)':1000,
        '_-Варка овсяной каши (килограмм)':1,
        }

metadict_detail['Каша гречневая (килограмм)'] = {
        'Крупа гречневая отборная (грамм)':317,
        'Лук обжаренный (грамм)':100,
        'Соль поваренная (грамм)':6,
        'Вода для готовки (грамм)':1200,
        '_-Варка рассыпчатой каши (килограмм)':1,
        }

metadict_detail['Каша гречневая с грибами (килограмм)'] = {
        # http://www.rus-food-recipes.ru/P_1/108.htm
        'Крупа гречневая отборная (грамм)':317,
        'Боровики сушёные (грамм)':50,
        'Лук обжаренный (грамм)':100,
        'Соль поваренная (грамм)':6,
        'Вода для готовки (грамм)':1200,
        '_-Варка рассыпчатой каши (килограмм)':1,
        }

metadict_detail['Каша ячневая (килограмм)'] = {
        'Крупа ячневая (грамм)':300,
        'Соль поваренная (грамм)':7,
        'Вода для готовки (грамм)':1000,
        '_-Промывание крупы (килограмм)':1,
        '_-Варка ячневой каши (килограмм)':1,
        }

metadict_detail['Каша кукурузно-мучная (килограмм)'] = {
        # Пюре из кукурузной муки, мамалыга
            # https://en.wikipedia.org/wiki/Nshima
        'Мука кукурузная (грамм)':300,
        'Соль поваренная (грамм)':5,
        'Пряности нежного карри (грамм)':10,
        'Вода для готовки (грамм)':1000,
        '_-Варка мучной каши (килограмм)':1,
        }

metadict_detail['Каша кукурузная (килограмм)'] = {
        'Крупа кукурузная (грамм)':300,
        'Морковь обжаренная (грамм)':100,
        'Соль поваренная (грамм)':5,
        'Вода для готовки (грамм)':1000,
        '_-Варка кукурузной каши (килограмм)':1,
        }

metadict_detail['Каша кукурузная с фруктами (килограмм)'] = {
        'Крупа кукурузная (грамм)':300,
        'Виноград отборный (грамм)':200,
        'Персик отборный (грамм)':200,
        'Соль поваренная (грамм)':5,
        'Вода для готовки (грамм)':1000,
        '_-Варка кукурузной каши (килограмм)':1,
        }

metadict_detail['Каша кукурузная с сухофруктами (килограмм)'] = {
        'Крупа кукурузная (грамм)':300,
        'Виноград сушёный (грамм)':30,
        'Персик сушёный (грамм)':30,
        'Соль поваренная (грамм)':5,
        'Вода для готовки (грамм)':1000,
        '_-Варка кукурузной каши (килограмм)':1,
        }

metadict_detail['Фасоль тушёная (килограмм)'] = {
        'Фасоль варёная (грамм)':500,
        'Морковь обжаренная (грамм)':200,
        'Лук обжаренный (грамм)':100,
        'Масло подсолнечное (грамм)':25,
        'Чеснок чищеный (грамм)':12,
        'Соль поваренная (грамм)':5,
        'Перец красный сушёный (грамм)':2,
        'Пряности нежного карри (грамм)':10,
        '_-Тушение овощей (килограмм)':1,
        }

metadict_detail['Чечевица тушёная (килограмм)'] = {
        'Чечевица варёная (грамм)':500,
        'Морковь обжаренная (грамм)':200,
        'Лук обжаренный (грамм)':100,
        'Масло подсолнечное (грамм)':25,
        'Чеснок чищеный (грамм)':12,
        'Соль поваренная (грамм)':5,
        'Перец красный сушёный (грамм)':2,
        'Пряности нежного карри (грамм)':10,
        '_-Тушение овощей (килограмм)':1,
        }

metadict_detail['Каша гороховая (килограмм)'] = {
        'Горох замоченный (грамм)':500,
        'Лук обжаренный (грамм)':100,
        'Соль поваренная (грамм)':5,
        'Вода для готовки (грамм)':1000,
        'Пряности для бобовых v1 (грамм)':10,
        '_-Варка бобовой каши (килограмм)':1,
        }

metadict_detail['Каша горохово-гречневая (килограмм)'] = {
        # Кашица тихвинская
        # http://www.rus-food-recipes.ru/P_1/106.htm
        'Горох замоченный (грамм)':230,
        'Продел гречневый (грамм)':210,
        'Лук обжаренный (грамм)':200,
        'Соль поваренная (грамм)':5,
        'Вода для готовки (грамм)':1000,
        'Пряности для бобовых v1 (грамм)':10,
        '_-Варка рассыпчатой каши (килограмм)':1,
        }

metadict_detail['Горох варёный (килограмм)'] = {
        'Горох замоченный (грамм)':400,
        'Вода для готовки (грамм)':1000,
        '_-Варка гороха (килограмм)':1,
        }

metadict_detail['Чечевица варёная (килограмм)'] = {
        'Чечевица замоченная (грамм)':800,
        'Вода для готовки (грамм)':1000,
        '_-Варка бобов (килограмм)':1,
        }

metadict_detail['Фасоль варёная (килограмм)'] = {
        'Фасоль замоченная (грамм)':900,
        'Вода для готовки (грамм)':1000,
        '_-Варка бобов (килограмм)':1,
        }

metadict_detail['Соя варёная (килограмм)'] = {
        'Соя замоченная (грамм)':900,
        'Вода для готовки (грамм)':3000,
        '_-Варка соевых бобов (килограмм)':1,
        }

metadict_detail['Мусс из орехов карии с мёдом (килограмм)'] = {
        'Напиток из орехов карии (грамм)':700,
        'Аквафаба чечевичная (грамм)':200,
        'Мёд жидкий (грамм)':100,
        '_-Приготовление крема (килограмм)':1,
        }

metadict_detail['Напиток из орехов карии с мёдом (килограмм)'] = {
        # Hickory Nut Ambrosia
        # https://www.tyrantfarms.com/recipe-how-to-make-hickory-nut-ambrosia/
        'Напиток из орехов карии (грамм)':750,
        'Напиток овсяной (грамм)':200,
        'Мёд жидкий (грамм)':50,
        }

metadict_detail['Напиток из орехов карии (килограмм)'] = {
        # Hickory Milk
        # https://tomscaroliniantrees.blogspot.com/2010/01/hickory-milk.html
        'Орех карии чищенный (грамм)':300,
        'Вода кипячёная (грамм)':1000,
        '_-Варка напитка из орехов карии (килограмм)':1,
        'Орех карии чищенный (фильтрация/грамм)':300,
        }

metadict_detail['Желе яблочное (килограмм)'] = {
        'Сок яблочный (грамм)':500,
        'Сироп сахарный (грамм)':350,
        'Вода кипячёная (грамм)':200,
        'Агар-агар (грамм)':10,
        '_-Приготовление желе (килограмм)':1,
        }

metadict_detail['Желе лимонное (килограмм)'] = {
        'Сок лимонный (грамм)':500,
        'Сироп сахарный (грамм)':350,
        'Вода кипячёная (грамм)':200,
        'Агар-агар (грамм)':10,
        '_-Приготовление желе (килограмм)':1,
        }

metadict_detail['Желе виноградное (килограмм)'] = {
        'Сок виноградный (грамм)':500,
        'Сироп сахарный (грамм)':350,
        'Вода кипячёная (грамм)':200,
        'Агар-агар (грамм)':10,
        '_-Приготовление желе (килограмм)':1,
        }

metadict_detail['Желе из ревеня (килограмм)'] = {
        'Сок ревеня (грамм)':500,
        'Сироп сахарный (грамм)':350,
        'Вода кипячёная (грамм)':200,
        'Агар-агар (грамм)':10,
        '_-Приготовление желе (килограмм)':1,
        }

metadict_detail['Кисель из ревеня (килограмм)'] = {
        # Слушай, няша, не вари кисель! Всё делается иначе:
            # 1) Сварить сахарный сироп.
            # 2) Приготовить сок, отставить.
            # 3) Приготовить крахмальный раствор.
            # 4) Влить крахмальный раствор в кипящий сахарный сироп,
            # 5) Быстро размешать 20 секунд и погасить огонь.
            # 6) Мешать смесь дальше, пока не начнёт густеть.
            # 7) Влить сок в студенистую массу, тщательно перемешать.
        # И да, этот метод подходит для любых фруктовых/овощных/шоколадных киселей.
        'Сок ревеня (грамм)':500,
        'Сироп сахарный (грамм)':250,
        'Раствор крахмальный (грамм)':300,
        '_-Приготовление киселя (килограмм)':1,
        }

metadict_detail['Кисель яблочный (килограмм)'] = {
        'Сок яблочный (грамм)':500,
        'Сироп сахарный (грамм)':250,
        'Раствор крахмальный (грамм)':300,
        '_-Приготовление киселя (килограмм)':1,
        }

metadict_detail['Кисель гороховый (килограмм)'] = {
        # Хм, ну если уж знаток говорит, что блюдо не кислое:
        # https://kare-l.livejournal.com/303414.html
        'Мука гороховая (грамм)':140,
        'Лук обжаренный (грамм)':100,
        'Соль поваренная (грамм)':5,
        'Масло конопляное (грамм)':100,
        'Вода для готовки (грамм)':800,
        '_-Варка горохового киселя (килограмм)':1,
        }

metadict_detail['Кисель овсяной (килограмм)'] = {
        # https://ru.wikipedia.org/wiki/Русский_кисель
        # http://www.molohovetc.ru/otdel_xx/2022_ovsjanyjj_kisel_s_mindalnymi_vyzhimkami/
        'Опара овсяная (грамм)':1000,
        'Соль поваренная (грамм)':5,
        '_-Варка овсяного киселя (килограмм)':1,
        'Опара овсяная (фильтрация/грамм)':1000,
        }

metadict_detail['Напиток овсяной с мёдом (килограмм)'] = {
        # Тот же овсяной кисель, только жидкий и подслащённый.
        'Опара овсяная (грамм)':600,
        'Вода кипячёная (грамм)':350,
        'Мёд жидкий (грамм)':50,
        '_-Варка овсяного киселя (килограмм)':1,
        'Опара овсяная (фильтрация/грамм)':600,
        }

metadict_detail['Напиток овсяной (килограмм)'] = {
        'Опара овсяная (грамм)':600,
        'Вода кипячёная (грамм)':400,
        '_-Варка овсяного киселя (килограмм)':1,
        'Опара овсяная (фильтрация/грамм)':600,
        }

metadict_detail['Напиток рисовый (килограмм)'] = {
        # Бесполезное рисовое молоко
        'Рис замоченный (грамм)':300,
        'Вода кипячёная (грамм)':700,
        '_-Варка рисового напитка (килограмм)':1,
        'Рис замоченный (фильтрация/грамм)':200,
        }

metadict_detail['Компот черничный (килограмм)'] = {
        'Черника сушёная (грамм)':100,
        'Сахар-песок (грамм)':100,
        'Вода для готовки (грамм)':1200,
        '_-Варка компота (килограмм)':1,
        }

metadict_detail['Компот из свежего ревеня (килограмм)'] = {
        'Ревень отборный (грамм)':800,
        'Сахар-песок (грамм)':100,
        'Вода для готовки (грамм)':500,
        '_-Варка компота (килограмм)':1,
        }

metadict_detail['Компот из свежих персиков (килограмм)'] = {
        'Персик отборный (грамм)':600,
        'Сахар-песок (грамм)':100,
        'Вода для готовки (грамм)':500,
        '_-Варка компота (килограмм)':1,
        }

metadict_detail['Компот из свежей вишни (килограмм)'] = {
        'Вишня отборная (грамм)':600,
        'Сахар-песок (грамм)':100,
        'Вода для готовки (грамм)':500,
        '_-Варка компота (килограмм)':1,
        }

metadict_detail['Компот из сухофруктов (килограмм)'] = {
        'Сухофрукты разные (грамм)':100,
        'Сахар-песок (грамм)':100,
        'Вода для готовки (грамм)':1200,
        '_-Варка компота (килограмм)':1,
        }

#----
# Готовые блюда (брожение, закваска, засолка):

metadict_detail['Квас ржаной имбирно-яблочный (килограмм)'] = {
        'Квас ржаной хлебный (грамм)':950,
        'Сироп яблочный (грамм)':50,
        'Корень имбиря (грамм)':1,
        '_-Приготовление кваса (килограмм)':1,
        'Сахар-песок (брожение/грамм)':25 * 0.5,
        }

metadict_detail['Квас ржаной хлебный (килограмм)'] = {
        # Исправить
            # Ты забываешь брожение сухарей, закваски, солода.
        # http://interdoka.ru/kulinaria/1982/2_supi/7_xolodnie/1.html
        'Сухари ржаные (грамм)':70,
        'Закваска ржаная (грамм)':20,
        'Солод ржаной (грамм)':20,
        'Сахар-песок (грамм)':20,
        'Вода кипячёная (грамм)':900,
        '_-Приготовление кваса (килограмм)':1,
        'Сухари ржаные (фильтрация/грамм)':70,
        'Сахар-песок (брожение/грамм)':20,
        }

metadict_detail['Эль имбирный (килограмм)'] = {
        # https://ru.wikipedia.org/wiki/Имбирный_эль
        # https://therumdiary.ru/napitki/pivo/recept-imbirnogo-elya.html
        'Корень имбиря (грамм)':18,
        'Сахар-песок (грамм)':112,
        'Соль поваренная (грамм)':1,
        'Сок лимонный (грамм)':20,
        'Дрожжи жидкие (грамм)':25,
        'Вода кипячёная (грамм)':825,
        '_-Приготовление имбирного эля (килограмм)':1,
        'Корень имбиря (фильтрация/грамм)':18,
        'Сахар-песок (брожение/грамм)':112 * 0.25,
        }

metadict_detail['Сидр яблочный (килограмм)'] = {
        # https://therumdiary.ru/napitki/vina/domashnij-sidr-ot-a-do-yu.html
        # https://ru.wikisource.org/wiki/ЭСБЕ/Плодовое_вино
        # https://ru.wikisource.org/wiki/ЭСБЕ/Сидр
        'Яблоко отборное (грамм)':2000,
        '_-Приготовление яблочного сидра (килограмм)':1,
        '|=Бочка яблочного сидра (килограмм)':1,
        'Сусло яблочное (спиртовое брожение/грамм)':2000,
        'Сусло яблочное (фильтрация/грамм)':2000,
        }

metadict_detail['Вино красное сухое (килограмм)'] = {
        # Нормы технологического проектирования винодельческих заводов по переработке винограда:
            # http://xcook.info/product/krasnoe-suhoe-vino.html
            # http://www.norm-load.ru/SNiP/Data1/9/9947/index.htm#i831023
            # https://ru.wikisource.org/wiki/ЭСБЕ/Виноделие
        'Виноград отборный (грамм)':2000,
        '_-Приготовление вина (килограмм)':1,
        '|=Бочка вина (килограмм)':1,
        'Сусло виноградное (спиртовое брожение/грамм)':2000,
        'Сусло виноградное (фильтрация/грамм)':2000,
        }

metadict_detail['Сидр грушевый (килограмм)'] = {
        # Старый добрый перри
        'Груша отборная (грамм)':2000,
        '_-Приготовление грушевого сидра (килограмм)':1,
        '|=Бочка грушевого сидра (килограмм)':1,
        'Сусло грушевое (брожение/грамм)':2000,
        'Сусло грушевое (фильтрация/грамм)':2000,
        }

metadict_detail['Капуста квашеная (килограмм)'] = {
        # http://konservirovanie.su/books/item/f00/s00/z0000000/st002.shtml
        'Капуста чищеная (грамм)':1000 / (1 - 0.15),
        'Соль поваренная (грамм)':30,
        'Семена тмина (грамм)':5,
        'Вода кипячёная (грамм)':200,
        '_-Нарезка овощей (килограмм)':1,
        '_-Квашение капусты (килограмм)':1,
        '|=Бочка квашеной капусты (килограмм)':1,
        'Капуста (брожение/грамм)':1000,
        }

metadict_detail['Капуста квашеная с соевым соусом (килограмм)'] = {
        # Корейская кимчи.
        'Капуста чищеная (грамм)':750 / (1 - 0.15),
        'Морковь чищеная (грамм)':70,
        'Лук зелёный отборный (грамм)':50,
        'Соус соевый (грамм)':70,
        'Соль поваренная (грамм)':30,
        'Чеснок чищеный (грамм)':20,
        'Корень имбиря (грамм)':10,
        'Сахар-песок (грамм)':15,
        'Перец красный сушёный (грамм)':5,
        'Вода кипячёная (грамм)':200,
        '_-Шинковка овощей (килограмм)':1,
        '_-Квашение капусты (килограмм)':1,
        '|=Бочка квашеной капусты (килограмм)':1,
        'Капуста (брожение/грамм)':1000,
        }

metadict_detail['Морковь маринованная (килограмм)'] = {
        'Морковь чищеная (грамм)':900 / (1 - 0.15),
        'Чеснок чищеный (грамм)':36,
        'Уксус виноградный 6% (грамм)':50,
        'Перец красный сушёный (грамм)':5,
        'Гвоздика сушёная (грамм)':0.3,
        'Зелень кориандра сушёная (грамм)':2,
        'Лавровый лист сушёный (грамм)':1,
        'Соль поваренная (грамм)':10,
        'Сахар-песок (грамм)':15,
        'Масло оливковое (грамм)':50,
        '_-Шинковка овощей (килограмм)':1,
        '_-Домашняя консервация овощей (килограмм)':1,
        '|=Бочка консервированной моркови (килограмм)':1,
        }

metadict_detail['Свёкла квашеная (килограмм)'] = {
        # Исправить
            # Слишком много рассола.
        # http://konservirovanie.su/books/item/f00/s00/z0000000/st003.shtml
        'Свёкла чищеная (грамм)':1000 / (1 - 0.15),
        'Рассол для консервации овощей (грамм)':1000,
        '_-Домашняя консервация овощей (килограмм)':1,
        '|=Бочка консервированной свёклы (килограмм)':1 * 2,
        'Свёкла (брожение/грамм)':1000,
        }

metadict_detail['Кабачок консервированный (килограмм)'] = {
        'Кабачок чищеный (грамм)':1000 / (1 - 0.15),
        'Рассол для консервации овощей (грамм)':1000,
        '_-Домашняя консервация овощей (килограмм)':1,
        '|=Бочка консервированных кабачков (килограмм)':1 * 2,
        'Кабачок (брожение/грамм)':1000,
        }

metadict_detail['Боровики маринованные (килограмм)'] = {
        'Боровики варёные (грамм)':1000 / (1 - 0.15),
        'Маринад для консервации грибов (грамм)':300,
        '_-Домашняя консервация грибов (килограмм)':1,
        '|=Бочка консервированных боровиков (килограмм)':1 * 1.3,
        'Боровики (брожение/грамм)':1000,
        }

metadict_detail['Огурцы солёные (килограмм)'] = {
        'Огурцы отборные (грамм)':1000 / (1 - 0.15),
        'Рассол для консервации овощей (грамм)':1000,
        '_-Домашняя консервация овощей (килограмм)':1,
        '|=Бочка консервированных огурцов (килограмм)':1 * 2,
        'Огурцы (брожение/грамм)':1000,
        }

metadict_detail['Томаты солёные (килограмм)'] = {
        # http://konservirovanie.su/books/item/f00/s00/z0000000/st007.shtml
        'Томаты отборные (грамм)':1000 / (1 - 0.15),
        'Рассол для консервации овощей (грамм)':1000,
        '_-Домашняя консервация овощей (килограмм)':1,
        '|=Бочка консервированных томатов (килограмм)':1 * 2,
        'Томаты (брожение/грамм)':1000,
        }

metadict_detail['Оливки солёные (килограмм)'] = {
        'Оливки чищеные (грамм)':1000,
        'Соль поваренная (грамм)':40,
        'Уксус виноградный 6% (грамм)':40,
        'Лист лавра (грамм)':5,
        '_-Домашняя консервация овощей (килограмм)':1,
        '|=Бочка консервированных оливок (килограмм)':1,
        }

metadict_detail['Яблоко мочёное (килограмм)'] = {
        'Яблоко отборное (грамм)':1000 / (1 - 0.15),
        'Рассол для мочения фруктов (грамм)':1000,
        '_-Домашняя консервация фруктов (килограмм)':1,
        '|=Бочка мочёных яблок (килограмм)':1 * 2,
        'Яблоко отборное (брожение/грамм)':1000,
        }

metadict_detail['Груша мочёная (килограмм)'] = {
        'Груша чищеная (грамм)':1000 / (1 - 0.15),
        'Рассол для мочения фруктов (грамм)':1000,
        '_-Домашняя консервация фруктов (килограмм)':1,
        '|=Бочка мочёных груш (килограмм)':1 * 2,
        'Груша (брожение/грамм)':1000,
        }

metadict_detail['Слива мочёная (килограмм)'] = {
        'Слива отборная (грамм)':1000 / (1 - 0.15),
        'Рассол для мочения фруктов (грамм)':1000,
        '_-Домашняя консервация фруктов (килограмм)':1,
        '|=Бочка мочёной сливы (килограмм)':1 * 2,
        'Слива (брожение/грамм)':1000,
        }

metadict_detail['Темпе (килограмм)'] = {
        # https://ru.wikipedia.org/wiki/Темпе
        'Соя варёная (грамм)':1000 / (1 - 0.15),
        'Уксус виноградный 6% (грамм)':100,
        '_-Ферментация сои (килограмм)':1,
        }

#----
# Ингредиенты (тепловая обработка):

metadict_detail['Арахис обжаренный (килограмм)'] = {
        'Арахис чищеный (грамм)':1000,
        'Соль поваренная (грамм)':10,
        '_-Бланширование орехов (килограмм)':1,
        '_-Обжаривание орехов (килограмм)':1,
        }

metadict_detail['Соус томатный (килограмм)'] = {
        # Лютеница
        'Томаты отборные (грамм)':320 / (1 - 0.60),
        'Перец печёный (грамм)':250 / (1 - 0.20),
        'Баклажан печёный (грамм)':200 / (1 - 0.20),
        'Кабачок печёный (грамм)':100 / (1 - 0.20),
        'Зелень петрушки отборная (грамм)':50,
        'Масло оливковое (грамм)':50,
        'Сахар-песок (грамм)':20,
        'Чеснок чищеный (грамм)':20,
        'Соль поваренная (грамм)':10,
        'Уксус яблочный 6% (грамм)':10,
        '_-Тушение овощей (килограмм)':1,
        '_-Приготовление соуса (килограмм)':1,
        }

metadict_detail['Аквафаба чечевичная (килограмм)'] = {
        # Подобие яичного белка (50 миллилитров = одно яицо)
            # https://en.wikipedia.org/wiki/Aquafaba
            # 1) Бобовый бульон вываривается до 10% сухого вещества.
            # 2) Затем интенсивно взбивается 15 минут.
        'Бульон чечевичный (грамм)':3000,
        '_-Взбивание аквафабы (килограмм)':1,
        '_-Вываривание аквафабы (килограмм)':3,
        }

metadict_detail['Бульон чечевичный (килограмм)'] = {
        # Бульон от варёных бобов содержит около 5% сухого вещества.
        'Чечевица замоченная (грамм)':100,
        'Вода для готовки (грамм)':1000,
        #'_-Варка бобов (килограмм)':1,
        }

metadict_detail['Бульон фасолевый (килограмм)'] = {
        'Фасоль замоченная (грамм)':100,
        'Вода для готовки (грамм)':1000,
        #'_-Варка бобов (килограмм)':1,
        }

metadict_detail['Сироп сахарный (килограмм)'] = {
        'Сахар-песок (грамм)':700,
        'Вода для готовки (грамм)':300,
        '_-Варка сахарного сиропа (килограмм)':1,
        }

metadict_detail['Сироп лимонный (килограмм)'] = {
        'Сок лимонный (грамм)':500,
        'Сахар-песок (грамм)':500,
        '_-Варка сахарного сиропа (килограмм)':1,
        }

metadict_detail['Сироп яблочный (килограмм)'] = {
        'Сок яблочный (грамм)':500,
        'Сахар-песок (грамм)':500,
        '_-Варка сахарного сиропа (килограмм)':1,
        }

metadict_detail['Масло ароматизированное для щей (килограмм)'] = {
        # Исправить
            # Эм, а нафига мы обжариваем петрушку и укроп?
            # Пряности в масле нагревают, но не жарят.
        'Масло льняное (грамм)':750,
        'Семена аниса (грамм)':50,
        'Семена фенхеля (грамм)':50,
        'Семена кориандра (грамм)':50,
        'Зелень укропа сушёная (грамм)':50,
        'Зелень петрушки сушёная (грамм)':50,
        '_-Обжаривание пряностей (килограмм)':1,
        }

metadict_detail['Масло ароматизированное для картофеля (килограмм)'] = {
        'Масло оливковое (грамм)':750,
        'Семена зиры (грамм)':40,
        'Корень имбиря (грамм)':35,
        'Чеснок сушёный (грамм)':35,
        'Семена кориандра (грамм)':35,
        'Корень куркумы (грамм)':35,
        'Перец красный сушёный (грамм)':35,
        'Пряности гарам масала (грамм)':35,
        '_-Обжаривание пряностей (килограмм)':1,
        }

metadict_detail['Масло ароматизированное для бобов (килограмм)'] = {
        'Масло оливковое (грамм)':750,
        'Семена зиры (грамм)':50,
        'Корень имбиря (грамм)':50,
        'Чеснок сушёный (грамм)':50,
        'Семена кориандра (грамм)':50,
        'Пряности гарам масала (грамм)':50,
        '_-Обжаривание пряностей (килограмм)':1,
        }

metadict_detail['Масло ароматизированное для овощей (килограмм)'] = {
        'Масло оливковое (грамм)':645,
        'Перец душистый сушёный (грамм)':225,
        'Перец красный сушёный (грамм)':100,
        'Корень имбиря (грамм)':30,
        '_-Обжаривание пряностей (килограмм)':1,
        }

metadict_detail['Фарш овощной (килограмм)'] = {
        # http://www.100menu.ru/pages/foods/veget/11.perecovochi.htm
        'Картофель чищеный (грамм)':200,
        'Томаты отборные (грамм)':200,
        'Лук чищеный (грамм)':130,
        'Корень сельдерея (грамм)':200,
        'Морковь чищеная (грамм)':300,
        'Крем маслено-горчичный (грамм)':100,
        'Масло подсолнечное (грамм)':20,
        'Розмарин сушёный (грамм)':2,
        'Чеснок чищеный (грамм)':3,
        'Соль поваренная (грамм)':3,
        'Перец чёрный молотый (грамм)':2,
        'Вода для готовки (грамм)':300,
        '_-Шинковка овощей (килограмм)':1,
        '_-Тушение овощей (килограмм)':1,
        }

metadict_detail['Темпе обжаренный (килограмм)'] = {
        'Темпе (грамм)':950 / (1 - 0.10),
        'Масло подсолнечное (грамм)':25,
        '_-Обжаривание овощей (килограмм)':1,
        }

metadict_detail['Лук обжаренный (килограмм)'] = {
        'Лук чищеный (грамм)':950 / (1 - 0.10),
        'Масло подсолнечное (грамм)':50,
        '_-Шинковка овощей (килограмм)':1,
        '_-Обжаривание овощей (килограмм)':1,
        }

metadict_detail['Морковь обжаренная (килограмм)'] = {
        'Морковь чищеная (грамм)':950 / (1 - 0.10),
        'Масло подсолнечное (грамм)':50,
        '_-Шинковка овощей (килограмм)':1,
        '_-Обжаривание овощей (килограмм)':1,
        }

#----
# Ингредиенты (смеси, растворы):

metadict_detail['Раствор крахмальный (килограмм)'] = {
        # Холодная кипячёная вода.
        'Крахмал картофельный (грамм)':100,
        'Вода кипячёная (грамм)':900,
        }

metadict_detail['Травяной сбор (килограмм)'] = {
        # Исправить
            # На самом деле для разных пропорций и разных чаёв.
        'Одуванчик сушёный (грамм)':1000 / 11,
        'Зверобой сушёный (грамм)':1000 / 11,
        'Фенхель сушёный (грамм)':1000 / 11,
        'Ромашка сушёная (грамм)':1000 / 11,
        'Таволга сушёная (грамм)':1000 / 11,
        'Крапива сушёная (грамм)':1000 / 11,
        'Лаванда сушёная (грамм)':1000 / 11,
        'Чабрец сушёный (грамм)':1000 / 11,
        'Душица сушёная (грамм)':1000 / 11,
        'Клевер сушёный (грамм)':1000 / 11,
        'Мята сушёная (грамм)':1000 / 11,
        }

metadict_detail['Заправка для салатов медово-горчичная (килограмм)'] = {
        # Хороша к свёкле и зелёным салатам -- 50 грамм/килограмм
        'Масло конопляное (грамм)':200,
        'Горчица столовая (грамм)':280,
        'Мёд жидкий (грамм)':280,
        'Сок лимонный (грамм)':240,
        }

metadict_detail['Заправка для салатов на соевом соусе (килограмм)'] = {
        # Исправить
            # Уточни пропорции, или вовсе раздели
        'Масло кунжутное (грамм)':400,
        'Уксус виноградный 6% (грамм)':200,
        'Соус соевый (грамм)':250,
        'Сахар-песок (грамм)':150,
        'Перец чёрный молотый (грамм)':5,
        }

metadict_detail['Заправка для салатов на подсолнечном масле (килограмм)'] = {
        'Масло подсолнечное (грамм)':500,
        'Уксус яблочный 3% (грамм)':450,
        'Сахар-песок (грамм)':40,
        'Перец чёрный молотый (грамм)':2,
        'Соль поваренная (грамм)':20,
        }

metadict_detail['Заправка для салатов на конопляном масле (килограмм)'] = {
        'Масло конопляное (грамм)':500,
        'Уксус яблочный 3% (грамм)':450,
        'Сахар-песок (грамм)':40,
        'Перец чёрный молотый (грамм)':2,
        'Соль поваренная (грамм)':20,
        }

metadict_detail['Заправка для салатов на оливковом масле (килограмм)'] = {
        'Масло оливковое (грамм)':500,
        'Уксус яблочный 3% (грамм)':450,
        'Сахар-песок (грамм)':40,
        'Перец чёрный молотый (грамм)':2,
        'Соль поваренная (грамм)':20,
        }

metadict_detail['Уксус яблочный 3% (килограмм)'] = {
        'Уксус яблочный 6% (грамм)':500,
        'Вода кипячёная (грамм)':500,
        }

metadict_detail['Сухофрукты разные (килограмм)'] = {
        # Исправить
            # Раздели на североморские/среднеземные
            # Уточни пропорции.
        'Яблоко сушёное (грамм)':300,
        'Слива сушёная (грамм)':200,
        'Груша сушёная (грамм)':200,
        'Вишня сушёная (грамм)':100,
        'Инжир сушёный (грамм)':50,
        'Персик сушёный (грамм)':50,
        'Абрикос сушёный (грамм)':50,
        'Виноград сушёный (грамм)':50,
        }

metadict_detail['Рассол для мочения фруктов (килограмм)'] = {
        # Исправить
            # Сочетания: эстрагон и базилик, корица и гвоздика. Что там ещё к яблокам подойдёт?
        # Сахарный раствор 6%. Мочение.
            # http://konservirovanie.su/books/item/f00/s00/z0000000/st010.shtml
        'Сахар-песок (грамм)':60,
        'Соль поваренная (грамм)':15,
        'Горчичный порошок (грамм)':2,
        'Солод пшеничный (грамм)':5,
        'Вода для готовки (грамм)':1000,
        '_-Приготовление рассола для мочения фруктов (килограмм)':1,
        'Сахар-песок (брожение/грамм)':60,
        }

metadict_detail['Рассол для консервации овощей (килограмм)'] = {
        # Стоит заметить, пряностями соленья не испортишь. А ещё можно листья добавлять:
            # 1-2 головки чеснока, 50 грамм укропа, по 8 смородиновых и вишнёвых листьев, 2-3 дубовых.
            # 1 лист хрена, 1 стебель эстрагона, 2 стебля базилика, щепотки две красного перца.
        # Рассол 6% концентрации. Соление, стало быть.
            # http://konservirovanie.su/books/item/f00/s00/z0000000/st002.shtml
        'Соль поваренная (грамм)':60,
        'Чеснок чищеный (грамм)':50,
        'Зелень укропа отборная (грамм)':30,
        'Лист смородины (грамм)':50,
        'Стебель сельдерея (грамм)':20,
        'Стебель эстрагона (грамм)':5,
        'Перец душистый сушёный (грамм)':2,
        'Лист дуба (грамм)':10,
        'Корень хрена (грамм)':5,
        'Вода для готовки (грамм)':1000,
        '_-Приготовление рассола для консервации овощей (килограмм)':1,
        }

metadict_detail['Маринад для консервации грибов (килограмм)'] = {
        # Исправить
            # Уточнить, особенно количество уксусной кислоты и соли.
        'Уксус яблочный 6% (грамм)':200,
        'Соль поваренная (грамм)':40,
        'Чеснок чищеный (грамм)':60,
        'Зелень укропа отборная (грамм)':50,
        'Перец душистый сушёный (грамм)':1,
        'Перец чёрный сушёный (грамм)':1,
        'Вода для готовки (грамм)':630,
        'Лавровый лист сушёный (грамм)':0.5,
        '_-Приготовление маринада для консервации грибов (килограмм)':1,
        }

metadict_detail['Рассол для квашения капусты (килограмм)'] = {
        # Исправить
            # Не используется.
        # Рассол 3% концентрации, квашение.
        'Семена тмина (грамм)':5,
        'Соль поваренная (грамм)':30,
        'Вода для готовки (грамм)':1000,
        '_-Приготовление рассола для квашения капусты (килограмм)':1,
        }

metadict_detail['Основа квасная для ботвиньи (килограмм)'] = {
        'Квас ржаной хлебный (грамм)':935,
        'Сок лимонный (грамм)':25,
        'Хрен тёртый (грамм)':20,
        'Сахар-песок (грамм)':10,
        'Горчица столовая (грамм)':10,
        }

metadict_detail['Горчица столовая (килограмм)'] = {
        # http://www.molohovetc.ru/xlvii/3583/
        # http://konservirovanie.su/books/item/f00/s00/z0000000/st035.shtml
        'Горчичный порошок (грамм)':264,
        'Сахар-песок (грамм)':81.2,
        'Масло подсолнечное (грамм)':60.9,
        'Уксус яблочный 6% (грамм)':380,
        'Соль поваренная (грамм)':25.4,
        'Вода кипячёная (грамм)':189.2,
        'Корица молотая (грамм)':0.2,
        'Гвоздика сушёная (грамм)':0.2,
        'Лавровый лист сушёный (грамм)':0.3,
        'Перец чёрный молотый (грамм)':0.2,
        '_-Приготовление горчицы (килограмм)':1,
        }

#----
# Ингредиенты (дробление, измельчение):

metadict_detail['Корень сельдерея шинкованный (килограмм)'] = {
        'Корень сельдерея (грамм)':1000,
        '_-Шинковка овощей (килограмм)':1,
        }

metadict_detail['Паста арахисовая (килограмм)'] = {
        # Исправить
            # Есть мнение, что сахар здесь ни к чему.
        'Арахис чищеный (грамм)':900,
        'Сироп сахарный (грамм)':100,
        'Соль поваренная (грамм)':10,
        '_-Бланширование орехов (килограмм)':1,
        '_-Обжаривание орехов (килограмм)':1,
        '_-Помол орехов (килограмм)':1,
        }

metadict_detail['Паста пекановая (килограмм)'] = {
        'Орех пекана чищенный (грамм)':900,
        'Сироп сахарный (грамм)':100,
        'Соль поваренная (грамм)':10,
        '_-Бланширование орехов (килограмм)':1,
        '_-Обжаривание орехов (килограмм)':1,
        '_-Помол орехов (килограмм)':1,
        }

metadict_detail['Паста кунжутная (килограмм)'] = {
        # Тахини
        'Семена кунжута (грамм)':1000,
        'Соль поваренная (грамм)':10,
        '_-Обжаривание семян (килограмм)':1,
        '_-Помол семян (килограмм)':1,
        }

metadict_detail['Заправка зелёная для ботвиньи (килограмм)'] = {
        'Ботва свекольная (грамм)':400,
        'Крапива отборная (грамм)':300,
        'Щавель отборный (грамм)':300,
        'Соль поваренная (грамм)':10,
        '_-Шинковка овощей (килограмм)':1,
        }

metadict_detail['Заправка овощная для ботвиньи (килограмм)'] = {
        'Свёкла варёная (грамм)':500,
        'Огурцы отборные (грамм)':300,
        'Лук зелёный отборный (грамм)':150,
        'Зелень укропа отборная (грамм)':50,
        '_-Шинковка овощей (килограмм)':1,
        }

metadict_detail['Хрен тёртый (килограмм)'] = {
        # Исправить
            # немного соли, в 2-3 раза больше сахару
            # 1-2 чайные ложки лимонной цедры в порошке
            # Раствор (2% ароматизированный уксус)
        'Корень хрена (грамм)':1000,
        '_-Шинковка овощей (килограмм)':1,
        }

metadict_detail['Продел гречневый (килограмм)'] = {
        'Крупа гречневая отборная (грамм)':1000,
        '_-Дробление крупы (килограмм)':1,
        }

metadict_detail['Цедра лимонная (килограмм)'] = {
        # Исправить
            # Да проверь же, блин!
        'Лимон отборный (грамм)':10000,
        '_-Чистка фруктов (килограмм)':1,
        }

metadict_detail['Мука ячменная (килограмм)'] = {
        # Исправить
            # Добавь тару, на мельнице ведь делают.
        'Крупа ячневая (грамм)':1000,
        '_-Помол ячменной крупы (килограмм)':1,
        }

metadict_detail['Мука гороховая (килограмм)'] = {
        'Горох сухой (грамм)':1000,
        '_-Помол гороховой крупы (килограмм)':1,
        }

metadict_detail['Мука гречневая (килограмм)'] = {
        'Крупа гречневая отборная (грамм)':1000,
        '_-Помол гречневой крупы (килограмм)':1,
        }

metadict_detail['Сахарная пудра (килограмм)'] = {
        'Сахар-песок (грамм)':1000,
        '_-Помол сахар-песка (килограмм)':1,
        }

metadict_detail['Перец чёрный молотый (килограмм)'] = {
        'Перец чёрный сушёный (грамм)':1000,
        '_-Помол специй (килограмм)':1,
        }

metadict_detail['Корица молотая (килограмм)'] = {
        'Корица палочкой (грамм)':1000,
        '_-Помол специй (килограмм)':1,
        }

#----
# Ингредиенты (отжим):

metadict_detail['Сок лимонный (килограмм)'] = {
        'Лимон отборный (грамм)':2000,
        '_-Приготовление фруктового сока (килограмм)':1,
        'Лимон отборный (фильтрация/грамм)':2000,
        }

metadict_detail['Сок яблочный (килограмм)'] = {
        # http://konservirovanie.su/books/item/f00/s00/z0000000/st020.shtml
        'Яблоко чищеное (грамм)':2000,
        '_-Приготовление фруктового сока (килограмм)':1,
        'Яблоко чищеное (фильтрация/грамм)':2000,
        }

metadict_detail['Сок ревеня (килограмм)'] = {
        'Ревень отборный (грамм)':2000,
        '_-Приготовление фруктового сока (килограмм)':1,
        'Ревень отборный (фильтрация/грамм)':2000,
        }

metadict_detail['Сок виноградный (килограмм)'] = {
        'Виноград отборный (грамм)':1500,
        '_-Приготовление фруктового сока (килограмм)':1,
        'Виноград отборный (фильтрация/грамм)':1500,
        }

#----
# Ингредиенты (эмульгация):

metadict_detail['Крем лимонный (килограмм)'] = {
        'Аквафаба чечевичная (грамм)':400,
        'Сироп лимонный (грамм)':600,
        '_-Приготовление крема (килограмм)':1,
        }

metadict_detail['Крем кленовый (килограмм)'] = {
        'Аквафаба чечевичная (грамм)':400,
        'Сироп кленовый (грамм)':600,
        '_-Приготовление крема (килограмм)':1,
        }

metadict_detail['Крем заварной (килограмм)'] = {
        # http://vegetarianrecept.ru/deserty/zefir-bez-yaic-s-agar-agarom-iz-akvafaby.html
        'Аквафаба чечевичная (грамм)':400,
        'Масло подсолнечное (грамм)':100,
        'Сироп сахарный (грамм)':300,
        'Раствор крахмальный (грамм)':200,
        '_-Приготовление крема (килограмм)':1,
        }

metadict_detail['Крем масленый (килограмм)'] = {
        # Исправить
            # Хм, уксус, масло и тепловая обработка, это ужасное сочетание.
        # https://plantepusherne.dk/vegan-aquafaba-butter/
        'Аквафаба чечевичная (грамм)':350,
        'Масло подсолнечное (грамм)':600,
        'Соль поваренная (грамм)':10,
        'Уксус яблочный 6% (грамм)':50,
        '_-Приготовление крема (килограмм)':1,
        }

metadict_detail['Крем маслено-горчичный (килограмм)'] = {
        # Напоминает майонез, но быстро спадает и терпим к запеканию (если убрать кислоту).
            # http://klassnie.ru/majonez-iz-akvafaby-na-soke-goroxa/
            # http://ohsheglows.com/2016/06/02/5-minute-soy-free-vegan-mayonnaise-using-aquafaba/
            # http://www.100menu.ru/pages/foods/sous/10.maionez.htm
        'Аквафаба чечевичная (грамм)':300,
        'Масло подсолнечное (грамм)':600,
        'Горчица столовая (грамм)':50,
        'Сок лимонный (грамм)':50,
        'Соль поваренная (грамм)':7,
        'Сахарная пудра (грамм)':15,
        '_-Приготовление майонеза (килограмм)':1,
        }

metadict_detail['Маргарин соевый (килограмм)'] = {
        # Маргарин. Производство маргарина:
            # https://znaytovar.ru/new1010.html
        # Эмульгатор -- соевый лецитин
        'Масло соевое (грамм)':630,
        'Вода кипячёная (грамм)':370,
        '_-Производство соевого маргарина (килограмм)':1,
        '|=Бочка соевого маргарина (килограмм)':1,
        }

#----
# Ингредиенты (замачивание, регидрация):

metadict_detail['Фасоль замоченная (килограмм)'] = {
        'Фасоль сухая (грамм)':500,
        'Вода для готовки (грамм)':2000,
        '_-Замачивание бобов (килограмм)':1,
        }

metadict_detail['Соя замоченная (килограмм)'] = {
        'Бобы соевые (грамм)':500,
        'Вода для готовки (грамм)':2000,
        '_-Замачивание бобов (килограмм)':1,
        }

metadict_detail['Горох замоченный (килограмм)'] = {
        'Горох сухой (грамм)':500,
        'Вода для готовки (грамм)':2000,
        '_-Замачивание бобов (килограмм)':1,
        }

metadict_detail['Чечевица замоченная (килограмм)'] = {
        'Чечевица сухая (грамм)':500,
        'Вода для готовки (грамм)':2000,
        '_-Замачивание бобов (килограмм)':1,
        }

metadict_detail['Рис замоченный (килограмм)'] = {
        'Рис шлифованный (грамм)':500,
        'Вода для готовки (грамм)':2000,
        '_-Дробление крупы (килограмм)':0.5,
        '_-Замачивание риса (килограмм)':1,
        }

metadict_detail['Морская капуста замоченная (килограмм)'] = {
        'Морская капуста сушёная (грамм)':100,
        'Вода для готовки (грамм)':2000,
        '_-Замачивание овощей (килограмм)':1,
        }

#----
# Ингредиенты (сушка, дегидрация):

metadict_detail['Морская капуста сушёная (килограмм)'] = {
        'Морская капуста отборная (грамм)':20000,
        '_-Нарезка лапши (килограмм)':1,
        '_-Сушка овощей (килограмм)':1,
        }

metadict_detail['Лапша сушёная (килограмм)'] = {
        'Тесто пшеничное бездрожжевое для лапши (грамм)':1400,
        '_-Бланширование лапши (килограмм)':1,
        '_-Нарезка лапши (килограмм)':1,
        '_-Сушка лапши (килограмм)':1,
        }

metadict_detail['Крахмал картофельный (килограмм)'] = {
        # https://ru.wikisource.org/wiki/ЭСБЕ/Крахмальное_производство
        # https://znaytovar.ru/s/Texnologicheskaya_liniya_proizvod33.html
        # http://howtogetrid.ru/kak-sdelat-kraxmal-v-domashnix-usloviyax/
        'Картофель чищеный (грамм)':20000,
        '_-Производство картофельного крахмала (килограмм)':1,
        'Картофель чищеный (крахмализация/грамм)':20000,
        }

metadict_detail['Агар-агар (килограмм)'] = {
        'Водоросли красные (килограмм)':20,
        '_-Производство агар-агара (килограмм)':1,
        }

metadict_detail['Мёд засахаренный (килограмм)'] = {
        'Мёд жидкий (грамм)':1200,
        }

metadict_detail['Сухари пшеничные (килограмм)'] = {
        'Хлеб пшеничный домашний (грамм)':1500,
        '_-Сушка сухарей (килограмм)':1,
        }

metadict_detail['Сухари ржаные (килограмм)'] = {
        'Хлеб ржаной домашний (грамм)':1500,
        '_-Сушка сухарей (килограмм)':1,
        }

metadict_detail['Боровики сушёные (килограмм)'] = {
        'Боровики чищеные (грамм)':8000,
        '_-Сушка грибов (килограмм)':1,
        '|=Бочка сушёных белых грибов (килограмм)':1,
        }

metadict_detail['Сморчки сушёные (килограмм)'] = {
        'Сморчки чищеные (грамм)':7000,
        '_-Сушка грибов (килограмм)':1,
        '|=Бочка сушёных сморчков (килограмм)':1,
        }

metadict_detail['Черника сушёная (килограмм)'] = {
        'Черника отборная (грамм)':8000,
        '_-Сушка ягод (килограмм)':1,
        '|=Бочка сушёной черники (килограмм)':1,
        }

metadict_detail['Смородина сушёная (килограмм)'] = {
        'Смородина отборная (грамм)':8000,
        '_-Сушка ягод (килограмм)':1,
        '|=Бочка сушёной смородины (килограмм)':1,
        }

metadict_detail['Виноград сушёный (килограмм)'] = {
        'Виноград отборный (грамм)':4000,
        '_-Сушка ягод (килограмм)':1,
        '|=Бочка изюма (килограмм)':1,
        }

metadict_detail['Яблоко сушёное (килограмм)'] = {
        # Настольная книга садовода 7.14. Сушка:
        # http://www.citrus.abc64.ru/bookgardene714.htm
        'Яблоко чищеное (грамм)':5000,
        '_-Нарезка фруктов (килограмм)':1,
        '_-Сушка фруктов (килограмм)':1,
        '|=Бочка сушёных яблок (килограмм)':1,
        }

metadict_detail['Груша сушёная (килограмм)'] = {
        'Груша чищеная (грамм)':5000,
        '_-Сушка фруктов (килограмм)':1,
        '|=Бочка сушёной груши (килограмм)':1,
        }

metadict_detail['Персик сушёный (килограмм)'] = {
        'Персик отборный (грамм)':6000,
        '_-Сушка фруктов (килограмм)':1,
        '|=Бочка сушёного персика (килограмм)':1,
        }

metadict_detail['Абрикос сушёный (килограмм)'] = {
        'Абрикос отборный (грамм)':6000,
        '_-Сушка фруктов (килограмм)':1,
        '|=Бочка сушёного абрикоса (килограмм)':1,
        }

metadict_detail['Слива сушёная (килограмм)'] = {
        'Слива отборная (грамм)':5000,
        '_-Сушка фруктов (килограмм)':1,
        '|=Бочка сушёной сливы (килограмм)':1,
        }

metadict_detail['Инжир сушёный (килограмм)'] = {
        'Инжир отборный (грамм)':4000,
        '_-Нарезка фруктов (килограмм)':1,
        '_-Сушка фруктов (килограмм)':1,
        '|=Бочка сушёного инжира (килограмм)':1,
        }

metadict_detail['Вишня сушёная (килограмм)'] = {
        'Вишня отборная (грамм)':6000,
        '_-Сушка фруктов (килограмм)':1,
        '|=Бочка сушёной вишни (килограмм)':1,
        }

metadict_detail['Томаты сушёные (килограмм)'] = {
        'Томаты отборные (грамм)':10000,
        '_-Нарезка овощей (килограмм)':1,
        '_-Сушка овощей (килограмм)':1,
        '|=Бочка сушёных томатов (килограмм)':1,
        }

#----
# Ингредиенты (специи сушёные):

metadict_detail['Эстрагон сушёный (килограмм)'] = {
        # Исправить
            # Вообще-то сушатся и листья.
        'Стебель эстрагона (грамм)':11000,
        '_-Сушка овощей (килограмм)':1,
        '|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Чеснок сушёный (килограмм)'] = {
        'Чеснок чищеный (грамм)':2300,
        '_-Сушка овощей (килограмм)':1,
        '|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Чабер сушёный (килограмм)'] = {
        'Лист чабера (грамм)':7000,
        '_-Сушка трав (килограмм)':1,
        '|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Зелень кориандра сушёная (килограмм)'] = {
        'Зелень кориандра отборная (грамм)':10000,
        '_-Сушка трав (килограмм)':1,
        '|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Зелень петрушки сушёная (килограмм)'] = {
        'Зелень петрушки отборная (грамм)':6000,
        '_-Сушка трав (килограмм)':1,
        '|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Зелень укропа сушёная (килограмм)'] = {
        'Зелень укропа отборная (грамм)':7000,
        '_-Сушка трав (килограмм)':1,
        '|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Зелень сельдерея сушёная (килограмм)'] = {
        'Зелень сельдерея (грамм)':7000,
        '_-Сушка трав (килограмм)':1,
        '|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Крапива сушёная (килограмм)'] = {
        'Крапива отборная (грамм)':7000,
        '_-Сушка трав (килограмм)':1,
        '|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Лаванда сушёная (килограмм)'] = {
        'Лаванда отборная (грамм)':7000,
        '_-Сушка трав (килограмм)':1,
        '|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Чабрец сушёный (килограмм)'] = {
        'Чабрец отборный (грамм)':7000,
        '_-Сушка трав (килограмм)':1,
        '|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Фенхель сушёный (килограмм)'] = {
        'Фенхель отборный (грамм)':7000,
        '_-Сушка трав (килограмм)':1,
        '|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Таволга сушёная (килограмм)'] = {
        'Таволга отборная (грамм)':7000,
        '_-Сушка трав (килограмм)':1,
        '|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Мята сушёная (килограмм)'] = {
        'Мята отборная (грамм)':7000,
        '_-Сушка трав (килограмм)':1,
        '|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Зверобой сушёный (килограмм)'] = {
        'Зверобой отборный (грамм)':7000,
        '_-Сушка трав (килограмм)':1,
        '|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Ромашка сушёная (килограмм)'] = {
        'Ромашка отборная (грамм)':7000,
        '_-Сушка трав (килограмм)':1,
        '|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Клевер сушёный (килограмм)'] = {
        'Клевер отборный (грамм)':7000,
        '_-Сушка трав (килограмм)':1,
        '|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Одуванчик сушёный (килограмм)'] = {
        'Одуванчик чищеный (грамм)':7000,
        '_-Сушка трав (килограмм)':1,
        '|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Лист смородины сушёный (килограмм)'] = {
        'Лист смородины (грамм)':7000,
        '_-Сушка трав (килограмм)':1,
        '|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Лавровый лист сушёный (килограмм)'] = {
        'Лист лавра (грамм)':7000,
        '_-Сушка трав (килограмм)':1,
        '|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Базилик сушёный (килограмм)'] = {
        'Лист базилика (грамм)':8000,
        '_-Сушка трав (килограмм)':1,
        '|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Бадьян сушёный (килограмм)'] = {
        'Бадьян (килограмм)':8,
        '_-Сушка трав (килограмм)':1,
        '|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Душица сушёная (килограмм)'] = {
        'Душица (килограмм)':8,
        '_-Сушка трав (килограмм)':1,
        '|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Мята сушёная (килограмм)'] = {
        'Мята (килограмм)':8,
        '_-Сушка трав (килограмм)':1,
        '|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Тимьян сушёный (килограмм)'] = {
        'Тимьян (килограмм)':8,
        '_-Сушка трав (килограмм)':1,
        '|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Майоран сушёный (килограмм)'] = {
        'Майоран (килограмм)':8,
        '_-Сушка трав (килограмм)':1,
        '|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Майоран сушёный (килограмм)'] = {
        'Майоран (килограмм)':8,
        '_-Сушка трав (килограмм)':1,
        '|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Розмарин сушёный (килограмм)'] = {
        'Розмарин (килограмм)':8,
        '_-Сушка трав (килограмм)':1,
        '|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Шалфей сушёный (килограмм)'] = {
        'Шалфей (килограмм)':8,
        '_-Сушка трав (килограмм)':1,
        '|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Шафран сушёный (килограмм)'] = {
        # Килограмм рылец шафрана = 80 000 цветов
        # Много ручной работы -- 2-12 тысяч евро/килограмм (2016 год)
        'Цветы шафрана (килограмм)':1000,
        '_-Перебор трав (килограмм)':1000,
        '_-Сушка трав (килограмм)':1,
        '|=Бочка импортных пряностей (килограмм)':1,
        }

metadict_detail['Гвоздика сушёная (килограмм)'] = {
        'Гвоздика (килограмм)':8,
        '_-Сушка трав (килограмм)':1,
        '|=Бочка импортных пряностей (килограмм)':1,
        }

metadict_detail['Перец душистый сушёный (килограмм)'] = {
        'Плоды пименты лекарственной (килограмм)':8,
        '_-Сушка фруктов (килограмм)':1,
        '|=Бочка импортных пряностей (килограмм)':1,
        }

metadict_detail['Перец красный сушёный (килограмм)'] = {
        'Стручки красного перца (килограмм)':8,
        '_-Сушка трав (килограмм)':1,
        '|=Бочка импортных пряностей (килограмм)':1,
        }

metadict_detail['Перец чёрный сушёный (килограмм)'] = {
        'Плоды чёрного перца (килограмм)':8,
        '_-Сушка трав (килограмм)':1,
        '|=Бочка импортных пряностей (килограмм)':1,
        }

#----
# Ингредиенты (дрожжевое брожение, заварка):

metadict_detail['Тесто пряничное медовое заварное (килограмм)'] = {
        # http://www.hleb.net/prjanik/350/index-r.html#medovyeprjaniki
        'Мука пшеничная (грамм)':560,
        'Сахар-песок (грамм)':111,
        'Мёд жидкий (грамм)':390,
        'Вода кипячёная (грамм)':111,
        '_-Заваривание пряничного теста (килограмм)':1,
        }

metadict_detail['Тесто ржаное на закваске (килограмм)'] = {
        # http://www.borodinsky.com/istruk/instruk5/innstruk5.html
        # https://mariana-aga.livejournal.com/222615.html
        # https://registrr.livejournal.com/26134.html
        # ТЕСТО (1,5 – 2 часа при 28-30С):
        'Опара ржаная (грамм)':700,
        'Мука ржаная (грамм)':210,
        'Вода для готовки (грамм)':90,
        'Соль поваренная (грамм)':8.8,
        #'Патока (грамм)':5.9,
        '_-Приготовление ржаного теста на закваске (килограмм)':1,
        }

metadict_detail['Опара ржаная (килограмм)'] = {
        # ОПАРА (3-3,5 часа при 28-30С):
        'Закваска ржаная (грамм)':220,
        'Заварка ржаная (грамм)':500,
        'Мука ржаная (грамм)':280,
        }

metadict_detail['Заварка ржаная (килограмм)'] = {
        # ЗАВАРКА (1,5 -2 часа при 63-65С):
        'Мука ржаная (грамм)':170,
        'Солод ржаной (грамм)':120,
        'Вода для готовки (грамм)':710,
        'Семена тмина (грамм)':1.7,
        }

metadict_detail['Закваска ржаная (килограмм)'] = {
        # ЗАКВАСКА (3-4 часа при 25-28С):
        'Мука ржаная (грамм)':500,
        'Вода для готовки (грамм)':500,
        }

metadict_detail['Опара овсяная (килограмм)'] = {
        # Исправить
            # Уточни рецепт
            # http://rus-food-recipes.ru/P_00/10/53.htm
            # http://www.povarenok.ru/recipes/show/41567/
            # https://2ch.hk/di/res/62449.html
        # Заготовка для овсяного киселя.
        'Крупа овсяная (грамм)':350,
        'Вода для готовки (грамм)':650,
        '_-Приготовление овсяной опары (килограмм)':1,
        }

metadict_detail['Тесто пшенично-овсяное для оладий (килограмм)'] = {
        # https://www.seriouseats.com/recipes/2016/05/fluffy-vegan-oatmeal-pancakes-recipe-aquafaba.html
        'Мука овсяная (грамм)':180,
        'Мука пшеничная (грамм)':180,
        'Соль поваренная (грамм)':5,
        'Сахар-песок (грамм)':70,
        'Сода пищевая (грамм)':7,
        'Уксус яблочный 6% (грамм)':10,
        'Аквафаба чечевичная (грамм)':70,
        'Масло подсолнечное (грамм)':70,
        'Напиток овсяной (грамм)':420,
        '_-Замешивание бездрожжевого теста (килограмм)':1,
        }

metadict_detail['Тесто кукурузное для оладий (килограмм)'] = {
        'Мука кукурузная (грамм)':360,
        'Масло оливковое (грамм)':100,
        'Соль поваренная (грамм)':5,
        'Сода пищевая (грамм)':7,
        'Уксус яблочный 6% (грамм)':10,
        'Аквафаба чечевичная (грамм)':100,
        'Вода кипячёная (грамм)':420,
        '_-Замешивание бездрожжевого теста (килограмм)':1,
        }

metadict_detail['Тесто пшенично-кукурузное для маффинов (килограмм)'] = {
        # https://www.asaucykitchen.com/vegan-cornbread-muffins-aquafaba/
        'Мука кукурузная (грамм)':180,
        'Мука пшеничная (грамм)':180,
        'Соль поваренная (грамм)':5,
        'Сахар-песок (грамм)':70,
        'Сода пищевая (грамм)':7,
        'Уксус яблочный 6% (грамм)':10,
        'Аквафаба чечевичная (грамм)':70,
        'Масло подсолнечное (грамм)':70,
        'Напиток рисовый (грамм)':420,
        '_-Замешивание бездрожжевого теста (килограмм)':1,
        }

metadict_detail['Тесто пшеничное бездрожжевое для пирогов (килограмм)'] = {
        'Мука пшеничная (грамм)':300,
        'Сахар-песок (грамм)':200,
        'Соль поваренная (грамм)':5,
        'Сода пищевая (грамм)':6,
        'Уксус яблочный 6% (грамм)':10,
        'Масло подсолнечное (грамм)':100,
        'Аквафаба чечевичная (грамм)':200,
        'Вода для готовки (грамм)':200,
        '_-Замешивание бездрожжевого теста (килограмм)':1,
        }

metadict_detail['Тесто пшеничное бездрожжевое для лапши (килограмм)'] = {
        'Мука пшеничная (грамм)':700,
        'Соль поваренная (грамм)':5,
        'Вода для готовки (грамм)':300,
        '_-Замешивание бездрожжевого теста (килограмм)':1,
        }

metadict_detail['Тесто пшеничное дрожжевое (килограмм)'] = {
        # http://hlebinfo.ru/pshenichnyiy-hleb-iz-muki-1-sorta.html
        # http://www.eda5.ru/recipes/pastry/bread_pastry/
        'Мука пшеничная (грамм)':625,
        'Вода для готовки (грамм)':375,
        'Дрожжи жидкие (грамм)':50,
        'Соль поваренная (грамм)':2.5,
        '_-Приготовление пшеничного дрожжевого теста (килограмм)':1,
        }

metadict_detail['Тесто пшеничное дрожжевое для пирогов (килограмм)'] = {
        # http://kuking.net/my/viewtopic.php?p=987050#987050
        # http://interdoka.ru/kulinaria/1982/16_muchnie/2_izdelia/1.html
        # Вместо яиц пони используют льняную муку.
        'Опара пшеничная (грамм)':438,
        'Мука пшеничная (грамм)':352,
        'Сахар-песок (грамм)':44,
        'Соль поваренная (грамм)':8,
        'Вода для готовки (грамм)':20,
        'Масло подсолнечное (грамм)':69,
        'Аквафаба чечевичная (грамм)':69,
        '_-Приготовление пшеничного дрожжевого теста (килограмм)':1,
        }

metadict_detail['Тесто пшеничное для пончиков (килограмм)'] = {
        'Опара пшеничная (грамм)':400,
        'Мука пшеничная (грамм)':250,
        'Сахар-песок (грамм)':50,
        'Соль поваренная (грамм)':5,
        'Масло подсолнечное (грамм)':100,
        'Аквафаба чечевичная (грамм)':50,
        'Вода для готовки (грамм)':150,
        '_-Приготовление пшеничного дрожжевого теста (килограмм)':1,
        }

metadict_detail['Тесто пшенично-кукурузное дрожжевое (килограмм)'] = {
        # Исправить
            # Уточни, проверь. Делай по рецептурам, блин!
            # И вообще, лучше уж простые маисовые лепёшки.
        'Опара пшеничная (грамм)':235,
        'Мука кукурузная (грамм)':300,
        'Мука пшеничная (грамм)':100,
        'Вода для готовки (грамм)':230,
        'Аквафаба чечевичная (грамм)':100,
        'Соль поваренная (грамм)':10,
        'Сахар-песок (грамм)':25,
        '_-Приготовление пшеничного дрожжевого теста (килограмм)':1,
        }

metadict_detail['Тесто пшенично-соевое дрожжевое (килограмм)'] = {
        'Опара пшеничная (грамм)':235,
        'Мука соевая (грамм)':300,
        'Мука пшеничная (грамм)':100,
        'Вода для готовки (грамм)':230,
        'Аквафаба чечевичная (грамм)':100,
        'Соль поваренная (грамм)':10,
        'Сахар-песок (грамм)':25,
        '_-Приготовление пшеничного дрожжевого теста (килограмм)':1,
        }

metadict_detail['Тесто пшенично-ячменное дрожжевое (килограмм)'] = {
        # https://www.hlebomoli.ru/blog/yachmennyy-hleb-i-dakos
        'Опара пшеничная (грамм)':235,
        'Мука ячменная (грамм)':250,
        'Мука ржаная (грамм)':50,
        'Мука пшеничная (грамм)':100,
        'Вода для готовки (грамм)':330,
        'Соль поваренная (грамм)':10,
        'Мёд жидкий (грамм)':25,
        '_-Приготовление пшеничного дрожжевого теста (килограмм)':1,
        }

metadict_detail['Тесто пшенично-гречневое для блинов (килограмм)'] = {
        # http://www.molohovetc.ru/otdel_xv/1659_postnye_russkie_bliny/
        'Опара пшенично-гречневая (грамм)':600,
        'Мука пшеничная (грамм)':150,
        'Сахар-песок (грамм)':7,
        'Соль поваренная (грамм)':7,
        'Вода кипячёная (грамм)':250,
        '_-Приготовление пшеничного дрожжевого теста (килограмм)':1,
        }

metadict_detail['Опара пшенично-гречневая (килограмм)'] = {
        # Исправить
            # Уточнить
        'Вода кипячёная (грамм)':450,
        'Мука пшеничная (грамм)':250,
        'Мука гречневая (грамм)':250,
        'Дрожжи жидкие (грамм)':50,
        }

metadict_detail['Опара пшеничная (килограмм)'] = {
        # Готовится 210 минут при +30°C
        'Вода для готовки (грамм)':300,
        'Мука пшеничная (грамм)':650,
        'Дрожжи жидкие (грамм)':50,
        }

metadict_detail['Дрожжи жидкие (килограмм)'] = {
        # Дрожжи у пекарей свои, причём весьма паршивые
            # http://www.libussr.ru/doc_ussr/usr_12090.htm
        'Сахар-песок (грамм)':50,
        'Солод пшеничный (грамм)':150,
        'Вода для готовки (грамм)':800,
        }

#----
# Ингредиенты (спиртовое брожение):

metadict_detail['Уксус яблочный 6% (килограмм)'] = {
        'Сидр яблочный (грамм)':1000,
        '_-Производство яблочного уксуса (килограмм)':1,
        '|=Бочка яблочного уксуса (килограмм)':1,
        'Сидр яблочный (окисление/грамм)':1000,
        }

metadict_detail['Уксус виноградный 6% (килограмм)'] = {
        'Вино красное сухое (грамм)':1000,
        '_-Производство виноградного уксуса (килограмм)':1,
        '|=Бочка виноградного уксуса (килограмм)':1,
        'Вино красное сухое (окисление/грамм)':1000,
        }

#----
# Готовые блюда (фабричные):

metadict_detail['Шоколад горький (килограмм)'] = {
        # Исправить
            # Весь раздел допилить.
            # http://thermalinfo.ru/svojstva-produktov/kulinariya-i-hleb/svojstva-shokolada-i-kakao
        'Какао-порошок (килограмм)':0.45,
        'Какао-масло (килограмм)':0.23,
        'Сахар-песок (килограмм)':0.32,
        '_-Производство горького шоколада (килограмм)':1,
        }

metadict_detail['Шоколад ванильный (килограмм)'] = {
        # "Рецептуры на шоколад, шоколадные изделия и какао порошок" 1968 год СССР:
        'Какао-порошок (килограмм)':0.199,
        'Какао-масло (килограмм)':0.281,
        'Сахар-песок (килограмм)':0.536,
        'Ваниль молотая (грамм)':0.3,
        '_-Производство горького шоколада (килограмм)':1,
        }

metadict_detail['Шоколад с изюмом (килограмм)'] = {
        'Какао-порошок (килограмм)':0.189,
        'Какао-масло (килограмм)':0.165,
        'Сахар-песок (килограмм)':0.359,
        'Виноград сушёный (килограмм)':0.296,
        'Ваниль молотая (грамм)':0.3,
        '_-Производство горького шоколада (килограмм)':1,
        }

metadict_detail['Печенье овсяное (килограмм)'] = {
        # http://penzafood.com/izdeliya/ovsyanoe-pechene.html
        # Исправить
            # Сделать тесто.
            # Перевести в граммы.
        'Мука пшеничная (килограмм)':0.294,
        'Мука овсяная (килограмм)':0.126,
        'Сахар-песок (килограмм)':0.371,
        'Масло соевое (килограмм)':0.137,
        'Виноград сушёный (килограмм)':0.042,
        'Корица молотая (грамм)':0.7,
        'Ваниль молотая (грамм)':0.5,
        'Сода пищевая (грамм)':2.5,
        'Соль поваренная (грамм)':3.8,
        '_-Выпечка овсяного печенья (килограмм)':1,
        }

metadict_detail['Чай травяной (килограмм)'] = {
        'Вода кипячёная (грамм)':1000,
        'Травяной сбор (грамм)':10,
        '_-Заваривание чая (литр)':1,
        }

metadict_detail['Чай одуванчиковый (килограмм)'] = {
        'Вода кипячёная (грамм)':1000,
        'Одуванчик сушёный (грамм)':10,
        '_-Заваривание чая (литр)':1,
        }

metadict_detail['Чай из листьев смородины (килограмм)'] = {
        'Вода кипячёная (грамм)':1000,
        'Лист смородины сушёный (грамм)':10,
        'Мята сушёная (грамм)':5,
        '_-Заваривание чая (литр)':1,
        }

metadict_detail['Чай чёрный (килограмм)'] = {
        'Вода кипячёная (грамм)':1000,
        'Сушёные чайные листья (грамм)':12,
        '_-Заваривание чая (литр)':1,
        }

metadict_detail['Кофе (килограмм)'] = {
        'Вода кипячёная (грамм)':1000,
        'Кофе молотый (грамм)':30,
        '_-Приготовление кофе (грамм)':1000,
        }

#----
# Полуфабрикаты, заменители:

metadict_detail['Масло подсолнечное (килограмм)'] = {
        # Исправить
            # Весь раздел допилить.
        'Семена подсолнечника (килограмм)':3,
        '_-Производство подсолнечного масла (килограмм)':1,
        '|=Бочка подсолнечного масла (килограмм)':1,
        }

metadict_detail['Масло оливковое (килограмм)'] = {
        'Оливки (килограмм)':10,
        '_-Производство оливкового масла (килограмм)':1,
        '|=Бочка оливкового масла (килограмм)':1,
        }

metadict_detail['Масло льняное (килограмм)'] = {
        'Семена льна (килограмм)':4,
        '_-Производство льняного масла (килограмм)':1,
        '|=Бочка льняного масла (килограмм)':1,
        }

metadict_detail['Масло кунжутное (килограмм)'] = {
        'Семена кунжута (килограмм)':3,
        '_-Производство кунжутного масла (килограмм)':1,
        '|=Бочка кунжутного масла (килограмм)':1,
        }

metadict_detail['Масло конопляное (килограмм)'] = {
        # http://www.molohovetc.ru/xlvii/3597/
        'Семена конопли (килограмм)':4,
        '_-Производство конопляного масла (килограмм)':1,
        '|=Бочка конопляного масла (килограмм)':1,
        }

metadict_detail['Масло соевое (килограмм)'] = {
        'Бобы соевые неочищенные (килограмм)':10,
        '_-Производство соевого масла (килограмм)':1,
        '|=Бочка соевого масла (килограмм)':1,
        }

metadict_detail['Масло арахисовое (килограмм)'] = {
        # Исправить
            # На самом деле пони едят арахисовую пасту
            # Убрать, или переделать. Не используется
        'Паста арахисовая (килограмм)':2.2,
        '_-Производство арахисового масла (килограмм)':1,
        '|=Бочка арахисового масла (килограмм)':1,
        }

metadict_detail['Сироп кленовый (килограмм)'] = {
        'Сок кленовый (килограмм)':40,
        '_-Выварка кленового сиропа (килограмм)':1,
        '|=Бочка кленового сиропа (килограмм)':1,
        }

metadict_detail['Мёд жидкий (килограмм)'] = {
        'Мёд луговой (килограмм)':1,
        '_-Упаковка мёда в бочки (килограмм)':1,
        '|=Бочка мёда (килограмм)':1,
        }

metadict_detail['Какао-порошок (килограмм)'] = {
        # Исправить
            # Из-за этой фигни плантации какао-бобов удваиваются.
            # А что делать? Введём коэффициент 0.5
        'Какао-бобы сухие (килограмм)':4 * 0.5,
        '_-Производство какао-порошка (килограмм)':1,
        '|=Бочка какао-порошка (килограмм)':1,
        }

metadict_detail['Какао-масло (килограмм)'] = {
        'Какао-бобы сухие (килограмм)':4 * 0.5,
        '_-Производство масла какао (килограмм)':1,
        '|=Бочка какао-масла (килограмм)':1,
        }

metadict_detail['Сахар-песок (килограмм)'] = {
        # Иногда заменяется мёдом. На самом деле нет.
        'Сахар тростниковый (килограмм)':1,
        }

metadict_detail['Сахар тростниковый (килограмм)'] = {
        'Сахар тростниковый-сырец (килограмм)':1.1,
        '_-Производство рафинированного сахара (килограмм)':1,
        '|=Бочка тростникового сахара (килограмм)':1,
        }

metadict_detail['Сахар тростниковый-сырец (килограмм)'] = {
        # Примитивный техпроцесс, из 10% сахарозы в стеблях извлекают только 5% сахара.
            # https://carbofood.ru/sugar-technology/saxarnyj-trostnik-texnologiya
        'Сахарный тростник (килограмм)':1/0.05,
        'Известь свежегашёная (килограмм)':0.0035,
        '_-Производство тростникового сахара-сырца (килограмм)':1,
        '|=Бочка тростникового сахара-сырца (килограмм)':1,
        }

metadict_detail['Крупа овсяная (килограмм)'] = {
        'Зерно овса (килограмм)':1.3,
        '_-Производство овсяной крупы (килограмм)':1,
        '|=Бочка овсяной крупы (килограмм)':1,
        }

metadict_detail['Крупа гречневая (килограмм)'] = {
        'Зерно гречихи посевной (килограмм)':1.3,
        '_-Чистка и обжарка гречихи (килограмм)':1,
        '|=Бочка гречневой крупы (килограмм)':1,
        }

metadict_detail['Крупа ячневая (килограмм)'] = {
        'Зерно ячменя (килограмм)':1.3,
        '_-Дробление крупы (килограмм)':1,
        '|=Бочка ячневой крупы (килограмм)':1,
        }

metadict_detail['Рис шлифованный (килограмм)'] = {
        'Зерно риса посевного (килограмм)':1.3,
        '_-Чистка и шлифование риса (килограмм)':1,
        '|=Бочка риса шлифованного (килограмм)':1,
        }

metadict_detail['Бобы соевые (килограмм)'] = {
        'Бобы соевые неочищенные (килограмм)':1.3,
        '_-Чистка соевых бобов (килограмм)':1,
        '|=Бочка соевых бобов (килограмм)':1,
        }

metadict_detail['Горох сухой (килограмм)'] = {
        'Горох посевной в стручках (килограмм)':1.3,
        '_-Чистка и сушка гороха (килограмм)':1,
        '|=Бочка сухого гороха (килограмм)':1,
        }

metadict_detail['Фасоль сухая (килограмм)'] = {
        'Фасоль в стручках (килограмм)':1.3,
        '_-Чистка и сушка фасоли (килограмм)':1,
        '|=Бочка сухой фасоли (килограмм)':1,
        }

metadict_detail['Чечевица сухая (килограмм)'] = {
        'Чечевица в стручках (килограмм)':1.3,
        '_-Чистка и сушка чечевицы (килограмм)':1,
        '|=Бочка сухой чечевицы (килограмм)':1,
        }

metadict_detail['Ваниль молотая (килограмм)'] = {
        # Сушёные стручки ванили:
            # Очень сложная в выращивании, дорогая пряность.
            # https://ru.wikisource.org/wiki/ЭСБЕ/Ваниль
            # https://ru.wikipedia.org/wiki/Ваниль_(пряность)
        'Стручки ванили (килограмм)':2,
        '_-Ферментизация и сушка стручков ванили (килограмм)':1,
        '|=Бочка сухой ванили (килограмм)':1,
        }

metadict_detail['Перец красный (килограмм)'] = {
        'Стручки красного перца (килограмм)':3,
        '_-Сушка красного перца (килограмм)':1,
        }

metadict_detail['Какао-бобы сухие (килограмм)'] = {
        # ВЛИЯНИЕ ФЕРМЕНТАЦИИ И СУШКИ НА КАЧЕСТВО КАКАО БОБОВ:
            # http://bibliotekar.ru/5-kakao/4.htm
            # После обработки какао бобы теряют 50% массы (плюс оболочка 50%)
        # https://ru.wikisource.org/wiki/ЭСБЕ/Какао
        'Плоды дерева какао (килограмм)':1 / 0.5 / 0.5,
        '_-Ферметизация и сушка какао-бобов (килограмм)':1,
        '|=Бочка какао-бобов (килограмм)':1,
        }

metadict_detail['Мука кукурузная (килограмм)'] = {
        'Зерно кукурузы (килограмм)':1.3,
        '_-Помол кукурузной муки (килограмм)':1,
        '|=Бочка кукурузной муки (килограмм)':1,
        }

metadict_detail['Крупа кукурузная (килограмм)'] = {
        'Зерно кукурузы (килограмм)':1.3,
        '_-Дробление кукурузных зёрен (килограмм)':1,
        '|=Бочка кукурузной крупы (килограмм)':1,
        }

metadict_detail['Мука пшеничная (килограмм)'] = {
        # Пшеница при помоле теряет 25% веса.
        'Зерно пшеницы (килограмм)':1.25,
        '_-Помол пшеничной муки (килограмм)':1,
        '|=Бочка пшеничной муки (килограмм)':1,
        }

metadict_detail['Мука ржаная (килограмм)'] = {
        'Зерно ржи (килограмм)':1.25,
        '_-Помол ржаной муки (килограмм)':1,
        '|=Бочка ржаной муки (килограмм)':1,
        }

metadict_detail['Мука овсяная (килограмм)'] = {
        'Зерно овса (килограмм)':1.25,
        '_-Помол овсяной муки (килограмм)':1,
        '|=Бочка овсяной муки (килограмм)':1,
        }

metadict_detail['Мука льняная (килограмм)'] = {
        'Семена льна (килограмм)':1.25,
        '_-Помол льняной муки (килограмм)':1,
        '|=Бочка льняной муки (килограмм)':1,
        }

metadict_detail['Мука соевая (килограмм)'] = {
        # Исправить
            # Хм, пони используют соевое масло.
            # Поэтому мука в основном обезжиренная.
        'Бобы соевые (килограмм)':1.25,
        '_-Помол соевой муки (килограмм)':1,
        '|=Бочка соевой муки (килограмм)':1,
        }

metadict_detail['Солод пшеничный (килограмм)'] = {
        # Крупноразмолотые проросшие зёрна пшеницы.
        'Зерно пшеницы (килограмм)':1.25,
        '_-Производство пшеничного солода (килограмм)':1,
        '|=Бочка пшеничного солода (килограмм)':1,
        }

metadict_detail['Солод ржаной (килограмм)'] = {
        'Зерно ржи (килограмм)':1.25,
        '_-Производство ржаного солода (килограмм)':1,
        '|=Бочка ржаного солода (килограмм)':1,
        }

metadict_detail['Кофе молотый (килограмм)'] = {
        'Кофейные зёрна (килограмм)':1,
        '_-Жарение и помол кофе (килограмм)':1,
        }

metadict_detail['Кофейные зёрна (килограмм)'] = {
        'Плоды кофейного дерева (килограмм)':3,
        '|=Бочка кофейных зёрен (килограмм)':1,
        }

metadict_detail['Горчичный порошок (килограмм)'] = {
        # http://www.molohovetc.ru/xlvii/3588/
        'Семена горчицы белой (килограмм)':1.5,
        '_-Помол семян горчицы (килограмм)':1,
        '|=Бочка сухой горчицы (килограмм)':1,
        }

metadict_detail['Сушёные чайные листья (килограмм)'] = {
        'Чайные листья (килограмм)':4,
        '_-Сушка чайных листьев (килограмм)':1,
        '|=Бочка сушёных чайных листьев (килограмм)':1,
        }

#----
# Ингредиенты (чистка):

metadict_detail['Ростки соевые (килограмм)'] = {
        'Бобы соевые неочищенные (килограмм)':1,
        'Вода для готовки (грамм)':2000,
        '_-Проращивание сои (килограмм)':1,
        '_-Перебор трав (килограмм)':1,
        }

metadict_detail['Боровики чищеные (килограмм)'] = {
        # Расчеты производительности и количества персонала для овощного цеха:
            # https://www.pitportal.ru/chef2010/10921.html
        'Боровики (килограмм)':1 / (1 - 0.25),
        '_-Чистка грибов (килограмм)':1,
        }

metadict_detail['Брокколи чищеные (килограмм)'] = {
        'Брокколи (килограмм)':1 / (1 - 0.25),
        '_-Чистка овощей (килограмм)':1,
        }

metadict_detail['Артишоки чищеные (килограмм)'] = {
        'Артишоки (килограмм)':1 / (1 - 0.25),
        '_-Чистка овощей (килограмм)':1,
        }

metadict_detail['Груша чищеная (килограмм)'] = {
        'Груша (килограмм)':1 / (1 - 0.25),
        '_-Чистка фруктов (килограмм)':1,
        }

metadict_detail['Картофель чищеный (килограмм)'] = {
        # Физико-механические свойства картофеля
            # http://razvitie-pu.ru/?page_id=6639
        'Картофель (килограмм)':1 / (1 - 0.25),
        '_-Чистка корнеплодов (килограмм)':1,
        }

metadict_detail['Батат чищеный (килограмм)'] = {
        'Батат (килограмм)':1 / (1 - 0.25),
        '_-Чистка корнеплодов (килограмм)':1,
        }

metadict_detail['Перец сладкий чищеный (килограмм)'] = {
        'Перец сладкий (килограмм)':1 / (1 - 0.25),
        '_-Чистка овощей (килограмм)':1,
        }

metadict_detail['Кабачок чищеный (килограмм)'] = {
        'Кабачок (килограмм)':1 / (1 - 0.25),
        '_-Чистка овощей (килограмм)':1,
        }

metadict_detail['Баклажан чищеный (килограмм)'] = {
        # Исправить
            # Вообще-то баклажаны не чистят.
        'Баклажан (килограмм)':1 / (1 - 0.25),
        '_-Чистка овощей (килограмм)':1,
        }

metadict_detail['Корень петрушки чищеный (килограмм)'] = {
        'Петрушка (килограмм)':1 / (1 - 0.25),
        '_-Чистка корнеплодов (килограмм)':1,
        }

metadict_detail['Лук чищеный (килограмм)'] = {
        'Лук репчатый (килограмм)':1 / (1 - 0.25),
        '_-Чистка корнеплодов (килограмм)':1,
        }

metadict_detail['Морковь чищеная (килограмм)'] = {
        'Морковь (килограмм)':1 / (1 - 0.25),
        '_-Чистка корнеплодов (килограмм)':1,
        }

metadict_detail['Одуванчик чищеный (килограмм)'] = {
        'Одуванчик (килограмм)':1 / (1 - 0.25),
        '_-Чистка овощей (килограмм)':1,
        }

metadict_detail['Орешки кедровые (килограмм)'] = {
        # Исправить
            # Уточнить содержание орешков в шишках
        'Орешки кедровые в шишках (килограмм)':1 / (1 - 0.70),
        '_-Чистка орехов (килограмм)':1,
        }

metadict_detail['Орех карии чищенный (килограмм)'] = {
        'Орех карии (килограмм)':1 / (1 - 0.25),
        '_-Чистка орехов (килограмм)':1,
        }

metadict_detail['Орех пекана чищенный (килограмм)'] = {
        'Орех пекана (килограмм)':1 / (1 - 0.25),
        '_-Чистка орехов (килограмм)':1,
        }

metadict_detail['Арахис чищеный (килограмм)'] = {
        # Массовая доля шелухи: от 15 до 47%
        'Арахис в стручках (килограмм)':1 / (1 - 0.25),
        '_-Чистка орехов (килограмм)':1,
        '|=Бочка арахиса (килограмм)':1,
        }

metadict_detail['Репа чищеная (килограмм)'] = {
        'Репа (килограмм)':1 / (1 - 0.25),
        '_-Чистка корнеплодов (килограмм)':1,
        }

metadict_detail['Брюква чищеная (килограмм)'] = {
        'Брюква (килограмм)':1 / (1 - 0.25),
        '_-Чистка корнеплодов (килограмм)':1,
        }

metadict_detail['Салат-латук чищеный (килограмм)'] = {
        'Латук посевной (килограмм)':1 / (1 - 0.25),
        '_-Чистка овощей (килограмм)':1,
        }

metadict_detail['Свёкла чищеная (килограмм)'] = {
        'Свёкла (килограмм)':1 / (1 - 0.25),
        '_-Чистка корнеплодов (килограмм)':1,
        }

metadict_detail['Ботва свекольная (килограмм)'] = {
        'Свёкла (килограмм)':1 / (1 - 0.25),
        '_-Чистка овощей (килограмм)':1,
        }

metadict_detail['Зелень сельдерея (килограмм)'] = {
        'Сельдерей (килограмм)':1 / (1 - 0.25),
        '_-Чистка овощей (килограмм)':1,
        }

metadict_detail['Стебель сельдерея (килограмм)'] = {
        'Сельдерей (килограмм)':1 / (1 - 0.25),
        '_-Чистка овощей (килограмм)':1,
        }

metadict_detail['Корень сельдерея (килограмм)'] = {
        'Сельдерей (килограмм)':1 / (1 - 0.25),
        '_-Чистка овощей (килограмм)':1,
        }

metadict_detail['Стебель эстрагона (килограмм)'] = {
        'Эстрагон (килограмм)':1 / (1 - 0.25),
        '_-Чистка овощей (килограмм)':1,
        }

metadict_detail['Сморчки чищеные (килограмм)'] = {
        'Сморчки (килограмм)':1 / (1 - 0.25),
        '_-Чистка грибов (килограмм)':1,
        }

metadict_detail['Спаржа чищеная (килограмм)'] = {
        'Спаржа (килограмм)':1 / (1 - 0.25),
        '_-Чистка овощей (килограмм)':1,
        }

metadict_detail['Тыква чищеная (килограмм)'] = {
        'Тыква (килограмм)':1 / (1 - 0.25),
        '_-Чистка овощей (килограмм)':1,
        }

metadict_detail['Чеснок чищеный (килограмм)'] = {
        'Чеснок (килограмм)':1 / (1 - 0.25),
        '_-Чистка овощей (килограмм)':1,
        }

metadict_detail['Яблоко чищеное (килограмм)'] = {
        'Яблоко (килограмм)':1 / (1 - 0.25),
        '_-Чистка фруктов (килограмм)':1,
        }

metadict_detail['Арбуз чищеный (килограмм)'] = {
        'Арбуз (килограмм)':1 / (1 - 0.25),
        '_-Чистка фруктов (килограмм)':1,
        }

metadict_detail['Дыня чищеная (килограмм)'] = {
        'Дыня (килограмм)':1 / (1 - 0.25),
        '_-Чистка фруктов (килограмм)':1,
        }

metadict_detail['Оливки чищеные (килограмм)'] = {
        'Оливки (килограмм)':1 / (1 - 0.25),
        '_-Чистка фруктов (килограмм)':1,
        }

metadict_detail['Капуста чищеная (килограмм)'] = {
        'Капуста белокочанная (килограмм)':1 / (1 - 0.20),
        '_-Чистка овощей (килограмм)':1,
        }

metadict_detail['Кукуруза чищеная (килограмм)'] = {
        'Зерно кукурузы (килограмм)':1 / (1 - 0.1),
        '_-Чистка овощей (килограмм)':1,
        }

#----
# Ингредиенты (обмолот дикоросов):

metadict_detail['Семена тмина (килограмм)'] = {
        'Плоды тмина (килограмм)':1 / 0.33,
        '_-Обмолот пряных растений (килограмм)':1,
        '|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Семена зиры (килограмм)'] = {
        'Плоды зиры (килограмм)':1 / 0.33,
        '_-Обмолот пряных растений (килограмм)':1,
        '|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Семена аниса (килограмм)'] = {
        'Анис (килограмм)':1 / 0.25,
        '_-Обмолот пряных растений (килограмм)':1,
        '|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Семена фенхеля (килограмм)'] = {
        'Фенхель (килограмм)':1 / 0.25,
        '_-Обмолот пряных растений (килограмм)':1,
        '|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Семена фенугрека (килограмм)'] = {
        'Фенугрек (килограмм)':1 / 0.25,
        '_-Обмолот пряных растений (килограмм)':1,
        '|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Семена кардамона (килограмм)'] = {
        'Кардамон (килограмм)':1 / 0.25,
        '_-Обмолот пряных растений (килограмм)':1,
        '|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Семена кориандра (килограмм)'] = {
        'Кориандр (килограмм)':1 / 0.25,
        '_-Обмолот пряных растений (килограмм)':1,
        '|=Бочка местных пряностей (килограмм)':1,
        }

#----
# Ингредиенты (отбор):

metadict_detail['Крупа гречневая отборная (килограмм)'] = {
        'Крупа гречневая (килограмм)':1 / (1 - 0.05),
        '_-Перебор крупы (килограмм)':1,
        }

metadict_detail['Корень имбиря (килограмм)'] = {
        'Имбирь (килограмм)':1 / (1 - 0.15),
        '_-Перебор трав (килограмм)':1,
        }

metadict_detail['Корень хрена (килограмм)'] = {
        'Хрен (килограмм)':1 / (1 - 0.15),
        '_-Перебор овощей (килограмм)':1,
        }

metadict_detail['Корень куркумы (килограмм)'] = {
        'Куркума (килограмм)':1 / (1 - 0.15),
        '_-Перебор овощей (килограмм)':1,
        }

metadict_detail['Корица палочкой (килограмм)'] = {
        'Корица (килограмм)':1 / (1 - 0.15),
        '_-Перебор трав (килограмм)':1,
        }

metadict_detail['Лист хрена (килограмм)'] = {
        'Хрен (килограмм)':1 / (1 - 0.15),
        '_-Перебор трав (килограмм)':1,
        }

metadict_detail['Лист базилика (килограмм)'] = {
        'Базилик (килограмм)':1 / (1 - 0.15),
        '_-Перебор трав (килограмм)':1,
        }

metadict_detail['Кресс-салат отборный (килограмм)'] = {
        'Кресс-салат (килограмм)':1 / (1 - 0.15),
        '_-Перебор трав (килограмм)':1,
        }

metadict_detail['Крапива отборная (килограмм)'] = {
        'Крапива (килограмм)':1 / (1 - 0.15),
        '_-Перебор трав (килограмм)':1,
        }

metadict_detail['Щавель отборный (килограмм)'] = {
        'Щавель (килограмм)':1 / (1 - 0.15),
        '_-Перебор трав (килограмм)':1,
        }

metadict_detail['Зелень петрушки отборная (килограмм)'] = {
        'Петрушка (килограмм)':1 / (1 - 0.15),
        '_-Перебор трав (килограмм)':1,
        }

metadict_detail['Зелень кориандра отборная (килограмм)'] = {
        'Кориандр (килограмм)':1 / (1 - 0.15),
        '_-Перебор трав (килограмм)':1,
        }

metadict_detail['Земляника отборная (килограмм)'] = {
        'Земляника (килограмм)':1 / (1 - 0.15),
        '_-Перебор ягод (килограмм)':1,
        }

metadict_detail['Лимон отборный (килограмм)'] = {
        'Лимон (килограмм)':1 / (1 - 0.15),
        '_-Перебор фруктов (килограмм)':1,
        }

metadict_detail['Лук зелёный отборный (килограмм)'] = {
        'Лук репчатый (килограмм)':1 / (1 - 0.15),
        '_-Перебор овощей (килограмм)':1,
        }

metadict_detail['Огурцы отборные (килограмм)'] = {
        'Огурцы (килограмм)':1 / (1 - 0.15),
        '_-Перебор овощей (килограмм)':1,
        }

metadict_detail['Горошек зелёный (килограмм)'] = {
        # Молодой горох сладких сортов.
        'Горох посевной в стручках (килограмм)':1 / (1 - 0.15),
        '_-Перебор овощей (килограмм)':1,
        }

metadict_detail['Смородина отборная (килограмм)'] = {
        'Смородина (килограмм)':1 / (1 - 0.15),
        '_-Перебор ягод (килограмм)':1,
        }

metadict_detail['Малина отборная (килограмм)'] = {
        'Малина (килограмм)':1 / (1 - 0.15),
        '_-Перебор ягод (килограмм)':1,
        }

metadict_detail['Морошка отборная (килограмм)'] = {
        'Морошка (килограмм)':1 / (1 - 0.15),
        '_-Перебор ягод (килограмм)':1,
        }

metadict_detail['Ревень отборный (килограмм)'] = {
        'Ревень (килограмм)':1 / (1 - 0.15),
        '_-Перебор овощей (килограмм)':1,
        }

metadict_detail['Яблоко отборное (килограмм)'] = {
        'Яблоко (килограмм)':1 / (1 - 0.15),
        '_-Перебор фруктов (килограмм)':1,
        }

metadict_detail['Груша отборная (килограмм)'] = {
        'Груша (килограмм)':1 / (1 - 0.15),
        '_-Перебор фруктов (килограмм)':1,
        }

metadict_detail['Томаты отборные (килограмм)'] = {
        'Томаты (килограмм)':1 / (1 - 0.15),
        '_-Перебор овощей (килограмм)':1,
        }

metadict_detail['Зелень укропа отборная (килограмм)'] = {
        'Укроп (килограмм)':1 / (1 - 0.15),
        '_-Перебор трав (килограмм)':1,
        }

metadict_detail['Черника отборная (килограмм)'] = {
        'Черника (килограмм)':1 / (1 - 0.15),
        '_-Перебор ягод (килограмм)':1,
        }

metadict_detail['Вишня отборная (килограмм)'] = {
        'Вишня (килограмм)':1 / (1 - 0.15),
        '_-Перебор ягод (килограмм)':1,
        }

metadict_detail['Виноград отборный (килограмм)'] = {
        'Виноград (килограмм)':1 / (1 - 0.15),
        '_-Перебор ягод (килограмм)':1,
        }

metadict_detail['Слива отборная (килограмм)'] = {
        'Слива (килограмм)':1 / (1 - 0.15),
        '_-Перебор фруктов (килограмм)':1,
        }

metadict_detail['Персик отборный (килограмм)'] = {
        'Персик (килограмм)':1 / (1 - 0.15),
        '_-Перебор фруктов (килограмм)':1,
        }

metadict_detail['Абрикос отборный (килограмм)'] = {
        'Абрикос (килограмм)':1 / (1 - 0.15),
        '_-Перебор фруктов (килограмм)':1,
        }

metadict_detail['Инжир отборный (килограмм)'] = {
        'Инжир (килограмм)':1 / (1 - 0.15),
        '_-Перебор фруктов (килограмм)':1,
        }

metadict_detail['Зверобой отборный (килограмм)'] = {
        'Зверобой (килограмм)':1 / (1 - 0.15),
        '_-Перебор трав (килограмм)':1,
        }

metadict_detail['Клевер отборный (килограмм)'] = {
        'Клевер (килограмм)':1 / (1 - 0.15),
        '_-Перебор трав (килограмм)':1,
        }

metadict_detail['Ромашка отборная (килограмм)'] = {
        'Ромашка (килограмм)':1 / (1 - 0.15),
        '_-Перебор трав (килограмм)':1,
        }

metadict_detail['Таволга отборная (килограмм)'] = {
        'Таволга (килограмм)':1 / (1 - 0.15),
        '_-Перебор трав (килограмм)':1,
        }

metadict_detail['Фенхель отборный (килограмм)'] = {
        'Фенхель (килограмм)':1 / (1 - 0.15),
        '_-Перебор трав (килограмм)':1,
        }

metadict_detail['Чабрец отборный (килограмм)'] = {
        'Чабрец (килограмм)':1 / (1 - 0.15),
        '_-Перебор трав (килограмм)':1,
        }

metadict_detail['Лаванда отборная (килограмм)'] = {
        'Лаванда (килограмм)':1 / (1 - 0.15),
        '_-Перебор трав (килограмм)':1,
        }

metadict_detail['Вёшенки отборные (килограмм)'] = {
        'Вёшенки (килограмм)':1 / (1 - 0.15),
        '_-Перебор грибов (килограмм)':1,
        }

metadict_detail['Шампиньоны отборные (килограмм)'] = {
        'Шампиньоны (килограмм)':1 / (1 - 0.15),
        '_-Перебор грибов (килограмм)':1,
        }

metadict_detail['Морская капуста отборная (килограмм)'] = {
        'Морская капуста (килограмм)':1 / (1 - 0.15),
        '_-Перебор трав (килограмм)':1,
        }
