#----
# Заметки
# Пользуйся регекспами, ёпт!
# %s/        '_Производство \(.*\),/        '_Производство \1,\r        '_Утилизация \1,/gic
# %s/_Утилизация \(.*\)':\(.*\),/_Утилизация \1':\2 * 0.5,/gic

#----
# Здания, отделка:

metadict_detail['|Ковёр соломенный, пол (квадратный метр)'] = {
        # Обновляют каждый год. Недолговечный.
        '||Утварь текстильная (ковёр соломенный) (квадратный метр)':1 / 1,
        }

metadict_detail['|Ковёр джутовый, пол (квадратный метр)'] = {
        '||Утварь текстильная (ковёр джутовый) (квадратный метр)':1 / 10,
        }

metadict_detail['|Ковёр тканевый, пол (квадратный метр)'] = {
        '||Утварь текстильная (ковёр хлопчатый) (квадратный метр)':1 / 10,
        }

metadict_detail['|Шторы водонепроницаемые (квадратный метр)'] = {
        '||Утварь текстильная (шторы 100x100)':1 / 10,
        }

metadict_detail['|Обои, потолок (квадратный метр)'] = {
        # Обновляют в течении 10 лет.
        '||Обои (квадратный метр)':1 / 10,
        }

metadict_detail['|Обои, стены (квадратный метр)'] = {
        '||Обои (квадратный метр)':1 / 10,
        }

metadict_detail['|Паркет, пол (квадратный метр)'] = {
        # Обновляют в течении 20 лет.
        '||Паркет (квадратный метр)':1 / 20,
        }

metadict_detail['|Кафель, пол (квадратный метр)'] = {
        '||Кафель (квадратный метр)':1 / 20,
        }

metadict_detail['|Кафель, стены (квадратный метр)'] = {
        '||Кафель (квадратный метр)':1 / 20,
        }

#----
# Постельное бельё, запасы:

metadict_detail['|Матрац стёганный (вата)'] = {
        }

metadict_detail['|Одеяло лоскутное (вата)'] = {
        }

metadict_detail['|Одеяло стёганное (вата)'] = {
        }

metadict_detail['|Подушка стёганная (вата)'] = {
        }

metadict_detail['|Простыня (парусина)'] = {
        }

metadict_detail['|Простыня (хлопок)'] = {
        }

metadict_detail['|Простыня махровая (хлопок)'] = {
        }

metadict_detail['|Тюфяк (солома)'] = {
        }

#----
# Одежда, обувь, запасы:

metadict_detail['|Ботинки (кирза)'] = {
        }

metadict_detail['|Бушлат (хлопок)'] = {
        }

metadict_detail['|Ветровка (брезент)'] = {
        }

metadict_detail['|Галоши (каучук)'] = {
        }

metadict_detail['|Жакет (хлопок)'] = {
        }

metadict_detail['|Жилет (хлопок)'] = {
        }

metadict_detail['|Жилет (парусина)'] = {
        }

metadict_detail['|Кафтан (хлопок)'] = {
        }

metadict_detail['|Пальто (хлопок)'] = {
        }

metadict_detail['|Пиджак (хлопок)'] = {
        }

metadict_detail['|Платье (хлопок)'] = {
        }

metadict_detail['|Плащ (брезент)'] = {
        }

metadict_detail['|Плащ (хлопок)'] = {
        }

metadict_detail['|Чулки (хлопок)'] = {
        }

metadict_detail['|Чулки (лён)'] = {
        }

metadict_detail['|Туфли (джут)'] = {
        }

metadict_detail['|Туфли (кирза)'] = {
        }

metadict_detail['|Чепчик (лён)'] = {
        }

metadict_detail['|Чепчик (хлопок)'] = {
        }

metadict_detail['|Шапка (хлопок)'] = {
        }

metadict_detail['|Шляпа (солома)'] = {
        }

metadict_detail['|Шляпа (хлопок)'] = {
        }

#----
# Всю эту домашнюю утварь и инструменты потом подсчитаем, когда будет готова денежная система:

metadict_detail['|Бинокль'] = {
        }

metadict_detail['|Блюдо для еды (2 литра)'] = {
        }

metadict_detail['|Блюдце для еды (0.5 литра)'] = {
        }

metadict_detail['|Бункер для раствора (кубометр)'] = {
        }

metadict_detail['|Бучарда штукатурная'] = {
        }

metadict_detail['|Валик для окраски поверхностей'] = {
        }

metadict_detail['|Ванночка с сеткой'] = {
        }

metadict_detail['|Ведро деревянное (10 литров)'] = {
        }

metadict_detail['|Корзина для мусора (10 литров)'] = {
        }

metadict_detail['|Визирки (для определения величины просадок)'] = {
        }

metadict_detail['|Вилы щебёночные'] = {
        }

metadict_detail['|Воронка кухонная'] = {
        }

metadict_detail['|Вышка передвижная сборно-разборная'] = {
        }

metadict_detail['|Гладилка стальная большая'] = {
        }

metadict_detail['|Гладилка стальная малая'] = {
        }

metadict_detail['|Горшок для углей (10 литров)'] = {
        }

metadict_detail['|Горшок печной (1 литр)'] = {
        }

metadict_detail['|Горшок печной (2 литра)'] = {
        }

metadict_detail['|Горшок печной (5 литров)'] = {
        }

metadict_detail['|Дексель (для затёски шпал)'] = {
        }

metadict_detail['|Деревянная бочка (300 литров)'] = {
        }

metadict_detail['|Деревянная кадка (100 литров)'] = {
        }

metadict_detail['|Деревянная кадка (300 литров)'] = {
        }

metadict_detail['|Деревянное ведро (10 литров)'] = {
        }

metadict_detail['|Диван'] = {
        }

metadict_detail['|Лавка'] = {
        }

metadict_detail['|Долото'] = {
        }

metadict_detail['|Домкрат винтовой (10 тонн)'] = {
        }

metadict_detail['|Доска для овощей'] = {
        }

metadict_detail['|Доска для теста'] = {
        }

metadict_detail['|Дрель пневматическая (0.5 кВт)'] = {
        }

metadict_detail['|Дровяная печь (5.5 кВт)'] = {
        }

metadict_detail['|Дровяная печь (2.5 кВт)'] = {
        }

metadict_detail['|Дровяная печь, камин (5.5 кВт)'] = {
        }

metadict_detail['|Дуршлаг кухонный'] = {
        }

metadict_detail['|Душ'] = {
        }

metadict_detail['|Жернова (1-кг/час)'] = {
        }

metadict_detail['|Зеркало'] = {
        }

metadict_detail['|Зеркало (для осмотра рельсов)'] = {
        }

metadict_detail['|Зубило кузнечное'] = {
        }

metadict_detail['|Зубило слесарное'] = {
        }

metadict_detail['|Инвентарные шарнирно-панельные подмостки'] = {
        }

metadict_detail['|Каска строительная'] = {
        }

metadict_detail['|Квашня деревянная (25 литров)'] = {
        }

metadict_detail['|Кельма для каменных работ'] = {
        }

metadict_detail['|Кельма штукатурная'] = {
        }

metadict_detail['|Кирка остроконечная'] = {
        }

metadict_detail['|Кисть маховая'] = {
        }

metadict_detail['|Кисть филенчатая'] = {
        }

metadict_detail['|Кисть флейцовая КФ-62'] = {
        }

metadict_detail['|Кисть-макловица'] = {
        }

metadict_detail['|Кисть-ручник КР-35'] = {
        }

metadict_detail['|Клещи обыкновенные'] = {
        }

metadict_detail['|Клещи шпальные'] = {
        }

metadict_detail['|Ключ путевой рожковый'] = {
        }

metadict_detail['|Ключ торцовый (гаечный)'] = {
        }

metadict_detail['|Ключ торцовый (шурупный)'] = {
        }

metadict_detail['|Ковш деревянный (5 литров)'] = {
        }

metadict_detail['|Ковш для отделочных работ'] = {
        }

metadict_detail['|Ковшик для питья (1 литр)'] = {
        }

metadict_detail['|Когти для щебня'] = {
        }

metadict_detail['|Коловорот (по дереву)'] = {
        }

metadict_detail['|Коловорот (по металлу)'] = {
        }

metadict_detail['|Комод'] = {
        }

metadict_detail['|Сундук'] = {
        }

metadict_detail['|Компрессор винтовой (30 кВт)'] = {
        }

metadict_detail['|Водонагревный котёл (100 кВт)'] = {
        # Материал — сталь
        # Масса 3 тонны
        # Габариты 2x2x2 метра.
        # Топливо — уголь. КПД — 70%
        }

metadict_detail['|Парогенератор (5 кВт)'] = {
        }

metadict_detail['|Радиатор отопления, чугунный (2 кВт)'] = {
        }

metadict_detail['|Котёл чугунный (25 литров)'] = {
        }

metadict_detail['|Котелок чугунный (10 литров)'] = {
        }

metadict_detail['|Кочерга литая'] = {
        }

metadict_detail['|Кран для воды'] = {
        }

metadict_detail['|Кровать двуспальная'] = {
        }

metadict_detail['|Кровать односпальная'] = {
        }

metadict_detail['|Кружка для питья (0.5 литра)'] = {
        }

metadict_detail['|Кружка мерная (для суфляжа)'] = {
        }

metadict_detail['|Кувалда (5 килограмм)'] = {
        }

metadict_detail['|Кувшин глиняный (3 литра)'] = {
        }

metadict_detail['|Кувшин глиняный (5 литров)'] = {
        }

metadict_detail['|Лампа светляковая (1200 Лм)'] = {
        }

metadict_detail['|Лампа светляковая (600 Лм)'] = {
        }

metadict_detail['|Лампа светокристальная (1200 Лм)'] = {
        }

metadict_detail['|Лампа светокристальная (600 Лм)'] = {
        }

metadict_detail['|Линейка для расшивки швов'] = {
        }

metadict_detail['|Линейка измерительная металлическая'] = {
        }

metadict_detail['|Линейка метровая (для измерения неровностей рельсов)'] = {
        }

metadict_detail['|Лом лапчатый'] = {
        }

metadict_detail['|Лом монтажный'] = {
        }

metadict_detail['|Лом остроконечный'] = {
        }

metadict_detail['|Лопата деревянная'] = {
        }

metadict_detail['|Лопата печная'] = {
        }

metadict_detail['|Лопата растворная'] = {
        }

metadict_detail['|Лопата совковая'] = {
        }

metadict_detail['|Лопата суфляжная'] = {
        }

metadict_detail['|Лопата штыковая'] = {
        }

metadict_detail['|Лопатка кухонная'] = {
        }

metadict_detail['|Лупа (для осмотра рельсов)'] = {
        }

metadict_detail['|Метла'] = {
        }

metadict_detail['|Метр металлический'] = {
        }

metadict_detail['|Метр складной металлический'] = {
        }

metadict_detail['|Метёлка печная'] = {
        }

metadict_detail['|Механический насос (35 литров/минуту)'] = {
        }

metadict_detail['|Миска глиняная (3 литра)'] = {
        }

metadict_detail['|Миска глиняная (5 литров)'] = {
        }

metadict_detail['|Миска для еды (1 литр)'] = {
        }

metadict_detail['|Молоток (для остукивания рельсов)'] = {
        }

metadict_detail['|Молоток костыльный'] = {
        }

metadict_detail['|Молоток слесарный'] = {
        }

metadict_detail['|Молоток штукатурный'] = {
        }

metadict_detail['|Молоток-кирочка'] = {
        }

metadict_detail['|Наддёргиватель путевых костылей'] = {
        }

metadict_detail['|Напильник трёхгранный (150 мм)'] = {
        }

metadict_detail['|Раковина напольная'] = {
        }

metadict_detail['|Нож кухонный (10 см)'] = {
        }

metadict_detail['|Нож кухонный (6 см)'] = {
        }

metadict_detail['|Нож столовый'] = {
        }

metadict_detail['|Нож штукатурный'] = {
        }

metadict_detail['|Нож-овощечистка'] = {
        }

metadict_detail['|Ножницы для резки металла'] = {
        }

metadict_detail['|Ножницы кухонные'] = {
        }

metadict_detail['|Ножовка по дереву широкая'] = {
        }

metadict_detail['|Обводной привод'] = {
        }

metadict_detail['|Острогубцы (кусачки)'] = {
        }

metadict_detail['|Отвес строительный'] = {
        }

metadict_detail['|Отрезовка'] = {
        }

metadict_detail['|Очки защитные'] = {
        }

metadict_detail['|Пила механическая цепная (2 кВт)'] = {
        }

metadict_detail['|Пила ножовка поперечная по дереву'] = {
        }

metadict_detail['|Пила поперечная'] = {
        }

metadict_detail['|Пила-ножовка'] = {
        }

metadict_detail['|Поварёшка деревянная (0.25 литра)'] = {
        }

metadict_detail['|Поварёшка стальная (0.125 литра)'] = {
        }

metadict_detail['|Поддон с металлическими крючьями'] = {
        }

metadict_detail['|Подмости панельные для кирпичной кладки'] = {
        }

metadict_detail['|Полотенце кухонное'] = {
        }

metadict_detail['|Полутёрка деревянная'] = {
        }

metadict_detail['|Поэтажная ёмкость 0.35'] = {
        }

metadict_detail['|Пояс монтажный'] = {
        }

metadict_detail['|Правило'] = {
        }

metadict_detail['|Правило окованное'] = {
        }

metadict_detail['|Правило прижимное'] = {
        }

metadict_detail['|Правило усеночное'] = {
        }

metadict_detail['|Прибор стяжной (для перешивки пути)'] = {
        }

metadict_detail['|Приспособление для шлифовки поверхностей'] = {
        }

metadict_detail['|Прозорник стыковой'] = {
        }

metadict_detail['|Прозорник-прокладка'] = {
        }

metadict_detail['|Противень жестяной (12 литров)'] = {
        }

metadict_detail['|Путевой ключ механичесикй (0.4 кВт)'] = {
        }

metadict_detail['|Разгонщик гидравлический'] = {
        }

metadict_detail['|Раковина'] = {
        }

metadict_detail['|Расшивка'] = {
        }

metadict_detail['|Расшивка (выпуклая и вогнутая)'] = {
        }

metadict_detail['|Рейка контрольная длиной 2 м'] = {
        }

metadict_detail['|Рейка с отвесом'] = {
        }

metadict_detail['|Рейка-порядовка'] = {
        }

metadict_detail['|Рейкодержатель винтовой'] = {
        }

metadict_detail['|Рейкодержатель дуговой'] = {
        }

metadict_detail['|Рейкодержатель универсальный'] = {
        }

metadict_detail['|Рейкодержатель штыревой'] = {
        }

metadict_detail['|Респиратор ШБ1'] = {
        }

metadict_detail['|Решето рогожно-деревянное'] = {
        }

metadict_detail['|Рихтовщик гидравлический'] = {
        }

metadict_detail['|Рубанок'] = {
        }

metadict_detail['|Рулетка (30 метров)'] = {
        }

metadict_detail['|Рулетка металлическая'] = {
        }

metadict_detail['|Рулетки измерительные металлические'] = {
        }

metadict_detail['|Самовар медный (5 литров)'] = {
        }

metadict_detail['|Сито для муки'] = {
        }

metadict_detail['|Скалка кухонная'] = {
        }

metadict_detail['|Скоба (для перегонки шпал)'] = {
        }

metadict_detail['|Скобы литые'] = {
        }

metadict_detail['|Сковорода чугунная (1 литр)'] = {
        }

metadict_detail['|Сковородник'] = {
        }

metadict_detail['|Скрапели диаметром 8 и 10 мм'] = {
        }

metadict_detail['|Скребок'] = {
        }

metadict_detail['|Скребок металлический'] = {
        }

metadict_detail['|Совок печной'] = {
        }

metadict_detail['|Сокол дюралюминиевый'] = {
        }

metadict_detail['|Сотейник чугунный (2 литра)'] = {
        }

metadict_detail['|Стаместка'] = {
        }

metadict_detail['|Станок рельсорезный (1.5 кВт)'] = {
        }

metadict_detail['|Станок рельсосверлильный (1.5 кВт)'] = {
        }

metadict_detail['|Станок рельсошлифовальный (1 кВт)'] = {
        }

metadict_detail['|Стол кухонный'] = {
        }

metadict_detail['|Стол обеденный'] = {
        }

metadict_detail['|Стол письменный'] = {
        }

metadict_detail['|Столик складной двух высотный'] = {
        }

metadict_detail['|Строп 4-х ветвевой (6 метров)'] = {
        }

metadict_detail['|Строп кольцевой (20 метров)'] = {
        }

metadict_detail['|Струбница (для стягивания накладок)'] = {
        }

metadict_detail['|Ступка кухонная'] = {
        }

metadict_detail['|Таз эмалированный (10 литров)'] = {
        }

metadict_detail['|Тесак кухонный (20 см)'] = {
        }

metadict_detail['|Топор плотничий'] = {
        }

metadict_detail['|Трамбовка простая'] = {
        }

metadict_detail['|Тёрка деревянная'] = {
        }

metadict_detail['|Тёрка для овощей'] = {
        }

metadict_detail['|Тёрка поролоновая'] = {
        }

metadict_detail['|Угольник деревянный'] = {
        }

metadict_detail['|Угольник для каменных работ'] = {
        }

metadict_detail['|Угольник путевой (для проверки стыков)'] = {
        }

metadict_detail['|Угольник специальный'] = {
        }

metadict_detail['|Умывальник'] = {
        }

metadict_detail['|Уровень гибкий'] = {
        }

metadict_detail['|Уровень строительный'] = {
        }

metadict_detail['|Ухват литой'] = {
        }

metadict_detail['|Форма для выпечки хлеба (2 литра)'] = {
        }

metadict_detail['|Форма для выпечки пирога (0.5 литра)'] = {
        }

metadict_detail['|Форма для выпечки маффинов (0.125 литра)'] = {
        }

metadict_detail['|Футляр траверсный (грузоподъёмность 1.5 тонны)'] = {
        }

metadict_detail['|Чайник фарфоровый (1 литр)'] = {
        }

metadict_detail['|Чашка для питья (0.5 литра)'] = {
        }

metadict_detail['|Чугунок (1 литр)'] = {
        }

metadict_detail['|Чугунок (3 литра)'] = {
        }

metadict_detail['|Чугунок (5 литров)'] = {
        }

metadict_detail['|Чугунок эмалированый (5 литров)'] = {
        }

metadict_detail['|Шаблон для устройства откосов'] = {
        }

metadict_detail['|Шкаф-буфет'] = {
        }

metadict_detail['|Шкаф-витрина'] = {
        }

metadict_detail['|Шкаф-гардероб'] = {
        }

metadict_detail['|Шкаф-стеллаж'] = {
        }

metadict_detail['|Шкаф-книжный'] = {
        }

metadict_detail['|Шнур причальный (30 метров)'] = {
        }

metadict_detail['|Шнур разметочный'] = {
        }

metadict_detail['|Шнур разметочный в корпусе'] = {
        }

metadict_detail['|Шпалоноска'] = {
        }

metadict_detail['|Шпалоподбойка пневматическая (0.4 кВт)'] = {
        }

metadict_detail['|Шпалоподбойка торцовая'] = {
        }

metadict_detail['|Шпатель малярный ШД-45'] = {
        }

metadict_detail['|Шпатель малярный ШМ-75'] = {
        }

metadict_detail['|Шпатель с ванночкой'] = {
        }

metadict_detail['|Шуруповёрт механический (1.7 кВт)'] = {
        }

metadict_detail['|Щипцы для дров'] = {
        }

metadict_detail['|Щуп (комплект)'] = {
        }

metadict_detail['|Щётка торцевая ЩТ-1'] = {
        }

metadict_detail['|Щётка-овощемойка'] = {
        }

metadict_detail['|Ящик для раствора (0.35 кубометра)'] = {
        }

metadict_detail['|Дверца каминная'] = {
        }

metadict_detail['|Дверца поддувала'] = {
        }

metadict_detail['|Дверца прочистная'] = {
        }

metadict_detail['|Дверца топки'] = {
        }

metadict_detail['|Задвижка дымохода'] = {
        }

metadict_detail['|Задвижка печная'] = {
        }

metadict_detail['|Решётка колосниковая'] = {
        }

metadict_detail['|Самоварник'] = {
        }

metadict_detail['|Дверь амбарная 3000x4000x50 мм'] = {
        }

metadict_detail['|Дверь внешняя 1500x800x50 мм'] = {
        }

metadict_detail['|Дверь внутренняя 1500x800x25 мм'] = {
        }

metadict_detail['|Люк подвальный 1500x800x50 мм'] = {
        }

metadict_detail['|Люк чердачный 1500x800x50 мм'] = {
        }

metadict_detail['|Парта'] = {
        }

metadict_detail['|Колыбель'] = {
        }

metadict_detail['|Чертёжная доска'] = {
        }

metadict_detail['|Бассейн (2x2 метра)'] = {
        }

metadict_detail['|Верстак слесарный'] = {
        }

metadict_detail['|Верстак столярный'] = {
        }

metadict_detail['|Картина в рамке'] = {
        }

metadict_detail['|Фотография в рамке'] = {
        }

metadict_detail['|Цветочный горшок'] = {
        }

#----
# Инструменты (через "Использование")

metadict_detail['||Ёмкость бондарная (бочка)'] = {
        }

metadict_detail['||Ёмкость бондарная (ведро)'] = {
        }

metadict_detail['||Ёмкость бондарная (кадка)'] = {
        }

metadict_detail['||Ёмкость деревянная пиленая (лоток)'] = {
        }

metadict_detail['||Ёмкость деревянная пиленая (ящик)'] = {
        }

metadict_detail['||Ёмкость керамическая (горшок)'] = {
        }

metadict_detail['||Ёмкость керамическая (пифос)'] = {
        }

metadict_detail['||Ёмкость плетёная (корзина)'] = {
        }

metadict_detail['||Ёмкость стальная кованая (чан, 300 литров)'] = {
        }

metadict_detail['||Ёмкость стальная кованая (противень, 300 литров)'] = {
        }

metadict_detail['||Ёмкость медная литая (чан, 300 литров)'] = {
        }

metadict_detail['||Ёмкость чугунная литая (чан, 20 000 литров)'] = {
        }

metadict_detail['||Ёмкость чугунная литая (реторта, 6000 литров)'] = {
        # Смоло-скипидарные аппараты — минские реторты емкостью 8 м³ (цикл 56 часов, восемь рабочих)
            # Аппарат производит 330 литров смолы из 8 кубометров смоляка
            # http://www.findpatent.ru/patent/257/2578695.html
        }

metadict_detail['||Посуда деревянная долблёная (ложка)'] = {
        }

metadict_detail['||Посуда деревянная долблёная (лопатка)'] = {
        }

metadict_detail['||Посуда деревянная долблёная (поварёшка)'] = {
        }

metadict_detail['||Посуда деревянная долблёная (скалка)'] = {
        }

metadict_detail['||Посуда деревянная долблёная (ступа)'] = {
        }

metadict_detail['||Посуда деревянная долблёная (уголок)'] = {
        }

metadict_detail['||Инструмент деревянный пиленый (вышка сборная)'] = {
        }

metadict_detail['||Инструмент деревянный пиленый (доска)'] = {
        }

metadict_detail['||Инструмент деревянный пиленый (лопата)'] = {
        }

metadict_detail['||Инструмент деревянный пиленый (поддон)'] = {
        }

metadict_detail['||Инструмент деревянный пиленый (подмостки)'] = {
        }

metadict_detail['||Инструмент деревянный пиленый (совок)'] = {
        }

metadict_detail['||Инструмент деревянный пиленый (сокол)'] = {
        }

metadict_detail['||Инструмент деревянный пиленый (трамбовка)'] = {
        }

metadict_detail['||Инструмент деревянный пиленый (тёрка)'] = {
        }

metadict_detail['||Инструмент измерительный (линейка)'] = {
        }

metadict_detail['||Инструмент измерительный (отвес)'] = {
        }

metadict_detail['||Инструмент измерительный (рейка)'] = {
        }

metadict_detail['||Инструмент измерительный (рулетка)'] = {
        }

metadict_detail['||Инструмент измерительный (угольник)'] = {
        }

metadict_detail['||Инструмент измерительный (уровень)'] = {
        }

metadict_detail['||Инструмент измерительный (шнур/метр)'] = {
        }

metadict_detail['||Инструмент измерительный (штангенциркуль)'] = {
        }

metadict_detail['||Инструмент измерительный ртутный (термометр)'] = {
        }

metadict_detail['||Инструмент плетёный мочальный (валик)'] = {
        }

metadict_detail['||Инструмент плетёный мочальный (венчик)'] = {
        }

metadict_detail['||Инструмент плетёный мочальный (веник)'] = {
        }

metadict_detail['||Инструмент плетёный мочальный (кисть)'] = {
        }

metadict_detail['||Инструмент плетёный мочальный (метёлка)'] = {
        }

metadict_detail['||Инструмент стальной кованый (вилы)'] = {
        }

metadict_detail['||Инструмент стальной кованый (гладилка)'] = {
        }

metadict_detail['||Инструмент стальной кованый (зубило)'] = {
        }

metadict_detail['||Инструмент стальной кованый (кельмо)'] = {
        }

metadict_detail['||Инструмент стальной кованый (кирка)'] = {
        }

metadict_detail['||Инструмент стальной кованый (клещи)'] = {
        }

metadict_detail['||Инструмент стальной кованый (ключ гаечный)'] = {
        }

metadict_detail['||Инструмент стальной кованый (крюк)'] = {
        }

metadict_detail['||Инструмент стальной кованый (лом)'] = {
        }

metadict_detail['||Инструмент стальной кованый (лопата)'] = {
        }

metadict_detail['||Инструмент стальной кованый (молоток)'] = {
        }

metadict_detail['||Инструмент стальной кованый (нож)'] = {
        }

metadict_detail['||Инструмент стальной кованый (нож-овощечистка)'] = {
        }

metadict_detail['||Инструмент стальной кованый (ножовка)'] = {
        }

metadict_detail['||Инструмент стальной кованый (поварёшка)'] = {
        }

metadict_detail['||Инструмент стальной кованый (рубанок)'] = {
        }

metadict_detail['||Инструмент стальной кованый (скоба)'] = {
        }

metadict_detail['||Инструмент стальной кованый (скребок)'] = {
        }

metadict_detail['||Инструмент стальной кованый (струбница)'] = {
        }

metadict_detail['||Инструмент стальной кованый (тесак)'] = {
        }

metadict_detail['||Инструмент стальной кованый (топор)'] = {
        }

metadict_detail['||Инструмент стальной кованый (тёрка кухонная)'] = {
        }

metadict_detail['||Инструмент стальной кованый (формочка)'] = {
        }

metadict_detail['||Инструмент стальной кованый (шпатель)'] = {
        }

metadict_detail['||Инструмент стальной кованый (шумовка)'] = {
        }

metadict_detail['||Инструмент стальной кованый (щипцы)'] = {
        }

metadict_detail['||Инструмент чугунный литой (кочерга)'] = {
        }

metadict_detail['||Инструмент чугунный литой (кувалда)'] = {
        }

metadict_detail['||Инструмент чугунный литой (прут)'] = {
        }

metadict_detail['||Инструмент чугунный литой (сковородник)'] = {
        }

metadict_detail['||Инструмент чугунный литой (ухват)'] = {
        }

metadict_detail['||Инструмент чугунный литой (щипцы)'] = {
        }

metadict_detail['||Мебель деревянная пиленая (стол)'] = {
        }

metadict_detail['||Механизм винтовой (жернова)'] = {
        }

metadict_detail['||Механизм винтовой (пресс для фруктов)'] = {
        }

metadict_detail['||Механизм винтовой (пресс, 5-кубометров/час)'] = {
        }

metadict_detail['||Механизм винтовой (разгонщик)'] = {
        }

metadict_detail['||Механизм винтовой (рихтовщик)'] = {
        }

metadict_detail['||Механизм колёсный (грейдер)'] = {
        }

metadict_detail['||Механизм колёсный (скрепер)'] = {
        }

metadict_detail['||Механизм колёсный самоходный (каток)'] = {
        }

metadict_detail['||Механизм пневматический (компрессор)'] = {
        }

metadict_detail['||Механизм пневматический (трамбовка)'] = {
        }

metadict_detail['||Механизм пневматический (шпалоподбойка)'] = {
        }

metadict_detail['||Механизм стальной (домкрат)'] = {
        }

metadict_detail['||Механизм стальной (дрель)'] = {
        }

metadict_detail['||Механизм стальной (костылевыдёргиватель)'] = {
        }

metadict_detail['||Механизм стальной (мегафон)'] = {
        }

metadict_detail['||Механизм стальной (пресс-пюре)'] = {
        }

metadict_detail['||Посуда медная кованая (самовар)'] = {
        }

metadict_detail['||Механизм строительный (башенный кран)'] = {
        }

metadict_detail['||Механизм строительный (копатель)'] = {
        }

metadict_detail['||Механизм строительный (буровой станок)'] = {
        }

metadict_detail['||Механизм строительный (лебёдка)'] = {
        }

metadict_detail['||Механизм строительный (роликовый транспортёр)'] = {
        }

metadict_detail['||Механизм винтовой (пресс черепичный)'] = {
        }

metadict_detail['||Механизм винтовой (пресс кафельный)'] = {
        }

metadict_detail['||Механизм фабричный (вальцовый пресс мощный)'] = {
        }

metadict_detail['||Механизм фабричный (вальцовый пресс)'] = {
        }

metadict_detail['||Станок механический (глиномялка)'] = {
        # - Глиномялка с конным приводом (1 лошадиная сила) -- 181 рубль
            # на 5000 порций глины для кирпичей/сутки (5-6 кубометров), вес глиномялки 1 тонна.
            # http://www.arhplan.ru/materials/bricks/dobycha-i-podgotovka-gliny-dlya-kirpicha
        }

metadict_detail['||Механизм фабричный (дробилка)'] = {
        }

metadict_detail['||Механизм фабричный (лесопильная рама)'] = {
        }

metadict_detail['||Механизм фабричный (молотилка)'] = {
        }

metadict_detail['||Механизм фабричный (мельница вальцовая)'] = {
        }

metadict_detail['||Механизм фабричный (мельница баробанная)'] = {
        }

metadict_detail['||Механизм фабричный (мельница жерновная)'] = {
        }

metadict_detail['||Механизм фабричный (моечная машина)'] = {
        }

metadict_detail['||Механизм фабричный (рафинирочное сито)'] = {
        }

metadict_detail['||Механизм фабричный (тёрочный барабан)'] = {
        }

metadict_detail['||Посуда деревянная долблёная (воронка)'] = {
        }

metadict_detail['||Посуда деревянная долблёная (ковш)'] = {
        }

metadict_detail['||Посуда деревянная долблёная (солонка)'] = {
        }

metadict_detail['||Посуда жестяная кованая (противень)'] = {
        }

metadict_detail['||Посуда керамическая (кружка)'] = {
        }

metadict_detail['||Посуда керамическая (кувшин)'] = {
        }

metadict_detail['||Посуда керамическая (миска)'] = {
        }

metadict_detail['||Посуда керамическая (мисочка)'] = {
        }

metadict_detail['||Посуда керамическая (чашка)'] = {
        }

metadict_detail['||Посуда плетёная (корзинка)'] = {
        }

metadict_detail['||Посуда чугунная литая (котелок)'] = {
        }

metadict_detail['||Посуда чугунная литая (котёл)'] = {
        }

metadict_detail['||Посуда чугунная литая (сковорода)'] = {
        }

metadict_detail['||Посуда чугунная литая (сотейник)'] = {
        }

metadict_detail['||Посуда чугунная литая (чугунок)'] = {
        }

metadict_detail['||Снаряжение защитное (каска)'] = {
        }

metadict_detail['||Снаряжение защитное (маска)'] = {
        }

metadict_detail['||Снаряжение защитное (очки)'] = {
        }

metadict_detail['||Снаряжение защитное (пояс страховой)'] = {
        }

metadict_detail['||Станок простой (ткацкий)'] = {
        # - Ручной ткацкий станок для соломенных ковров (80-130 аршин/день) -- 8 рублей
        }

metadict_detail['||Станок механический (ткацкий)'] = {
        }

metadict_detail['||Станок механический (паркетно-строгательный)'] = {
        }

metadict_detail['||Станок механический (паркетно-шлифовальный)'] = {
        }

metadict_detail['||Станок механический (кирпичнорезный)'] = {
        }

metadict_detail['||Станок механический (металлорежущий)'] = {
        }

metadict_detail['||Станок механический (сверлильно-шлифовальный)'] = {
        }

metadict_detail['||Станок механический (сверлильный)'] = {
        }

metadict_detail['||Станок механический (шлифовальный)'] = {
        }

metadict_detail['||Транспорт железнодорожный (локомотив)'] = {
        }

metadict_detail['||Транспорт железндорожный (вагон)'] = {
        }

metadict_detail['||Транспорт железнодорожный (вагон, 16 тонн, 50 км/час, 26-кВт-час)'] = {
        }

metadict_detail['||Транспорт железнодорожный (поезд, 400 тонн, 50 км/час, 640-кВт-час)'] = {
        }

metadict_detail['||Транспорт железндорожный (платформа)'] = {
        }

metadict_detail['||Транспорт колёсный грузовой (телега)'] = {
        }

metadict_detail['||Транспорт колёсный грузовой (тележка)'] = {
        }

metadict_detail['||Транспорт воздушный пассажирский (лёгкий планёр)'] = {
        }

metadict_detail['||Транспорт воздушный санитарный (лёгкий планёр)'] = {
        }

metadict_detail['||Транспорт воздушный грузовой (5-тонный планёр)'] = {
        }

metadict_detail['||Транспорт морской грузовой (барк)'] = {
        }

metadict_detail['||Транспорт речной грузовой (баржа)'] = {
        }

metadict_detail['||Устройство тепловое (смоляная печь)'] = {
        }

metadict_detail['||Устройство тепловое (штабель кирпича большой)'] = {
        }

metadict_detail['||Устройство тепловое (штабель кирпича малый)'] = {
        }

metadict_detail['||Устройство тепловое (штабель керамики малый)'] = {
        }

metadict_detail['||Утварь соломенная (коврик)'] = {
        }

metadict_detail['||Инструмент чугунный литой (утюг)'] = {
        }

metadict_detail['||Механизм гидравлический (пресс, 300-кг/час)'] = {
        }

metadict_detail['||Механизм гидравлический (насос высокого давления)'] = {
        }

metadict_detail['||Механизм гидравлический (насос, 35 литров/минуту)'] = {
        }

metadict_detail['||Инструмент чугунный литой (мангал)'] = {
        }

#----
# Промышленное оборудование (через "Использование"):

metadict_detail['||Механизм фабричный (барабан сетчатый)'] = {
        }

metadict_detail['||Механизм фабричный (вентилятор)'] = {
        }

metadict_detail['||Механизм фабричный (диффузионная батарея-маслоэкстрактор)'] = {
        }

metadict_detail['||Механизм фабричный (мешалка)'] = {
        }

metadict_detail['||Механизм фабричный (молотилка вальцовая)'] = {
        }

metadict_detail['||Механизм фабричный (сковорода паровая)'] = {
        }

metadict_detail['||Станок простой (касса наборная типографская)'] = {
        }

metadict_detail['||Станок механический (переплётный)'] = {
        }

metadict_detail['||Механизм фабричный (бумагодельная машина)'] = {
        }

metadict_detail['||Станок механический (печатный ротационный)'] = {
        }

metadict_detail['||Станок механический (печатный ротационный обойный)'] = {
        }

metadict_detail['||Механизм фабричный (мельница шаровая)'] = {
        }

metadict_detail['||Механизм фабричный (цементный пресс)'] = {
        }

metadict_detail['||Печь шахтная, 10 кубометров (часов)'] = {
        }

metadict_detail['||Сито проволочное (квадратный метр)'] = {
        }

#----
# Судовое имущество (через "Использование"):

metadict_army['||Парус морской (брезент) (квадратый метр)'] = {
        # Некоторые паруса имеют нашивки:
        # https://ru.wikisource.org/wiki/ЭСБЕ/Бант
        '-Парус морской (требуется/квадратный метр)':1,
        #'_Производство парусов морских (брезент) (квадратный метр)':1,
        #'_Утилизация парусов морских (брезент) (квадратный метр)':1 * 0.5,
        }

metadict_army['||Такелаж стоячий (сталь) (метр)'] = {
        'Канат стальной такелажный (метр)':1,
        }

metadict_army['||Такелаж бегущий (пенька) (метр)'] = {
        'Канат пеньковый такелажный (метр)':1,
        }

metadict_detail['||Инструмент текстильный (канат/метр)'] = {
        'Канат пеньковый строительный (метр)':1,
        }

metadict_detail['||Инструмент текстильный (шнур/метр)'] = {
        'Бечева пеньковая хозяйственная (метр)':1,
        }

#----
# Утварь (через "Использование"):

metadict_detail['||Утварь текстильная (ковёр соломенный) (квадратный метр)'] = {
        'Соломенные ковры 25-мм (квадратный метр)':1,
        }

metadict_detail['||Утварь текстильная (ковёр джутовый) (квадратный метр)'] = {
        '_Производство утвари, ковёр 100x100 (джут)':1,
        '_Утилизация утвари, ковёр 100x100 (джут)':1 * 0.75,
        }

metadict_detail['||Утварь текстильная (ковёр хлопчатый) (квадратный метр)'] = {
        '_Производство утвари, ковёр 100x100 (хлопок)':1,
        '_Утилизация утвари, ковёр 100x100 (хлопок)':1 * 0.75,
        }

metadict_detail['||Утварь текстильная (шторы 100x100)'] = {
        '_Производство утвари, шторы 100x100 (хлопок)':1,
        '_Утилизация утвари, шторы 100x100 (хлопок)':1 * 0.75,
        }

metadict_detail['||Утварь текстильная (полотенце 40x60 вафельное)'] = {
        '_Производство утвари, полотенце 40x60 вафельное (хлопок)':1,
        '_Утилизация утвари, полотенце 40x60 вафельное (хлопок)':1 * 0.75,
        }

metadict_detail['||Утварь текстильная (полотенце 50x90 вафельное)'] = {
        '_Производство утвари, полотенце 50x90 вафельное (хлопок)':1,
        '_Утилизация утвари, полотенце 50x90 вафельное (хлопок)':1 * 0.75,
        }

metadict_detail['||Утварь текстильная (полотенце 70x140 махровое)'] = {
        '_Производство утвари, полотенце 70x140 махровое (хлопок)':1,
        '_Утилизация утвари, полотенце 70x140 махровое (хлопок)':1 * 0.75,
        }

metadict_detail['||Утварь текстильная (скатерть 220x130)'] = {
        '_Производство утвари, скатерть 220x130 (хлопок)':1,
        '_Утилизация утвари, скатерть 220x130 (хлопок)':1 * 0.75,
        }

metadict_detail['||Утварь текстильная (холст 80x120)'] = {
        '_Производство утвари, холст 80x120 (лён)':1,
        '_Утилизация утвари, холст 80x120 (лён)':1 * 0.75,
        }

metadict_detail['||Утварь текстильная (мешочек)'] = {
        '_Производство утвари, мешочек (лён)':1,
        '_Утилизация утвари, мешочек (лён)':1 * 0.75,
        }

metadict_detail['||Утварь текстильная (сито)'] = {
        '_Производство утвари, сито (джут)':1,
        '_Утилизация утвари, сито (джут)':1 * 0.75,
        }

metadict_detail['||Утварь текстильная (мешок)'] = {
        '_Производство утвари, мешок (джут)':1,
        '_Утилизация утвари, мешок (джут)':1 * 0.75,
        }

metadict_detail['||Утварь текстильная (ветошь)'] = {
        '_Производство утвари, ветошь (лоскуты)':1,
        '_Утилизация утвари, ветошь (лоскуты)':1 * 0.75,
        }

#----
# Постельное бельё (через "Использование"):

metadict_detail['||Матрац стёганный (вата)'] = {
        # Старые постели идут на ветошь и лоскуты.
        '_Производство белья, матрац (вата)':1,
        '_Утилизация белья, матрац (вата)':1 * 0.75,
        }

metadict_detail['||Одеяло лоскутное (вата)'] = {
        '_Производство белья, одеяло лоскутное (вата)':1,
        '_Утилизация белья, одеяло лоскутное (вата)':1 * 0.75,
        }

metadict_detail['||Одеяло стёганное (вата)'] = {
        '_Производство белья, одеяло стёганное (вата)':1,
        '_Утилизация белья, одеяло стёганное (вата)':1 * 0.75,
        }

metadict_detail['||Подушка стёганная (вата)'] = {
        '_Производство белья, подушка стёганная (вата)':1,
        '_Утилизация белья, подушка стёганная (вата)':1 * 0.75,
        }

metadict_detail['||Простыня (парусина)'] = {
        '_Производство белья, простыня (парусина)':1,
        '_Утилизация белья, простыня (парусина)':1 * 0.75,
        }

metadict_detail['||Простыня (хлопок)'] = {
        '_Производство белья, простыня (хлопок)':1,
        '_Утилизация белья, простыня (хлопок)':1 * 0.75,
        }

metadict_detail['||Простыня махровая (хлопок)'] = {
        '_Производство белья, простыня махровая (хлопок)':1,
        '_Утилизация белья, простыня махровая (хлопок)':1 * 0.75,
        }

metadict_detail['||Тюфяк (солома)'] = {
        '_Производство белья, чехол тюфяка (мешковина)':1,
        '_Утилизация белья, чехол тюфяка (мешковина)':1 * 0.75,
        }

#----
# Одежда (через "Использование"):

metadict_detail['||Бушлат (хлопок)'] = {
        # Только 50% одежды режут на лоскуты.
        '_Производство одежды, бушлат (хлопок)':1,
        '_Утилизация одежды, бушлат (хлопок)':1 * 0.5,
        }

metadict_detail['||Ветровка (брезент)'] = {
        '_Производство одежды, ветровка (брезент)':1,
        '_Утилизация одежды, ветровка (брезент)':1 * 0.5,
        }

metadict_detail['||Жакет (хлопок)'] = {
        '_Производство одежды, жакет (хлопок)':1,
        '_Утилизация одежды, жакет (хлопок)':1 * 0.5,
        }

metadict_detail['||Жилет (хлопок)'] = {
        '_Производство одежды, жилет (хлопок)':1,
        '_Утилизация одежды, жилет (хлопок)':1 * 0.5,
        }

metadict_detail['||Жилет (парусина)'] = {
        '_Производство одежды, жилет (парусина)':1,
        '_Утилизация одежды, жилет (парусина)':1 * 0.5,
        }

metadict_detail['||Кафтан (хлопок)'] = {
        '_Производство одежды, кафтан (хлопок)':1,
        '_Утилизация одежды, кафтан (хлопок)':1 * 0.5,
        }

metadict_detail['||Пальто (хлопок)'] = {
        '_Производство одежды, пальто (хлопок)':1,
        '_Утилизация одежды, пальто (хлопок)':1 * 0.5,
        }

metadict_detail['||Пиджак (хлопок)'] = {
        '_Производство одежды, пиджак (хлопок)':1,
        '_Утилизация одежды, пиджак (хлопок)':1 * 0.5,
        }

metadict_detail['||Платье (хлопок)'] = {
        '_Производство одежды, платье (хлопок)':1,
        '_Утилизация одежды, платье (хлопок)':1 * 0.5,
        }

metadict_detail['||Плащ (брезент)'] = {
        '_Производство одежды, плащ (брезент)':1,
        '_Утилизация одежды, плащ (брезент)':1 * 0.5,
        }

metadict_detail['||Плащ (хлопок)'] = {
        '_Производство одежды, плащ (хлопок)':1,
        '_Утилизация одежды, плащ (хлопок)':1 * 0.5,
        }

metadict_detail['||Чепчик (лён)'] = {
        '_Производство одежды, чепчик (лён)':1,
        '_Утилизация одежды, чепчик (лён)':1 * 0.5,
        }

metadict_detail['||Чепчик (хлопок)'] = {
        '_Производство одежды, чепчик (хлопок)':1,
        '_Утилизация одежды, чепчик (хлопок)':1 * 0.5,
        }

metadict_detail['||Шапка (хлопок)'] = {
        '_Производство одежды, шапка (хлопок)':1,
        '_Утилизация одежды, шапка (хлопок)':1 * 0.5,
        }

metadict_detail['||Шляпа (солома)'] = {
        '_Производство одежды, шляпа (солома)':1,
        '_Утилизация одежды, шляпа (солома)':1 * 0.5,
        }

metadict_detail['||Шляпа (хлопок)'] = {
        '_Производство одежды, шляпа (хлопок)':1,
        '_Утилизация одежды, шляпа (хлопок)':1 * 0.5,
        }

metadict_detail['||Чулки (хлопок)'] = {
        '_Производство одежды, чулки (хлопок)':1,
        '_Утилизация одежды, чулки (хлопок)':1 * 0.5,
        }

metadict_detail['||Чулки (лён)'] = {
        '_Производство одежды, чулки (лён)':1,
        '_Утилизация одежды, чулки (лён)':1 * 0.5,
        }

#----
# Обувь (через "Использование"):

metadict_detail['||Ботинки (кирза)'] = {
        '_Производство обуви, ботинки (кирза)':1,
        '_Утилизация обуви, ботинки (кирза)':1 * 0.25,
        }

metadict_detail['||Туфли (кирза)'] = {
        '_Производство обуви, туфли (кирза)':1,
        '_Утилизация обуви, туфли (кирза)':1 * 0.25,
        }

metadict_detail['||Туфли (джут)'] = {
        '_Производство обуви, туфли (джут)':1,
        '_Утилизация обуви, туфли (джут)':1 * 0.25,
        }

metadict_detail['||Галоши (каучук)'] = {
        '_Производство обуви, галоши (каучук)':1,
        '_Утилизация обуви, галоши (каучук)':1 * 0.25,
        }

#----
# Инструменты канцелярские:

metadict_detail['||Инструмент канцелярский (грифель)'] = {
        }

metadict_detail['||Инструмент канцелярский (грифельная доска)'] = {
        }

metadict_detail['||Инструмент канцелярский (ластик)'] = {
        }

metadict_detail['||Инструмент канцелярский (ручка перьевая)'] = {
        }

#----
# Печать:

metadict_detail['||Продукция печатная (книга)'] = {
        '_Производство книг (штук)':1,
        #'+Бумага газетная старая (доступно/квадратный метр)':4,
        '+Книги библиотечные (доступно/штук)':1,
        '|=Книги (килограмм)':0.5,
        }

metadict_detail['||Продукция печатная (учебник)'] = {
        # Вес 130 листов бумаги + вес картона переплёта
        '_Производство книг (штук)':1,
        #'+Бумага газетная старая (доступно/квадратный метр)':4,
        '|=Книги (килограмм)':0.5,
        }

metadict_detail['||Продукция печатная (газета)'] = {
        '_Производство газет (штук)':1,
        '+Бумага газетная старая (доступно/квадратный метр)':0.75,
        '+Газеты библиотечные (доступно/штук)':1,
        '|=Газеты (килограмм)':0.04,
        }

metadict_detail['||Продукция печатная (журнал)'] = {
        '_Производство журналов (штук)':1,
        '+Бумага газетная старая (доступно/квадратный метр)':1.5,
        '+Журналы библиотечные (доступно/штук)':1,
        '|=Журналы (килограмм)':0.21,
        }

metadict_detail['||Продукция печатная (тетрадь)'] = {
        # Для старших школьников и студентов. Жеребята учатся на грифельных досках.
        '_Производство тетрадей (штук)':1,
        #'+Бумага газетная старая (доступно/квадратный метр)':1.6,
        '|=Тетради (килограмм)':0.21,
        }

metadict_detail['||Письмо (конверт и почтовая марка)'] = {
        # Лист А4 -- 0.0625 кв.метра, 5 грамм (80 грамм/кв.метр)
        # Среднее письмо -- 20 грамм (лист, конверт, марка)
        '|=Письма (килограмм)':0.02,
        }

metadict_detail['||Посылка (почтовая бандероль)'] = {
        # TODO: Картонные коробки, это тара для писем. Их учитываем в goods.
            # Тара не только картонная. Также плетёная, берестяная, жестяная.
            # Пони используют коробки для посылок по несколько раз.
        # Объёмный вес 200 кг/кубометр. Средний вес посылки -- 0.7 кг.
            # Это коробка 260×170×80 мм (0.2 кв.метра картона, считая крышку)
            # Типичные посылки, в порядке уменьшения доли:
                # посуда, одежда, инструменты, книги, игрушки, сувениры,
                # лекарства, мыло, семена, пряности, сладкое, чай и кофе.
            # https://ru.wikipedia.org/wiki/Объёмный_вес_отправления
        '|=Посылки (килограмм)':0.7,
        }

metadict_detail['||Продукция печатная (конверт)'] = {
        '_Производство почтовых конвертов (штук)':1,
        }

metadict_detail['||Продукция печатная (почтовая бандероль)'] = {
        '_Производство почтовых бандеролей (штук)':1,
        }

metadict_detail['||Продукция печатная (почтовая марка)'] = {
        '_Производство почтовых марок (штук)':1,
        }

#----
# Отделка (обновление, ремонт):

metadict_detail['||Кафель (квадратный метр)'] = {
        'Устройство кафельного покрытия (квадратный метр)':1,
        }

metadict_detail['||Паркет (квадратный метр)'] = {
        'Устройство покрытий из паркетных досок (квадратный метр)':1,
        }

metadict_detail['||Обои (квадратный метр)'] = {
        'Оклейка обоями (квадратный метр)':1,
        }

#----
# Здания:

metadict_detail['||Больничное место (койка)'] = {
        }

metadict_detail['||Больничное место (кабинет)'] = {
        }

metadict_detail['||Общежитие (койка)'] = {
        }

metadict_detail['||Школьное место (парта)'] = {
        }
