#----
# Инструменты (характеистики):

metadict_detail['Использование миски для еды (часов/килограмм)'] = {
        # Одна порция --  0.5 килограмма (посуда используется на 50%)
        'Использование 1-литровой миски для еды (часов)':1 / 0.5,
        }

metadict_detail['Использование кружки для питья (часов/литр)'] = {
        # Собственно кружкой называется мера объёма -- 1/8 ведра, 1.5 литра.
        'Использование 1.5-литровой кружки для питья (часов)':1 / 0.66,
        }

metadict_detail['Использование бочки для брожения виноградного сусла (часов/килограмм)'] = {
        'Использование 500-литровой бочки для брожения виноградного сусла (часов)':1 / 500,
        }

metadict_detail['Использование бочки для брожения сусла (часов/килограмм)'] = {
        'Использование 500-литровой бочки для брожения сусла (часов)':1 / 500,
        }

metadict_detail['Использование бочки для приготовления эля (часов/килограмм)'] = {
        'Использование 500-литровой бочки для приготовления эля (часов)':1 / 500,
        }

metadict_detail['Использование винтового пресса (часов/килограмм)'] = {
        # Не заполняется больше чем на 50%
        'Использование 50-литрового механического винтового пресса (часов)':1 / 50 / 0.5,
        }

metadict_detail['Использование вальцевого пресса (часов/килограмм)'] = {
        # Не заполняется больше чем на 75%
        'Использование 50-литрового механического вальцевого пресса (часов)':1 / 50 / 0.75,
        }

metadict_detail['Использование горшка для варки каши (часов/килограмм)'] = {
        # Посуда заполняется на 75%
        'Использование 5-литрового чугунка для варки каши (часов)':1 / 5 / 0.75,
        }

metadict_detail['Использование горшка для варки супа (часов/килограмм)'] = {
        'Использование 5-литрового чугунка для варки супа (часов)':1 / 5 / 0.75,
        }

metadict_detail['Использование горшка для варки (часов/килограмм)'] = {
        'Использование 5-литрового чугунка для варки (часов)':1 / 5 / 0.75,
        }

metadict_detail['Использование горшка для варки корнеплодов (часов/килограмм)'] = {
        'Использование 5-литрового чугунка для варки корнеплодов (часов)':1 / 5 / 0.75,
        }

metadict_detail['Использование горшка для варки компота (часов/килограмм)'] = {
        'Использование 5-литрового чугунка для варки компота (часов)':1 / 5 / 0.75,
        }

metadict_detail['Использование горшка для варки сиропа (часов/килограмм)'] = {
        'Использование 5-литрового чугунка для варки сиропа (часов)':1 / 5 / 0.75,
        }

metadict_detail['Использование доски для нарезки фруктов (часов/килограмм)'] = {
        'Использование доски для нарезки (часов)':1,
        }

metadict_detail['Использование доски для шинковки овощей (часов/килограмм)'] = {
        'Использование доски для нарезки (часов)':1,
        }

metadict_detail['Использование стола для перебора крупы (часов/килограмм)'] = {
        'Использование 1800x600 стола для перебора крупы (часов)':1,
        }

metadict_detail['Использование стола для перебора овощей (часов/килограмм)'] = {
        'Использование 1800x600 стола для перебора овощей (часов)':1,
        }

metadict_detail['Использование стола для перебора грибов (часов/килограмм)'] = {
        'Использование 1800x600 стола для перебора грибов (часов)':1,
        }

metadict_detail['Использование стола для перебора трав (часов/килограмм)'] = {
        'Использование 1800x600 стола для перебора трав (часов)':1,
        }

metadict_detail['Использование стола для перебора фруктов (часов/килограмм)'] = {
        'Использование 1800x600 стола для перебора фруктов (часов)':1,
        }

metadict_detail['Использование стола для перебора ягод (часов/килограмм)'] = {
        'Использование 1800x600 стола для перебора ягод (часов)':1,
        }

metadict_detail['Использование стола для шинковки овощей (часов/килограмм)'] = {
        'Использование 1800x600 стола для шинковки овощей (часов)':1,
        }

metadict_detail['Использование стола для нарезки фруктов (часов/килограмм)'] = {
        'Использование 1800x600 стола для нарезки фруктов (часов)':1,
        }

metadict_detail['Использование стола для рубки овощей (часов/килограмм)'] = {
        'Использование 1800x600 стола для рубки овощей (часов)':1,
        }

metadict_detail['Использование стола для чистки корнеплодов (часов/килограмм)'] = {
        'Использование 1800x600 стола для чистки корнеплодов (часов)':1,
        }

metadict_detail['Использование стола для чистки овощей (часов/килограмм)'] = {
        'Использование 1800x600 стола для чистки овощей (часов)':1,
        }

metadict_detail['Использование стола для чистки фруктов (часов/килограмм)'] = {
        'Использование 1800x600 стола для чистки фруктов (часов)':1,
        }

metadict_detail['Использование стола для чистки орехов (часов/килограмм)'] = {
        'Использование 1800x600 стола для чистки орехов (часов)':1,
        }

metadict_detail['Использование стола для ферментации (часов/килограмм)'] = {
        'Использование 1800x600 стола для ферментации (часов)':1 / 50,
        }

metadict_detail['Использование стола для ферментации чайных листьев (часов/килограмм)'] = {
        'Использование 1800x600 стола для ферментации чайных листьев (часов)':1 / 50,
        }

metadict_detail['Использование кадки для приготовления кваса (часов/килограмм)'] = {
        # Кадка заполняется на 75%
        'Использование 50-литровой квашни для приготовления кваса (часов)':1 / 0.75 / 50,
        }

metadict_detail['Использование кадки для приготовления эля (часов/килограмм)'] = {
        'Использование 50-литровой квашни для приготовления эля (часов)':1 / 0.75 / 50,
        }

metadict_detail['Использование кадки для брожения соевого соуса (часов/килограмм)'] = {
        # Кадка заполняется на 50%
        'Использование 50-литровой квашни для брожения соевого соуса (часов)':1 / 0.50 / 50,
        }

metadict_detail['Использование кадки для брожения теста (часов/килограмм)'] = {
        # Кадка заполняется на 25%
        'Использование 50-литровой квашни для брожения теста (часов)':1 / 0.25 / 50,
        }

metadict_detail['Использование кадки для заваривания теста (часов/килограмм)'] = {
        # Кадка заполняется на 25%
        'Использование 50-литровой квашни для заваривания теста (часов)':1 / 0.25 / 50,
        }

metadict_detail['Использование кадки для квашения капусты (часов/килограмм)'] = {
        # Кадка заполняется на 90%
        'Использование 500-литровой кадки для квашения капусты (часов)':1 / 0.90 / 500,
        }

metadict_detail['Использование кадки для консервации овощей (часов/килограмм)'] = {
        'Использование 500-литровой кадки для консервации овощей (часов)':1 / 0.90 / 500,
        }

metadict_detail['Использование кадки для консервации фруктов (часов/килограмм)'] = {
        'Использование 500-литровой кадки для консервации фруктов (часов)':1 / 0.90 / 500,
        }

metadict_detail['Использование ведра для сбора кленового сока (часов/килограмм)'] = {
        # Ведро заполняется на 75%
        'Использование 10-литрового ведра для сбора кленового сока (часов)':1 / 0.75 / 10,
        }

metadict_detail['Использование уголка для сбора кленового сока (часов/килограмм)'] = {
        'Использование уголка для сбора кленового сока (часов)':1 / 0.75 / 10,
        }

metadict_detail['Использование ведра для мытья посуды (часов/килограмм)'] = {
        # Расход воды -- 1 литр на килограмм употреблённой пищи.
        'Использование 10-литрового ведра для мытья посуды (часов)':1 / 0.75 / 10,
        }

metadict_detail['Использование ведра для мытья орехов (часов/килограмм)'] = {
        # Расход воды -- 3 литра на килограмм.
        'Использование 10-литрового ведра для мытья (часов)':3 / 0.75 / 10,
        }

metadict_detail['Использование ведра для промывания крупы (часов/килограмм)'] = {
        'Использование 10-литрового ведра для мытья (часов)':3 / 0.75 / 10,
        }

metadict_detail['Использование ведра для мытья корнеплодов (часов/килограмм)'] = {
        'Использование 10-литрового ведра для мытья корнеплодов (часов)':3 / 0.75 / 10,
        }

metadict_detail['Использование ведра для мытья овощей (часов/килограмм)'] = {
        'Использование 10-литрового ведра для мытья овощей (часов)':3 / 0.75 / 10,
        }

metadict_detail['Использование ведра для мытья сухофруктов (часов/килограмм)'] = {
        'Использование 10-литрового ведра для мытья сухофруктов (часов)':3 / 0.75 / 10,
        }

metadict_detail['Использование ведра для мытья фруктов (часов/килограмм)'] = {
        'Использование 10-литрового ведра для мытья фруктов (часов)':3 / 0.75 / 10,
        }

metadict_detail['Использование противеня для сушки пастилы (часов/килограмм)'] = {
        # Слой 5 миллиметров, объём слоя 0.005 кубометра, масса -- 5 килограмм
        'Использование 1800x600 противеня для сушки (часов)':1 / 5,
        }

metadict_detail['Использование противеня для сушки хлеба (часов/килограмм)'] = {
        # Слой 20 миллиметров, объём слоя 0.02 кубометра, масса -- 20 килограмм
        'Использование 1800x600 противеня для сушки (часов)':1 / 10,
        }

metadict_detail['Использование листа для вяления чайных листьев (часов/килограмм)'] = {
        # Слой 50 миллиметров, объём слоя 0.05 кубометра, масса (сырого) -- 50 килограмм
        'Использование 1800x600 листа для вяления чайных листьев (часов)':1 / 50,
        }

metadict_detail['Использование листа для сушки крахмала (часов/килограмм)'] = {
        'Использование 1800x600 листа для сушки крахмала (часов)':1 / 50,
        }

metadict_detail['Использование листа для сушки растений (часов/килограмм)'] = {
        'Использование 1800x600 листа для сушки растений (часов)':1 / 50,
        }

metadict_detail['Использование листа для сушки фруктов (часов/килограмм)'] = {
        'Использование 1800x600 листа для сушки фруктов (часов)':1 / 50,
        }

metadict_detail['Использование листа для сушки солода (часов/килограмм)'] = {
        'Использование 1800x600 листа для сушки солода (часов)':1 / 50,
        }

metadict_detail['Использование маслоотжимного пресса (часов/килограмм)'] = {
        # Исправить
            # На самом деле немеханизированные маслоотжимные прессы менее эффективны.
        # Не заполняется больше чем на 50%
        'Использование 50-литрового механического винтового пресса (часов)':1 / 50 / 0.5,
        }

metadict_detail['Использование мельницы (часов/килограмм)'] = {
        # 20-70 килограмм в час, одна пара жерновов
        'Использование 50-кг/час ветряной мельницы (часов)':1 / 50,
        }

metadict_detail['Использование колодца (часов/тонн)'] = {
        # Расход воды 1 тонна/час
        'Использование 1-тонн/час шахтного колодца (часов)':1,
        }

metadict_detail['Использование механизированной лесопильной рамы (часов/кубометр)'] = {
        # http://saper.isnet.ru/texnica/lrv.html
            # Мощность -- 30 кВт.
            # Производство: 50 кубометров бруса и доски в сутки; Расчёт: 8 бойцов.
        'Использование 5-кубометров/час механизированной лесопильной рамы (часов)':12/60,
        }

metadict_detail['Использование механической глиномялки (часов/кубометр)'] = {
        # Исправить
            # В реальности используют лошадиную силу. Но и пегаска сойдёт.
        # 5-6 кубометров глины за 8-часовую смену:
        # http://www.arhplan.ru/materials/bricks/dobycha-i-podgotovka-gliny-dlya-kirpicha
        'Использование 0.5-кубометра/час механической глиномялки (часов)':2,
        }

metadict_detail['Использование щита дощатого для опалубки (часов/квадратный метр)'] = {
        'Использование щита дощатого для опалубки (часов)':1,
        }

metadict_detail['Использование штабелей для сушки кирпича (часов/кубометр)'] = {
        # 3000 кирпичей в штабеле -- 6 кубометров:
        'Использование 6-кубометровых штабелей для сушки кирпича (часов)':1 / 6,
        }

metadict_detail['Использование штабелей для обжига кирпича (часов/кубометр)'] = {
        # 120 000 кирпичей в штабеле -- 480 кубометров:
        'Использование 480-кубометровых штабелей для обжига кирпича (часов)':1 / 480,
        }

metadict_detail['Использование соломенного мата для замачивания глины (часов/кубометр)'] = {
        # Глину выкладывают слоем в 0.5 метра, так что нужно два мата на кубометр.
        'Использование 1000x1000 соломенного мата (часов)':2,
        }

metadict_detail['Использование немеханизированных жерновов (часов/килограмм)'] = {
        # 1 килограмм/час
        'Использование 1-кг/час немеханизированных жерновов (часов)':1,
        }

metadict_detail['Использование молотка для чистки орехов (часов/килограмм)'] = {
        'Использование молотка в хозяйстве (часов)':1,
        }

metadict_detail['Использование ножа для рубки овощей (часов/килограмм)'] = {
        'Использование ножа для рубки овощей (часов)':1,
        }

metadict_detail['Использование ножа для шинковки овощей (часов/килограмм)'] = {
        'Использование ножа для шинковки овощей (часов)':1,
        }

metadict_detail['Использование ножа для чистки орехов (часов/килограмм)'] = {
        'Использование ножа для чистки орехов (часов)':1,
        }

metadict_detail['Использование ножа для чистки корнеплодов (часов/килограмм)'] = {
        'Использование ножа для чистки корнеплодов (часов)':1,
        }

metadict_detail['Использование ножа для чистки овощей (часов/килограмм)'] = {
        'Использование ножа для чистки овощей (часов)':1,
        }

metadict_detail['Использование ножа для чистки фруктов (часов/килограмм)'] = {
        'Использование ножа для чистки фруктов (часов)':1,
        }

metadict_detail['Использование посуды для приготовления пюре (часов/килограмм)'] = {
        'Использование 5-литровой миски для приготовления пюре (часов)':1 / 5,
        }

metadict_detail['Использование посуды для приготовления желе (часов/килограмм)'] = {
        'Использование 5-литровой миски для приготовления желе (часов)':1 / 5,
        }

metadict_detail['Использование посуды для приготовления соуса (часов/килограмм)'] = {
        'Использование 5-литровой миски для приготовления соуса (часов)':1 / 5,
        }

metadict_detail['Использование посуды для замачивания (часов/килограмм)'] = {
        'Использование 5-литровой миски для замачивания (часов)':1 / 5,
        }

metadict_detail['Использование посуды для замачивания зерна (часов/килограмм)'] = {
        'Использование 5-литровой миски для замачивания зерна (часов)':1 / 5,
        }

metadict_detail['Использование посуды для проращивания зерна (часов/килограмм)'] = {
        'Использование 5-литровой миски для проращивания зерна (часов)':1 / 5,
        }

metadict_detail['Использование самовара (часов/килограмм)'] = {
        'Использование 5-литрового самовара (часов)':1 / 5,
        }

metadict_detail['Использование формы для выпечки кексов (часов/килограмм)'] = {
        # В килограмме 20 кексов.
        'Использование 50-граммовой формы для выпечки кексов (часов)':20,
        }

metadict_detail['Использование сковороды для выпечки блинов (часов/килограмм)'] = {
        # Масса блинов -- 50 грамм
        # Блины толщиной по 3 миллиметра, объёмом: 3.14159265*0.10^2*0.003=0.0001 кубометра (0.1 литра)
        'Использование 200x30 сковороды для выпечки блинов (часов)':1,
        }

metadict_detail['Использование сковороды для жарения (часов/килограмм)'] = {
        'Использование 300x100 сковороды для жарения (часов)':1,
        }

metadict_detail['Использование сковороды для обжаривания арахиса (часов/килограмм)'] = {
        # Сковорода с диаметром 30 см и глубиной 10 см, объём 7 литров, используется на 50%
        'Использование 300x100 сковороды для обжаривания арахиса (часов)':1 / 0.5 / 7,
        }

metadict_detail['Использование сковороды для обжаривания кофе (часов/килограмм)'] = {
        'Использование 300x100 сковороды для обжаривания кофе (часов)':1 / 0.5 / 7,
        }

metadict_detail['Использование сковороды для обжаривания семян (часов/килограмм)'] = {
        'Использование 300x100 сковороды для обжаривания семян (часов)':1 / 0.5 / 7,
        }

metadict_detail['Использование таза для варки яблочного джема (часов/килограмм)'] = {
        'Использование 10-литрового таза для варки яблочного джема (часов)':1 / 0.75 / 10,
        }

metadict_detail['Использование таза для варки варенья (часов/килограмм)'] = {
        'Использование 10-литрового таза для варки варенья (часов)':1 / 0.75 / 10,
        }

metadict_detail['Использование чана для конширования шоколада (часов/килограмм)'] = {
        'Использование 300-литрового чана для конширования шоколада (часов)':1 / 0.75 / 300,
        }

metadict_detail['Использование чана для выпаривания кленового сока (часов/килограмм)'] = {
        'Использование 300-литрового чана для выпаривания кленового сока (часов)':1 / 0.75 / 300,
        }

metadict_detail['Использование чана для выпаривания сахарного тростника (часов/килограмм)'] = {
        'Использование 300-литрового чана для выпаривания сахарного тростника (часов)':1 / 0.75 / 300,
        }

metadict_detail['Использование чана для выварки яблочного сиропа (часов/килограмм)'] = {
        'Использование 300-литрового чана для выварки яблочного сиропа (часов)':1 / 0.75 / 300,
        }

metadict_detail['Использование котла для кипячения воды (часов/литр)'] = {
        'Использование 25-литрового котла для кипячения воды (часов)':1 / 0.75 / 25,
        }

metadict_detail['Использование котла для варки соевых бобов (часов/килограмм)'] = {
        'Использование 25-литрового котла для варки соевых бобов (часов)':1 / 0.75 / 25,
        }

metadict_detail['Использование большого очага для кипячения (часов/килограмм)'] = {
        'Использование большого очага (часов)':1 / 200,
        }

metadict_detail['Использование большого очага для кипячения воды (часов/килограмм)'] = {
        'Использование большого очага (часов)':1 / 200,
        }

metadict_detail['Использование печи для выпечки хлеба (часов/килограмм)'] = {
        # Исправить
            # Таки посчиатай через объём
            # Размер устья 0.5x0.35 метров
            # Хлеба 10 килограмм (10% объёма)
            # Многовато дров получается. 4.4 тонны на тонну хлеба.
        'Использование дровяной печи (часов)':1 / 10,
        }

metadict_detail['Использование печи для сушки (часов/килограмм)'] = {
        # Сушат в остывающей печи.
        'Использование дровяной печи (часов)':1 / 30,
        }

metadict_detail['Использование печи для выпечки пирога (часов/килограмм)'] = {
        'Использование дровяной печи (часов)':1 / 5,
        }

metadict_detail['Использование печи для выпечки пряников (часов/килограмм)'] = {
        # На противень тонким слоем
        'Использование дровяной печи (часов)':1,
        }

metadict_detail['Использование печи для выпечки овсяного печенья (часов/килограмм)'] = {
        'Использование дровяной печи (часов)':1,
        }

metadict_detail['Использование печи для варки (часов/килограмм)'] = {
        'Использование дровяной печи (часов)':1 / 10,
        }

metadict_detail['Использование печи для варки супа (часов/килограмм)'] = {
        'Использование дровяной печи (часов)':1 / 10,
        }

metadict_detail['Использование печи для варки каши (часов/килограмм)'] = {
        'Использование дровяной печи (часов)':1 / 10,
        }

metadict_detail['Использование печи для варки компота (часов/килограмм)'] = {
        'Использование дровяной печи (часов)':1 / 10,
        }

metadict_detail['Использование печи для варки корнеплодов (часов/килограмм)'] = {
        'Использование дровяной печи (часов)':1 / 10,
        }

metadict_detail['Использование печи для запекания (часов/килограмм)'] = {
        'Использование дровяной печи (часов)':1 / 10,
        }

metadict_detail['Использование печи для жарения (часов/килограмм)'] = {
        'Использование дровяной печи (часов)':1 / 10,
        }

#----
# Инструменты (объём тары):

metadict_detail['Использование бочки для хранения воды (часов/литр)'] = {
        'Использование 500-литровой бочки для хранения воды (часов)':1 / 500,
        }

metadict_detail['Использование бочки для хранения продовольствия (часов/литр)'] = {
        'Использование 500-литровой бочки для хранения продовольствия (часов)':1 / 500,
        }

metadict_detail['Использование бочки для хранения промышленных товаров (часов/литр)'] = {
        'Использование 500-литровой бочки для хранения промышленных товаров (часов)':1 / 500,
        }

metadict_detail['Использование ведра для хранения кленового сока (часов/литр)'] = {
        # Исправить
            # Вёдра уже используются на сборе кленового сока.
        }

metadict_detail['Использование мешка для брожения соевого соуса (часов/килограмм)'] = {
        'Использование 20-литрового мешка для брожения соевого соуса (часов)':1 / 20,
        }

metadict_detail['Использование мешка для хранения продовольствия (часов/литр)'] = {
        'Использование 20-литрового мешка для хранения продовольствия (часов)':1 / 20,
        }

metadict_detail['Использование мешка для хранения промышленных товаров (часов/литр)'] = {
        'Использование 20-литрового мешка для хранения промышленных товаров (часов)':1 / 20,
        }

metadict_detail['Использование корзины для хранения продовольствия (часов/литр)'] = {
        'Использование 100-литровой корзины для хранения продовольствия (часов)':1 / 100,
        }

metadict_detail['Использование ящика для хранения продовольствия (часов/литр)'] = {
        'Использование 100-литрового ящика для хранения несыпучих грузов (часов)':1 / 100,
        }

metadict_detail['Использование ящика для хранения несыпучих грузов (часов/литр)'] = {
        # Исправить
            # Не используется. А стоило бы.
        'Использование 100-литрового ящика для хранения несыпучих грузов (часов)':1 / 100,
        }

metadict_detail['Использование ящика для хранения сыпучих грузов (часов/литр)'] = {
        # Исправить
            # Не используется
        'Использование 100-литрового ящика для хранения сыпучих грузов (часов)':1 / 100,
        }

#----
# Инструменты (количество):

metadict_detail['Использование 50-кг/час ветряной мельницы (часов)'] = {
        # Работает по 16 часов, 200 дней в году.
        '||Ветряная мельница (50-кг/час)':1 / (16 * 200),
        }

metadict_detail['Использование 50-литрового механического винтового пресса (часов)'] = {
        # Работает по 8 часов, 30 дней в сезон сбора фруктов.
        '||Механический винтовой пресс (50 литров)':1 / (8 * 30),
        }

metadict_detail['Использование 50-литрового механического вальцевого пресса (часов)'] = {
        # Завод по переработке сахарного тростника работает в две смены
        '||Механический вальцевый пресс (50 литров)':1 / (200 * 16),
        }

metadict_detail['Использование дровяной печи (часов)'] = {
        # Исправить
            # Расход дров у тебя слишком уж зимний.
            # Вообще, теплота сгорания дров -- 15 МДЖ/килограмм
            # КПД печи не больше 75% (воздух для горения: 10 кубометров/кг дров)
            # Среднесуточная теплоотдача (с топки на 22 кг): 22*15*1000/(24*60*60)*0.75 = 2.85 кВт
            # Для расчётных 5.5 кВт теплоотдачи нужно две топки на 22 кг -- всего 44 кг/сутки
        # Как топить русскую печь: Теплушка - правила эксплуатаци
            # http://kirpichiki.pro/read/articles/teplushka-expluataciya.html
            # http://kirpichiki.pro/assets/images/gallery/pechi/krep_bashnia/020_conv.jpg
        # Особенности сжигания дров в печи
            # http://health.totalarch.com/bathhouse/5/7/2
        '||Дровяная печь (5.5 кВт)':1 / 360,
        #'Теплоотдача печи (кВт*час)':5.5,
        'Дрова (килограмм)':22,
        }

metadict_detail['Использование большого очага (часов)'] = {
        # Исправить
            # Нужно перенести сюда расход дров.
            # Испарение литра воды -- 2.26 кДж (0.63 кВт*часа)
            # Чтобы испарить 200 литров нам нужно 126 кВт*часа (без учёта потерь)
            # Кленовый сок выпаривают 15 часов, сок сахарного тростника всего 5 часов.
        #'||Большой очаг (25 кВт)':1 / (200*8),
        #'Теплоотдача очага (кВт*час)':25,
        #'Дрова (килограмм)':22,
        }

metadict_detail['Использование 5-кубометров/час механизированной лесопильной рамы (часов)'] = {
        # Лесопилка работает в одну смену, 200 дней в году.
        '||Лесопильная рама механизированная (30 кВт)':1 / (200*8),
        }

metadict_detail['Использование грузового планёра (часов)'] = {
        '||Планёр грузовой (груз 100 кг)':1 / (200*8),
        }

metadict_detail['Использование грузового поезда (часов)'] = {
        # Пример из мира людей:
        # https://ru.wikipedia.org/wiki/Паровоз_О
        '||Основной локомотив (400 кВт)':1 / (200 * 16),
        '||Вагон железнодорожный (20-тонн)':20 / (200 * 16),
        }

metadict_detail['Использование грузового барка (часов)'] = {
        # Исправить
            # Парусные суда. Каков сезон навигации?
        '||Барк грузовой (груз 1400 тонн)':1 / (200*24),
        }

metadict_detail['Использование грузовой баржи (часов)'] = {
        # Исправить
            # Пегаско-двигательные плоскодонки. Крылатые пашут в две смены.
            # Таки реки в Эквестрии замерзают, или всё же нет?
        '||Баржа грузовая (груз 200 тонн)':1 / (200*16),
        }

metadict_detail['Использование 0.3-кВт пневматической трамбовки (часов)'] = {
        '||Трамбовка пневматическая (0.3 кВт)':1 / (200 * 8),
        }

metadict_detail['Использование 0.4-кВт пневматической шпалоподбойки (часов)'] = {
        '||Шпалоподбойка пневматическая (0.4 кВт)':1 / (200 * 8),
        }

metadict_detail['Использование 0.4-кВт пневматического отбойного молотка (часов)'] = {
        '||Отбойный молоток пневматический (0.4 кВт)':1 / (200 * 8),
        }

metadict_detail['Использование 0.5-тонного механического подъёмника (часов)'] = {
        '||Лебёдка монтажная (0.5 тонны)':1 / (200 * 8),
        }

metadict_detail['Использование 0.5-тонной лебёдки (часов)'] = {
        '||Лебёдка монтажная (0.5 тонны)':1 / (200 * 8),
        }

metadict_detail['Использование 10-тонного винтового домкрата (часов)'] = {
        '||Домкрат винтовой (10 тонн)':1 / (200 * 8),
        }

metadict_detail['Использование 8-тонного 60-кВт механического катка (часов)'] = {
        '||Каток механический (60 кВт)':1 / (200 * 16),
        }

metadict_detail['Использование 20-тонного вагона (часов)'] = {
        '||Вагон железнодорожный (20-тонн)':1 / (200 * 16),
        }

metadict_detail['Использование 30-тонной платформы (часов)'] = {
        '||Платформа железнодорожная (30-тонн)':1 / (200 * 16),
        }

metadict_detail['Использование 300-литрового чана для бетона (часов)'] = {
        '||Чан чугунный (300 литров)':1 / (200 * 8),
        }

metadict_detail['Использование 300-литрового чана для раствора (часов)'] = {
        '||Чан чугунный (300 литров)':1 / (200 * 8),
        }

metadict_detail['Использование 300-литрового чана для варки битума (часов)'] = {
        '||Чан чугунный (300 литров)':1 / (200 * 8),
        }

metadict_detail['Использование 400-кВт маневрового локомотива (часов)'] = {
        '||Локомотив маневровый (400 кВт)':1 / (200 * 16),
        }

metadict_detail['Использование 5-кубометров/минуту 700 кПа компрессора (часов)'] = {
        '||Компрессор винтовой (30 кВт)':1 / (200 * 8),
        }

metadict_detail['Использование 8-тонного башенного крана (часов)'] = {
        '||Кран башенный (8 тонн)':1 / (200 * 8),
        }

metadict_detail['Использование гаечного ключа (часов)'] = {
        '||Ключ гаечный':1 / (200 * 8),
        }

metadict_detail['Использование 2-кВт цепной механической пилы (часов)'] = {
        '||Пила механическая цепная (2 кВт)':1 / (200 * 8),
        }

metadict_detail['Использование коловорота (часов)'] = {
        '||Коловорот':1 / (200 * 8),
        }

metadict_detail['Использование кувалды для забивки костылей (часов)'] = {
        '||Кувалда':1 / (200 * 8),
        }

metadict_detail['Использование 1-кВт пневматического костылезабивщика (часов)'] = {
        '||Костылезабивник пневматический (1 кВт)':1 / (200 * 8),
        }

metadict_detail['Использование роликового транспортёра (часов)'] = {
        '||Транспортёр роликовый':1 / (200 * 16),
        }

metadict_detail['Использование рубанка (часов)'] = {
        '||Рубанок':1 / (200 * 8),
        }

metadict_detail['Использование упряжного скрепера на 0.5 кубометра (часов)'] = {
        '||Скрепер упряжной (0.5 кубометра)':1 / (200 * 8),
        }

metadict_detail['Использование 1.5-кВт сверлильного станка (часов)'] = {
        '||Станок сверлильный (1.5 кВт)':1 / (200 * 8),
        }

metadict_detail['Использование 1.5-кВт металлорежущего станка (часов)'] = {
        '||Станок металлорежущий (1.5 кВт)':1 / (200 * 8),
        }

metadict_detail['Использование 1.5-кВт шлифовального станка (часов)'] = {
        '||Станок шлифовальный (1.5 кВт)':1 / (200 * 8),
        }

metadict_detail['Использование 1-кг/час немеханизированных жерновов (часов)'] = {
        # Исправить
            # Кофемолка. Нужна ли? Можно и ступой обойтись
        # Каждый месяц один час на помол зёрен для кофе
        # Используется каждую неделю (понячья неделя -- 6 дней):
        '||Жернова (1-кг/час)':1 / (360/6),
        }

metadict_detail['Использование 5-литрового чугунка для варки (часов)'] = {
        # Исправить
            # Нужно добавить коэффициент частоты использования.
            # Хотя, этот параметр сильно зависит от богатства.
            # Тогда ставь пораметр "Нужен"
        # Используется каждый день (если нужен).
        '||Чугунок (5 литров)':1 / 360,
        }

metadict_detail['Использование 5-литрового чугунка для варки каши (часов)'] = {
        '||Чугунок (5 литров)':1 / 360,
        }

metadict_detail['Использование 5-литрового чугунка для варки супа (часов)'] = {
        '||Чугунок (5 литров)':1 / 360,
        }

metadict_detail['Использование 5-литрового чугунка для варки компота (часов)'] = {
        '||Чугунок (5 литров)':1 / 360,
        }

metadict_detail['Использование 5-литрового чугунка для варки сиропа (часов)'] = {
        '||Чугунок (5 литров)':1 / 360,
        }

metadict_detail['Использование 5-литрового чугунка для варки корнеплодов (часов)'] = {
        '||Чугунок (5 литров)':1 / 360,
        }

metadict_detail['Использование 500-литровой бочки для брожения виноградного сусла (часов)'] = {
        # Вино хранится и перевозится в тех же бочках.
        '||Бочка деревянная (500 литров)':1 / (360*24),
        }

metadict_detail['Использование 500-литровой бочки для брожения сусла (часов)'] = {
        '||Бочка деревянная (500 литров)':1 / (360*24),
        }

metadict_detail['Использование 500-литровой бочки для приготовления эля (часов)'] = {
        '||Бочка деревянная (500 литров)':1 / (24*14),
        }

metadict_detail['Использование 500-литровой кадки для квашения капусты (часов)'] = {
        # Капусту готовят за две недели, но хранят в кадках весь год.
        '||Кадка деревянная (500 литров)':1 / (24*14),
        }

metadict_detail['Использование 500-литровой кадки для консервации овощей (часов)'] = {
        '||Кадка деревянная (500 литров)':1 / (24*30),
        }

metadict_detail['Использование 500-литровой кадки для консервации фруктов (часов)'] = {
        '||Кадка деревянная (500 литров)':1 / (24*30),
        }

metadict_detail['Использование 10-литрового ведра для мытья (часов)'] = {
        # По пять минут каждый день?
        '||Ведро деревянное (10 литров)':1 / (360*(5/60)),
        }

metadict_detail['Использование 10-литрового ведра для мытья корнеплодов (часов)'] = {
        '||Ведро деревянное (10 литров)':1 / (360*(5/60)),
        }

metadict_detail['Использование 10-литрового ведра для мытья овощей (часов)'] = {
        '||Ведро деревянное (10 литров)':1 / (360*(5/60)),
        }

metadict_detail['Использование 10-литрового ведра для мытья сухофруктов (часов)'] = {
        '||Ведро деревянное (10 литров)':1 / (360*(5/60)),
        }

metadict_detail['Использование 10-литрового ведра для мытья фруктов (часов)'] = {
        '||Ведро деревянное (10 литров)':1 / (360*(5/60)),
        }

metadict_detail['Использование 10-литрового ведра для мытья посуды (часов)'] = {
        '||Ведро деревянное (10 литров)':1 / (360*(5/60)),
        }

metadict_detail['Использование 50-литровой квашни для приготовления кваса (часов)'] = {
        # 15 часов каждую неделю
        '||Квашня деревянная (50 литров)':1 / (60*15),
        }

metadict_detail['Использование 50-литровой квашни для приготовления эля (часов)'] = {
        '||Квашня деревянная (50 литров)':1 / (60*15),
        }

metadict_detail['Использование 50-литровой квашни для брожения теста (часов)'] = {
        # 15 часов каждую неделю
        '||Квашня деревянная (50 литров)':1 / (60*15),
        }

metadict_detail['Использование 50-литровой квашни для брожения соевого соуса (часов)'] = {
        # Соус готовится весь год
        '||Квашня деревянная (50 литров)':1 / (12*30*24),
        }

metadict_detail['Использование 50-литровой квашни для заваривания теста (часов)'] = {
        # 15 дней каждый месяц
        '||Квашня деревянная (50 литров)':1 / (12*15*24),
        }

metadict_detail['Использование 1800x600 противеня для сушки (часов)'] = {
        '||Противень для выпечки (квадратный метр)':1 / 360,
        }

metadict_detail['Использование 1800x600 листа для вяления чайных листьев (часов)'] = {
        # Сезон сушки фруктов -- месяц.
        '||Лист сушильный (квадратный метр)':1 / (30*24),
        }

metadict_detail['Использование 1800x600 листа для сушки растений (часов)'] = {
        '||Лист сушильный (квадратный метр)':1 / (30*24),
        }

metadict_detail['Использование 1800x600 листа для сушки солода (часов)'] = {
        '||Лист сушильный (квадратный метр)':1 / (30*24),
        }

metadict_detail['Использование 1800x600 листа для сушки фруктов (часов)'] = {
        '||Лист сушильный (квадратный метр)':1 / (30*24),
        }

metadict_detail['Использование 1800x600 листа для сушки крахмала (часов)'] = {
        '||Лист сушильный (квадратный метр)':1 / (30*24),
        }

metadict_detail['Использование 1800x600 стола для нарезки фруктов (часов)'] = {
        # По часу каждый день
        '||Стол кухонный (квадратный метр)':1 / 360,
        }

metadict_detail['Использование 1800x600 стола для шинковки овощей (часов)'] = {
        '||Стол кухонный (квадратный метр)':1 / 360,
        }

metadict_detail['Использование 1800x600 стола для перебора крупы (часов)'] = {
        '||Стол кухонный (квадратный метр)':1 / 360,
        }

metadict_detail['Использование 1800x600 стола для перебора овощей (часов)'] = {
        '||Стол кухонный (квадратный метр)':1 / 360,
        }

metadict_detail['Использование 1800x600 стола для перебора грибов (часов)'] = {
        '||Стол кухонный (квадратный метр)':1 / 360,
        }

metadict_detail['Использование 1800x600 стола для перебора трав (часов)'] = {
        '||Стол кухонный (квадратный метр)':1 / 360,
        }

metadict_detail['Использование 1800x600 стола для перебора фруктов (часов)'] = {
        '||Стол кухонный (квадратный метр)':1 / 360,
        }

metadict_detail['Использование 1800x600 стола для перебора ягод (часов)'] = {
        '||Стол кухонный (квадратный метр)':1 / 360,
        }

metadict_detail['Использование 1800x600 стола для чистки орехов (часов)'] = {
        '||Стол кухонный (квадратный метр)':1 / 360,
        }

metadict_detail['Использование 1800x600 стола для рубки овощей (часов)'] = {
        '||Стол кухонный (квадратный метр)':1 / 360,
        }

metadict_detail['Использование 1800x600 стола для ферментации (часов)'] = {
        '||Стол кухонный (квадратный метр)':1 / 360,
        }

metadict_detail['Использование 1800x600 стола для ферментации чайных листьев (часов)'] = {
        '||Стол кухонный (квадратный метр)':1 / 360,
        }

metadict_detail['Использование 1800x600 стола для чистки корнеплодов (часов)'] = {
        '||Стол кухонный (квадратный метр)':1 / 360,
        }

metadict_detail['Использование 1800x600 стола для чистки овощей (часов)'] = {
        '||Стол кухонный (квадратный метр)':1 / 360,
        }

metadict_detail['Использование 1800x600 стола для чистки фруктов (часов)'] = {
        '||Стол кухонный (квадратный метр)':1 / 360,
        }

metadict_detail['Использование 200x30 сковороды для выпечки блинов (часов)'] = {
        '||Сковорода (2 литра)':1 / ((360/6)*(10/60)),
        }

metadict_detail['Использование 50-граммовой формы для выпечки кексов (часов)'] = {
        '||Форма для выпечки кексов (50 грамм)':1 / ((360/6)*(10/60)),
        }

metadict_detail['Использование 300x100 сковороды для обжаривания арахиса (часов)'] = {
        # По 10 минут каждую неделю.
        '||Сковорода (5 литров)':1 / ((360/6)*(10/60)),
        }

metadict_detail['Использование 300x100 сковороды для обжаривания кофе (часов)'] = {
        '||Сковорода (5 литров)':1 / ((360/6)*(10/60)),
        }

metadict_detail['Использование 300x100 сковороды для обжаривания семян (часов)'] = {
        '||Сковорода (5 литров)':1 / ((360/6)*(10/60)),
        }

metadict_detail['Использование 300x100 сковороды для жарения (часов)'] = {
        '||Сковорода (5 литров)':1 / ((360/6)*(10/60)),
        }

metadict_detail['Использование 5-литрового самовара (часов)'] = {
        # По часу каждый день
        '||Самовар (5 литров)':1 / 360,
        }

metadict_detail['Использование 25-литрового котла для кипячения воды (часов)'] = {
        '||Котёл чугунный (25 литров)':2 / 360,
        }

metadict_detail['Использование 25-литрового котла для варки соевых бобов (часов)'] = {
        '||Котёл чугунный (25 литров)':3 / 360,
        }

metadict_detail['Использование 5-литровой миски для замачивания (часов)'] = {
        '||Миска глиняная (5 литров)':1 / 360,
        }

metadict_detail['Использование 5-литровой миски для замачивания зерна (часов)'] = {
        '||Миска глиняная (5 литров)':1 / 360,
        }

metadict_detail['Использование 5-литровой миски для проращивания зерна (часов)'] = {
        '||Миска глиняная (5 литров)':1 / (24 * 2),
        }

metadict_detail['Использование 5-литровой миски для приготовления пюре (часов)'] = {
        '||Миска глиняная (5 литров)':1 / 360,
        }

metadict_detail['Использование 5-литровой миски для приготовления желе (часов)'] = {
        '||Миска глиняная (5 литров)':1 / 360,
        }

metadict_detail['Использование 5-литровой миски для приготовления соуса (часов)'] = {
        '||Миска глиняная (5 литров)':1 / 360,
        }

metadict_detail['Использование 1-тонн/час шахтного колодца (часов)'] = {
        # Используется по 4 часа, 360 дней в году.
        '||Колодец шахтный (тонна/час)':1 / (4 * 360),
        }

metadict_detail['Использование доски для нарезки (часов)'] = {
        '||Доска кухонная':1 / (2 * 360),
        }

metadict_detail['Использование ножа для рубки овощей (часов)'] = {
        '||Тесак кухонный':1 / 360,
        }

metadict_detail['Использование ножа для нарезки фруктов (часов/килограмм)'] = {
        # Работает по часу каждый день.
        '||Нож кухонный':1 / 360,
        }

metadict_detail['Использование ножа для шинковки овощей (часов)'] = {
        '||Нож кухонный':1 / 360,
        }

metadict_detail['Использование ножа для чистки орехов (часов)'] = {
        '||Нож кухонный':1 / 360,
        }

metadict_detail['Использование ножа для чистки корнеплодов (часов)'] = {
        '||Нож-овощечистка':1 / 360,
        }

metadict_detail['Использование ножа для чистки овощей (часов)'] = {
        '||Нож-овощечистка':1 / 360,
        }

metadict_detail['Использование ножа для чистки фруктов (часов)'] = {
        '||Нож-овощечистка':1 / 360,
        }

metadict_detail['Использование уголка для сбора кленового сока (часов)'] = {
        # Сезон длится 15 дней (март-апрель),
        # с дерева 40 литров; 4 отверстия, 2 литра/день (5 дней, 1/3 сезона).
        '||Уголок для сбора кленового сока':1 / (15*5*3),
        }

metadict_detail['Использование 10-литрового ведра для сбора кленового сока (часов)'] = {
        # Сезон длится 15 дней (март-апрель),
        # с дерева 40 литров; 4 отверстия, 2 литра/день (5 дней, 1/3 сезона).
        '||Ведро деревянное (10 литров)':1 / (15*5*3),
        }

metadict_detail['Использование 300-литрового чана для выпаривания кленового сока (часов)'] = {
        # Сезон длится 14 дней, циклы варки по 15 часов.
        '||Чан чугунный (300 литров)':1 / (14*15),
        }

metadict_detail['Использование 300-литрового чана для выварки яблочного сиропа (часов)'] = {
        # Сезон длится 60 дней, циклы варки по 8 часов.
        '||Чан чугунный (300 литров)':1 / (60*8),
        }

metadict_detail['Использование 10-литрового таза для варки яблочного джема (часов)'] = {
        # Перерабатывают яблоки 30 дней после сбора урожая.
        '||Таз эмалированный (10 литров)':1 / (30*8),
        }

metadict_detail['Использование 10-литрового таза для варки варенья (часов)'] = {
        '||Таз эмалированный (10 литров)':1 / (30*8),
        }

metadict_detail['Использование 300-литрового чана для конширования шоколада (часов)'] = {
        '||Чан чугунный (300 литров)':1 / (200 * 8),
        }

metadict_detail['Использование 300-литрового чана для выпаривания сахарного тростника (часов)'] = {
        '||Чан чугунный (300 литров)':1 / (200 * 16),
        }

metadict_detail['Использование 1-литровой миски для еды (часов)'] = {
        # По два часа каждый день
        '||Миска для еды (1 литр)':1 / (360*2),
        }

metadict_detail['Использование 1.5-литровой кружки для питья (часов)'] = {
        '||Кружка для питья (1.5 литра)':1 / (360*2),
        }

metadict_detail['Использование 10-литрового ведра для воды (часов)'] = {
        '||Ведро деревянное (10 литров)':1 / 360,
        }

metadict_detail['Использование 500-литровой кадки для воды (часов)'] = {
        '||Кадка деревянная (500 литров)':1 / 360,
        }

metadict_detail['Использование 100-литровой бочки для перевозки воды (часов)'] = {
        '||Бочка деревянная (100 литров)':1 / 360,
        }

metadict_detail['Использование 500-литровой бочки для перевозки воды (часов)'] = {
        '||Бочка деревянная (500 литров)':1 / 360,
        }

metadict_detail['Использование 10-литрового ведра для переноски воды (часов)'] = {
        '||Ведро деревянное (10 литров)':1 / 360,
        }

metadict_detail['Использование граблей для перемешивания глины (часов)'] = {
        '||Грабли':1 / (200 * 8),
        }

metadict_detail['Использование топора для колки дров (часов)'] = {
        '||Топор':1 / 360,
        }

metadict_detail['Использование топора для валки леса (часов)'] = {
        '||Топор':1 / (200 * 8),
        }

metadict_detail['Использование топора для обработки древесины (часов)'] = {
        '||Топор':1 / (200 * 8),
        }

metadict_detail['Использование топора для колки пней на смоляк (часов)'] = {
        '||Топор':1 / (200 * 8),
        }

metadict_detail['Использование киркомотыги для корчёвки сосновых пней (часов)'] = {
        '||Киркомотыга':1 / (200 * 8),
        }

metadict_detail['Использование киркомотыги для корчёвки пней (часов)'] = {
        '||Киркомотыга':1 / (200 * 8),
        }

metadict_detail['Использование лопаты для перемещения глины (часов)'] = {
        '||Лопата большая':1 / (200 * 8),
        }

metadict_detail['Использование лопаты для земляных работ (часов)'] = {
        '||Лопата большая':1 / (200 * 8),
        }

metadict_detail['Использование грузовой тележки (часов)'] = {
        '||Тележка грузовая (груз 100 кг)':1 / (200 * 8),
        }

metadict_detail['Использование грузовой телеги (часов)'] = {
        '||Телега грузовая (груз 1000 кг)':1 / (200 * 8),
        }

metadict_detail['Использование упряжного грейдера (часов)'] = {
        '||Грейдер упряжной':1 / (200 * 8),
        }

metadict_detail['Использование упряжного грейдера для земляных работ (часов)'] = {
        '||Грейдер упряжной':1 / (200 * 8),
        }

metadict_detail['Использование упряжного грейдера для перемещения глины (часов)'] = {
        '||Грейдер упряжной':1 / (200 * 8),
        }

metadict_detail['Использование 30-кВт механического копателя (часов)'] = {
        '||Механический копатель (30 кВт)':1 / (200 * 8),
        }

metadict_detail['Использование 0.5-кубометра/час механической глиномялки (часов)'] = {
        '||Глиномялка механическая (0.5-кубометра/час)':1 / (200 * 8),
        }

metadict_detail['Использование 90-кВт насоса высокого давления (часов)'] = {
        '||Насос высокого давления (90-кВт)':1 / (200 * 8),
        }

metadict_detail['Использование прямоугольного мундштука для глиномялки (часов)'] = {
        # Исправить
            # Эта фигня, вообще, нужна?
        }

metadict_detail['Использование 8-кубометровой смоляной печи (часов)'] = {
        # исправить
            # Печь таки не работает круглые сутки.
            # Её ведь перезагружать нужно!
        '||Печь смоляная (6 литров/час)':1 / (200 * 24),
        }

metadict_detail['Использование 1000x1000 соломенного мата (часов)'] = {
        '||Мат соломенный (квадратный метр)':1 / (200 * 24),
        }

metadict_detail['Использование станка для резки кирпича (часов)'] = {
        '||Станок для резки кирпича':1 / (200 * 8),
        }

metadict_detail['Использование станка сверлильно-шлифовального (часов)'] = {
        '||Станок сверлильно-шлифовальный (1.5 кВт)':1 / (200 * 8),
        }

metadict_detail['Использование щита дощатого для опалубки (часов)'] = {
        # Исправить
            # Как-то неуместно смотрится в инструментах
        '||Дощатый щит (квадратный метр)':1 / (200 * 8),
        }

metadict_detail['Использование молотка в хозяйстве (часов)'] = {
        '||Молоток':1 / (200 * 8),
        }

metadict_detail['Использование 6-кубометровых штабелей для сушки кирпича (часов)'] = {
        # Сушка длится 15 суток:
        '||Штабель для сушки кирпича':1 / (24 * 15),
        }

metadict_detail['Использование 480-кубометровых штабелей для обжига кирпича (часов)'] = {
        # Обжиг длится 200 часов:
        '||Штабель для обжига кирпича':1 / 200,
        }

metadict_detail['Использование 100-литрового ящика для хранения несыпучих грузов (часов)'] = {
        # Исправить
            # Не используется
        '||Ящик деревянный решётчатый (100 литров)':1 / (360*24),
        }

metadict_detail['Использование 100-литрового ящика для хранения сыпучих грузов (часов)'] = {
        # Исправить
            # Не используется
        '||Ящик деревянный щитовой (100 литров)':1 / (360*24),
        }

metadict_detail['Использование 500-литровой бочки для хранения воды (часов)'] = {
        '||Бочка деревянная (500 литров)':1 / (360*24),
        }

metadict_detail['Использование 500-литровой бочки для хранения продовольствия (часов)'] = {
        '||Бочка деревянная (500 литров)':1 / (360*24),
        }

metadict_detail['Использование 500-литровой бочки для хранения промышленных товаров (часов)'] = {
        '||Бочка деревянная (500 литров)':1 / (360*24),
        }

metadict_detail['Использование 20-литрового мешка для брожения соевого соуса (часов)'] = {
        '||Мешок холщёвый (20 литров)':1 / (360*24),
        }

metadict_detail['Использование 20-литрового мешка для хранения продовольствия (часов)'] = {
        '||Мешок холщёвый (20 литров)':1 / (360*24),
        }

metadict_detail['Использование 20-литрового мешка для хранения промышленных товаров (часов)'] = {
        '||Мешок холщёвый (20 литров)':1 / (360*24),
        }

metadict_detail['Использование 100-литровой корзины для хранения продовольствия (часов)'] = {
        '||Корзина плетёная (100 литров)':1 / (360*24),
        }

#----
# Инструменты (комплекты):

metadict_detail['Использование инструментов каменщика (часов)'] = {
        '||Инструменты каменщика (комплект)':1 / (200 * 8),
        }

metadict_detail['Использование инструментов штукатура (часов)'] = {
        '||Инструменты штукатура (комплект)':1 / (200 * 8),
        }

metadict_detail['Использование инструментов маляра (часов)'] = {
        '||Инструменты маляра (комплект)':1 / (200 * 8),
        }

metadict_detail['Использование инструментов железнодорожника (часов)'] = {
        '||Инструменты железнодорожника (комплект)':1 / (200 * 8),
        }
