#----
# Обжитые земли: 

metadict_detail['|----Обжитые земли (гектар)'] = {
        # Исправить
            # Теперь нужно узнать радиус круга полей.
            # Например, Понивиль (38.4 кв.километров)
            # (38.4 / 3.14159265) ** (1/2) = 3.496155
            # Проблема в том, что скрипт не умеет в корни.
        '|----Обжитые земли (квадратный километр)':1 / 100,
        }

#----
# Административное деление:

metadict_detail['-----Мегаполисы'] = {
        }

metadict_detail['-----Округа'] = {
        }

metadict_detail['----Кантоны'] = {
        }

metadict_detail['---Города'] = {
        }

metadict_detail['---Городки'] = {
        }

metadict_detail['--Деревни'] = {
        }

metadict_detail['--Селения'] = {
        }

metadict_detail['--Фермы'] = {
        }

metadict_detail['-Семьи'] = {
        }

#----
# Убираем лишние параметры из вывода (их можно вызвать по ключу -e)

metadict_detail['-Уксусная кислота (грамм)'] = {
        }

metadict_detail['|-Пчелиная семья (Ápis melliféra)'] = {
        }

metadict_detail['--Питательные вещества (грамм)'] = {
        }

metadict_detail['---Калорийность пищи (килокалорий)'] = {
        }

metadict_detail['---Алкоголь (литров)'] = {
        }

metadict_detail['|-Сосновая вырубка (гектар)'] = {
        }

metadict_detail['|--Дровяные деревья'] = {
        }

metadict_detail['|--Прутовые деревья'] = {
        }

metadict_detail['|--Строевые деревья'] = {
        }

metadict_detail['|--Плодовые деревья'] = {
        }

#----
# Складские помещения.

metadict_detail['-Площадь амбара (квадратный метр)'] = {
        '--Площадь складских помещений (квадратный метр)':1,
        }

metadict_detail['-Площадь полуподвала (квадратный метр)'] = {
        '--Площадь складских помещений (квадратный метр)':1,
        }

metadict_detail['-Площадь погреба (квадратный метр)'] = {
        '--Площадь складских помещений (квадратный метр)':1,
        }

metadict_detail['-Площадь ледника (квадратный метр)'] = {
        '--Площадь складских помещений (квадратный метр)':1,
        }

metadict_detail['-Площадь чердака (квадратный метр)'] = {
        '--Площадь складских помещений (квадратный метр)':1,
        }

metadict_detail['--Площадь складских помещений (квадратный метр)'] = {
        }

metadict_detail['-Площадь жилых помещений (квадратный метр)'] = {
        }

metadict_detail['-Площадь общественных помещений (квадратный метр)'] = {
        }

metadict_detail['-Площадь хозяйственных помещений (квадратный метр)'] = {
        }

metadict_detail['-Объём помещений (кубометр)'] = {
        }

#----
# Всю эту домашнюю утварь и инструменты потом подсчитаем, когда будет готова денежная система:

metadict_detail['|Бинокль'] = {
        }

metadict_detail['|Блюдо для еды (2 литра)'] = {
        }

metadict_detail['|Блюдце для еды (0.5 литра)'] = {
        }

metadict_detail['|Бункер для раствора (кубометр)'] = {
        }

metadict_detail['|Бучарда штукатурная'] = {
        }

metadict_detail['|Валик для окраски поверхностей'] = {
        }

metadict_detail['|Ванночка с сеткой'] = {
        }

metadict_detail['|Ведро деревянное (10 литров)'] = {
        }

metadict_detail['|Визирки (для определения величины просадок)'] = {
        }

metadict_detail['|Вилы щебёночные'] = {
        }

metadict_detail['|Воронка кухонная'] = {
        }

metadict_detail['|Вышка передвижная сборно-разборная'] = {
        }

metadict_detail['|Гладилка стальная большая'] = {
        }

metadict_detail['|Гладилка стальная малая'] = {
        }

metadict_detail['|Горшок для углей (10 литров)'] = {
        }

metadict_detail['|Горшок печной (1 литр)'] = {
        }

metadict_detail['|Горшок печной (2 литра)'] = {
        }

metadict_detail['|Горшок печной (5 литров)'] = {
        }

metadict_detail['|Дексель (для затёски шпал)'] = {
        }

metadict_detail['|Деревянная бочка (300 литров)'] = {
        }

metadict_detail['|Деревянная кадка (100 литров)'] = {
        }

metadict_detail['|Деревянная кадка (300 литров)'] = {
        }

metadict_detail['|Деревянное ведро (10 литров)'] = {
        }

metadict_detail['|Диван'] = {
        }

metadict_detail['|Долото'] = {
        }

metadict_detail['|Домкрат винтовой (10 тонн)'] = {
        }

metadict_detail['|Доска для овощей'] = {
        }

metadict_detail['|Доска для теста'] = {
        }

metadict_detail['|Дрель пневматическая (0.5 кВт)'] = {
        }

metadict_detail['|Дровяная печь (5.5 кВт)'] = {
        }

metadict_detail['|Дровяная печь (2.5 кВт)'] = {
        }

metadict_detail['|Дуршлаг кухонный'] = {
        }

metadict_detail['|Душ'] = {
        }

metadict_detail['|Жернова (1-кг/час)'] = {
        }

metadict_detail['|Зеркало'] = {
        }

metadict_detail['|Зеркало (для осмотра рельсов)'] = {
        }

metadict_detail['|Зубило кузнечное'] = {
        }

metadict_detail['|Зубило слесарное'] = {
        }

metadict_detail['|Инвентарные шарнирно-панельные подмостки'] = {
        }

metadict_detail['|Каска строительная пластиковая'] = {
        }

metadict_detail['|Квашня деревянная (50 литров)'] = {
        }

metadict_detail['|Кельма для каменных работ'] = {
        }

metadict_detail['|Кельма штукатурная'] = {
        }

metadict_detail['|Кирка остроконечная'] = {
        }

metadict_detail['|Кисть маховая'] = {
        }

metadict_detail['|Кисть филенчатая'] = {
        }

metadict_detail['|Кисть флейцовая КФ-62'] = {
        }

metadict_detail['|Кисть-макловица'] = {
        }

metadict_detail['|Кисть-ручник КР-35'] = {
        }

metadict_detail['|Клещи обыкновенные'] = {
        }

metadict_detail['|Клещи шпальные'] = {
        }

metadict_detail['|Ключ путевой рожковый'] = {
        }

metadict_detail['|Ключ торцовый (гаечный)'] = {
        }

metadict_detail['|Ключ торцовый (шурупный)'] = {
        }

metadict_detail['|Ковш деревянный (5 литров)'] = {
        }

metadict_detail['|Ковш для отделочных работ'] = {
        }

metadict_detail['|Ковшик для питья (1 литр)'] = {
        }

metadict_detail['|Ковёр (квадратный метр)'] = {
        }

metadict_detail['|Когти для щебня'] = {
        }

metadict_detail['|Коловорот (по дереву)'] = {
        }

metadict_detail['|Коловорот (по металлу)'] = {
        }

metadict_detail['|Комод'] = {
        }

metadict_detail['|Компрессор винтовой (30 кВт)'] = {
        }

metadict_detail['|Котёл чугунный (50 литров)'] = {
        }

metadict_detail['|Кочерга литая'] = {
        }

metadict_detail['|Кран для воды'] = {
        }

metadict_detail['|Кровать двуспальная'] = {
        }

metadict_detail['|Кровать односпальная'] = {
        }

metadict_detail['|Кружка для питья (1.5 литра)'] = {
        }

metadict_detail['|Кружка мерная (для суфляжа)'] = {
        }

metadict_detail['|Кувалда (5 килограмм)'] = {
        }

metadict_detail['|Кувшин (3 литра)'] = {
        }

metadict_detail['|Кувшин (5 литров)'] = {
        }

metadict_detail['|Лампа светляковая (1200 Лм)'] = {
        }

metadict_detail['|Лампа светокристальная (1200 Лм)'] = {
        }

metadict_detail['|Лампа светокристальная (600 Лм)'] = {
        }

metadict_detail['|Линейка для расшивки швов'] = {
        }

metadict_detail['|Линейка измерительная металлическая'] = {
        }

metadict_detail['|Линейка метровая (для измерения неровностей рельсов)'] = {
        }

metadict_detail['|Лом лапчатый'] = {
        }

metadict_detail['|Лом монтажный'] = {
        }

metadict_detail['|Лом остроконечный'] = {
        }

metadict_detail['|Лопата деревянная'] = {
        }

metadict_detail['|Лопата печная'] = {
        }

metadict_detail['|Лопата растворная'] = {
        }

metadict_detail['|Лопата совковая'] = {
        }

metadict_detail['|Лопата суфляжная'] = {
        }

metadict_detail['|Лопата штыковая'] = {
        }

metadict_detail['|Лопатка кухонная'] = {
        }

metadict_detail['|Лупа (для осмотра рельсов)'] = {
        }

metadict_detail['|Метла'] = {
        }

metadict_detail['|Метр металлический'] = {
        }

metadict_detail['|Метр складной металлический'] = {
        }

metadict_detail['|Метёлка печная'] = {
        }

metadict_detail['|Механический насос (35 литров/минуту)'] = {
        }

metadict_detail['|Миска глиняная (3 литра)'] = {
        }

metadict_detail['|Миска глиняная (5 литров)'] = {
        }

metadict_detail['|Миска для еды (1 литр)'] = {
        }

metadict_detail['|Молоток (для остукивания рельсов)'] = {
        }

metadict_detail['|Молоток костыльный'] = {
        }

metadict_detail['|Молоток слесарный'] = {
        }

metadict_detail['|Молоток штукатурный'] = {
        }

metadict_detail['|Молоток-кирочка'] = {
        }

metadict_detail['|Наддёргиватель путевых костылей'] = {
        }

metadict_detail['|Напильник трёхгранный (150 мм)'] = {
        }

metadict_detail['|Напольная раковина'] = {
        }

metadict_detail['|Нож кухонный (10 см)'] = {
        }

metadict_detail['|Нож кухонный (6 см)'] = {
        }

metadict_detail['|Нож столовый'] = {
        }

metadict_detail['|Нож штукатурный'] = {
        }

metadict_detail['|Нож-овощечистка'] = {
        }

metadict_detail['|Ножницы для резки металла'] = {
        }

metadict_detail['|Ножницы кухонные'] = {
        }

metadict_detail['|Ножовка по дереву широкая'] = {
        }

metadict_detail['|Обводной привод'] = {
        }

metadict_detail['|Острогубцы (кусачки)'] = {
        }

metadict_detail['|Отвес строительный'] = {
        }

metadict_detail['|Отрезовка'] = {
        }

metadict_detail['|Очки защитные'] = {
        }

metadict_detail['|Пила механическая цепная (2 кВт)'] = {
        }

metadict_detail['|Пила ножовка поперечная по дереву'] = {
        }

metadict_detail['|Пила поперечная'] = {
        }

metadict_detail['|Пила-ножовка'] = {
        }

metadict_detail['|Поварёшка деревянная'] = {
        }

metadict_detail['|Поварёшка стальная'] = {
        }

metadict_detail['|Поддон с металлическими крючьями'] = {
        }

metadict_detail['|Подмости панельные для кирпичной кладки'] = {
        }

metadict_detail['|Полотенце кухонное'] = {
        }

metadict_detail['|Полутёрка деревянная'] = {
        }

metadict_detail['|Поэтажная ёмкость 0.35'] = {
        }

metadict_detail['|Пояс монтажный'] = {
        }

metadict_detail['|Правило'] = {
        }

metadict_detail['|Правило окованное'] = {
        }

metadict_detail['|Правило прижимное'] = {
        }

metadict_detail['|Правило усеночное'] = {
        }

metadict_detail['|Прибор стяжной (для перешивки пути)'] = {
        }

metadict_detail['|Приспособление для шлифовки поверхностей'] = {
        }

metadict_detail['|Прозорник стыковой'] = {
        }

metadict_detail['|Прозорник-прокладка'] = {
        }

metadict_detail['|Противень жестяной'] = {
        }

metadict_detail['|Путевой ключ механичесикй (0.4 кВт)'] = {
        }

metadict_detail['|Разгонщик гидравлический'] = {
        }

metadict_detail['|Раковина'] = {
        }

metadict_detail['|Расшивка'] = {
        }

metadict_detail['|Расшивка (выпуклая и вогнутая)'] = {
        }

metadict_detail['|Рейка контрольная длиной 2 м'] = {
        }

metadict_detail['|Рейка с отвесом'] = {
        }

metadict_detail['|Рейка-порядовка'] = {
        }

metadict_detail['|Рейкодержатель винтовой'] = {
        }

metadict_detail['|Рейкодержатель дуговой'] = {
        }

metadict_detail['|Рейкодержатель универсальный'] = {
        }

metadict_detail['|Рейкодержатель штыревой'] = {
        }

metadict_detail['|Респиратор ШБ1'] = {
        }

metadict_detail['|Решето рогожно-деревянное'] = {
        }

metadict_detail['|Рихтовщик гидравлический'] = {
        }

metadict_detail['|Рубанок'] = {
        }

metadict_detail['|Рулетка (30 метров)'] = {
        }

metadict_detail['|Рулетка металлическая'] = {
        }

metadict_detail['|Рулетки измерительные металлические'] = {
        }

metadict_detail['|Самовар медный (5 литров)'] = {
        }

metadict_detail['|Сито для муки'] = {
        }

metadict_detail['|Скалка кухонная'] = {
        }

metadict_detail['|Скоба (для перегонки шпал)'] = {
        }

metadict_detail['|Скобы литые'] = {
        }

metadict_detail['|Сковорода (2 литра)'] = {
        }

metadict_detail['|Сковорода (5 литров)'] = {
        }

metadict_detail['|Сковородник'] = {
        }

metadict_detail['|Скрапели диаметром 8 и 10 мм'] = {
        }

metadict_detail['|Скребок'] = {
        }

metadict_detail['|Скребок металлический'] = {
        }

metadict_detail['|Совок печной'] = {
        }

metadict_detail['|Сокол дюралюминиевый'] = {
        }

metadict_detail['|Сотейник (2 литра)'] = {
        }

metadict_detail['|Стаместка'] = {
        }

metadict_detail['|Станок рельсорезный (1.5 кВт)'] = {
        }

metadict_detail['|Станок рельсосверлильный (1.5 кВт)'] = {
        }

metadict_detail['|Станок рельсошлифовальный (1 кВт)'] = {
        }

metadict_detail['|Стол кухонный'] = {
        }

metadict_detail['|Стол обеденный'] = {
        }

metadict_detail['|Стол письменный'] = {
        }

metadict_detail['|Столик складной двух высотный'] = {
        }

metadict_detail['|Строп 4-х ветвевой (6 метров)'] = {
        }

metadict_detail['|Строп кольцевой (20 метров)'] = {
        }

metadict_detail['|Струбница (для стягивания накладок)'] = {
        }

metadict_detail['|Ступка кухонная'] = {
        }

metadict_detail['|Таз эмалированный (10 литров)'] = {
        }

metadict_detail['|Тесак кухонный (20 см)'] = {
        }

metadict_detail['|Топор плотничий'] = {
        }

metadict_detail['|Трамбовка простая'] = {
        }

metadict_detail['|Тёрка деревянная'] = {
        }

metadict_detail['|Тёрка для овщей'] = {
        }

metadict_detail['|Тёрка поролоновая'] = {
        }

metadict_detail['|Угольник деревянный'] = {
        }

metadict_detail['|Угольник для каменных работ'] = {
        }

metadict_detail['|Угольник путевой (для проверки стыков)'] = {
        }

metadict_detail['|Угольник специальный'] = {
        }

metadict_detail['|Умывальник'] = {
        }

metadict_detail['|Уровень гибкий'] = {
        }

metadict_detail['|Уровень строительный'] = {
        }

metadict_detail['|Ухват литой'] = {
        }

metadict_detail['|Форма для выпечки'] = {
        }

metadict_detail['|Футляр траверсный (грузоподъёмность 1.5 тонны)'] = {
        }

metadict_detail['|Чайник фарфоровый (1 литр)'] = {
        }

metadict_detail['|Чашка для питья (0.5 литра)'] = {
        }

metadict_detail['|Чугунок (1 литр)'] = {
        }

metadict_detail['|Чугунок (3 литра)'] = {
        }

metadict_detail['|Чугунок (5 литров)'] = {
        }

metadict_detail['|Чугунок эмалированый (5 литров)'] = {
        }

metadict_detail['|Шаблон для устройства откосов'] = {
        }

metadict_detail['|Шкаф-буфет'] = {
        }

metadict_detail['|Шкаф-витрина'] = {
        }

metadict_detail['|Шкаф-гардероб'] = {
        }

metadict_detail['|Шкаф-стеллаж'] = {
        }

metadict_detail['|Шнур причальный (30 метров)'] = {
        }

metadict_detail['|Шнур разметочный'] = {
        }

metadict_detail['|Шнур разметочный в корпусе'] = {
        }

metadict_detail['|Шпалоноска'] = {
        }

metadict_detail['|Шпалоподбойка пневматическая (0.4 кВт)'] = {
        }

metadict_detail['|Шпалоподбойка торцовая'] = {
        }

metadict_detail['|Шпатель малярный ШД-45'] = {
        }

metadict_detail['|Шпатель малярный ШМ-75'] = {
        }

metadict_detail['|Шпатель с ванночкой'] = {
        }

metadict_detail['|Шторы водонепроницаемые (квадратный метр)'] = {
        }

metadict_detail['|Шуруповёрт механический (1.7 кВт)'] = {
        }

metadict_detail['|Щипцы для дров'] = {
        }

metadict_detail['|Щуп (комплект)'] = {
        }

metadict_detail['|Щётка торцевая ЩТ-1'] = {
        }

metadict_detail['|Щётка-овощемойка'] = {
        }

metadict_detail['|Ящик для раствора (0.35 кубометра)'] = {
        }

metadict_detail['|Дверца каминная'] = {
        }

metadict_detail['|Дверца поддувала'] = {
        }

metadict_detail['|Дверца прочистная'] = {
        }

metadict_detail['|Дверца топки'] = {
        }

metadict_detail['|Задвижка дымохода'] = {
        }

metadict_detail['|Задвижка печная'] = {
        }

metadict_detail['|Решётка колосниковая'] = {
        }

metadict_detail['|Самоварник'] = {
        }

metadict_detail['|Дверь амбарная 3000x4000x50 мм'] = {
        }

metadict_detail['|Дверь внешняя 1500x800x50 мм'] = {
        }

metadict_detail['|Дверь внутренняя 1500x800x25 мм'] = {
        }

metadict_detail['|Люк подвальный 1500x800x50 мм'] = {
        }

metadict_detail['|Люк чердачный 1500x800x50 мм'] = {
        }

#----
# А вот эти инструменты вычисляются через потребности, совсем другой подход:

metadict_detail['||Баржа грузовая (груз 200 тонн)'] = {
        }

metadict_detail['||Барк грузовой (груз 1400 тонн)'] = {
        }

metadict_detail['||Бочка деревянная (100 литров)'] = {
        }

metadict_detail['||Бочка деревянная (500 литров)'] = {
        }

metadict_detail['||Ящик деревянный решётчатый (100 литров)'] = {
        }

metadict_detail['||Вагон железнодорожный (20-тонн)'] = {
        }

metadict_detail['||Ведро деревянное (10 литров)'] = {
        }

metadict_detail['||Ветряная мельница (50-кг/час)'] = {
        }

metadict_detail['||Глиномялка механическая (0.5-кубометра/час)'] = {
        }

metadict_detail['||Каток механический (60 кВт)'] = {
        }

metadict_detail['||Грабли'] = {
        }

metadict_detail['||Грейдер упряжной'] = {
        }

metadict_detail['||Домкрат винтовой (10 тонн)'] = {
        }

metadict_detail['||Дровяная печь (5.5 кВт)'] = {
        }

metadict_detail['||Жернова (1-кг/час)'] = {
        }

metadict_detail['||Кадка деревянная (100 литров)'] = {
        }

metadict_detail['||Кадка деревянная (500 литров)'] = {
        }

metadict_detail['||Квашня деревянная (50 литров)'] = {
        }

metadict_detail['||Киркомотыга'] = {
        }

metadict_detail['||Лопата большая'] = {
        }

metadict_detail['||Ключ гаечный'] = {
        }

metadict_detail['||Коловорот'] = {
        }

metadict_detail['||Компрессор винтовой (30 кВт)'] = {
        }

metadict_detail['||Корзина плетёная (100 литров)'] = {
        }

metadict_detail['||Кран башенный (8 тонн)'] = {
        }

metadict_detail['||Кружка для питья (1.5 литра)'] = {
        }

metadict_detail['||Кувалда'] = {
        }

metadict_detail['||Лебёдка монтажная (0.5 тонны)'] = {
        }

metadict_detail['||Лесопильная рама механизированная (30 кВт)'] = {
        }

metadict_detail['||Лист сушильный (квадратный метр)'] = {
        }

metadict_detail['||Противень для выпечки (квадратный метр)'] = {
        }

metadict_detail['||Локомотив маневровый (400 кВт)'] = {
        }

metadict_detail['||Мат соломенный (квадратный метр)'] = {
        }

metadict_detail['||Механический вальцевый пресс (50 литров)'] = {
        }

metadict_detail['||Механический винтовой пресс (50 литров)'] = {
        }

metadict_detail['||Мешок холщёвый (20 литров)'] = {
        }

metadict_detail['||Миска глиняная (5 литров)'] = {
        }

metadict_detail['||Миска для еды (1 литр)'] = {
        }

metadict_detail['||Нож кухонный'] = {
        }

metadict_detail['||Нож-овощечистка'] = {
        }

metadict_detail['||Основной локомотив (400 кВт)'] = {
        }

metadict_detail['||Печь смоляная (6 литров/час)'] = {
        }

metadict_detail['||Пила механическая цепная (2 кВт)'] = {
        }

metadict_detail['||Платформа железнодорожная (30-тонн)'] = {
        }

metadict_detail['||Рубанок'] = {
        }

metadict_detail['||Самовар (5 литров)'] = {
        }

metadict_detail['||Форма для выпечки кексов (50 грамм)'] = {
        }

metadict_detail['||Сковорода (2 литра)'] = {
        }

metadict_detail['||Сковорода (5 литров)'] = {
        }

metadict_detail['||Скрепер упряжной (0.5 кубометра)'] = {
        }

metadict_detail['||Станок для резки кирпича'] = {
        }

metadict_detail['||Станок металлорежущий (1.5 кВт)'] = {
        }

metadict_detail['||Станок сверлильный (1.5 кВт)'] = {
        }

metadict_detail['||Стол кухонный (квадратный метр)'] = {
        }

metadict_detail['||Таз эмалированный (10 литров)'] = {
        }

metadict_detail['||Телега грузовая (груз 1000 кг)'] = {
        }

metadict_detail['||Тележка грузовая (груз 100 кг)'] = {
        }

metadict_detail['||Тесак кухонный'] = {
        }

metadict_detail['||Доска кухонная'] = {
        }

metadict_detail['||Топор'] = {
        }

metadict_detail['||Молоток'] = {
        }

metadict_detail['||Отбойный молоток пневматический (0.4 кВт)'] = {
        }

metadict_detail['||Трамбовка пневматическая (0.3 кВт)'] = {
        }

metadict_detail['||Транспортёр роликовый'] = {
        }

metadict_detail['||Уголок для сбора кленового сока'] = {
        }

metadict_detail['||Чан чугунный (300 литров)'] = {
        }

metadict_detail['||Котёл чугунный (25 литров)'] = {
        }

metadict_detail['||Чугунок (5 литров)'] = {
        }

metadict_detail['||Шпалоподбойка пневматическая (0.4 кВт)'] = {
        }

metadict_detail['||Штабель для обжига кирпича'] = {
        }

metadict_detail['||Штабель для сушки кирпича'] = {
        }

metadict_detail['||Станок сверлильно-шлифовальный (1.5 кВт)'] = {
        }

metadict_detail['||Механический копатель (30 кВт)'] = {
        }

metadict_detail['||Насос высокого давления (90-кВт)'] = {
        }

metadict_detail['||Дощатый щит (квадратный метр)'] = {
        }

#----
# Грузонапряжённость путей (таки почему так мало используются железные дороги?):

metadict_detail['|===Грузонапряжённость городских дорог (тонн)'] = {
        }

metadict_detail['|===Грузонапряжённость железных дорог (тонн)'] = {
        }

metadict_detail['|===Грузонапряжённость морских путей (тонн)'] = {
        }

metadict_detail['|===Грузонапряжённость речных путей (тонн)'] = {
        }

metadict_detail['|===Грузонапряжённость сельских дорог (тонн)'] = {
        }

metadict_detail['|===Грузонапряжённость шоссейных дорог (тонн)'] = {
        }

#----
# Возможности путей:

metadict_detail['-Предельный грузооборот шоссейных дорог (тонно-километров)'] = {
        }

metadict_detail['-Предельный грузооборот грунтовых дорог (тонно-километров)'] = {
        }

#----
# Площадь распила (так мы будем вычислять затраты энергии и труда на обработку древесины)

metadict_detail['-Распил пиломатериалов (квадратный метр)'] = {
        }

#----
# Предполагаемый вес тары:

metadict_detail['-Тарные бочки (килограмм)'] = {
        # Исправить
            # Пили производство тары.
        }

metadict_detail['-Тарные корзины (килограмм)'] = {
        }

metadict_detail['-Тарные ящики (килограмм)'] = {
        }

metadict_detail['-Тарные банки (килограмм)'] = {
        }

#----
# Площадь поселений:

metadict_detail['|-Усадьба (квадратный метр)'] = {
        # Исправить
            # Перенеси, хм, к планам поселений (которых пока нет).
        '|--Усадьбы (гектар)':1 / 10000,
        }

#----
# Расчёты отопления:

metadict_detail['-Объём помещений (кубометр)'] = {
        # На каждый кубометр утеплённого помещения требуется 40 ватт зимой
        '--Необходимо отопление (киловатт)':0.04,
        }

metadict_detail['--Необходимо отопление (киловатт)'] = {
        }

#----
# Показатели водопровода:

metadict_detail['|=Расход воды (литр)'] = {
        }

metadict_detail['-Очистка воды (кубометров/сутки)'] = {
        # 250 литров в сутки. Много на самом деле.
        '--Очистка воды (пони)':1 / 0.25,
        }

metadict_detail['--Очистка воды (пони)'] = {
        }

metadict_detail['-Хранение питьевой воды (кубометров)'] = {
        # Должно обеспечивать 40% суточной потребности в воде.
        '--Хранение питьевой воды (пони)':1 / 0.25 / 0.4,
        }

metadict_detail['--Хранение питьевой воды (пони)'] = {
        }

#----
# Трудовые ресурсы:

#metadict_detail['_+Работа единорога (нормо-часов)'] = {
#        }
#
#metadict_detail['_+Работа пегаса (нормо-часов)'] = {
#        }
#
#metadict_detail['_+Работа земнопони (нормо-часов)'] = {
#        }
