#----
# Заметки:
# Денежная база и запасы казначейств Эквестрии:
    # Доля | Товар     | Стоимость | Оборот  | Запасы | на 10k пони
    # ---- | --------- | --------- | ------- | ------ | -----------
    # 33%  | Золото    | 340M бит  | 255t    | 1275t  | 116 кг
    # 15%  | Серебро   | 153       | 2.3kt   | 11.5kt | 1045 кг
    # 7%   | Самоцветы | 71.4      | 19.2Mct | 190Mct | 8.75k карат
    # Оставшиеся 45% банкнот обеспеченны зерном, металлами, топливом, т.д.
# Монетная масса в обороте на 10 тысяч жителей:
    # Год  | Страна | Людей  | Золото | Серебро | Разм. монета | Банкноты
    # ---- | ------ | ------ | ------ | ------- | ------------ | ------------
    # 1800 | Европа | 189M   | 79 кг  | 1323 кг | -            | -
    # 1896 | США    | 71     | 123    | 1944    | 15 кг золота | 50 кг золота
    # 1896 | Герман | 53     | 199    | 495     | 33           | 46
    # 1897 | Россия | 93     | 3      | 11      | 7            | 89
    # 1898 | Россия | 94     | 12.2   | -       | -            | 74
    # 1899 | Россия | 96     | 36.4   | -       | -            | 53
    # 1900 | Россия | 97     | 42.7   | -       | -            | 41
    # Монетная масса, это 13-15% ВВП Росии/Германии (разменная монета 2.3-3.3% ВВП)
    # Бумажных денег в обращении -- 17% ВВП России (на 50% обеспечены золотом)
    # Убыль золотых из оборота (тезаврация + вывоз + износ) -- 10% в год.
    # Рубль (1897 года) = 0.774 грамма чистого золота (18 грамм серебра)
# Монетная масса и запасы казначейств (1895 год) -- в тоннах драгоценных металлов:
    # Страна          | Золото      | Серебро      | Разменная монета | Непокрытые билеты
    # --------------- | ----------- | ------------ | ---------------- | -----------------
    # Франция         |  1 334 тонн |  16 640 тонн |   76 т зол. экв. |    28 т зол. экв.
    # Англия          |  1 044      |   3 640      |  203             |     -
    # Германия        |  1 044      |   2 600      |  174             |   242
    # Австро-Венгрия  |    267      |   2 132      |   61             |   152
    # Голландия       |     41      |   1 508      |    5             |    60
    # Италия          |    154      |     416      |   38             |   236
    # Россия          |    728      |     104 *    |   67             |   118
    # Испания         |     58      |   2 860      |   59             |   155
    # Бельгия         |     81      |   1 076      |   12             |   104
    # США             |    931      |  14 820      |  116             |   377
    # Япония          |   >270      |  -           |  -               |   -    
    # Итого           |  5 786      |  42 120      |  810             | 1 527 
    # * несоответствие, для монетного двора ввозили 291 тонн/год (30 кг/10k чел)
    # Ввоз серебра в Россию (1897 год) -- 662 тонн/год (37 млн руб, 68 кг/10k чел)
    # Контрибуция Германии (Франция, 1871 год) -- 1451t золота (5 млрд франков)
    # Контрибуция Японии (Китай, 1895 год) -- 270t золота (38M фунтов стерлингов)
    # Оттомар Гаупт "Reuler’s Finanz Chronik" (1896 г. № 7)
    # https://ru.wikisource.org/wiki/ЭСБЕ/Монетная_регалия
    # https://ru.wikisource.org/wiki/ЭСБЕ/Серебро,_в_экономическом_отношении
    # https://ru.wikipedia.org/wiki/Японо-китайская_война_(1894—1895)
# Добыча золота и серебра (1900 год):
    # Страна             | Золота (1900 год) | Серебро (1897 год)
    # ------------------ | ----------------- | -----------------
    # США (всего)        | 118.2 тонны/год   | 1675 тонн/год
    # ..Аляска           |  33.5             | -
    # ..Калифорния       |  19.5             | -
    # Австралия          | 113.2             | 496
    # Африка             |  58.5             | -
    # Канада             |  39.1             | -
    # Россия (всего)     |  34.7             | 7.5
    # ..Сибирь           |  26.0             | -
    # Мексика            |  15.2             | 1676
    # Британская Империя |  14.4             | -
    # Китай              |  13.1             | -
    # Корея              |   5.2             | -
    # Колумбия           |   3.8             | -
    # Итого              | 415.4             | 5481-6412
    # Золотой запас России (1914 год) -- 2 196 тонн (1 312 центробанк, 362 тонн обращ, добыча 62 тонн/год)
    # Другие данные (1914 год) -- 1694 тонн (494.2 млн золотых рублей, 1695.2 млн обеспеченных банкнот)
    # Монетная масса (1914) -- 362.1 тонн золота, 2 198 тонн серебра; 18.5 млн. рублей в медной монете.
    # История российской золотодобычи в датах. Факты и события начиная с 1900 года
    # https://zolotodb.ru/article/11637
    # https://zolotodb.ru/article/12327
    # https://ru.wikisource.org/wiki/ЭСБЕ/Серебро,_в_экономическом_отношении
# Золотой запас по странам (1953 год):
    # Страна          | золото тонн
    # --------------- | -----------
    # США             | 19 631
    # СССР            |  2 049
    # Великобритания  |  2 011
    # Швейцария       |  1 296
    # Канада          |    876
    # Бельгия         |    689
    # Нидерланды      |    658
    # Франция         |    548
    # Green Т. Central Bank Gold Reserves. – P. 18.
    # Добыча золота в СССР (1953-1991 годы, Катасонов) -- 250 тонн/год (70 тонн/год на промышленность)
# Золотой запас по странам (1991 год):
    # Страна          | золото тонн
    # --------------- | -----------
    # США (физически) | 20 000
    # США (собствен.) |  8 146
    # Германия        |  2 960
    # Швейцария       |  2 590
    # Франция         |  2 546
    # Италия          |  2 074
    # Нидерланды      |  1 367
    # Великобритания  |    588
    # Португалия      |    494
    # Испания         |    486
    # СССР            |    485
    # Green Т. Central Bank Gold Reserves. – P. 19.
    # "Золото: международный экономический аспект" А. В. Аникин. 
# Золотой запас по странам (2024 год):
    # Страна          | золото тонн
    # --------------- | -----------
    # США (физически) | 20 000
    # США (собствен.) |  8 134
    # Германия (част) |  7 000
    # Германия (казн) |  3 352
    # IMF *           |  2 814
    # Италия          |  2 452
    # Франция         |  2 437
    # Россия          |  2 333
    # Китай (закупки) | 10 000
    # Китай (частные) |  6 000
    # Китай (казна)   |  2 263
    # Швейцария       |  1 040
    # Япония          |    846
    # Индия (частные) | 21 000 **
    # Индия (казна)   |    823
    # Нидерланды      |    613
    # Турция          |    570
    # ECB *           |    506
    # Тайвань         |    422
    # * IMF -- International Monetary Fund
    # * ECB --  European Central Bank
    # ** Скупают на 3% ВВП Индии 2021 года, 1068t в год, 33% мировой добычи
    # https://en.m.wikipedia.org/wiki/Gold_reserve
    # https://kubkaramazoff.livejournal.com/109736.html
# Хронология добычи золота:
    # Период          | Население  | Добыча     | Оборот 
    # --------------- | ---------- | ---------- | ----------
    # 1500-500 до н.э | 80-150 млн | ~6000 тонн | <4000 тонн
    # -500-500 н.э.   | 150-400    | ~3500      | -
    # 500-1500 годы   | 390-438    | ~2500      | <12 500
    # 16 век          | 438-579    | -          | -
    # 17 век          | 579-682    | <1000      | -
    # 18 век          | 682-1036   | 1890       | -
    # 19 век          | 1036-1650  | 11 600     | <29 000
    # 20 век          | 1650-6080  | 120 000    | -
    # 2001-2020 годы  | 6080-8145  | 57 000     | -
    # Золотодобыча (Рим, Лас-Медулас, 100 до н.э. - 300 н.э.) -- 1500 тонн
    # Золотодобыча (Венгрия, 1300-1500) -- 500 тонн
    # Добыча золота (Мир, до 1492) -- 12 780 тонн
    # Золотодобыча (Колонии Испании, 1521-1800) -- 1700 тонн
        # Золотодобыча (Америка, 1521-1600) -- 139 тонн
        # Золотодобыча (Америка, 1521-1720) -- 2700 тонн
        # Золотодобыча (Бразилия, 1700-1821) -- 939 тонн
        # Золотодобыча (Бразилия, 1822-1889) -- 161 тонн
        # Золотодобыча (Бразилия, 1890-2000) -- 2972 тонн
    # Золотодобыча (Сибирь, 1819-1861 годы) -- 583 тонн
    # Золотодобыча (Сибирь, 1814-1917 годы) -- 2000-3000 тонн
        # Золотодобыча (Алтай, 1740-1890 годы) -- 60.4 тонн
        # Золотодобыча (Тува, 1839-1913 годы) -- 11.8 тонн
    # Запасы золота (Мир, 2020 год) -- 135kt (30% золотые запасы)
        # За всю историю добыто 200kt золота (18% в золотых запасах)
        # Из всего золота 25% было добыто в ЮАР (коих разграбили в 1990-е)
        # 60% золотодобычи 20 века, это ЮАР (0.72-9 грамм/тонна руды)
        # Осталось золота -- 111 600 тонн (60 400 тонн разведано)
        # https://1981dn.livejournal.com/60151.html
        # https://ru.wikipedia.org/wiki/Революция_цен
        # https://en.wikipedia.org/wiki/List_of_deepest_mines
        # http://slavikap.livejournal.com/20715795.html
        # https://ru.wikipedia.org/wiki/Население_Земли
        # https://ru.wikipedia.org/wiki/Бразильская_золотая_лихорадка
        # https://en.wikipedia.org/wiki/Brazilian_Gold
# Хронология добычи серебра:
    # Добыча серебра (Греция, 600-300 до н.э.) -- 20-30 тонн/год (3000 тонн всего)
    # Добыча серебра (Римская империя, 200 год. 55 млн) -- 200 тонн/год
        # Монетная масса (Рим, 150 год, 70 млн) -- 2025 тонн серебра (9% ВВП)
        # Расходы на специи 100 млн сестерциев (100 тонн/год, 50% добываемого)
        # "Rome Economic Revolution" Philip Kay
    # Добыча серебра (Европа, 1200-1450 годы) -- 25-30 тонн/год (7kt всего)
    # Добыча серебра (Европа, 1450-1500 годы) -- 45-50 тонн/год (2.4kt всего)
    # Добыча серебра (Европа, 1515-1540 годы) -- 90 тонн/год (4.5kt и падение)
        # Монетная масса (Европа, 1550 год, 62 млн) -- ×12 к обращению 1492 года
        # Убыль серебра (Европа, 1500 год, 62 млн) -- 5-6.5 кг/год на 10k чел
        # Инфляция (Англия, 1500-1600) -- 1.2% в год (×3.3 цены за 100 лет)
    # Добыча серебра (Колонии Испании, 1545-1800) -- 86kt (85% мировой добычи)
        # Добыча серебра (Мексика, Перу, Боливия, 1545-1800) -- 40kt
        # Добыча серебра (Мексика, 1545-1800) -- 10.1/44kt (23% добычи Америки)
        # Вывоз серебра (Америка --> Европа, до 1550 года) -- 85 тонн
        # Вывоз серебра (Америка --> Европа, 1550-е годы) -- 300 тонн
        # Вывоз серебра (Америка --> Европа, 1570-е годы) -- 1000 тонн
        # Вывоз серебра (Америка --> Европа, 1590-е годы) -- 2700 тонн
            # Испанские колонии в 16 веке дали 75% ввоза серебра Европы
    # Добыча серебра (Мир, 1521-1945) -- 615kt
        # Добыча серебра (Мексика, 1521-1945) -- 205kt (33% мировой добычи)
        # Добыча серебра (Южная Америка, Потоси, 1556-1783) -- 18.5kt (821M песо)
        # Добыча серебра (Южная Америка, Потоси, 1545-1810) -- 22.695kt (20% мировой добычи)
        # Вывоз серебра (Америка --> Европа, 1521-1600 годы) -- 7439 тонн
        # Вывоз серебра (Америка --> Европа, 1503-1660 годы) -- 16k тонн
        # Вывоз серебра (Америка --> Европа, 1537-1888 годы) -- 67.5k тонн
        # Вывоз серебра (Америка --> Европа, 1889-1913 годы) -- 77.5k тонн
    # Денежная масса династии Мин (1570-1649, 250 млн) -- до 26 362 тонн серебра
        # Вывоз серебра (Испания --> Китай, 1570-1649 годы) -- 3282.4 тонн
        # Вывоз серебра (Португалия --> Китай, 1570-1649 годы) -- 1604 тонн
        # Вывоз серебра (Проч. Европа --> Китай, 1570-1649 годы) -- 1231 тонн
        # Вывоз серебра (Филиппины --> Китай, 1570-1649 годы) -- 2611 тонн
        # Вывоз серебра (Япония --> Китай, 1570-1649 годы) -- 7460 тонн
            # Добыча серебра (Япония 1600 год) -- 150-200 тонн/год
            # Добыча серебра (Япония 1640 год) -- 60 тонн/год
        # Добыто серебра (Tang, Song and Yuan dynasties) -- 14 090 тонн
        # Добыча серебра (Китай, 1390-1620 годы) -- 820 тонн
        # Капитал Лю Цзиня (Китай, 1510 год) -- 11.5t золота, 1925t серебра, 250M лян, 1.25 млрд бит
        # Капитал Хэ Шеня (Китай, 1750-1799) -- 6.1t золота, 2465t серебра, 1100M лян, 5.5 млрд бит
        # Запас серебра <1055 кг на 10k населения (скорее 300-500 кг/10k, 10 000 тонн всего)
        # "Re-examining the social impact of silver monetization in the Ming Dynasty
        # from the perspective of supply and demand"
        # "A Study on the Inflow of Foreign Silver into China (16th-mid-19th Century)" Hou Zhigang
        # "Estimates of Silver Stocks in the Late Ming Dynasty" Li Longsheng
    # Добыча серебра (Сибирь, 18 век) -- 2500 тонн
        # Добыча серебра (Алтай, 1740-1890) -- 2038 тонн
    # Добыча серебра (Мир, 1821-1850 годы) -- 892.5 тонн
    # Добыча серебра (Мир, 1851-1880 годы) -- 5637 тонн
    # Добыча серебра (Мир, 2015 год) -- 23.7k тонн
    # Добыто серебра (Мир, до 2014 года) -- 1.35-1.46Mt всего
    # Запасы серебра (Мир, 2015 год) -- 2.7-3.1Mt (резервы 570kt)
    # Рынок серебра (Мир, 2025) -- 28.3k тонн/год
        # 68% промышленность, 15-34% инвестиции, 30% ювелирка, дефицит 11.5%-25%
    # https://ru.wikipedia.org/wiki/Революция_цен
    # "Investigating the sustainability of the global silver supply,
    # reserves, stocks in society and market price using different approaches"
    # https://web.archive.org/web/20190511205223/https://www.sciencedirect.com/science/article/pii/S0921344913002747
    # https://ru.wikipedia.org/wiki/Серебро#Нахождение_в_природе
    # https://grokipedia.com/page/Silver_mining#historical-development
    # "The Monetary Origins of the ‘Price Revolution’" John Munro
    # https://www.economics.utoronto.ca/public/workingPapers/UT-ECIPA-MUNRO-99-02.pdf
    # https://eprints.lse.ac.uk/119883/1/The_rise_and_decline_of_the_global_silver_standard_LSE_002_.pdf

#----
# Разовые услуги --> почасовая оплата

metadict_model['_-$Обслуживание-медицина, волшебник-врач, 1 круг (1_бит/ячейка*10_минут)'] = {
        # Число ячеек заклинаний ограничено правилами DnD 5e. Таблицы в spells
        '_-$Обслуживание-медицина, волшебник-врач, 1 круг (6_бит*нормо-час)':1 / 6,
        '-Заклинания использованные, стоимость (бит)':1,
        }

metadict_model['_-$Обслуживание-медицина, волшебник-врач, 1 круг (1_бит/ячейка*60_минут)'] = {
        '_-$Обслуживание-медицина, волшебник-врач, 1 круг (1_бит*нормо-час)':1 / 1,
        '-Заклинания использованные, стоимость (бит)':1,
        }

metadict_model['_-$Обслуживание-медицина, волшебник-врач, 2 круг (1.5_бит/ячейка*10_минут)'] = {
        '_-$Обслуживание-медицина, волшебник-врач, 2 круг (9_бит/нормо-час)':1 / 6,
        '-Заклинания использованные, стоимость (бит)':1.5,
        }

metadict_model['_-$Обслуживание-медицина, волшебник-врач, 3 круг (2.2_бит/ячейка*10_минут)'] = {
        '_-$Обслуживание-медицина, волшебник-врач, 3 круг (12_бит/нормо-час)':1 / 6,
        '-Заклинания использованные, стоимость (бит)':2.2,
        }

metadict_model['_-$Обслуживание-медицина, волшебник-врач, 4 круг (7_бит/ячейка*10_минут)'] = {
        '_-$Обслуживание-медицина, волшебник-врач, 4 круг (42_бит/нормо-час)':1 / 6,
        '-Заклинания использованные, стоимость (бит)':7,
        }

metadict_model['_-$Обслуживание-медицина, волшебник-врач, 5 круг (20_бит/ячейка*60_минут)'] = {
        '_-$Обслуживание-медицина, волшебник-врач, 5 круг (20_бит/нормо-час)':1 / 1,
        '-Заклинания использованные, стоимость (бит)':20,
        }

metadict_model['_-$Промышленность-кустари, волшебник-светокристаллы, 2 круг (1.5_бит/ячейка*10_минут)'] = {
        '_-$Промышленность-кустари, волшебник-светокристаллы, 2 круг (9_бит/нормо-час)':1 / 6,
        '-Заклинания использованные, стоимость (бит)':1.5,
        }

#----
# Категории профессий (управленцы)

metadict_model['_-$Промышленность-добыча, управление, лесоруб (0.6_бит*нормо-час)'] = {
        '_-$$Промышленность-управление (0.6_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-добыча, управление, шахтёр (1_бит*нормо-час)'] = {
        '_-$$Промышленность-управление (1_бит*нормо-час)':1,
        }

metadict_model['_-$Строительство, управление, дорожный строитель (0.6_бит*нормо-час)'] = {
        '_-$$Строительство-управление (0.6_бит*нормо-час)':1,
        }

metadict_model['_-$Строительство, управление, железнодорожный монтёр (0.6_бит*нормо-час)'] = {
        '_-$$Строительство-управление (0.6_бит*нормо-час)':1,
        }

metadict_model['_-$Строительство, управление, землекоп (0.6_бит*нормо-час)'] = {
        '_-$$Строительство-управление (0.6_бит*нормо-час)':1,
        }

metadict_model['_-$Строительство, управление, каменщик (0.6_бит*нормо-час)'] = {
        '_-$$Строительство-управление (0.6_бит*нормо-час)':1,
        }

metadict_model['_-$Строительство, управление, маляр (0.6_бит*нормо-час)'] = {
        '_-$$Строительство-управление (0.6_бит*нормо-час)':1,
        }

metadict_model['_-$Строительство, управление, печник (0.8_бит*нормо-час)'] = {
        '_-$$Строительство-управление (0.8_бит*нормо-час)':1,
        }

metadict_model['_-$Строительство, управление, плотник (0.6_бит*нормо-час)'] = {
        '_-$$Строительство-управление (0.6_бит*нормо-час)':1,
        }

metadict_model['_-$Строительство, управление, штукатур (0.6_бит*нормо-час)'] = {
        '_-$$Строительство-управление (0.6_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, управление, водопроводчик (0.7_бит*нормо-час)'] = {
        '_-$$Транспорт-управление (0.7_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, управление, грузчик (0.4_бит*нормо-час)'] = {
        '_-$$Транспорт-управление (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, управление, лётчик-пегас (0.7_бит*нормо-час)'] = {
        '_-$$Транспорт-управление (0.7_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, управление, лётчик-пегас (1_бит*нормо-час)'] = {
        '_-$$Транспорт-управление (1_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, управление, моряк (0.7_бит*нормо-час)'] = {
        '_-$$Транспорт-управление (0.7_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, управление, моряк (2_бит*нормо-час)'] = {
        '_-$$Транспорт-управление (2_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, управление, путевой смотритель (0.8_бит*нормо-час)'] = {
        '_-$$Транспорт-управление (0.8_бит*нормо-час)':1,
        }

#----
# Категории профессий

metadict_model['_-$Земледелие, бобовые (0.2_бит*нормо-час)'] = {
        '_-$$Земледелие (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Земледелие, бобовые (0.3_бит*нормо-час)'] = {
        '_-$$Земледелие (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Земледелие, грибовод (0.4_бит*нормо-час)'] = {
        '_-$$Земледелие (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Земледелие, зебра (0.1_бит*нормо-час)'] = {
        '_-$$Земледелие (0.1_бит*нормо-час)':1,
        }

metadict_model['_-$Земледелие, зерновые (0.2_бит*нормо-час)'] = {
        '_-$$Земледелие (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Земледелие, зерновые (0.3_бит*нормо-час)'] = {
        '_-$$Земледелие (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Земледелие, лесник (0.4_бит*нормо-час)'] = {
        '_-$$Земледелие (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Земледелие, масличные (0.2_бит*нормо-час)'] = {
        '_-$$Земледелие (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Земледелие, масличные (0.3_бит*нормо-час)'] = {
        '_-$$Земледелие (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Земледелие, огородник (0.2_бит*нормо-час)'] = {
        '_-$$Земледелие (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Земледелие, огородник (0.3_бит*нормо-час)'] = {
        '_-$$Земледелие (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Земледелие, пчеловод (0.5_бит*нормо-час)'] = {
        '_-$$Земледелие (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Земледелие, садовод (0.2_бит*нормо-час)'] = {
        '_-$$Земледелие (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Земледелие, садовод (0.3_бит*нормо-час)'] = {
        '_-$$Земледелие (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Земледелие, технические (0.2_бит*нормо-час)'] = {
        '_-$$Земледелие (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Земледелие, технические (0.3_бит*нормо-час)'] = {
        '_-$$Земледелие (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Земледелие, сушка (0.2_бит*нормо-час)'] = {
        '_-$$Земледелие (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Обслуживание-культура, библиотекарь (0.5_бит*нормо-час)'] = {
        '_-$$Обслуживание-культура (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Обслуживание-медицина, волшебник-врач, 1 круг (1_бит*нормо-час)'] = {
        '_-$$Обслуживание-медицина (1_бит*нормо-час)':1,
        }

metadict_model['_-$Обслуживание-медицина, волшебник-врач, 1 круг (6_бит*нормо-час)'] = {
        '_-$$Обслуживание-медицина (6_бит*нормо-час)':1,
        }

metadict_model['_-$Обслуживание-медицина, волшебник-врач, 2 круг (1.5_бит*нормо-час)'] = {
        '_-$$Обслуживание-медицина (1.5_бит*нормо-час)':1,
        }

metadict_model['_-$Обслуживание-медицина, волшебник-врач, 2 круг (9_бит/нормо-час)'] = {
        '_-$$Обслуживание-медицина (9_бит*нормо-час)':1,
        }

metadict_model['_-$Обслуживание-медицина, волшебник-врач, 3 круг (2_бит*нормо-час)'] = {
        '_-$$Обслуживание-медицина (2_бит*нормо-час)':1,
        }

metadict_model['_-$Обслуживание-медицина, волшебник-врач, 3 круг (12_бит/нормо-час)'] = {
        '_-$$Обслуживание-медицина (12_бит*нормо-час)':1,
        }

metadict_model['_-$Обслуживание-медицина, волшебник-врач, 4 круг (42_бит/нормо-час)'] = {
        '_-$$Обслуживание-медицина (42_бит*нормо-час)':1,
        }

metadict_model['_-$Обслуживание-медицина, волшебник-врач, 5 круг (20_бит/нормо-час)'] = {
        '_-$$Обслуживание-медицина (20_бит*нормо-час)':1,
        }

metadict_model['_-$Обслуживание-медицина, врач, больница (1_бит*нормо-час)'] = {
        '_-$$Обслуживание-медицина (1_бит*нормо-час)':1,
        }

metadict_model['_-$Обслуживание-медицина, врач, поликлиника (1_бит*нормо-час)'] = {
        '_-$$Обслуживание-медицина (1_бит*нормо-час)':1,
        }

metadict_model['_-$Обслуживание-медицина, фельдшер, больница (0.5_бит*нормо-час)'] = {
        '_-$$Обслуживание-медицина (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Обслуживание-медицина, фельдшер, поликлиника (0.5_бит*нормо-час)'] = {
        '_-$$Обслуживание-медицина (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Обслуживание-медицина, фельдшер, скорая помощь (0.5_бит*нормо-час)'] = {
        '_-$$Обслуживание-медицина (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Обслуживание-медицина, фельдшер, скорая помощь, пегас (0.5_бит*нормо-час)'] = {
        '_-$$Обслуживание-медицина (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Обслуживание-образование, учитель, начальная школа (0.5_бит*нормо-час)'] = {
        '_-$$Обслуживание-образование (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Обслуживание-образование, учитель, средняя школа (0.7_бит*нормо-час)'] = {
        '_-$$Обслуживание-образование (0.7_бит*нормо-час)':1,
        }

metadict_model['_-$Обслуживание-образование, учитель, профессиональная школа (1_бит*нормо-час)'] = {
        '_-$$Обслуживание-образование (1_бит*нормо-час)':1,
        }

metadict_model['_-$Обслуживание-образование, учитель, университет (2_бит*нормо-час)'] = {
        '_-$$Обслуживание-образование (2_бит*нормо-час)':1,
        }

metadict_model['_-$Обслуживание-кулинария, повар (0.5_бит*нормо-час)'] = {
        '_-$$Обслуживание-кулинария (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Обслуживание-кулинария, поварёнок (0.3_бит*нормо-час)'] = {
        '_-$$Обслуживание-кулинария (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Обслуживание-кулинария, поварёнок (0.2_бит*нормо-час)'] = {
        '_-$$Обслуживание-кулинария (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Обслуживание-кулинария, официант (0.3_бит*нормо-час)'] = {
        '_-$$Обслуживание-кулинария (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Обслуживание-кулинария, уборщица (0.2_бит*нормо-час)'] = {
        '_-$$Обслуживание-кулинария (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Обслуживание-хозяйство, прачка (0.3_бит*нормо-час)'] = {
        '_-$$Обслуживание-хозяйство (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Обслуживание-хозяйство, уборщик (0.3_бит*нормо-час)'] = {
        '_-$$Обслуживание-хозяйство (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Обслуживание-медицина, волшебник-врач, 0 круг (1_бит*нормо-час)'] = {
        '_-$$Обслуживание-медицина (1_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-добыча, волшебник-шахтёр, 0 круг (1_бит*нормо-час)'] = {
        '_-$$Промышленность-добыча (1_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-добыча, рабочий, лесоруб (0.3_бит*нормо-час)'] = {
        '_-$$Промышленность-добыча (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-добыча, рабочий, лесоруб (0.2_бит*нормо-час)'] = {
        '_-$$Промышленность-добыча (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-добыча, землекоп, глина (0.2_бит*нормо-час)'] = {
        '_-$$Промышленность-добыча (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-добыча, землекоп, торф (0.3_бит*нормо-час)'] = {
        '_-$$Промышленность-добыча (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-добыча, рабочий, сапёр (2_бит*нормо-час)'] = {
        '_-$$Промышленность-добыча (2_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-добыча, рабочий, шахтёр (0.5_бит*нормо-час)'] = {
        '_-$$Промышленность-добыча (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-добыча, рабочий, обогащение (0.5_бит*нормо-час)'] = {
        '_-$$Промышленность-добыча (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-добыча, рабочий, шахтёр, щебень (0.4_бит*нормо-час)'] = {
        '_-$$Промышленность-добыча (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-кустари, рабочий, сапожник (0.7_бит*нормо-час)'] = {
        '_-$$Промышленность-кустари (0.7_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-кустари, рабочий, портной (1_бит*нормо-час)'] = {
        '_-$$Промышленность-кустари (1_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-кустари, рабочий, ткач (0.2_бит*нормо-час)'] = {
        '_-$$Промышленность-кустари (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-кустари, рабочий, швец (0.5_бит*нормо-час)'] = {
        '_-$$Промышленность-кустари (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-кустари, рабочий, керамика (0.5_бит*нормо-час)'] = {
        '_-$$Промышленность-кустари (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-кустари, рабочий, корзины (0.4_бит*нормо-час)'] = {
        '_-$$Промышленность-кустари (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-кустари, рабочий, бондарь (0.4_бит*нормо-час)'] = {
        '_-$$Промышленность-кустари (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-кустари, рабочий, ящики (0.4_бит*нормо-час)'] = {
        '_-$$Промышленность-кустари (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-кустари, волшебник-светокристаллы, 2 круг (9_бит/нормо-час)'] = {
        '_-$$Промышленность-кустари (9_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, металлургия (0.5_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, известь (0.4_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, кафель (0.4_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, смолокур (0.3_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, углежог (0.3_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, черепица (0.3_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, кирпич (0.3_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, кирпич саманный (0.2_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, кирпич саманный (0.3_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, красильщик (0.3_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, красильщик (0.4_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, лесопилка (0.4_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, маслозавод (0.4_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, мыловар (0.4_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, клеевар (0.4_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, опилкобетон (0.3_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, паркет (0.4_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, мукомол (0.4_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, пивоварня (0.4_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, прядильщик (0.3_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, прядильщик (0.4_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, солевар (0.5_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, солод (0.4_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, бумага (0.3_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, бумага (0.4_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, бумага (0.7_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, типография (0.5_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, типография (1_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (1_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, ткач (0.5_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, хлебозавод (0.4_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, цемент (0.4_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Собирательство, валежник (0.1_бит*нормо-час)'] = {
        '_-$$Собирательство (0.1_бит*нормо-час)':1,
        }

metadict_model['_-$Собирательство, водоросли (0.2_бит*нормо-час)'] = {
        '_-$$Собирательство (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Собирательство, дикорастущие грибы (0.1_бит*нормо-час)'] = {
        '_-$$Собирательство (0.1_бит*нормо-час)':1,
        }

metadict_model['_-$Собирательство, дикорастущие орехи (0.1_бит*нормо-час)'] = {
        '_-$$Собирательство (0.1_бит*нормо-час)':1,
        }

metadict_model['_-$Собирательство, дикорастущие растения (0.1_бит*нормо-час)'] = {
        '_-$$Собирательство (0.1_бит*нормо-час)':1,
        }

metadict_model['_-$Собирательство, дикорастущие ягоды (0.1_бит*нормо-час)'] = {
        '_-$$Собирательство (0.1_бит*нормо-час)':1,
        }

metadict_model['_-$Собирательство, зебры, дикорастущие растения (0.1_бит*нормо-час)'] = {
        '_-$$Собирательство (0.1_бит*нормо-час)':1,
        }

metadict_model['_-$Собирательство, кленовый сок (0.1_бит*нормо-час)'] = {
        '_-$$Собирательство (0.1_бит*нормо-час)':1,
        }

metadict_model['_-$Собирательство, сосновая живица (0.1_бит*нормо-час)'] = {
        '_-$$Собирательство (0.1_бит*нормо-час)':1,
        }

metadict_model['_-$Строительство, волшебник-сварщик, 0 круг (1_бит*нормо-час)'] = {
        '_-$$Строительство (1_бит*нормо-час)':1,
        }

metadict_model['_-$Строительство, дорожный строитель (0.2_бит*нормо-час)'] = {
        '_-$$Строительство (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Строительство, железнодорожный монтёр (0.3_бит*нормо-час)'] = {
        '_-$$Строительство (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Строительство, землекоп (0.1_бит*нормо-час)'] = {
        '_-$$Строительство (0.1_бит*нормо-час)':1,
        }

metadict_model['_-$Строительство, землекоп (0.2_бит*нормо-час)'] = {
        '_-$$Строительство (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Строительство, каменщик (0.3_бит*нормо-час)'] = {
        '_-$$Строительство (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Строительство, каменщик, печник (0.5_бит*нормо-час)'] = {
        '_-$$Строительство (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Строительство, кровельщик (0.2_бит*нормо-час)'] = {
        '_-$$Строительство (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Строительство, маляр (0.3_бит*нормо-час)'] = {
        '_-$$Строительство (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Строительство, плотник (0.2_бит*нормо-час)'] = {
        '_-$$Строительство (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Строительство, плотник (0.3_бит*нормо-час)'] = {
        '_-$$Строительство (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Строительство, разнорабочий (0.2_бит*нормо-час)'] = {
        '_-$$Строительство (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Строительство, разнорабочий-пегас (0.2_бит*нормо-час)'] = {
        '_-$$Строительство (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Строительство, штукатур (0.3_бит*нормо-час)'] = {
        '_-$$Строительство (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, водовоз (0.1_бит*нормо-час)'] = {
        '_-$$Транспорт (0.1_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, водовоз-пегас (0.2_бит*нормо-час)'] = {
        '_-$$Транспорт (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, водовоз-земнопони (0.2_бит*нормо-час)'] = {
        '_-$$Транспорт (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, водопроводчик (0.4_бит*нормо-час)'] = {
        '_-$$Транспорт (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, возничий-зебра (0.1_бит*нормо-час)'] = {
        '_-$$Транспорт (0.1_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, возничий-пегас (0.2_бит*нормо-час)'] = {
        '_-$$Транспорт (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, возничий-земнопони (0.2_бит*нормо-час)'] = {
        '_-$$Транспорт (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, грузчик (0.2_бит*нормо-час)'] = {
        '_-$$Транспорт (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, грузчик-зебра (0.1_бит*нормо-час)'] = {
        '_-$$Транспорт (0.1_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, железнодорожник (0.4_бит*нормо-час)'] = {
        '_-$$Транспорт (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, железнодорожник-пегас (0.3_бит*нормо-час)'] = {
        '_-$$Транспорт (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, лётчик-пегас (0.5_бит*нормо-час)'] = {
        '_-$$Транспорт (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, лётчик-пегас (0.7_бит*нормо-час)'] = {
        '_-$$Транспорт (0.7_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, лётчик-пегас (1_бит*нормо-час)'] = {
        '_-$$Транспорт (1_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, моряк (0.3_бит*нормо-час)'] = {
        '_-$$Транспорт (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, моряк (0.4_бит*нормо-час)'] = {
        '_-$$Транспорт (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, моряк (0.7_бит*нормо-час)'] = {
        '_-$$Транспорт (0.7_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, моряк (1_бит*нормо-час)'] = {
        '_-$$Транспорт (1_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, моряк (2_бит*нормо-час)'] = {
        '_-$$Транспорт (2_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, моряк (4_бит*нормо-час)'] = {
        '_-$$Транспорт (4_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, моряк-пегас (0.3_бит*нормо-час)'] = {
        '_-$$Транспорт (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, моряк-пегас (0.4_бит*нормо-час)'] = {
        '_-$$Транспорт (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, почтальон-пегас (0.4_бит*нормо-час)'] = {
        '_-$$Транспорт (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, почтовый служащий (0.5_бит*нормо-час)'] = {
        '_-$$Транспорт (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, путевой смотритель (0.4_бит*нормо-час)'] = {
        '_-$$Транспорт (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, таксист-пегас (0.5_бит*нормо-час)'] = {
        '_-$$Транспорт (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Домохозяйство, повар (0.3_бит*нормо-час)'] = {
        '_-$$Домохозяйство (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Домохозяйство, поварёнок (0.2_бит*нормо-час)'] = {
        '_-$$Домохозяйство (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Домохозяйство, прачка (0.2_бит*нормо-час)'] = {
        '_-$$Домохозяйство (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Домохозяйство, уборщик (0.2_бит*нормо-час)'] = {
        '_-$$Домохозяйство (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Домохозяйство, разнорабочий (0.2_бит*нормо-час)'] = {
        '_-$$Домохозяйство (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Домохозяйство, водовоз (0.2_бит*нормо-час)'] = {
        '_-$$Домохозяйство (0.2_бит*нормо-час)':1,
        }

#----
# Почасовой оклад (управленцы)

metadict_model['_-$$Промышленность-управление (0.6_бит*нормо-час)'] = {
        'Заработная плата (0.6_бит*нормо-час)':1,
        '_-$$$Управление (бит*нормо-час)':0.6,
        }

metadict_model['_-$$Промышленность-управление (1_бит*нормо-час)'] = {
        'Заработная плата (1_бит*нормо-час)':1,
        '_-$$$Управление (бит*нормо-час)':1,
        }

metadict_model['_-$$Строительство-управление (0.4_бит*нормо-час)'] = {
        'Заработная плата (0.4_бит*нормо-час)':1,
        '_-$$$Управление (бит*нормо-час)':0.4,
        }

metadict_model['_-$$Строительство-управление (0.6_бит*нормо-час)'] = {
        'Заработная плата (0.6_бит*нормо-час)':1,
        '_-$$$Управление (бит*нормо-час)':0.6,
        }

metadict_model['_-$$Строительство-управление (0.8_бит*нормо-час)'] = {
        'Заработная плата (0.8_бит*нормо-час)':1,
        '_-$$$Управление (бит*нормо-час)':0.8,
        }

metadict_model['_-$$Транспорт-управление (0.4_бит*нормо-час)'] = {
        'Заработная плата (0.4_бит*нормо-час)':1,
        '_-$$$Управление (бит*нормо-час)':0.4,
        }

metadict_model['_-$$Транспорт-управление (0.7_бит*нормо-час)'] = {
        'Заработная плата (0.7_бит*нормо-час)':1,
        '_-$$$Управление (бит*нормо-час)':0.7,
        }

metadict_model['_-$$Транспорт-управление (0.8_бит*нормо-час)'] = {
        'Заработная плата (0.8_бит*нормо-час)':1,
        '_-$$$Управление (бит*нормо-час)':0.8,
        }

metadict_model['_-$$Транспорт-управление (1_бит*нормо-час)'] = {
        'Заработная плата (1_бит*нормо-час)':1,
        '_-$$$Управление (бит*нормо-час)':1,
        }

metadict_model['_-$$Транспорт-управление (2_бит*нормо-час)'] = {
        'Заработная плата (2_бит*нормо-час)':1,
        '_-$$$Управление (бит*нормо-час)':2,
        }

#----
# Почасовой оклад

metadict_model['_-$$Земледелие (0.1_бит*нормо-час)'] = {
        # Заработная плата для расчётов соотношения зарплат в output
        'Заработная плата (0.1_бит*нормо-час)':1,
        '_-$$$Земледелие (бит*нормо-час)':0.1,
        }

metadict_model['_-$$Земледелие (0.2_бит*нормо-час)'] = {
        'Заработная плата (0.2_бит*нормо-час)':1,
        '_-$$$Земледелие (бит*нормо-час)':0.2,
        }

metadict_model['_-$$Земледелие (0.3_бит*нормо-час)'] = {
        'Заработная плата (0.3_бит*нормо-час)':1,
        '_-$$$Земледелие (бит*нормо-час)':0.3,
        }

metadict_model['_-$$Земледелие (0.4_бит*нормо-час)'] = {
        'Заработная плата (0.4_бит*нормо-час)':1,
        '_-$$$Земледелие (бит*нормо-час)':0.4,
        }

metadict_model['_-$$Земледелие (0.5_бит*нормо-час)'] = {
        'Заработная плата (0.5_бит*нормо-час)':1,
        '_-$$$Земледелие (бит*нормо-час)':0.5,
        }

metadict_model['_-$$Обслуживание-культура (0.5_бит*нормо-час)'] = {
        'Заработная плата (0.5_бит*нормо-час)':1,
        '_-$$$Обслуживание-культура (бит*нормо-час)':0.5,
        }

metadict_model['_-$$Обслуживание-медицина (0.5_бит*нормо-час)'] = {
        'Заработная плата (0.5_бит*нормо-час)':1,
        '_-$$$Обслуживание-медицина (бит*нормо-час)':0.5,
        }

metadict_model['_-$$Обслуживание-медицина (0.7_бит*нормо-час)'] = {
        'Заработная плата (0.7_бит*нормо-час)':1,
        '_-$$$Обслуживание-медицина (бит*нормо-час)':0.7,
        }

metadict_model['_-$$Обслуживание-медицина (1_бит*нормо-час)'] = {
        'Заработная плата (1_бит*нормо-час)':1,
        '_-$$$Обслуживание-медицина (бит*нормо-час)':1,
        }

metadict_model['_-$$Обслуживание-медицина (1.5_бит*нормо-час)'] = {
        'Заработная плата (1.5_бит*нормо-час)':1,
        '_-$$$Обслуживание-медицина (бит*нормо-час)':1.5,
        }

metadict_model['_-$$Обслуживание-медицина (2_бит*нормо-час)'] = {
        'Заработная плата (2_бит*нормо-час)':1,
        '_-$$$Обслуживание-медицина (бит*нормо-час)':2,
        }

metadict_model['_-$$Обслуживание-медицина (6_бит*нормо-час)'] = {
        'Заработная плата (6_бит*нормо-час)':1,
        '_-$$$Обслуживание-медицина (бит*нормо-час)':6,
        }

metadict_model['_-$$Обслуживание-медицина (9_бит*нормо-час)'] = {
        'Заработная плата (9_бит*нормо-час)':1,
        '_-$$$Обслуживание-медицина (бит*нормо-час)':9,
        }

metadict_model['_-$$Обслуживание-медицина (12_бит*нормо-час)'] = {
        'Заработная плата (12_бит*нормо-час)':1,
        '_-$$$Обслуживание-медицина (бит*нормо-час)':12,
        }

metadict_model['_-$$Обслуживание-медицина (20_бит*нормо-час)'] = {
        'Заработная плата (20_бит*нормо-час)':1,
        '_-$$$Обслуживание-медицина (бит*нормо-час)':20,
        }

metadict_model['_-$$Обслуживание-медицина (42_бит*нормо-час)'] = {
        'Заработная плата (42_бит*нормо-час)':1,
        '_-$$$Обслуживание-медицина (бит*нормо-час)':42,
        }

metadict_model['_-$$Обслуживание-образование (0.5_бит*нормо-час)'] = {
        'Заработная плата (0.5_бит*нормо-час)':1,
        '_-$$$Обслуживание-образование (бит*нормо-час)':0.5,
        }

metadict_model['_-$$Обслуживание-образование (0.7_бит*нормо-час)'] = {
        'Заработная плата (0.7_бит*нормо-час)':1,
        '_-$$$Обслуживание-образование (бит*нормо-час)':0.7,
        }

metadict_model['_-$$Обслуживание-образование (1_бит*нормо-час)'] = {
        'Заработная плата (1_бит*нормо-час)':1,
        '_-$$$Обслуживание-образование (бит*нормо-час)':1,
        }

metadict_model['_-$$Обслуживание-образование (2_бит*нормо-час)'] = {
        'Заработная плата (2_бит*нормо-час)':1,
        '_-$$$Обслуживание-образование (бит*нормо-час)':2,
        }

metadict_model['_-$$Обслуживание-кулинария (0.2_бит*нормо-час)'] = {
        'Заработная плата (0.2_бит*нормо-час)':1,
        '_-$$$Обслуживание-кулинария (бит*нормо-час)':0.2,
        }

metadict_model['_-$$Обслуживание-кулинария (0.3_бит*нормо-час)'] = {
        'Заработная плата (0.3_бит*нормо-час)':1,
        '_-$$$Обслуживание-кулинария (бит*нормо-час)':0.3,
        }

metadict_model['_-$$Обслуживание-кулинария (0.5_бит*нормо-час)'] = {
        'Заработная плата (0.5_бит*нормо-час)':1,
        '_-$$$Обслуживание-кулинария (бит*нормо-час)':0.5,
        }

metadict_model['_-$$Обслуживание-хозяйство (0.3_бит*нормо-час)'] = {
        'Заработная плата (0.3_бит*нормо-час)':1,
        '_-$$$Обслуживание-хозяйство (бит*нормо-час)':0.3,
        }

metadict_model['_-$$Промышленность-добыча (0.2_бит*нормо-час)'] = {
        'Заработная плата (0.2_бит*нормо-час)':1,
        '_-$$$Промышленность-добыча (бит*нормо-час)':0.2,
        }

metadict_model['_-$$Промышленность-добыча (0.3_бит*нормо-час)'] = {
        'Заработная плата (0.3_бит*нормо-час)':1,
        '_-$$$Промышленность-добыча (бит*нормо-час)':0.3,
        }

metadict_model['_-$$Промышленность-добыча (0.4_бит*нормо-час)'] = {
        'Заработная плата (0.4_бит*нормо-час)':1,
        '_-$$$Промышленность-добыча (бит*нормо-час)':0.2,
        }

metadict_model['_-$$Промышленность-добыча (0.5_бит*нормо-час)'] = {
        'Заработная плата (0.5_бит*нормо-час)':1,
        '_-$$$Промышленность-добыча (бит*нормо-час)':0.5,
        }

metadict_model['_-$$Промышленность-добыча (1_бит*нормо-час)'] = {
        'Заработная плата (1_бит*нормо-час)':1,
        '_-$$$Промышленность-добыча (бит*нормо-час)':1,
        }

metadict_model['_-$$Промышленность-добыча (2_бит*нормо-час)'] = {
        'Заработная плата (2_бит*нормо-час)':1,
        '_-$$$Промышленность-добыча (бит*нормо-час)':2,
        }

metadict_model['_-$$Промышленность-кустари (0.2_бит*нормо-час)'] = {
        'Заработная плата (0.2_бит*нормо-час)':1,
        '_-$$$Промышленность-кустари (бит*нормо-час)':0.2,
        }

metadict_model['_-$$Промышленность-кустари (0.4_бит*нормо-час)'] = {
        'Заработная плата (0.4_бит*нормо-час)':1,
        '_-$$$Промышленность-кустари (бит*нормо-час)':0.4,
        }

metadict_model['_-$$Промышленность-кустари (0.5_бит*нормо-час)'] = {
        'Заработная плата (0.5_бит*нормо-час)':1,
        '_-$$$Промышленность-кустари (бит*нормо-час)':0.5,
        }

metadict_model['_-$$Промышленность-кустари (0.7_бит*нормо-час)'] = {
        'Заработная плата (0.7_бит*нормо-час)':1,
        '_-$$$Промышленность-кустари (бит*нормо-час)':0.7,
        }

metadict_model['_-$$Промышленность-кустари (1_бит*нормо-час)'] = {
        'Заработная плата (1_бит*нормо-час)':1,
        '_-$$$Промышленность-кустари (бит*нормо-час)':1,
        }

metadict_model['_-$$Промышленность-кустари (9_бит*нормо-час)'] = {
        'Заработная плата (9_бит*нормо-час)':1,
        '_-$$$Промышленность-кустари (бит*нормо-час)':9,
        }

metadict_model['_-$$Промышленность-фабрики (0.2_бит*нормо-час)'] = {
        'Заработная плата (0.2_бит*нормо-час)':1,
        '_-$$$Промышленность-фабрики (бит*нормо-час)':0.2,
        }

metadict_model['_-$$Промышленность-фабрики (0.3_бит*нормо-час)'] = {
        'Заработная плата (0.3_бит*нормо-час)':1,
        '_-$$$Промышленность-фабрики (бит*нормо-час)':0.3,
        }

metadict_model['_-$$Промышленность-фабрики (0.4_бит*нормо-час)'] = {
        'Заработная плата (0.4_бит*нормо-час)':1,
        '_-$$$Промышленность-фабрики (бит*нормо-час)':0.4,
        }

metadict_model['_-$$Промышленность-фабрики (0.5_бит*нормо-час)'] = {
        'Заработная плата (0.5_бит*нормо-час)':1,
        '_-$$$Промышленность-фабрики (бит*нормо-час)':0.5,
        }

metadict_model['_-$$Промышленность-фабрики (1_бит*нормо-час)'] = {
        'Заработная плата (1_бит*нормо-час)':1,
        '_-$$$Промышленность-фабрики (бит*нормо-час)':1,
        }

metadict_model['_-$$Собирательство (0.1_бит*нормо-час)'] = {
        'Заработная плата (0.1_бит*нормо-час)':1,
        '_-$$$Собирательство (бит*нормо-час)':0.1,
        }

metadict_model['_-$$Собирательство (0.2_бит*нормо-час)'] = {
        'Заработная плата (0.2_бит*нормо-час)':1,
        '_-$$$Собирательство (бит*нормо-час)':0.3,
        }

metadict_model['_-$$Строительство (0.1_бит*нормо-час)'] = {
        'Заработная плата (0.1_бит*нормо-час)':1,
        '_-$$$Строительство (бит*нормо-час)':0.1,
        }

metadict_model['_-$$Строительство (0.2_бит*нормо-час)'] = {
        'Заработная плата (0.2_бит*нормо-час)':1,
        '_-$$$Строительство (бит*нормо-час)':0.2,
        }

metadict_model['_-$$Строительство (0.3_бит*нормо-час)'] = {
        'Заработная плата (0.3_бит*нормо-час)':1,
        '_-$$$Строительство (бит*нормо-час)':0.3,
        }

metadict_model['_-$$Строительство (0.5_бит*нормо-час)'] = {
        'Заработная плата (0.5_бит*нормо-час)':1,
        '_-$$$Строительство (бит*нормо-час)':0.5,
        }

metadict_model['_-$$Строительство (1_бит*нормо-час)'] = {
        'Заработная плата (1_бит*нормо-час)':1,
        '_-$$$Строительство (бит*нормо-час)':1,
        }

metadict_model['_-$$Строительство (2_бит*нормо-час)'] = {
        'Заработная плата (2_бит*нормо-час)':1,
        '_-$$$Строительство (бит*нормо-час)':2,
        }

metadict_model['_-$$Транспорт (0.1_бит*нормо-час)'] = {
        'Заработная плата (0.1_бит*нормо-час)':1,
        '_-$$$Транспорт (бит*нормо-час)':0.1,
        }

metadict_model['_-$$Транспорт (0.2_бит*нормо-час)'] = {
        'Заработная плата (0.2_бит*нормо-час)':1,
        '_-$$$Транспорт (бит*нормо-час)':0.2,
        }

metadict_model['_-$$Транспорт (0.3_бит*нормо-час)'] = {
        'Заработная плата (0.3_бит*нормо-час)':1,
        '_-$$$Транспорт (бит*нормо-час)':0.3,
        }

metadict_model['_-$$Транспорт (0.4_бит*нормо-час)'] = {
        'Заработная плата (0.4_бит*нормо-час)':1,
        '_-$$$Транспорт (бит*нормо-час)':0.4,
        }

metadict_model['_-$$Транспорт (0.5_бит*нормо-час)'] = {
        'Заработная плата (0.5_бит*нормо-час)':1,
        '_-$$$Транспорт (бит*нормо-час)':0.5,
        }

metadict_model['_-$$Транспорт (0.7_бит*нормо-час)'] = {
        'Заработная плата (0.7_бит*нормо-час)':1,
        '_-$$$Транспорт (бит*нормо-час)':0.7,
        }

metadict_model['_-$$Транспорт (1_бит*нормо-час)'] = {
        'Заработная плата (1_бит*нормо-час)':1,
        '_-$$$Транспорт (бит*нормо-час)':1,
        }

metadict_model['_-$$Транспорт (2_бит*нормо-час)'] = {
        'Заработная плата (2_бит*нормо-час)':1,
        '_-$$$Транспорт (бит*нормо-час)':2,
        }

metadict_model['_-$$Транспорт (4_бит*нормо-час)'] = {
        'Заработная плата (4_бит*нормо-час)':1,
        '_-$$$Транспорт (бит*нормо-час)':4,
        }

metadict_model['_-$$Домохозяйство (0.2_бит*нормо-час)'] = {
        #'Заработная плата (0.2_бит*нормо-час)':1,
        '_-$$$Домохозяйство (бит*нормо-час)':0.2,
        }

metadict_model['_-$$Домохозяйство (0.3_бит*нормо-час)'] = {
        #'Заработная плата (0.3_бит*нормо-час)':1,
        '_-$$$Домохозяйство (бит*нормо-час)':0.3,
        }

#----
# Доходы (консолидация)
    # Распределение ВВП по базовым отраслям.

metadict_model['_-$$$Земледелие (бит*нормо-час)'] = {
        '_-$$$ ВВП Земледелие (бит)':1,
        }

metadict_model['_-$$$Собирательство (бит*нормо-час)'] = {
        '_-$$$ ВВП Земледелие (бит)':1,
        }

metadict_model['_-$$$Управление (бит*нормо-час)'] = {
        '_-$$$ ВВП Услуги (бит)':1,
        }

metadict_model['_-$$$Обслуживание-культура (бит*нормо-час)'] = {
        '_-$$$ ВВП Услуги (бит)':1,
        }

metadict_model['_-$$$Обслуживание-медицина (бит*нормо-час)'] = {
        '_-$$$ ВВП Услуги (бит)':1,
        }

metadict_model['_-$$$Обслуживание-образование (бит*нормо-час)'] = {
        '_-$$$ ВВП Услуги (бит)':1,
        }

metadict_model['_-$$$Обслуживание-кулинария (бит*нормо-час)'] = {
        '_-$$$ ВВП Услуги (бит)':1,
        }

metadict_model['_-$$$Обслуживание-хозяйство (бит*нормо-час)'] = {
        '_-$$$ ВВП Услуги (бит)':1,
        }

metadict_model['_-$$$Промышленность-добыча (бит*нормо-час)'] = {
        '_-$$$ ВВП Промышленность (бит)':1,
        }

metadict_model['_-$$$Промышленность-кустари (бит*нормо-час)'] = {
        '_-$$$ ВВП Промышленность (бит)':1,
        }

metadict_model['_-$$$Промышленность-фабрики (бит*нормо-час)'] = {
        '_-$$$ ВВП Промышленность (бит)':1,
        }

metadict_model['_-$$$Строительство (бит*нормо-час)'] = {
        '_-$$$ ВВП Строительство (бит)':1,
        }

metadict_model['_-$$$Транспорт (бит*нормо-час)'] = {
        '_-$$$ ВВП Транспорт (бит)':1,
        }

metadict_model['_-$$$Домохозяйство (бит*нормо-час)'] = {
        # Не считается в продукции, это дела по дому.
        #'_-$$$ ВВП Услуги (бит)':1,
        }

#----
# Доходы суммарно.

metadict_detail['_-$$$ ВВП Земледелие (бит)'] = {
        '_-$$ Продукция, стоимость (бит)':1,
        }

metadict_detail['_-$$$ ВВП Промышленность (бит)'] = {
        '_-$$ Продукция, стоимость (бит)':1,
        }

metadict_detail['_-$$$ ВВП Строительство (бит)'] = {
        '_-$$ Продукция, стоимость (бит)':1,
        }

metadict_detail['_-$$$ ВВП Транспорт (бит)'] = {
        '_-$$ Продукция, стоимость (бит)':1,
        }

metadict_detail['_-$$$ ВВП Услуги (бит)'] = {
        '_-$$ Продукция, стоимость (бит)':1,
        }
