#----
# Заметки
    # Все о пряностях, Похлёбкин
    # http://flibustahezeous3.onion/b/391130
    # * Асафетида (смола) -- для бобовых
    # * Анис (семена молотые) -- выпечка (хлеба, булки), компоты, киселени, варения, квасы.
        # - Нейтрализует неприятный запах конопляного масла.
    # * Бадьян (сухие плоды) -- для выпечки и варений (1 грамм порошка на килограмм)
    # * Ваниль -- изысканная выпечка, желе, суфле, пудинги, варенья.
    # * Гвоздика -- в маринады (0.3 грамм/килограмм), с корицей в сладких блюдах.
        # - Молотая гвоздика быстро выдыхается
        # - Гвоздику не кипятить, долго не нагревать (теряет аромат и горчит)
        # - Не сочетать гвоздику с алкоголем и уксусом (усиливает горечь)
    # * Имбирь (корень) -- выпечка (сдоба и пряники), варенья, компоты, сбитни, спиртное (а также квас).
    # * Калган (корень) -- пряники, сбитни, квасы (0.5 грамма/килограмм)
    # * Кардамон (семена) -- кексы, пряники, торты (особенно кофейные), кисели, компоты, картофель.
        # - Гороховые супы и картофельные салаты. Западноевропейская кухня.
        # - Сильная пряность (коробочка/килограмм теста, 1/4 коробочки/литр компота)
    # * Корица -- сладкая и фруктовая выпечка, морковь и яблоки, фруктовые маринады (1-3 грамма/килограмм)
    # * Куркума (корень) -- рис, маринады (0.1 грамм/килограмм)
    # * Лавр -- супы (гороховые, картофельные), тушёная морковь и картофель, грибные маринады.
    # * Мускатный орех -- выпечка и варенья, салаты и пюре, грибные блюда.
        # - Сушится 2-4 месяца, с большим расходом дров.
        # - Ядра помещают на несколько минут в известковое молоко (морская вода и известь)
        # - Вторая сушка 1-3 недели
        # - Цельный. Натирается в блюдо.
    # * Черный перец -- овощные и грибные блюда, некоторые печенья, маринады.
    # * Белый перец -- овощи, салаты, изделия из отварного теста
    # * Красный перец -- овощные пюре (сочетая с чесноком, кориандром, базиликом, чабером, лавром)
        # - Закладывать за 5-10 минут до готовности блюда
    # * Ямайский перец (душистый перец) -- маринады
    # * Розмарин (листья) -- горох, шпинат, капуста, вместо лаврового листа
    # * Лимонная цедра -- сладкие блюда, свекольные и шпинатные супы
        # - Закладывать за 30 секунд до готовности блюда, настоять 3 минуты.
    # * Шафран (рыльца цветов) -- кондитерские изделия, овощный блюда
        # - Сильная пряность, 0.1 грамма/килограмм выпечки
        # - Закладывать в виде спиртового раствора. Не сочетать с сильными пряностями.
        # - Килограмм шафрана -- 80 000 - 300 000 цветов
    # ----
    # Пряные овощи:
    # * Лук репчатый -- овощные блюда, отвары
    # * Лук порей -- супы-пюре, соусы, салаты
    # * Чеснок -- овощные и грибные блюда (сразу после кипения, 3 минуты настоять)
        # - Не закладывать чеснок в остывшие блюда
        # - Запах чеснока можно умерить или даже уничтожить корицей, бадьяном,
            # гвоздикой, мятой, цедрой, анисом, тмином и другими пряностями.
    # * Черемша -- салаты, засолка грибов, вместо чеснока
    # * Чесночный гриб -- как сушёный чеснок
    # * Петрушка -- супы, смеси пряностей
    # * Пастернак -- подобно петрушке, салаты, овощные пюре
    # * Сельдерей -- подобно петрушке, салаты, холодные супы, овощные пюре
    # * Фенхель (стебли) -- салаты, овощные гарниры, маринады и соления
    # * Хрен столоый -- холодные блюда и закуски
        # - Не смешивать с другими пряностями
    # ----
    # Пряные травы:
    # * Ажгон, зира (семена) -- пловы, овощные блюда (вместо тмина)
    # * Аир (корень) -- компоты, кисели
    # * Базилик (трава) -- овощные блюда (кроме картофеля и гороха), салаты, соления и квашения
    # * Сарептская горчица (Brassica juncea Czern.) -- столовая горчица, горчичный порошок.
    # * Душица -- овощные супы, грибные блюда (из шампиньонов), пицца, соусы, квас, пиво.
        # - Предохраняет квас и домашнее пиво от закисания
    # * Калуфер -- улучшает оливковое масло, сладкие блюда, кондитерские изделия, квасы.
        # - Оливковое масло, настоенное на листьях калуфера -- сильный антисептик
    # * Кориандр (семена) -- выпечка, хлеба, кондитерские изделия, засолка капусты (вместе с тмином)
        # - Семена для выпечки обжаривают.
        # - Перед закладкой в жидкие блюда долбят в ступе.
    # * Кинза (свежая/сушёная зелень кориандра) -- овощные блюда и салаты
    # * Садовый кресс (кресс-салат)
        # - Весенняя зелень. Вырастает за 7-14 дней.
    # * Лаванда (цветы) -- ароматизация напитков, уксуса, салаты, холодные закуски, овощные и грибные супы.
    # * Майоран (листья) -- зимние салаты, картофельные, гороховые, шпинатные супы, томатные соусы.
    # * Мелисса (листья) -- летние салаты, овощные супы, соления, компоты, квасы, чай.
        # - Весенняя зелень. 2-3 урожая за лето.
    # * Можжевельник -- квашеная капуста, домашний хлеб (в сочетании с полынью)
        # - ядовит.
    # * Мята перечная -- печенье, пряники, булочки, компоты, кисели, морсы, настойки, квасы.
        # - Закладывают как мятную эссенцию.
        # - Мяту нельзя перегревать.
    # * Мята кудрявая -- салаты (в свежем виде), бобовые блюда, морковные и картофельные пюре,
        # варенья, джемы, компоты, квасы (в сушёном виде)
    # * Мята яблочная -- компоты, кисели, варенья; яблочные начинки для пирогов, кондитерские изделия.
    # * Полынь лимонная -- вместе с можжевельником в домашний хлеб, ароматизация уксуса.
    # * Рута (сушёные листья) -- в овощные блюда (в очень малых дозах)
    # * Тимьян (высушенная трава) -- соление огурцов и помидоров (вместе с укропом),
        # картофельные и помидорные салаты.
    # * Тмин (семена) -- капуста, картофель в мундире, засолка поидоров и огурцов, хлеб, квас.
        # - Закладывают в горячие блюда, за 10-12 минут до готовности.
    # * Укроп -- в салаты и соления (свежий), овощи (сухой).
    # * Фенугрек (молотые семена) -- хлеба, компонент карри (15-20%)
    # * Чабер -- салаты, соления (свежая зелень), овощные и грибные супы, бобовые блюда, капуста (сухой)
    # * Чабрец (сушёная трава) -- овощные блюда (малые дозы, подобно тимьяну)
    # * Чернушка (чёрный тмин) -- квашение капусты, соление огурцов, выпечка, пудинги, компоты, кисели
    # * Шалфей (сухие листья) -- вместо розмарина в супы, капустные пироги.
    # * Эстрагон (тархун) -- соления (молодые стебли), салаты (свежие листья)

#----
# Травяные сборы для чаёв:

metadict_detail['Травяной сбор (килограмм)'] = {
        # TODO:
            # Раздели на ароматические, лечебные и окрашивающие травы.
        # Для самых разных чаёв.
        'Одуванчик сушёный (грамм)':1000 / 27,
        'Зверобой сушёный (грамм)':1000 / 27,
        'Эстрагон сушёный (грамм)':1000 / 27,
        'Розмарин сушёный (грамм)':1000 / 27,
        'Ромашка сушёная (грамм)':1000 / 27,
        'Таволга сушёная (грамм)':1000 / 27,
        'Крапива сушёная (грамм)':1000 / 27,
        'Лаванда сушёная (грамм)':1000 / 27,
        'Орегано сушёный (грамм)':1000 / 27,
        'Чабрец сушёный (грамм)':1000 / 27,
        'Кипрей сушёный (грамм)':1000 / 27,
        'Клевер сушёный (грамм)':1000 / 27,
        'Шалфей сушёный (грамм)':1000 / 27,
        'Иссоп сушёный (грамм)':1000 / 27,
        'Мята сушёная (грамм)':1000 / 27,
        'Тимьян сушёный (грамм)':1000 / 27,
        'Мелисса сушёная (грамм)':1000 / 27,
        'Смородина сушёная (грамм)':1000 / 27,
        'Шиповник сушёный (грамм)':1000 / 27,
        'Малина сушёная (грамм)':1000 / 27,
        'Рябина сушёная (грамм)':1000 / 27,
        'Зелень фенхеля сушёная (грамм)':1000 / 27,
        'Лист смородины сушёный (грамм)':1000 / 27,
        'Лист шиповника сушёный (грамм)':1000 / 27,
        'Лист малины сушёный (грамм)':1000 / 27,
        'Лист рябины сушёный (грамм)':1000 / 27,
        'Лист вишни сушёный (грамм)':1000 / 27,
        }

#----
# Ароматизированные масла:

metadict_detail['Масло ароматизированное для щей (килограмм)'] = {
        'Масло льняное (грамм)':750,
        'Семена аниса (грамм)':50,
        'Семена фенхеля (грамм)':50,
        'Семена кориандра (грамм)':50,
        'Зелень укропа сушёная (грамм)':50,
        'Зелень петрушки сушёная (грамм)':50,
        }

metadict_detail['Масло ароматизированное для палак панира (килограмм)'] = {
        'Масло оливковое (грамм)':700,
        'Семена зиры (грамм)':50,
        'Корень имбиря шинкованный (грамм)':50,
        'Чеснок сушёный (грамм)':50,
        'Корень куркумы (грамм)':50,
        'Зелень фенугрека сушёная (грамм)':50,
        'Пряности гарам масала (грамм)':50,
        }

metadict_detail['Масло ароматизированное для картофеля v1 (килограмм)'] = {
        'Масло оливковое (грамм)':750,
        'Семена зиры (грамм)':40,
        'Корень имбиря шинкованный (грамм)':35,
        'Чеснок сушёный (грамм)':35,
        'Семена кориандра (грамм)':35,
        'Корень куркумы (грамм)':35,
        'Перец острый сушёный (грамм)':35,
        'Пряности гарам масала (грамм)':35,
        }

metadict_detail['Масло ароматизированное для картофеля v2 (килограмм)'] = {
        'Масло оливковое (грамм)':750,
        'Семена зиры (грамм)':35,
        'Корень имбиря шинкованный (грамм)':35,
        'Корень куркумы (грамм)':30,
        'Семена фенхеля (грамм)':15,
        'Семена кориандра (грамм)':25,
        'Семена горчицы коричневой (грамм)':25,
        'Пряности гарам масала (грамм)':35,
        'Зелень фенугрека сушёная (грамм)':50,
        }

metadict_detail['Масло ароматизированное для запекания картофеля (килограмм)'] = {
        'Масло арахисовое (грамм)':750,
        'Пряности для овощей из трёх растений (грамм)':150,
        'Пряности нежного карри (грамм)':100,
        }

metadict_detail['Масло ароматизированное для бобов v1 (килограмм)'] = {
        'Масло оливковое (грамм)':750,
        'Семена зиры (грамм)':50,
        'Корень имбиря шинкованный (грамм)':50,
        'Чеснок сушёный (грамм)':50,
        'Семена кориандра (грамм)':50,
        'Пряности гарам масала (грамм)':50,
        }

metadict_detail['Масло ароматизированное для бобов v2 (килограмм)'] = {
        'Масло оливковое (грамм)':750,
        'Корень имбиря шинкованный (грамм)':50,
        'Семена зиры (грамм)':25,
        'Перец острый сушёный (грамм)':25,
        'Семена горчицы коричневой (грамм)':25,
        'Пряности самбар масала (грамм)':125,
        }

metadict_detail['Масло ароматизированное перечно-имбирное для жарения (килограмм)'] = {
        'Масло арахисовое (грамм)':750,
        'Перец душистый сушёный (грамм)':150,
        'Перец острый сушёный (грамм)':100,
        'Корень имбиря шинкованный (грамм)':50,
        }

metadict_detail['Масло ароматизированное горчицей для жарения (килограмм)'] = {
        'Масло арахисовое (грамм)':750,
        'Семена горчицы коричневой (грамм)':250,
        }

metadict_detail['Масло ароматизированное для тушения овощей (килограмм)'] = {
        'Масло оливковое (грамм)':750,
        'Порошок горчичный (грамм)':40,
        'Семена зиры (грамм)':40,
        'Корень имбиря шинкованный (грамм)':30,
        'Корень куркумы (грамм)':20,
        'Семена фенхеля (грамм)':40,
        'Семена кориандра (грамм)':30,
        'Пряности гарам масала (грамм)':30,
        'Перец острый сушёный (грамм)':20,
        }

#----
# Ингредиенты (пряности, специи):

metadict_detail['Пряности пряничные (килограмм)'] = {
        # 3 грамма на килограмм пряничного теста
        'Корица палочкой (грамм)':370,
        'Бадьян сушёный (грамм)':200,
        'Гвоздика сушёная (грамм)':50,
        'Орех мускатный (грамм)':50,
        'Семена кардамона (грамм)':50,
        'Цедра лимонная (грамм)':70,
        'Семена аниса (грамм)':140,
        'Корень имбиря шинкованный (грамм)':70,
        '_-Помол пряностей на жерновах (килограмм)':1,
        }

metadict_detail['Пряности кондитерские (килограмм)'] = {
        'Корица палочкой (грамм)':250,
        'Перец душистый сушёный (грамм)':250,
        'Гвоздика сушёная (грамм)':200,
        'Семена кориандра (грамм)':200,
        'Орех мускатный (грамм)':50,
        'Корень имбиря шинкованный (грамм)':50,
        '_-Помол пряностей на жерновах (килограмм)':1,
        }

metadict_detail['Пряности для фалафели (килограмм)'] = {
        # TODO:
            # Уточнить пропорции
        'Чабрец сушёный (грамм)':250,
        'Корень куркумы (грамм)':250,
        'Семена кардамона (грамм)':100,
        'Семена зиры (грамм)':100,
        'Орегано сушёный (грамм)':100,
        'Лист лавра сушёный (грамм)':100,
        'Перец острый сушёный (грамм)':100,
        '_-Помол пряностей на жерновах (килограмм)':1,
        }

metadict_detail['Пряности для тыквы (килограмм)'] = {
        'Корица палочкой (грамм)':500,
        'Корень имбиря шинкованный (грамм)':350,
        'Гвоздика сушёная (грамм)':100,
        'Орех мускатный (грамм)':50,
        '_-Помол пряностей на жерновах (килограмм)':1,
        }

metadict_detail['Пряности для овощей из трёх растений (килограмм)'] = {
        'Зелень укропа сушёная (грамм)':400,
        'Зелень петрушки сушёная (грамм)':300,
        'Зелень сельдерея сушёная (грамм)':300,
        }

metadict_detail['Пряности для овощей из пяти растений (килограмм)'] = {
        'Зелень укропа сушёная (грамм)':300,
        'Зелень петрушки сушёная (грамм)':300,
        'Зелень сельдерея сушёная (грамм)':250,
        'Лист лавра сушёный (грамм)':100,
        'Перец чёрный сушёный (грамм)':50,
        }

metadict_detail['Пряности для овощей из восьми растений (килограмм)'] = {
        'Зелень укропа сушёная (грамм)':250,
        'Зелень петрушки сушёная (грамм)':250,
        'Зелень сельдерея сушёная (грамм)':200,
        'Лист лавра сушёный (грамм)':100,
        'Перец острый сушёный (грамм)':50,
        'Перец чёрный сушёный (грамм)':50,
        'Орегано сушёный (грамм)':50,
        'Мята сушёная (грамм)':50,
        }

metadict_detail['Пряности прованские (килограмм)'] = {
        'Тимьян сушёный (грамм)':210,
        'Майоран сушёный (грамм)':170,
        'Зелень базилика сушёная (грамм)':125,
        'Розмарин сушёный (грамм)':125,
        'Эстрагон сушёный (грамм)':125,
        'Чабрец сушёный (грамм)':125,
        'Лаванда сушёная (грамм)':80,
        'Зелень фенхеля сушёная (грамм)':40,
        }

metadict_detail['Пряности для щей (килограмм)'] = {
        'Зелень укропа сушёная (грамм)':300,
        'Зелень сельдерея сушёная (грамм)':200,
        'Зелень петрушки сушёная (грамм)':200,
        'Лист лавра сушёный (грамм)':200,
        'Перец чёрный сушёный (грамм)':100,
        }

metadict_detail['Пряности для минестроне (килограмм)'] = {
        'Зелень петрушки сушёная (грамм)':250,
        'Зелень сельдерея сушёная (грамм)':200,
        'Розмарин сушёный (грамм)':200,
        'Чабер сушёный (грамм)':200,
        'Перец чёрный сушёный (грамм)':100,
        'Лист лавра сушёный (грамм)':50,
        }

metadict_detail['Пряности букета гарни с петрушкой (килограмм)'] = {
        # Средиземноморские травы (4 грамма/литр)
            # https://arborio.ru/bouquet-garni/
            # https://en.wikipedia.org/wiki/Bouquet_garni
            # The Professional Chef/The Culinary Institute of America. - 8th ed. стр 354
        'Зелень петрушки сушёная (грамм)':280,
        'Зелень сельдерея сушёная (грамм)':70,
        'Зелень базилика сушёная (грамм)':70,
        'Лист лавра сушёный (грамм)':70,
        'Майоран сушёный (грамм)':150,
        'Тимьян сушёный (грамм)':210,
        'Чабер сушёный (грамм)':150,
        }

metadict_detail['Пряности букета гарни с розмарином (килограмм)'] = {
        'Розмарин сушёный (грамм)':200,
        'Майоран сушёный (грамм)':200,
        'Тимьян сушёный (грамм)':200,
        'Шалфей сушёный (грамм)':150,
        'Чабер сушёный (грамм)':150,
        'Мята сушёная (грамм)':50,
        }

metadict_detail['Пряности для бобовых североморские (килограмм)'] = {
        'Зелень укропа сушёная (грамм)':350,
        'Чабер сушёный (грамм)':250,
        'Мята сушёная (грамм)':100,
        'Зелень петрушки сушёная (грамм)':100,
        'Перец острый сушёный (грамм)':50,
        'Перец чёрный сушёный (грамм)':50,
        'Семена кориандра (грамм)':50,
        'Лист лавра сушёный (грамм)':50,
        }

metadict_detail['Пряности для бобовых южноморские (килограмм)'] = {
        'Тимьян сушёный (грамм)':300,
        'Корень имбиря шинкованный (грамм)':250,
        'Перец чёрный сушёный (грамм)':100,
        'Порошок асафетиды (грамм)':100,
        'Мята сушёная (грамм)':100,
        'Орех мускатный (грамм)':50,
        'Шафран сушёный (грамм)':5,
        '_-Помол пряностей на жерновах (килограмм)':1,
        }

metadict_detail['Пряности для фруктового маринада (килограмм)'] = {
        # TODO:
            # Не используется.
        # 9 грамм на литр воды.
        'Корица палочкой (грамм)':920,
        'Гвоздика сушёная (грамм)':40,
        'Перец душистый сушёный (грамм)':40,
        '_-Помол пряностей на жерновах (килограмм)':1,
        }

metadict_detail['Пряности для овощного маринада с тмином (килограмм)'] = {
        # TODO:
            # Не используется.
        'Пряности для овощного маринада (грамм)':700,
        'Семена тмина (грамм)':300,
        }

metadict_detail['Пряности для овощного маринада (килограмм)'] = {
        # TODO:
            # Не используется.
        # К этой смеси в маринад добавляют (варианты):
            # 1) 60-80 стеблей зелёного укропа (с зонтиком)
            # 2) 400 грамм семян укропа
            # 3) 400 грамм семян тмина
        'Семена кориандра (грамм)':200,
        'Корица палочкой (грамм)':150,
        'Перец душистый сушёный (грамм)':150,
        'Семена горчицы белой (грамм)':100,
        'Перец чёрный сушёный (грамм)':100,
        'Лист лавра сушёный (грамм)':50,
        'Перец острый сушёный (грамм)':50,
        'Семена кардамона (грамм)':50,
        'Гвоздика сушёная (грамм)':50,
        'Корень имбиря шинкованный (грамм)':50,
        'Орех мускатный (грамм)':50,
        '_-Помол пряностей на жерновах (килограмм)':1,
        }

metadict_detail['Пряности нежного карри (килограмм)'] = {
        # Западноевропейский.
        'Корень куркумы (грамм)':300,
        'Корень имбиря шинкованный (грамм)':200,
        'Семена кориандра (грамм)':200,
        'Семена фенугрека (грамм)':100,
        'Перец острый сушёный (грамм)':50,
        'Перец чёрный сушёный (грамм)':50,
        'Гвоздика сушёная (грамм)':50,
        'Корица палочкой (грамм)':50,
        '_-Помол пряностей на жерновах (килограмм)':1,
        }

metadict_detail['Пряности светлого карри (килограмм)'] = {
        # Индийский
        'Перец острый сушёный (грамм)':40,
        'Перец душистый сушёный (грамм)':40,
        'Корица палочкой (грамм)':40,
        'Семена кардамона (грамм)':50,
        'Семена кориандра (грамм)':270,
        'Гвоздика сушёная (грамм)':20,
        'Семена зиры (грамм)':80,
        'Семена фенхеля (грамм)':20,
        'Семена фенугрека (грамм)':40,
        'Корень имбиря шинкованный (грамм)':40,
        'Цвет мускатный (грамм)':20,
        'Перец чёрный сушёный (грамм)':40,
        'Корень куркумы (грамм)':300,
        '_-Помол пряностей на жерновах (килограмм)':1,
        }

metadict_detail['Пряности самбар масала (килограмм)'] = {
        # TODO:
            # На самомо деле три вида бобов:
                # Black gram (dhuli urad dal)
                # Bengal gram (channa dal)
                # Yellow lentils (arhar dal)
        # https://food.ndtv.com/recipe-sambar-masala-218687
        'Перец острый сушёный (грамм)':330,
        'Семена кориандра (грамм)':250,
        'Семена горчицы коричневой (грамм)':30,
        'Семена зиры (грамм)':50,
        'Перец душистый сушёный (грамм)':70,
        'Семена фенугрека (грамм)':30,
        'Урд сухой (грамм)':100,
        'Рис шлифованный (грамм)':30,
        'Порошок асафетиды (грамм)':30,
        'Корень куркумы (грамм)':30,
        'Лист карри сушёный (грамм)':50,
        '_-Помол пряностей на жерновах (килограмм)':1,
        }

metadict_detail['Пряности чат масала (килограмм)'] = {
        # Манго незрелый (амчур), соль чёрная гималайская
            # https://food.ndtv.com/recipe-chaat-masala-218600
            # http://www.vedic-culture.in.ua/vegetarian-cooking/VKI/kulinariya/specii/masala.html
        'Семена зиры (грамм)':330,
        'Семена фенхеля (грамм)':80,
        'Пряности гарам масала (грамм)':165,
        'Манго сушёный (грамм)':165,
        'Соль поваренная (грамм)':165,
        'Перец острый сушёный (грамм)':50,
        'Порошок асафетиды (грамм)':30,
        'Корень имбиря шинкованный (грамм)':15,
        '_-Помол пряностей на жерновах (килограмм)':0.85,
        }

metadict_detail['Пряности гарам масала (килограмм)'] = {
        'Семена зиры (грамм)':190,
        'Семена кориандра (грамм)':190,
        'Перец чёрный сушёный (грамм)':190,
        'Семена кардамона (грамм)':190,
        'Корица палочкой (грамм)':180,
        'Гвоздика сушёная (грамм)':25,
        'Орех мускатный (грамм)':25,
        'Шафран сушёный (грамм)':5,
        '_-Помол пряностей на жерновах (килограмм)':1,
        }

metadict_detail['Пряности чили (килограмм)'] = {
        # TODO:
            # Нужен каенский перец
        'Орегано сушёный (грамм)':270,
        'Семена зиры (грамм)':200,
        'Чеснок сушёный (грамм)':200,
        'Паприка сушёная (грамм)':170,
        'Перец острый сушёный (грамм)':100,
        'Лук сушёный (грамм)':60,
        '_-Помол пряностей на жерновах (килограмм)':1,
        }

metadict_detail['Пряности хмели-сунели упрощённые (килограмм)'] = {
        # TODO:
            # Не используется
        'Зелень базилика сушёная (грамм)':250,
        'Майоран сушёный (грамм)':250,
        'Зелень укропа сушёная (грамм)':220,
        'Зелень кориандра сушёная (грамм)':250,
        'Перец острый сушёный (грамм)':20,
        'Шафран сушёный (грамм)':1,
        '_-Помол пряностей на жерновах (килограмм)':1,
        }

metadict_detail['Пряности хмели-сунели (килограмм)'] = {
        'Семена фенугрека (грамм)':100,
        'Зелень укропа сушёная (грамм)':100,
        'Зелень сельдерея сушёная (грамм)':100,
        'Зелень кориандра сушёная (грамм)':100,
        'Зелень петрушки сушёная (грамм)':100,
        'Лист лавра сушёный (грамм)':100,
        'Зелень базилика сушёная (грамм)':100,
        'Чабер сушёный (грамм)':100,
        'Мята сушёная (грамм)':100,
        'Майоран сушёный (грамм)':100,
        'Перец острый сушёный (грамм)':20,
        'Шафран сушёный (грамм)':1,
        '_-Помол пряностей на жерновах (килограмм)':1,
        }
