#----
# Доля тары в весе товаров:
# https://ru.wikisource.org/wiki/ЭСБЕ/Бочка
    # 6% — при упаковке гидравлического цемента, серы, сурьмы, соды и поташа;
    # 7% — соли, буры, винного камня, квасцов, жести, стали, меди, алюминия, никеля, кобальта, висмута и цинка;
    # 8% — сахара-сырца и рафинада, сыра, медного купороса, белил, сурика и свинца;
    # 9% — масла коровьего и кофе, если Б. для последнего хвойных пород;
    # 10% — риса, крахмала, какао, цикория, клея, дубильных и красильных растительных веществ,
        # асбеста, олова, селитры, уксусного порошка, хлорной извести, железного купороса,
        # берлинской лазури, парижской синьки, яри-медянки и разных полировочных веществ;
    # 12% — саго, сухих ягод и фруктов, хмеля и кофе (последний в дубовых бочках);
    # 14% — турецких рожков, орехов и миндаля;
    # 15% — гарпиуса и бумажной пряжи;
    # 16% — нюхательного табака;
    # 17% — дрожжей, рыбьего жира, асфальта, гудрона, оливок,
        # деревянного, рицинового, кокосового и пальмового масла, глицерина и лаков;
    # 18% — разных пряностей;
    # 20% — сажи, крапа и марены;
    # 21% — нефти и ее продуктов;
    # 30% — грецких губок, шерсти, гончарных и фаянсовых изделий;
    # 34% — стекла
    # 33%, 41% и 45% — разных сортов фарфоровых изделий.

#----
# Ценность продуктов и их распределение:
    # Германия 1896 года, 52.5 млн. населения
        # Национальное состояние (не ВВП!) -- 125 000 млн. марок (2381 марок/человека)
        # Национальный доход (оценочно) -- 33 140 млрд. марок (631 марка/человека)
        # https://istmat.info/node/27529
        # https://ru.wikisource.org/wiki/ЭСБЕ/Германия
        # * Марка = 0.463 золотого рубля 1897 года = 0.358 грамма золота.
        # * Цены в марках/кг, сумма в миллионах марок. Цены розничные.
        # | Пищевые продукты                 | количество (кг) | на человека  | цена м/кг | сумма (млн м)
        # | -------------------------------- | --------------- | ------------ | --------- | -----------
        # | Хлеб (2/3 пшеничный, 1/3 ржаной) | 10 000 млн.     | 191 кг       | 0.32      | 3 200
        # | Мясо (говядина)                  |  6 000 млн.     | 114 кг       | 1.30      | 7 800
        # | Поваренная и столовая соль       |    560 млн.     |  11 кг       | 0.18      |   100
        # | Масло (сливочное)                |  1 000 млн.     |  19 кг       | 2.2       | 2 200
        # | Сыр                              |    300 млн.     |   6 кг       | 1.5       |   450
        # | Столовый картофель               |  9 000 млн.     | 171 кг       | 0.06      |   540
        # | Спирт                            |    300 млн.     |   6 кг       | 2.0       |   600
        # | Вино                             |  1 000 млн.     |  19 кг       | 0.6       |   600
        # | Пиво                             | 12 000 млн.     | 229 кг       | 0.25      | 3 000
        # | Свежего молока                   |    300 млн.     |   6 кг       | 0.12      |   360
        # Всего: 18 850 млн. марок
        # 
        # | Колониальные продукты (импорт)   | количество (кг) | на человека  | цена м/кг | сумма (млн м)
        # | -------------------------------- | --------------- | ------------ | --------- | -----------
        # | Кофе                             |    500 млн.     |  10 кг       | 2.5       | 1 250
        # | Табак                            |    100 млн.     |   2 кг       | 5.0       |   500
        # | Какао, ваниль и т.д.             | -               | -            | -         |   100
        # | Фрукты                           | -               | -            | -         |   200
        # Всего: 2 050 млн. марок
        # 
        # | Одежда                           | количество      | на человека  | цена м/кг | сумма (млн м)
        # | -------------------------------- | --------------- | ------------ | --------- | -----------
        # | Костюмы шерстяные                |     53 млн. шт. |  1 штук      | 40        | 2 100
        # | Костюмы полушерстяные            |     53 млн.     |  1           | 30        | 1 600
        # | Пальто                           |     53 млн.     |  1           | 30        | 1 600
        # | Бельё (рубахи и панталоны)       |    400 млн.     |  8           | -         | 1 600
        # | Полотенца и постельное бельё     |     60 млн. кг. |  1.1 кг      | -         | -    
        # | Обувь                            |    150 млн. кг. |  2.9 кг      | 6.7       | 1 000
        # Всего: 7 900 млн. марок
        # 
        # | Промышленность                   | количество      | на человека  | цена м/кг | сумма (млн м)
        # | -------------------------------- | --------------- | ------------ | --------- | -----------
        # | Газовое отопление и печи         | 22 000 млн. м³  | 420 м³       | 0.025     |   550
        # | Мыло и стеариновые свечи         |    650 млн. кг. | 12.4 кг      | 0.77      |   500
        # | Сода                             |    221 млн. кг. |  4.2 кг      | -         | -    
        # | Писчая бумага                    |    270 млн. кг. |  5.1 кг      | 0.38      |   100
        # | Стеклянные изделия               | -               | -            | -         |   100
        # Всего: 1 250 млн. марок
        # 
        # | Транспорт и связь                | количество      | на человека  | цена м/кг | сумма (млн м)
        # | -------------------------------- | --------------- | ------------ | --------- | -----------
        # | Железнодорожные билеты           | -               | -            | -         |   850
        # | Пароходное сообщение             | -               | -            | -         |   100
        # | Почта и телеграф                 | -               | -            | -         |   250
        # Всего: 1 200 млн. марок
        # 
        # | Горнозаводская пром. (1890 год)  | количество      | на человека  | цена м/кг | сумма (млн м)
        # | -------------------------------- | --------------- | ------------ | --------- | -----------
        # | Каменный уголь                   | 70 200 млн. кг. | 1300 кг.     | -         | -
        # | Бурый уголь (лигнит)             | 19 000          |  360         | -         | -
        # | Железная руда                    | 11 410          |  220         | -         | -
        # | Цинковая руда                    |    700          |   13         | -         | -
        # | Свинцовая руда                   |    170          |    3         | -         | -
        # | Медная руда                      |    600          |   11         | -         | -
        # | Каменная соль                    |    560          |   11         | -         | -
        # | Калиевые соли                    |  1 175          |   22         | -         | -
        # | Другие минералы                  |    271          |    5         | -         | -
        # Всего: 726 млн. марок
        # 
        # | Добыча и выплавка (1889 год)     | количество      | на человека  | цена м/кг | сумма (млн м)
        # | -------------------------------- | --------------- | ------------ | --------- | -----------
        # | Чугун                            |  4 525 млн. кг. |   86.0 кг.   | 0.05      |   217
        # | Цинк                             |    136          |    2.6       | 0.31      |    42
        # | Свинец                           |    101          |    1.9       | 0.26      |    26
        # | Медь                             |     25          |    0.5       | 1.12      |    28
        # | Сера и серная кислота            |    482          |    9.2       | 0.08      |    45
        # | Серебро                          |      0.4        |    0.0076    | 62.5      |    25
        # | Золото                           |      0.002      | -            | 2750      |     5.5
        # | Никеля, висмута, купороса и т.д. |     26          |    0.5       | -         |     9.6
        # Всего: 398 млн. марок

#----
# Зарплаты (Российская Империя, 1910 год),
    # Центральный статистический комитет м. в. д. "Города россии в 1910 году"
        # Диапазоны модальной заработной платы:
        # - чернорабочий мужчина (Санкт-Петербург) -- 40-110 копеек/день (10-27.5 рублей/месяц)
        # - чернорабочий женщина (Санкт-Петербург) -- 25-80 копеек/день (6.25-20 рублей/месяц)
        # - чернорабочий мужчина (Вологда) -- 50-100 копеек/день (12.5-25 рублей/месяц)
        # - чернорабочий женщина (Вологда) -- 40-60 копеек/день (10 рублей/месяц)
        # - домашняя прислуга мужчина (Вологда) -- 12-70 рублей/месяц
        # - домашняя прислуга женщина (Вологда) -- 4-8 рублей/месяц
    # Начальное образование в Российской Империи конца ХIX — начала ХХ века.
    # https://www.politforums.net/historypages/1525073158.html
        # - средняя зарплата рабочего (1913 год) -- 21 рубль/месяц
        # - средний оклад сельского учителя (1911 год) -- 28 рублей/месяц
        # - средний оклад городского учителя (1911 год) -- 37-44 рубля/месяц
        # - оклад учителя высших начальных училищ (средняя школа) -- 80 рублей/месяц
        # - оклад ординарного профессора Томского технологического института -- 375 рублей/месяц
            # - из этого оклада квартирных -- 87 рублей/месяц
            # - из этого оклада столовых -- 87 рублей/месяц

#----
# Соотношение цен товаров (Российская Империя, 1860-1913 годы):
    # Рубль = 18 грамм серебра
    # Инфляция серебра:
        # 1866-1870 -- 15 грамм серебра за грамм золота.
        # 1889 -- 22.1 грамма
        # 1898 -- 35 грамм
    # Рубль (1897 год) = 0.774 чистого золота
        # Германская марка = 0.463 рубля
        # Северо-американский доллар = 1.96 рубля
    # Цены, 1838 года
    # Цены из мемуаров русских крестьян 18-19 вв:
    # http://statehistory.ru/3506/TSeny-iz-memuarov-russkikh-krestyan-18-19-vv/
        # - мука ржаная - 2.20 руб./пуд (14 коп/кг)
        # - пресноводная рыба - 25-60 коп./кг
        # - говядина - 40 коп./кг
        # - живой гусь - 1.20 руб.
        # - живая курица - 70 коп.
        # - 10 яиц - 23 коп.
        # - масло коровье или постное - 1 руб./кг
        # - мёд - 20 руб./пуд (1.2 руб/кг)
        # - мёд (деревня, Ярославская губерния, 1843 год) -- 6-10 руб/пуд (0.36-0.61 руб/кг)
        # - мыло - 1 руб./кг
        # - свечи - 1.10 руб./кг
        # - сено - 50 коп./пуд (4 рубля за воз)
        # - солома - 25 коп./пуд (1 рубль за воз)
        # - солома ржаная (1913 год, Киев) -- 20 копеек/пуд
        # - чай чёрный (опт, сухопутный путь, Кяхта) - 90 коп/фунт (2.2 руб/кг)
        # - чай чёрный (розница) - 2 руб/фунт (4.9 руб/кг)
        # - сахар (розница, Москва) - 24 коп/фунт (58 коп/кг)
    # Цены 1863 год
        # "Чай и чайная торговля в России и других государствах" А. П. Субботин 1892 год.
        # - чай чёрный (розница, Кяхтинский) -- 100-260 коп/фунт (2.4-6.3 руб/кг)
        # - чай цветочный (розница, Кяхтинский) -- 180-1000 коп/фунт (4.4-24 руб/кг)
    # Цены, Москва 1880 год
        # - Ржаная мука -- 96 копеек/пуд (5.9 копеек/килограмм)
        # - Сахар -- 5 рублей/пуд (31 копейка/килограмм)
    # Цены 1888 год
        # Иностранные, без учёта таможенных пошлин:
        # - чай чёрный (опт, морем, Лондон) -- 10.19 руб/пуд (0.62 руб/кг)
        # - чай чёрный (опт, морем, Китай) -- 19 коп/фунт (0.46 руб/кг)
        # - чай зелёный (опт, морем, Китай) -- 24 коп/фунт (0.59 руб/кг)
    # Цены 1891 год
        # - чай (опт, Москва) - 0.9-2 руб./фунт (2.2-4.9 руб/кг)
    # Цены 1900 год:
        # Южный Байкал, расходная книга:
        # http://clubklad.ru/blog/article/4561/
        # - 10 яиц -- 30 коп
        # - телега -- 24 рубля
        # - сани -- 5-10 рублей
        # - олифа -- 0.98 рубля
        # - картофель -- 12 копеек/кг
        # - ржаная мука -- 6 копеек/кг
        # - ухват (печной?) -- 0.25 рубля 
        # - расчётная книжка -- 5 копеек
        # - замок -- 0.5 рубля
        # - бутылка водки -- 0.52 рубля
        # - колёсная мазь -- 0.45 руб/коробка (5 фунтов?)
    # Цены 1910 год:
        # Центральный статистический комитет м. в. д. "Города россии в 1910 году"
        # Санкт-Петербург, весна:
        # - хлеб ржаной -- 3 копеек/фунт
        # - хлеб пшеничный -- 5-6.5 копеек/фунт
        # - мясо лучшего сорта -- 13.4-19.8 копеек/фунт
        # - мясо худшего сорта -- 10.0-18.8 копеек/фунт
        # - соль -- 1 копеек/фунт
        # - сахар -- 15 копеек/фунт
    # Жильё (1860 год)
        # Страхование жилья 1860 год, Рязанская губерния:
        # Изба -- 45.4 рублей (50 821 жилище на сумму 2 307 628 рублей)
    # Жильё (1910 год),
        # Санкт-Петербург:
        # - квартира большая 6+ комнат -- 118 рублей/месяц
        # - квартира средняя 4-6 комнат -- 39 рублей/месяц
        # - квартира малая, меньше 4 комнат -- 18 рублей/месяц
        # Уездные города;
        # - квартира большая 6+ комнат -- 50 рублей/месяц
        # - квартира средняя 4-6 комнат -- 33.3 рублей/месяц
        # - квартира малая, меньше 4 комнат -- 16.7 рублей/месяц
        # Строительство (уездные города):
        # - Деревянный дом (70 кв.м) с жестяной кровлей -- 600-700 рублей (9.3 руб/кв.метр)
        # - Кирпичный дом (150 кв.м) с полной отделкой -- 3000-4000 рублей (23.3 руб/кв.метр)
    # Жильё (1914 год),
        # https://russland.mirtesen.ru/blog/43550176068/TSENYI-I-ZARPLATYI-V-ROSSIYSKOY-IMPERII
        # С отоплением, освещением и обстановкой составлял в среднем:
        # - Койка — 4 руб. 33 коп. 
        # - Полукомната — 4 руб. 36 коп. 
        # - Комната — 8 руб. 45 коп. 
        # - 1-комнатная — 12 руб. 28 коп.
        # - 2-комнатная — 18 руб. 87 коп.
        # - 3-комнатная — 31 руб. 78 коп. 
        # - 4-комнатная — 49 руб. 85 коп.
        # - 5-комнатная — 59 руб. 90 коп.
        # В 1908 году в Киеве цены на квартиры были дешевле на 20-25%. 
    # Жильё (1913 год, Киев)
        # - "Гранд-Отель" — 1 руб. 50 коп. (в сут) 
        # - "Континенталь" — 1 руб. 75 коп. (в сут)
        # - Гранд-отель "Ланчия" — 1-10 руб. (в сут.)
        # - Гостиница "Европейская" — 1-12 руб. (в сут.)
        # - Гостиница Михельсона — 50 коп. — 3 руб. (в сут.) или 12-60 руб. (в мес.)
        # - Номера и меблированные комнаты в центре — 30-40 коп. (в сутки) или 9-12 руб. (в мес)
        # - Меблированные комнаты в частных домах с самоваром и прислугой — 15-20 руб. (в мес.),
            # - на окраинах — 5 руб/месяц
    # Бани (1913 год, Киев)
        # - "Караваевские" (угол пл. Льва Толстого и ул. Пушкинской) — 40 коп.
            # общая баня с мраморным бассейном для плавания
        # - Баня Бугаева (Подол, ул. Андреевская) -- общая — 6-25 коп. 
        # - Баня Бубнова на ул. Жилянской — 7-75 коп.
    # Услуги (1913 год, Киев)
        # - Посыльных — 10-50 коп.  
        # - Носильщика — 50 коп. 
        # - Трамвай — 3-5 коп. 
        # - Газеты — 3-5 коп. 
        # - Синематограф — 30 коп. - 1 руб. 
        # - Билет в оперный театр — 20 коп. - 16 руб. 
    # Транспорт, городской (1913 год, Киев):
        # - Извозчик (со станций железных дорог к центру города) — 25 коп.
        # - плата пароконному — 80 коп.-1 руб. 
        # - такси (верста) — 30-40 коп. 
    # Общепит и рестораны (1913 год, Киев)
        # ресторан при гостинице — стоимость табльдота — полноценного обеда — 1 руб.  
        # Обед в кухмистерской — 40 коп. 
        # Обед в "Дешевых обедах" (благотворительность) из двух блюд — 15 коп. 
    # Цены, Москва-Киев (1910-1913 годы):
        # https://ru-history.livejournal.com/2535043.html
        # Рецепты блюд русской кухни от Елены Молоховец, 1901 г.
        # Таблица приблизительных цен различных продуктов.
        # http://www.molohovetc.ru/otdel_i_tablitsa_mery_i_vesa/2_tablitsa_priblizitelnykh_tsen_razlichnykh_produktov/
        # Цены в Киеве по данным Киевского исторического музея на 1913 год
        # https://russland.mirtesen.ru/blog/43550176068/TSENYI-I-ZARPLATYI-V-ROSSIYSKOY-IMPERII
        # - Батон чёрного черствого хлеба весом в 400 грамм – 3 копейки, (7.5 копеек/килограмм)
        # - Батон ржаного свежего хлеба весом в 400 грамм – 4 копейки, (10 копеек/килограмм)
        # - Батон белого сдобного хлеба весом в 300 грамм – 7 копеек, (23 копейки/килограмм)
        # - Картофель свежий урожай 1 килограмм - 15 копеек,
        # - Картофель старый урожай 1 килограмм - 5 копеек,
        # - Мука ржаная 1 килограмм - 6 копеек,
        # - Мука овсяная 1 килограмм - 10 копеек,
        # - Мука пшеничная высшего сорта 1 килограмм - 24 копейки,
        # - Мука картофельная 1 килограмм - 30 копеек,
        # - Фасоль отборная -- 18 копеек
        # - Макароны простые 1 килограмм - 20 копеек,
        # - Вермишель из муки высшего сорта 1 килограмм - 32 копейки,
        # - Сахарный песок второго сорта 1 килограмм – 25 копеек,
        # - Кусковой сахар рафинад отборный 1 килограмм - 60 копеек,
        # - Пряники тульские с вареньем 1 килограмм - 80 копеек,
        # - Конфеты шоколадные 1 килограмм – 3 рубля,
        # - Кофе в зернах 1 килограмм – 2 рубля,
        # - Чай листовой 1 килограмм – 3 рубля,
        # - Соль поваренная 1 килограмм - 3 копейки,
        # - Молоко свежее 1 литр – 14 копеек,
        # - Сливки жирные 1 литр – 60 копеек,
        # - Сметана 1 литр – 80 копеек,
        # - Творог 1 килограмм - 25 копеек,
        # - Сыр «Российский» 1 килограмм - 70 копеек,
        # - Сыр по иностранной технологии «Швейцарский» 1 килограмм - 1 рубль 40 копеек
        # - Масло сливочное 1 килограмм – 1 рубль 20 копеек,
        # - Масло подсолнечное 1 литр – 40 копеек,
        # - Курица парная 1 килограмм – 80 копеек,
        # - Яйцо отборное десяток- 25 копеек,
        # - Мясо телятина парная вырезка 1 килограмм – 70 копеек,
        # - Мясо говядина лопатка 1 килограмм – 45 копеек,
        # - Мясо свинина шейка 1 килограмм – 30 копеек,
        # - Рыба свежая окунь речной 1 килограмм – 28 копеек,
        # - Рыба свежая судак речной 1 килограмм – 50 копеек,
        # - Рыба свежая сом 1 килограмм – 20 копеек,
        # - Рыба свежая лещ 1 килограмм – 24 копеек,
        # - Рыба мороженая горбуша 1 килограмм – 60 копеек,
        # - Рыба мороженая сёмга 1 килограмм – 80 копеек,
        # - Рыба мороженая осетр 1 килограмм – 90 копеек,
        # - Икра черная зернистая 1 килограмм – 3 рубля 20 копеек,
        # - Икра черная паюсная 1 сорта 1 килограмм – 1 рубль 80 копеек,
        # - Икра черная паюсная 2 сорта 1 килограмм – 1 рубль 20 копеек,
        # - Икра черная паюсная 3 сорта 1 килограмм – 80 копеек,
        # - Икра красная соленая 1 килограмм – 2 рубля 50 копеек,
        # - Овощи капуста свежая 1 килограмм – 10 копеек,
        # - Овощи капуста квашенная 1 килограмм – 20 копеек,
        # - Овощи лук репчатый 1 килограмм – 5 копеек,
        # - Овощи морковь 1 килограмм – 8 копеек,
        # - Овощи помидоры отборные 1 килограмм – 45 копеек.
        # - Овощи, свёкла (Киев 1913 год) -- 1.5 копеек
    # Кондитерские, ЭСБЕ (1900 год)
        # https://ru.wikisource.org/wiki/ЭСБЕ/Варенье
        # Варенье (себестоимость) -- 29-34 копейки/кг
        # Варенье (рыночная стоимость) -- 73-110 копеек/кг (наценка 250-320%)
    # Кондитерские, кулинария (1911 год)
        # Оптовый прейскурант. Товарищество А. И. Абрикосова сыновей в Москве. 1911 
        # https://humus.livejournal.com/3965423.html
        # - халва ореховая -- 0.49 рубля/килограмм
        # - чернослив в шоколаде -- 1.13 рубля/килограмм
        # - мармелад фруктовый -- 0.65 рубля/килограмм
        # - пастила фруктовая -- 0.68 рубля/килограмм
        # - пастила банановая -- 0.97 рубля/килограмм
        # - фрукты в сиропе (в бочках) -- 1.2-1.8 рубля/килограмм
        # - кофе зерновой жареный -- 2-2.4 рубля/килограмм
        # - английские бисквиты -- 0.55-0.8 рублей/килограмм
        # - карамель леденцовая -- 0.5-0.6 рублей/килограмм
        # - шоколад весовой, в коробках по 5 фунтов (2 кг) -- 1.1-1.95 рубля/килограмм
            # | название                | штук/фунт | цена (пуд)
            # | ----------------------- | --------- | -------
            # | Писатели                | 14-15     | 18.2
            # | Войско                  | 23-24     | 19.4 
            # | Санте                   | 17-18     | 18.0 
            # | Детский                 | 23-24     | 18.0  
            # | Этнографический         | 14-15     | 19.2 
            # | Виды Москвы             | 15-16     | 22
            # | Батоны Пралине          | 17-18     | 22
            # | Батоны Пралине          | 23-24     | 22
            # | Мексиканский            | 17-18     | 22
            # | Греческий               | 15-16     | 22
            # | Ямаровка                | 15-16     | 22
            # | С разными картинками    | 15        | 22
            # | Виды Киева              | 17-18     | 25
            # | Артисты                 | 30        | 32
            # | Неаполитанский          | 56        | 28
            # | Мелкий с картинками     | 56        | 28
            # | Таблетки сортированные  | 56        | 28
            # | Ист. памятники России   | 48        | 29.2
        # - Эссенции фруктовые и ягодные -- 7.3 рубля/кг
            # персиковая, померанцевая, рябиновая, черёмуховая
            # черносмородиновая, финь-шампань, фисташковая
            # шоколадная, яблочная
        # - Эссенции фруктовые и ягодные -- 8.5 рубля/кг
            # крем ваниль, индийская, бенедиктин
            # мандариновая, розовая, черносливовая
            # Шартрез, мараскинская, флер д'оранжевая
            # абрикотиновая, ванилевая, гелиотроп
    # Цены на спиртные напитки:
        # - бутылка казенной водки (600 мл) - 40 коп.
        # - водка двойной очистки (600 мл) - 60 коп.
        # - кружка пива (600 мл) - 10 коп.
        # - дешевое разливное вино - 5-20 коп./литр
    # Цены косметики (1910 год)
        # - духи высшей концентрации разных запахов -- 1.8-5.8 рублей/флакон
        # - духи тройные разных запахов -- 3.0-5.4 рублей/флакон
        # - духи "Амбруази" (Essence "Ambroisie") -- 2.5 рублей/флакон (30 рублей/дюжина)
        # - духи "Колерет" (Essence "Collerette") -- 2.75 рублей/флакон (33 рублей/дюжина)
    # Цены военной экипировки:
        # - Сапоги парадные офицерские – 20 рублей,
        # - Мундир парадный офицерский – 70 рублей,
        # - Фуражка обер-офицерская – 3 рубля,
        # - Шапка уланская – 20 рублей,
        # - Шапка гусарская штабная – 12 рублей,
        # - Эполеты штаб-офицерские золочёные – 13 рублей,
        # - Шпоры – 14 рублей,
        # - Драгунские и казачьи сабли – 15 рублей,
        # - Офицерский ранец – 4 рубля.
    # Цены на одежду и обувь:
        # - Рубаха выходная – 3 рубля,
        # - Рубашка — 1 руб.
        # - Парусиновые брюки — 1 руб.
        # - Костюм деловой для приказчиков – 8 рублей,
        # - Костюм (пошив) — 16 руб. 75 коп.
        # - Пальто длинное – 15 рублей,
        # - Пальто демисезонное (пошив) — 19 руб. 50 коп.
        # - Сапоги яловые – 5 рублей,
        # - Сапоги — 4-10 руб.
        # - Ботинки летние- 2 рубля,
    # Цены на оружие (1910 год)
        # Варшавское охотничье товарищество
        # Револьверы бельгийских фабрик
        # - револьвер системы "Бульдог" (калибры 320, 380, 440) -- 3, 3.65, 4.75 рубля
        # - револьверы Констабуляры чёрный или никелированный (320, 380, 440) -- 3.75, 4.45, 5.50 рубля
        # Винтовки
        # - 20-зарядная винтовка "Savage Arms Company" (калибр .22) -- 17.5 рубля
    # Цены фабричных товаров (1910 год):
        # - клозетная бумага, туалетная бумага -- 0.5 рубля/рулон
        # - очки, пенсе с лучшими французскими стёклами, оправа из никеля -- 1.5 рубля
            # - оправа из золота 56 пробы на 15% толщины оправы -- 4.5 рубля
        # - очки с рукоятью, лорнет металлический золочёный -- 6.5 рубля
        # - Гармонь - 7.5 рублей
        # - Патефон - 40 рублей,
        # - Рояль известной марки - 200 рублей,
        # - Автомобиль без дополнительной оснастки – 2000 рублей,
        # - швейная машинка Зингер, швеция -- 25 рублей
        # - ремонт швейной машинки -- 1 рубль
        # - граммофон -- 35 - 150 рублей
        # - спиртовой фонарь (250 свечей, 7.8 кг) -- 30 рублей
        # - часы наручные с кожаным браслетом -- 12-18 рублей
        # - часы карманные серебряные (84 пробы, гравированные) -- 13.5-19 рублей
        # - изоляционный сосуд "Янус" (термос) -- 2.25-5 рублей
        # - лампочки для домашнего освещения с винтом с угольной нитью -- 0.2 рубля
        # - с металлической нитью (в 3 раза долговечнее, на 75% энерго-эффективней) -- 0.4 рубля
            # 2, 3, 4, 5, 6, 8, 10 вольт
        # - фонари шкафочные электрические (ореховое дерево) -- 2.25-3 рубля
            # состоят из футляра, батареи и надёжной угольной лампочки.
            # батарея на 4.5 вольта (65x62x21 мм)
                # на 3 часа -- 0.2 рубля/штука
                # "Экстра" на 6 часов (сохраняет энергию 6 месяцев) -- 0.275 рубля/штука
        # - спиртовой утюг (1.2-2.5 кг) -- 3-5 рублей
            # расход спирта -- 0.1 литра/час
            # спирт для утюга -- 10 копеек/литр
        # - барометр американский, никелированная оправа -- 2.5-4.5 рублей
        # - барометр с термометром (дерево, изящная работа) -- 6.5-9.25 рублей
        # - компас в медной оправе -- 0.4-0.75 рублей
        # - шагомер, указывающий количество пройденных шагов -- 6 рублей
        # - бинокль перламутровый с золотыми выдвижками, ахроматические стёкла -- 10.5-22.5 рублей
        # - бинокль в чёрной коже, ахроматические стёкла -- 4.75-12.5 рублей
        # - гирлянда из 10 лампочек -- 7.5 рублей
        # фотоаппарат, складной карманный Кодак -- 38-47 рублей
            # снабжён апланатическим объективом с двойной комбинацией
            # автоматический затвор, автоматическая фокусная шкала, вращающийся видоискатель
            # алюминий, мелкозернистая кожа, никелированные части
            # размеры 19.5×11.5×4 сантиметра, вес 0.67 кг
            # заряжается на 12 съёмок, снимки 8x10.5 сантиметров
        # фотографический аппарат (9/12 см) -- 5-9 рублей
        # - Настольная лампа, с батареей и выключателем -- 3.5 рубля
        # - зажигалка, карманный закуриватель заграничной работы -- 0.85 рубля
        # - столовое огниво-закуриватель заграничной работы (бензин) -- 1.5 рубля
        # - электрический карманный фонарик с батареей и лампой -- 0.4-2 рубля
        # - электрический карманный фонарик в виде трубки -- 2.5-3 рубля
            # - батарея -- 0.5-0.75 рубля
        # - фонарь велосипедный -- 2-2.5 рубля
        # - термометр комнатный -- 0.25 рубля
        # - термометр наружный -- 0.5-1.25 рубля
    # Цены мебель (1910 год)
        # - Экспортная мебель (оптом) - 0.44-2 рубля/килограмм
            # 1905 год, газета  Русский листок
        # - биде фаянсовое английское -- 40-80 рублей
        # - унитазы фаянсовые -- 9-20 рублей
        # - сиденья для унитазов (американские, вишня) -- 3.75-7 рублей
        # - замок на дверь для клозета -- 3 рубля
        # - бумагодержатель -- 2.5 рубля
        # - держка (для смыва) -- 0.65-3.25 рублей
        # - раковины чугунные эмалированные (весьма изящные) -- 5-20 рублей
        # - корыто чугунное эмалированное (400 длина, 225 высота) -- 4 рубля
        # - писсуары чугунные эмалированные -- 2.4-6.5 рублей
        # - люки чугунные для канализации -- 2 рубля
        # - скобы железные для колодцев -- 0.3 рубля/кг
        # - колена чугунные эмалированные (100 мм) -- 3.4-4.2 рубля
        # - сифоны эмалированные (70 мм) -- 1.5 рубля
        # водопроводные краны и вентили:
        # - вентили кривые (10-25 мм, медь) -- 0.95-2.4 рубля
        # - вентили кривые (10-25 мм, бронза) -- 1.5-3.8 рубля
        # - краны кривые (6.25-25 мм, медь) -- 0.75-2.8 рубля
        # - краны самоприжимные (12.5-25 мм) -- 2.1-5.5 рубля
        # - пожарные кривые вентили (12.5-25) -- 2.4-5.25 рубля
        # водопроводные клапаны и краны:
        # - клапаны для воды с муфтами (9.4-25, медь) -- 0.9-2.3 рубля
        # - клапаны для воды с муфтами (9.4-25, бронза) -- 1.25-3.55 рубля
        # - фарфоровые ручки -- 0.6 рубля/пара
        # - медные ручки для кранов -- 0.4-1.4 рубля
        # - домофон (пара телефонов и звонок) -- 6 рублей
        # - фильтр для воды цинковый (6.5-24 литра) -- 6.5-12 рублей
        # - фильтр для воды с краном и медным резервуаром -- 8 рублей
            # Пропускная способность 1.2 литра/минуту
    # Каталог 12-й осенней сельско-хозяйственной и промышленной выставки Ростов на Дону
        # сентябрь 1908 года,
        # https://rusneb.ru/catalog/000199_000009_007860399/
        # в списке 1178 предприятий промышленных и кустарных:
        # * Рассчёт оптовых цен по годовому обороту и продукции фабрик.
        # * Нормо-часы по численности рабочих (8 часов/день, 200 дней/год) и годовой продукции.
        # - висячие замки (кустарь, 150 в год) -- 3 рубля/штука (10.7 нормо-часов)
        # - разные замки (2 кустаря, 500 в год) -- 1.6 рубля/штука (6.4 нормо-часа)
        # - самовары (опт) -- 6.7 руб (13.3 нормо-часа), 10 руб (13.6 н-час) 12 руб (9.3 н-час)
        # - гармони (опт) -- 1.42 руб (5.7 нормо-часа)
        # - валенки (опт) -- 1.67 руб/пара (2.7-3.4 нормо-часа), 5 руб/пара (3.2 н-час)
        # - краски разные (опт, 3 раб) -- 0.04 рубля/килограмм (0.0156 нормо-часа/килограмм)
        # - чулки (мелкий опт, 4 раб) -- 0.8 рубля/пара (6.4 нормо-часа)
        # - рукавицы кожаные (мелкий опт, 12 раб) -- 0.4 рубля/пара (0.4 нормо-часа)
        # - туфли (мелкий опт, 20 раб) -- 0.75 руб/пара (0.8 нормо-часа)
        # - стеариновые свечи (опт, 4 раб) -- 0.125 руб/пачка (0.046 нормо/часа)
        # - мыло для белья (опт, 4 раб) -- 0.24 руб/килограмм (0.016 нормо/часа)
        # - мыло простое и туалетное (опт, 41 раб) -- 0.4 руб/килограмм (0.4 нормо/часа)
        # - пиво (опт, 35 раб) -- 0.4 руб/литр (0.45 нормо-часа)
        # - велосипеды (опт, 50 раб) -- 114 руб/штука (229 нормо-часов)
        # - спички (опт, 55 раб) -- 0.8 руб/ящик (6.4 нормо-часа)
        # - канаты и верёвки (опт, 2000 раб) -- 0.37 руб/кг (0.78 нормо-часа)
        # - канаты и верёвки (опт, 550 раб) -- 0.38 руб/кг (0.67 нормо-часа)
        # - бумага (опт, 100 раб) -- 0.24 руб/кг (0.13 нормо-часа)
        # - табак (опт, 500 раб) -- 0.54 руб/кг (0.17 нормо-часа)
        # - ультрамарин (опт, 55 раб) -- 0.44 руб/кг (0.22 нормо-часа)
        # - платки шерстяные (опт, 250 раб) -- 1.25 руб/штука (1 нормо-час)
        # - мануфактура, ткани (опт, 1526 раб) -- 0.21 руб/метр (0.1 нормо-часа)
        # - масло льняное, олифа (опт, 30 раб) -- 0.3 руб/кг (0.073 нормо-часа)
        # - цинковое белило (опт, 20 раб) -- 0.022 руб/литр (0,0072 нормо-часа)
        # - перчатки (опт, 45 раб) -- 0.7 руб/пара (1.44 нормо-часа)
        # - фуражки (опт, 25 раб) -- 0,87 руб/штука (0.67 нормо-часа)
        # - воды фруктовые и содовые (опт, 24 раб) -- 1.6 руб/литр (0.13 нормо-часа) 
        # - масло подсолнечное (опт, 40 раб) -- 0.24 руб/кг (0.04 нормо-часа)
        # - табачный экстракт (опт, 5 раб) -- 0.3 руб/кг (0.24 нормо-часа)
        # - гвозди проволочные (опт, 40 раб) -- ??? руб/кг (0.04 нормо-часа/кг)
        # - алебастр молотый и колотый (опт, 80 раб) -- ??? руб/кг (0.016 нормо-часа/кг)
        # - конфеты (карамель?) (опт, 125 раб) -- 0.4 руб/кг (0.41 нормо-часа)
        # - бумага листовая (опт, 380 раб) -- 0.76 руб/кг (0.62 норма-часов)
        # - гильзы (опт, 50 раб) -- 4 руб/ящик (5.3 нормо-часа/ящик)
        # В списке 102 завода сельско-хозяйственных машин и орудий.
        # - плуги (опт, 715 раб) -- 20.4 руб/плуг (26.1-45.8 нормо-часов/плуг)
        # - однолемешковые плуги (опт, 300 раб) -- 12.5 руб/плуг (24 нормо-часа/плуг)
    # Цены кустарных товаров:
        # - Стул простой -- 9 копеек
        # - Ковёр, кустарный, 3x2 аршина (2.1x1.4 метра) -- 1.7-6.8 рублей/кв.метр
            # - 6 человеко-дней/ковёр, 88 кв.метров/год -- 16 нормо-часов/кв.метр 
            # - 3.5-5 рублей в Тюмени (1884 год)
            # - 18-20 рублей в Дубровке (1912 год)
            # - 12-20 рублей в Воронежской губернии
        # - соломенная шляпа -- 0.35 рубля
        # - крашенная соломенные шляпа -- 1.8 рубля/штука
    # Цены сырья (розничные):
        # Кустарная промышленность России -- 1913
        # https://www.prlib.ru/item/425782
        # https://ru.wikisource.org/wiki/ЭСБЕ/Мебельное_производство
        # https://ru.wikisource.org/wiki/ЭСБЕ/Бязь
        # - хлопок (1900 год, Тифлис) -- 7-9 руб/пуд (0.43-0.55 рубля/кг)
        # - пряжа (1898 год, Москва, биржа) -- 15.7-16.5 руб/пуд (1 рубль/кг)
        # - ткань, бязь (1890 год, Тифлис) -- 11-12 коп/кв.аршин (0.06 руб/кв.метр)
            # 130-160 кв.аршинов/пуд хлопка, 3.96-4.87 кв.метров/килограмм хлопка-сырца.
            # Должно быть 205-252 грамма хлопка-сырца на кв.метр готовой ткани
            # Плотность ткани 120 грамм, потери 40-52%.
        # - пряжа окрашенная -- 20 руб/пуд (1.22 рубля/кг)
            # - Аниловые краски -- 4.3 грамма/кв.метр ковра
            # - Синий и зелёный купорос -- 5 коп/фунт (12 коп/кг)
            # - Марена красильная (ализарин) -- тёмно-красная краска
            # - Чёрная краска -- Кору ольхи залить водой, вскипятить воду, бросить купорос.
        # - льняное волокно -- 3-4 рубля/пуд (18-24 коп/кг)
        # - Овечья шерсть -- 5-8 рублей/пуд (0.3-0.5 руб/кг)
        # - Коровья шерсть -- 2-3 рубля/пуд (0.12-0.18 руб/кг)
        # - Яловая шерсть -- 4 рубля/пуд (0.24 руб/кг)
        # - Соломенная плетёнка для шляп -- 40-80 коп/65 аршин (1-2 копейки/метр)
            # - Плетение соломы -- 6.3 аршин/день (0.56 метра/нормо-час) -- 0.2 рубля/метр
            # Плотность плетёнки: 15 пудов соломы на 365 мотков (65 аршин/моток) -- 10 грамм/аршин
            # Плетёнка №0 (самая тонкая) -- 6 аршин/день от лучшего мастера
            # Плетёнка №5 (толстая) -- 25 аршин/день от неумехи
            # - Солома варшавская для шляп -- 12 руб/пуд (0.73 руб/кг)
        # Импорт жмыха в Англию:
            # https://ru.wikisource.org/wiki/ЭСБЕ/Жмыхи
            # 1878 год, 1 497 851 пудов, 1 312 264 рублей -- 5.3 коп/килограмм
            # 1880 год, 1 694 837 пудов, 1 761 085 рублей -- 6.3 коп/килограмм
            # 1889 год (подсолнечный), 2 434 000 пудов, 1 637 000 рублей -- 6.7 коп/килограмм
            # 1890 год (подсолнечный), 1962 354 пудов, 1 379 856 рублей 
            # 1892 год (подсолнечный), 1962 354 пудов, 1 379 856 рублей
            # 1891 год (подсолнечный), 2434 000 пудов, 1 637 000 рублей 
    # Услуги связи:
        # https://ru.wikisource.org/wiki/ЭСБЕ/Земская_почта
        # https://ru.wikisource.org/wiki/ЭСБЕ/Почтовые_знаки
        # https://ru.wikisource.org/wiki/ЭСБЕ/Россия/Экономический_отдел/Почта,_телеграф,_телефон
        # - почтовая марка, самая распространённая (1896 год) -- 7 копеек/штука
        # - подписка на газету, журнал (1892 год) -- 0.5-3 рубля/год (или 10% с подписной цены)
        # - простое письмо, земская почта (1892 год) -- 1-5 копеек
        # - посылка, земская почта (1892 год) -- 10-12 копеек/килограмм
        # - послать письмо (1910 год) - 4 коп.
        # - отправить посылку весом менее 5 кг (1910 год) - 65 коп.
        # - телефонный звонок - 50 коп./минута
        # - телеграф - 5 коп./слово
        # - объявление в газете (строка) -- 10-25 коп
    # Услуги, культура
        # - Билеты в Большой театр --  30-60 коп (на галерке 3-5 руб, в партере, ложах -- до 30 руб)
        # - Билет в кино с пианино и скрипкой (1915 год, театр-цирк братьев Никитиных) -- 15-70 коп
            # мировой боевик (sic!) "Белый против чёрного" с Альберто Капоцци
    # Услуги, образование
        # Московский университет 1895 года:
            # https://ru.wikisource.org/wiki/ЭСБЕ/Московский_университет
            # Бюджет -- 4 106 589 рублей, 1183 рублей/год, или 99 рублей/месяц на студента**
            # Полное содержание в общежитии (расходы) -- 190 рублей/год, 16 рублей/месяц.
            # Бесплатные обеды (расходы) -- 0.4 рубля/студента
        # Казанский университет 1893 года:
            # https://ru.wikisource.org/wiki/ЭСБЕ/Казанский_университет
            # Бюджет -- 570 рублей/год, или 47 рублей/месяц на студента
            # Стипендия (20% студентов) -- 226 рублей/год, 18.8 рублей/месяц
        # Земские библиотеки, Новгородская губерния:
            # http://www.admin.novsu.ac.ru/domino/zemstvo.nsf/
            # - Устройство земской библиотеки, 500 книг, 4500 жителей (1906 год) -- 130 рублей
            # - Имущество земской библиотеки (1912 год) -- 275 рублей
    # Литература (1860 год):
        # https://www.prlib.ru/node/363491/source
        # - Худяков "Самоучитель для начинающих обучаться грамоте" -- 0.25 рубля серебром
        # - Бекетов "о земле и воде" -- 0.25 рубля серебром
        # - Бекетов "о живых тварях" -- 0.25 руб
        # - Бок "Будьте здоровы" -- 1.25 руб
        # - Бок "О больном и здоровом человеке" -- 2 руб
        # - Дейч "Гофъ-акушера. Советы матерям" -- 1.25 руб
        # - Худяков "Рассказы о старинных людях" (история) -- 0.6 руб
        # - Худяков "Русская книжка" (сказки) -- 0.3 руб
    # Литература (1894 год):
        # Беседы по вопросам земледелия -- 1894 год
        # - Журналики в 40 страниц на плохой бумаге -- 3-10 копеек
    # Школьные принадлежности для земских школ (1910 год):
        # - тетради №1, №2, №0 -- по 3-5 копеек
        # - начальная арифметика (богато иллюстрированная) -- 30 копеек
        # - практическая грамматика (112 стр) -- 20 копеек
        # - букварь (с рисунками) -- 8 копеек
        # - словарь (400 стр) -- 25 коп
        # - дневник -- 15-25 коп
        # - блокнот -- 40 коп
        # Н. П. Павлов, Нижегородская ярмарка
        # - монокли для рассматривания фотографических карточек -- 8-12 рублей
        # - стереоскопы открытые -- 1.25-2.5 рублей
        # - стереоскопы закрытые, красного дерева -- 3-7.5 рублей
        # - стереоскопические картины фотографические -- 0.1 рубля/штука
        # - лупа с ножками -- 0.75 рубля
        # - лупа складная карманная -- 0.5-3 рубля
        # - карманный микроскоп, ботаническая лупа, набор стёкол, деревянный ящик -- 3 рубля
        # - микроскоп 50x увеличение, объектив 1 линза -- 3.5 рубля
        # - микроскоп 100x увеличение, объектив 2 линзы -- 4.5 рубля
        # - микроскоп 150x увеличение, объектив 3 линзы -- 5.5 рубля
            # 50x линза для микроскопа -- 1 рубль/штука
        # - готовальня, лучшей швейцарской работы -- 3-8 рублей
        # - модель аэроплана (заводится шнурком) -- 1.75-3.5 рубля
        # - электромагнит -- 3 рубля
        # - динамо-машина 4 volt 1 amp -- 12 рублей
            # с ручным приводом -- 22 рубля
        # - Машина Виндгорста статическая электрическая (круг 18 см) -- 10 рублей
        # - Элемент Гренэ -- 2.5 рубля
        # - Спираль Румкорфа с конденсатором (длина искры 3-10 мм) -- 4-11 рублей
        # - Экспериментальный ящик для опытов с лучами Рентгена -- 20 рублей
        # - Экспериментальный ящик для опытов со статическим электричеством -- 15 рублей
        # - Экспериментальный ящик для опытов с динамическим и индуктивным эл. -- 8 рублей
        # - Экспериментальный ящик для опытов с магнитным и статическим эл. -- 12.5 рублей
        # - Индуктивная спираль с двумя проводниками и регулятором тока -- 2.5 рублей
        # - Гейслерова трубка для Румкорфовой спирали -- 0.3-0.75 рубля
        # - Гейслерова трубка наполненная жидкостью -- 0.4-0.75 рубля
    # Расходы на обучение, Киевский учебный округ (1911 год)
        # Траты на одного ученика (оклад учителя, помещение, учебники, тетради).
        # - начальные училища (земские школы) -- 11-18 руб/год
        # - городские училища -- 27-38 руб/год
        # - мужские гимназии -- 126 руб/год
        # - женские гимназии -- 76 руб/год
        # - реальные училища -- 133 руб/год
        # - ремесленные школы -- 142 руб/год
        # - средние технические училища -- 211 руб/год
    # Литература (1913 год):
        # Распределение книг, вышедших в 1913 г., по видам изданий и содержанию
        # Источник: Статистика произведений печати, вышедших в России в 1913 г. Пг., 1915. С. 5-7.
        # http://www.protown.ru/information/hide/6631.html
        # | №   | содержание             | названий   | тираж      | цена тиража | цена книги | доля назван.
        # | --- | ---------------------- | ---------- | ---------- | ----------- | ---------  | ------------
        # |  1. | Учебные пособия        | 2761       | 22 556 928 | 9 768 063   | 0.433      | 0.084
        # |  2. | Народные издания       | 2506       | 21 625 709 |   936 573   | 0.043      | 0.076
        # |  3. | Отчёты                 | 2158       |  1 391 250 |     7 165   | 0.005      | 0.065
        # |  4. | Уставы                 | 2120       |  1 367 321 |     4 439   | 0.003      | 0.064
        # |  5. | Беллетристика          | 1878       |  7 659 723 | 2 707 662   | 0.353      | 0.056
        # |  6. | Земское и город. дело  | 1840       |    500 730 |    14 450   | 0.028      | 0.056
        # |  7. | Религия                | 1764       |  5 731 975 | 2 144 695   | 0.374      | 0.053
        # |  8. | Детские издания        | 1396       |  6 549 530 | 2 034 071   | 0.311      | 0.042
        # |  9. | Сельское хозяйство     | 1329       |  3 579 146 |   835 194   | 0.233      | 0.040
        # | 10. | Музыка, пение, сцена   | 1300       |  1 303 419 |   430 785   | 0.331      | 0.039
        # | 11. | Медицина, вет. гигиен. | 1007       |  1 942 176 | 1 009 614   | 0.520      | 0.031
        # | 12. | Путеводители           |  979       |  2 802 855 | 1 554 730   | 0.555      | 0.030
        # | 13. | Сборники               |  843       |  1 698 781 | 1 060 955   | 0.625      | 0.025
        # | 14. | Библиография           |  774       |  3 124 983 |   138 054   | 0.044      | 0.023
        # | 15. | Драма                  |  767       |  1 025 090 |   287 437   | 0.280      | 0.023
        # | 16. | Календари              |  676       | 13 703 665 | 2 287 886   | 0.167      | 0.021 
        # | 17. | Текущая жизнь          |  662       |  1 087 879 |    96 862   | 0.089      | 0.020 
        # | 18. | Программы, правила     |  615       |    641 545 |    92 575   | 0.144      | 0.019 
        # | 19. | Педагогика             |  581       |    834 531 |   425 246   | 0.510      | 0.018 
        # | 20. | Природоведение         |  577       |    867 161 |   671 037   | 0.774      | 0.018 
        # | 21. | Технология             |  552       |    639 063 |   593 849   | 0.929      | 0.017 
        # | 22. | Поэзия                 |  540       |    909 876 |   343 840   | 0.378      | 0.016 
        # | 23. | Военное и морское дело |  524       |  1 215 826 |   688 178   | 0.566      | 0.016 
        # | 24. | История                |  516       |    950 875 | 1 154 284   | 1.214      | 0.016 
        # | 25. | Статистика             |  412       |    292 810 |    31 435   | 0.107      | 0.013 
        # | 26. | Юбилея дома Романовых  |  402       |  4 100 670 |   854 202   | 0.208      | 0.012 
        # | 27. | Право                  |  385       |    997 266 | 1 493 537   | 1.498      | 0.012 
        # | 28. | Биографии              |  358       |    597 092 |   147 176   | 0.247      | 0.011 
        # | 29. | География, этнография  |  354       |    510 792 |   372 127   | 0.729      | 0.011 
        # | 30. | Социология             |  341       |    844 841 |   747 398   | 0.885      | 0.010 
        # | 31. | Собрания сочинений     |  290       |  1 215 887 | 1 942 544   | 1.598      | 0.009 
        # | 32. | Железнодорожное дело   |  269       |    245 497 |   106 655   | 0.434      | 0.008 
        # | 33. | Спорт                  |  247       |    247 775 |   120 407   | 0.486      | 0.008 
        # | 34. | Политическая экономия  |  235       |    297 876 |   151 797   | 0.510      | 0.007 
        # | 35. | Психология             |  157       |    343 457 |   252 767   | 0.736      | 0.005 
        # | 36. | Ремесло                |  156       |    455 110 |   320 760   | 0.705      | 0.005 
        # | 37. | Алкоголизм             |  141       |  1 180 485 |    35 573   | 0.030      | 0.004 
        # | 38. | Археология             |  131       |     83 498 |   113 500   | 1.359      | 0.004 
        # | 39. | Словари                |  176       |    984 748 | 1 084 798   | 1.102      | 0.005 
        # | 40. | Физика                 |  171       |    705 585 |   198 473   | 0.281      | 0.005 
        # | 41. | Философия              |  111       |    198 801 |   169 398   | 0.852      | 0.003 
        # Всего 33 000 названий (3546 книг/тираж)
        # Всего 37 430 191 рублей (1134 рубля/тираж)
        # Всего 117 006 227 книг (0.32 рубля/книга)
    # Дорожные тарифы (1870 год):
        # - Железная дорога 1 класс грузов (чай) -- 1/6-1/12 копейки/пудоверсты (5.4-11 коп/тонно-километр)
        # - Железная дорога (каменный уголь) -- 1/40 копейки/пудоверсты (1.4 коп/тонно-километр)
        # - Гужевые перевозки (шоссе, Юг России) -- 1/6 копейки/пудоверста (11 коп/тонно-километр)
        # - Гужевые перевозки (дорога, Сибирь) -- 1/10 копейки/пудоверста (5 коп/тонно-километр)
        # - Речные пути (пароход, Волга) -- 1/50 копейки/пудоверста (1 коп/тонно-километр)
        # Доходы железных дорог (1872 год):
            # 20.6 млн. пассажиров и 935.4 млн. пудов груза (15 млн. тонн)
            # Сбор -- 102 млн. рублей; Расходы -- 79 млн; Доходы -- 23 млн.
            # Товарный поезд: 2.14 рубля/веста пробега
            # Пассажирский поезд: 0.73 рубля/верста пробега (вагоно-оборот 3 класса -- 30 копеек/верста?)
    # Дорожные тарифы (1913 года):
        # - Пассажирские перевозки (1 класса) -- 2.7-3.3 коп/верста
        # - Пассажирские перевозки (2 класса) 16 чел/вагон, 6 м³/чел -- 1.6-1.9 коп/человека
        # - Пассажирские перевозки (3 класса) 40 чел/вагон, 2 м³/чел. -- 1-1.3 коп/человека
    # Цены строительных материалов (Сибирь, 1901 год):
        # Постройка и эксплуатация мартеновской фабрики в Лысьвенском заводе гр. П. П. Шувалова 1901 год
        # https://elis.psu.ru/node/490058
        # - кирпич красный -- 10.2-17 рублей/1000 штук
        # - кирпич полукруглый дырчатый (для дымовой трубы) -- 20 рублей/1000 штук
        # - известь -- 6.1-10.8 рублей/тонна
        # - цемент -- 41.86 рублей/тонна
        # - цемент -- 70 коп/пуд, 42 рубля/тонна
        # - алебастр -- 7.36 рублей/тонна
        # - песок речной -- 0.32-0.53 рубля/кубометр
        # - камень бутовый -- 1.2-1.4 рубля/кубометр
        # - дрова обжигательные (насыпью) -- 0.61-0.62 рубля/кубометр
        # - дрова для дома (статистика, 1910 год) -- 0.3-0.5 рубля/кубометр
        # - каменный уголь (статистика, 1910 год) -- 1.2-3 копейки/килограмм
        # - кокс (статистика, 1910 год) -- 1.5-3 копейки/килограмм
        # - торф (статистика, 1910 год) -- 0.9 копейки/килограмм
        # - стеариновые свечи (1910 год) -- 75 копеек/килограмм
        # - крепи (деревянные, для шахты) -- 5 копеек/штука
        # - фальцевая черепица, без доставки, 70 штук/кв.сажень (15 штук/кв.метр) -- 2.5 коп/штука
        # - коньковая черепица, без доставки, 7 штук/сажень, (3 штуки/метр) -- 5 коп/штука
        # - глиносоломенные ковры, пеньковая основа (1887 год) -- 100 аршин за 3 рубля (4 копейки/кв.метр)
        # - жерди прямые диаметром 40-мм для глиносоломенной кровли (1887 год) -- 100 штук за 1.25 рубля.
        # Керамические трубы 2-10 дюймовые, безнапорные, глазированные:
        # - 2 дюйма, 50.8 мм, 6.16 кг/метр -- 0.5 руб/метр
        # - 3 дюйма, 76.2 мм, 11.2 кг/метр -- 0.78 руб/метр
        # - 4 дюйма, 101.6 мм, 16.6 кг/метр -- 0.92 руб/метр
        # - 5 дюймов, 127 мм, 21.9 кг/метр -- 0.99 руб/метр
        # - 6 дюймов, 152.4 мм, 26.6 кг/метр -- 1.13 руб/метр
        # - 8 дюймов, 203.2 мм, 37 кг/метр -- 1.69 руб/метр
        # - 9 дюймов, 228.6 мм, 44.7 кг/метр -- 1.83 руб/метр
        # - 10 дюймов, 254 мм, 49.3 кг/метр -- 2.18 руб/метр
        # Для мартеновской печи:
        # - кирпич
        #     - белый явенский -- 71 рубль/1000 штук 
        #     - белый лысьвенский -- 46.4 рубля/1000 штук 
        #     - шамотный товарищества Штарк -- 95.61 рубля/1000 штук 
        #     - кварце-глинистый -- 82 рубля/1000 штук 
        #     - динас -- 143 рубля/1000 штук
        # - глина красная (подножная) -- 0.28 рубля/кубометр
        # - глина белая -- 12.3 рубля/тонну
        # - кварцевый теплогорский песок -- 4.67 рубля/кубометр
        # Металлические изделия, прокат:
        # - сталь (какая?) -- 400 рублей/тонна
        # - железо сортовое -- 71 рубль/тонна
        # - железо кровельное -- 108 рублей/тонна
        # - железо листовое -- 150 рублей/тонна
        # - чугунное литьё -- 78.6 рублей/тонна
        # - железные лестницы -- 215 рублей/тонна
        # - двутавроые балки -- 110 рублей/тонна
        # - железо котельное -- 153 рубля/тонна
        # - двутавровые балки и железо котельное -- 232 рубля/тонна
        # - стальные рельсы (7 килограмм/метр) -- 108 рублей/тонна
        # - накладки для шпал -- 239 рублей/тонна
        # - болты -- 344 рубля/тонна
        # - гвозди -- 200 рублей/тонна
        # - поворотные круги -- 68 рублей/тонна
        # Для окраски:
        # - масло -- 337 рублей/тонна
        # - масло постное -- 327-351 рублей/тонна
        # - масло льняное -- 362 рублей/тонна
        # - белила -- 232 рубля/тонна
        # - белильная известь (1888 год) -- 127 рублей/тонна
        # - сурик свинцовый -- 233 рубля/тонна
        # - сажа голландская -- 184 рубля/тонна
        # - мумиё -- 150 рубля/тонна
    # Смазочные материалы, 1900 год:
        # - колёсная мазь на деревянную ось -- 20 коп за 5 фунт ящик (97.6 рублей/тонна)
        # - колёсная мазь на железную ось -- 30 коп за 5 фунт ящик (146 рублей/тонна)
    # Цены промышленных товаров:
        # Постройка и эксплуатация мартеновской фабрики в Лысьвенском заводе гр. П. П. Шувалова 1901 год
        # https://elis.psu.ru/node/490058
        # - весы Роберваль (до 2 пудов) -- 15.3 рублей
        # - весы Фербэнкс (на 50 пудов) -- 80 рублей
        # - весы Фербэнкс (на 75 пудов) -- 125 рублей
        # - весы Фербэнкс (на 200 пудов) -- 500 рублей
        # - деревянный кран -- 425 рублей/тонна груза
        # - стальной кран -- 825 рублей/тонна груза
        # - два разгрузочных крана-бегуна весом по 12 тонн -- 8500 рублей (1700 рублей тонна/груза)
        # - Турбина 52 квт -- 2390 рублей (46 рублей/киловатт)
        # - молоток рессорный, 240 ударов/минуту, 30 кг молот, электромотор 2.2 кВт -- 2500 рублей
        # - железная тележка (320 килограмм) -- 106-123 рублей
        # - две наковальни -- 36 рублей
        # - меха кузнечные -- 17 рублей
        # - ручной насос -- 56 рублей
        # - керосиновый двигатель (одноцилиндровый, 2 лошад. силы, 300 оборотов/минуту) -- 460 рублей
        # - керосиновый двигатель (двухцилиндровый, 30 лошад. силы, 200 оборотов/минуту) -- 3450 рублей
    # Цены промышленных товаров (1910 год):
        # - Винтовой пресс для фальцевой черепицы -- 454-568 рублей
            # до 1500 черепиц/день, вес пресса 1.5 тонны.
        # - Ручной пресс универсальный (кирпичи, трубы, черепица, плитка) -- 200-300 рублей
            # деревянная форма для полых кирпичей, смачивание -- 15 рублей
            # железная форма для труб 6 дюймов -- 11 рублей
        # - Глиномялка с конным приводом (1 лошадиная сила) -- 181 рубль
            # на 5000 порций глины для кирпичей/сутки (5-6 кубометров), вес глиномялки 1 тонна.
            # http://www.arhplan.ru/materials/bricks/dobycha-i-podgotovka-gliny-dlya-kirpicha
        # - Ручной ткацкий станок для соломенных ковров (80-130 аршин/день) -- 8 рублей
        # - воздушный ассенизаторный насос (360 литров/минуту) -- 235-275 рублей
            # 20-мм цилиндр, 20 мм ход поршня
        # манометры и вакууметры:
        # - манометры (диаметр шкалы 7.5-45 см) -- 11-63 рублей
            # до 30 атмосфер
        # - вакууметры (диаметр шкалы 10-25 см) -- 13-26 рублей
            # до 30 дюймов
        # гидравлические насосы:
        # - насос с одинарным поршнем для давления до 30 атмосфер --  57 рублей
        # - насос с двойным бронзовым поршнем для давления до 75 атмосфер -- 120 рублей
        # насосы поршневые чугунные:
        # - насос всасывающий обыкновенный:
            # поршень 56 мм, 31 мм труба, 1200 литров/час -- 11 рублей
            # поршень 87 мм, 40 мм труба, 2400 литров/час -- 17 рублей
        # - насос всасывающий и нагнетающий:
            # поршень 56 мм, 31 мм труба, 1200 литров/час -- 25 рублей
            # поршень 87 мм, 40 мм труба, 2400 литров/час -- 38 рублей
        # аппараты для устройства аббисивных колодцев (для трубы 50 мм)
        # - треножник (выше человека) -- 40 рублей
        # - забивная баба -- 18.5 рублей
        # - зажим для трубы -- 10 рублей
            # - ключ -- 1.8 рублей
        # - земляные бурава (диаметр 7.5-25 см) -- 4.5-11 рублей
        # - ворот для прижимания трубы во время ввинчивания -- 6.75-10 рублей
        # - наконечники для вколачивания и ввинчивания
            # - без фильтра (35-50 мм) -- 7-11.5 рублей
            # - с фильтром (35-50 мм) -- 10.5-15 рублей
        # - домкраты бутылчатые:
            # | высота (мм) |  вес (кг) |  сила (кг) | цена (рублей)
            # | ----------- | --------- | ---------- | -------------
            # | 225         | 5.33      | 2050       | 7.9
            # | 300         | 6.97      | 2952       | 9.5
            # | 375         | 9.02      | 4100       | 12.25
            # | 450         | 13.12     | 5084       | 16
            # | 525         | 15.58     | 6150       | 20
            # | 600         | 19.68     | 8200       | 23
            # | 600         | 25.83     | 10 168     | 30
        # домкраты паровозные на салазках, с двумя трещётками, стальные
            # (поднимает и сдвигает в сторону)
            # | высота (мм) | сдвигает (мм) |  вес (кг) |  сила (кг) | цена (рублей)
            # | ----------- | ------------- | --------- | ---------- | -------------
            # | 500         | 175           | 31.98     | 8200       | 50
            # | 600         | 250           | 41.82     | 10 250     | 62
            # | 600         | 300           | 44.69     | 12 300     | 68
            # | 650         | 350           | 78.31     | 15 580     | 80
            # | 675         | 450           | 102.5     | 20 500     | 120
        # лебёдки в чугунной раме
            # подъём №1 -- подъём непосредственно от барабана
            # подъём №2 -- подъём с помощью 1-го и 2-х рол. блоков
            # подъём №1 (кг)  | подъём №2 (кг) |  цена    
            # --------------- | -------------- | ------
            # 410             | 2050           | 45
            # 575             | 3034           | 48
            # 820             | 4100           | 50-63
            # 1017            | 5084           | 63-73
            # 1312            | 6068           | 88
            # 1558            | 7134           | 100
            # 1804            | 8200           | 110
            # 2050            | 10 168         | 150
    # Столярные инструменты (1890):
        # Как делать простую мебель -- 1890 год, Вологда
        # Опыт ознакомления детей начальных школ со столярным ремеслом
        # - Верстак -- от 5 рублей
        # - Измерительные инструменты -- 1.5 рубля
            # Ресмус, наугольник, ерунок,
            # малка, кианка, складной аршин
        # - Рубанок, шерхебел, фуганок, шлифтик -- 2.5 рубля
        # - 6 разных пил -- 1.5 рубля
        # - Коловорот железный и 12 свёрл -- 2 рубля
        # - 12 разных стаместок и долот -- 3 рубля
        # - Молоток, циркуль (стальной), 2 отвёртки, 2 шила -- 1.5 рубля
        # - Винтельня для нарезки винтов по дереву -- 1.5 рубля
        # - 4 напилка и цикля -- 1.5 рубля
        # - Топорок, брусок, оселок -- 1 рубль
        # - Клещи и 2 щипцов -- 1 рубль
        # - Ковш для варения клея -- 0.5 рубля
    # Слесарные инструменты (1910 год):
        # - тачка багажная (из углового железа, два колеса) -- 11.25 рублей
        # - тележка багажная (дубовая, окована железом, три колеса) -- 55 рублей
        # - ножницы для вырезки кругов и колец из жести (станок) -- 70-135 рублей
        # - коловорот -- 2.4-3.0 рублей
        # - дрель ручная (8 свёрл) -- 4 рубля
        # - дрель для ажурных работ (2 сверла) -- 1.75 рубля
        # - древь грудная с универсальный матроном и ватерпасом -- 9 рублей
        # - клуппы американские (для нарезки резьбы в трубах) -- 23-100 рублей (завист от диаметра труб) 
        # - клещи цепные для газовых труб -- 2.15 - 16 рублей (зависит от диаметра труб)
        # - труборез с двумя направляющими роликами (25-75 мм) -- 5.6-14.5 рублей
        # - труборез с хомутом (от 50 мм до 100 мм) -- 22 рубля
        # - труборез с хомутом (от 50 мм до 200 мм) -- 30 рублей
        # - ключи гаечные (комплект, 5 переставых шестерень) -- 5 рублей 
        # - ключи гаечные с трещёткой штамованные -- 0.4-2.10 рублей (зависит от диаметра гаек)
        # - тиски привертные кованые, разных размеров (1.2-4.1 кг) -- 2.85-6.5 рублей
        # - тиски привертные стальные с наковальней (2-4.1) -- 6.5-14 рублей
        # - точильные камни английские (на станок) -- 0.85-5.20 рублей
        # - циркуль стальной с дугой -- 0.6-1 рублей
        # - кронциркуль стальной с дугой -- 0.95-1.7 рублей
        # - кронциркуль с делением (2.5-4.8 см) -- 1.5-4.4 рублей
        # - штангенциркули никелированные -- 3.25-4.25 рублей
        # - штангенциркули с винтом (15-30 см) -- 1.65-2.65 рублей
        # - аршины складные английские (пальмовое дерево, шарнир) -- 0.3-0.7 рубля
        # - рулетки в кожаных футлярах -- 2.5-3.5 рубля
        # - рулетки в стальных футлярах -- 1.25-9.5 рубля
        # - линейки стальные обыкновенные -- 1.65-4.5 рублей
        # - алмазы для резки стекла (металлическая оправа, костяная ручка) -- 1.5-5 рублей
        # - болторезный станок "Симплекс" (болты и газовые трубы) -- 105-120 рублей
        # - выжигательный аппарат со всеми принадлежностями -- 4.5-8 рублей
        # - паяльник домашний "Швейцер" (электрический) -- 2.25 рубля
        # - паяльник бензиновый -- 10 рублей
        # - паяльная лампа для водопроводчиков -- 4 рубля
        # - вертикальная маслёнка №8 -- 15 рублей
        # - лампа паяльная, бензиновая -- 12 рублей
        # - лампа паяльная керосиновая "Бартель" -- 17-22 рублей
        # - керосиновая лампочка для литейных -- 18 рублей
        # - лампа-факел №18 для употребления на открытом воздухе -- 3.75 рубля
        # - осветительный прибор №1 керосиновый, для рудников -- 115 рублей
            # 500 свечей, расход керосина 3 фунта/час (6 часов)
            # размер резервуара 40x25 сантиметров
            # вес при полном резервуаре -- 33 кг (16.4 пустой)
        # - вилы для кокса американские (8-12 зубьев) -- 4.5-6 рублей
        # - молоток английский с гвоздодёром, лакированная ручка -- 0.75-1.2 рубля
    # Сельскохозяйственные инструменты (1897 год):
        # Описанiе земледельческих орудiй, с рисунками и с показанiем продажных цен
        # https://rusneb.ru/catalog/000199_000009_003641803_100627/
        # - коса длиной 5 -- 40 коп
        # - серп кустаря -- 30 коп
        # - топор плотницкий -- 70 коп
        # - лопаты деревянные для глины -- 25 коп
        # - лопаты весовые -- 30-60 коп
        # - лопаты балластовые с ручками -- 1-1.4 рубля
        # - вилы навозные -- 20-80 коп
        # - грабли садовые, 10 зубцов -- 40 коп
    # Сельскохозяйственные орудия (1897 год):
        # - безпередковый плуг (без колёс, борозда 4.5x4.5 вершка, вес плуга 39 кг) -- 14.75-17.20 рубля
        # - оборотный плуг (без колёс, борозда 6.5 вершка, вес плуга 90 кг) -- 31.5 рубля
        # - однолемешный плуг (без колёс, борозда 4x3.5 вершка, вес 24 кг) -- 6.75 рублей
            # деревянный станок, стальной отвал, лемех и нож.
        # - однолемешный плуг (два колеса, борозда 6x5.5 вершка, вес 84 кг) -- 23-27 рублей
        # - двухлемешный плуг (два колеса, борозда 12.5x5.5 вершка, вес 140 кг, 2-3 лошади) -- 50 рублей
        # - трёхлемешный плуг (два колеса, борозда 15x2.5 вершка, вес 123 кг, 2-3 лошади) -- 42 рубля
        # - четырёхлемешный плуг (три колеса, борозда 16x2.5 вершков, вес 150 кг, 2-3 лошади) -- 48 рублей
        # - плуг окучник (направ. колесо, вес 41 кг) -- 15.5 рублей
        # - дисковая борона (12 дисков, ширина 40 вершков, 2 метра, вес 164 кг) -- 85 рублей
            # - стально тарелко-образный диск -- 3 рубля/штука
        # - борона зиг-заг (ширина 40 вершков, вес 86.4 кг) -- 27 рублей
        # - луговая составная борона (кованое железо, ширина 32 вершка, вес 68 кг) -- 28 рублей
        # - грабли упряжные (стальные зубцы, рабочая колея 0.73 метра) -- 60 рублей
            # Заменяют 20 рабочих
        # - картофелекопатель (вес 37 кг) -- 12.42 рубля
            # выглядит как плуг
    # Сельскохозяйственные механизмы (1897 год):
        # - ручная молотилка (кованое железо, две рукоятки, вес 220 кг) -- 62 рубля
        # - конная молотилка (две рукоятки, вес 220 кг) -- 114 рублей
            # - конный привод (24-48 оборотов штанги = 1 оброт коня, вес 420 кг, 2-4 лошади) -- 100 рублей
        # - паровая молотилка -- 760-1085 рублей
            # - локомобиль для молотилки (4 лошадиные силы) -- 1400 рублей
        # - ручная веялка (внтилятор, очистка зерна воздухом, вес 100 кг) -- 23 рубля
            # сито для веялки (кв.аршин) -- 40 коп
        # - ручная соломорезка -- 33 рубля
        # - ручная корнерезка (тёрки и механизм) -- 19-29 рублей
        # - ручная дробилка зерна (90 кг/час) -- 39-50 рублей
        # - пресс для сена (тюки 25.6x15.7x14.4 верш. 0.5 кубометра, 60-70 кг, пресс 615 кг) -- 142.6 рубля
            # плотность сена -- 130 кг/кубометр
            # 2 рабочих для пресса, 3 для прочих работ -- 75 тюков/день (5 тонн/день)
        # - пульверизатор для поливки садов -- 21 рубль
            # Воздух до 1 атмосферы, раствор до 3 атмосфер.
            # 3-6 атмосфер, механический насос, манометр.
        # - лебёдка "Метеор" №1 и №2 (№1 -- 200 кг груза, №2 -- 500 кг) -- 18.4 руб и 36.8 руб
            # барабан, 2 подшипника, шестерня, винт с рукояткой, тормоз.
            # спуск груза управляется тормозом, поднимая груз рукоять можно отпускать.
        # - маслоделка для небольших производство -- 8.74-13.70 рублей
        # - сушилка фруктов на угле (вес 311 килограмм) -- ???
            # Поверхность 11+8 кв.аршин, 10 кв.метров, 22 сушильные решётки.
            # Производительность 24 пудов/сутки, 400 кг/сутки
            # Каменного угля -- 37 кг/сутки
        # - ручная мельница для размола фруктов -- ???
            # Производительность 30-50 пудов/сутки, 500-820 кг
        # - ручной аппарат для пессования винограда -- 45 рублей
        # - ручной пресс для выдавливания сока (12 литров) -- 28 рублей
        # - хлебо-жатвенная машина -- (4 грабли, ширина 1.5 метра, вес 361 кг, 2 лошади) -- 230 рублей
        # - траво-косилка (2 скорости движения ножа, 2 лошади, вес 295 кг) -- 165 рублей
    # Сельскохозяйственные механизмы (1910 год):
        # - двойной аспиратор "Зиг-Заг" (очистка пшеницы от постороних зёрен, 377 кг) -- 450-500 рублей
        # - аспиратор "Тарар" -- 120-175 рублей
        # - магнитный аппарат (18x20x11 см, 16 кг, 3 магнита) -- 50 рублей
        # - магнитный аппарат (70x20x11 см, 37 кг, 20 магнитов) -- 200 рублей
            # чистит зерно от гвоздей, кусочков проволоки, жести и т.д.
        # - зерноочистительный аппарат "Двойная еврека с деташером" -- 400-500 рублей
            # 200x80 сантиметров, цилиндр 56 мм, 500 оборотов/минуту, вес машины 426-525 кг
            # деташер -- две чугунные рифлёные тарелки, между которыми проходит зерно
            # очищает зерно от земли и пыли.
        # - щёточная зерноочистительная машина -- 325-475 рублей
            # 120x120x157 сантиметров, 600 оборотов/минуту, вес машины -- 328-492 кг
        # - жатвенная машина, косилка (для хлеба, травы, льна) -- 150 рублей
            # ширина 2 аршина, 5.75 вершка, вес -- 492 кг
            # два шкифа и приводной ремень от ходового колеса
            # Упряжь -- пара лошадей.
            # Производительность: 8 десятин
    # Пчеловодство (1897 год):
        # - улей системы Бутлера -- 4.5 руб
        # - улей системы Дадана -- 6 руб
        # - шкаф для уборки сот -- 4 руб
    # Удобрения (1897 год)
        # - суперфосфат (12% фосфорной кислоты, 18 пудов/десятину) -- 48 коп/пуд (2.9 коп/кг)
        # - фосфоритная мука (26% фосфорной кислоты, 30-50 пудов/десятину) -- 40 копеек/пуд (2.4 коп/кг)
        # - сырой гипс (15-25 пудов/десятину) -- 30 копеек/пуд (1.8 коп/кг)
        # - каинит (12% калия, 18 пудов/десятину) -- 75 коп/пуд (4.6 коп/кг)
        # - чилийская селитра (15% азота) -- 1.96 руб/пуд (12 коп/кг)

#----
# Почта в мешках:

metadict_detail['|=Газеты (килограмм)'] = {
        '|=Газеты (литр)':1 / 0.2,
        '|==Почта (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка почты (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные мешки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Письма (килограмм)'] = {
        '|=Письма (литр)':1 / 0.2,
        '|==Почта (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка почты (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные мешки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Посылки (килограмм)'] = {
        '|=Посылки (литр)':1 / 0.2,
        '|==Почта (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка почты (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные мешки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Журналы (килограмм)'] = {
        '|=Журналы (литр)':1 / 0.2,
        '|==Почта (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка почты (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные мешки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Книги (килограмм)'] = {
        '|=Книги (литр)':1 / 0.2,
        '|==Почта (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка почты (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные мешки (килограмм)':(1 / (1 - 0.12) - 1),
        }

#----
# Канцелярские товары в мешках:

metadict_detail['|=Тетради (килограмм)'] = {
        '|=Тетради (литр)':1 / 0.2,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные мешки (килограмм)':(1 / (1 - 0.12) - 1),
        }

#----
# Перевозка в банках и ящиках:

metadict_detail['|=Банка лечо (килограмм)'] = {
        # TODO:
            # Плохая идея, совмещать банки с ящиками.
            # И да, опять ты считаешь массу тары на глазок.
        # Пустая трёхлитровая банка -- килограмм (25% брутто)
        '|=Ящик лечо (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка тушёных шампиньонов (килограмм)'] = {
        '|=Ящик консервированных шампиньонов (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка соевого соуса (килограмм)'] = {
        '|=Ящик соевого соуса (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка соуса песто (килограмм)'] = {
        '|=Ящик соуса песто (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка томатного соуса (килограмм)'] = {
        '|=Ящик томатного соуса (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка томатной пасты (килограмм)'] = {
        '|=Ящик томатной пасты (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка лютеницы (килограмм)'] = {
        '|=Ящик лютеницы (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка баклажанного соуса (килограмм)'] = {
        '|=Ящик баклажанного соуса (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка джема из ревеня (килограмм)'] = {
        '|=Ящик джема из ревеня (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка яблочного джема (килограмм)'] = {
        '|=Ящик яблочного джема (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка земляничного варенья (килограмм)'] = {
        '|=Ящик земляничного варенья (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка одуванчикового варенья (килограмм)'] = {
        '|=Ящик одуванчикового варенья (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка рябинового варенья (килограмм)'] = {
        '|=Ящик рябинового варенья (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка вишнёвого варенья (килограмм)'] = {
        '|=Ящик вишнёвого варенья (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка клюквенного варенья (килограмм)'] = {
        '|=Ящик клюквенного варенья (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка смородинового варенья (килограмм)'] = {
        '|=Ящик смородинового варенья (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка лимонного сиропа (килограмм)'] = {
        '|=Ящик лимонного сиропа (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка клюквенного сиропа (килограмм)'] = {
        '|=Ящик клюквенного сиропа (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка яблочного сиропа (килограмм)'] = {
        '|=Ящик яблочного сиропа (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка горчицы (килограмм)'] = {
        '|=Ящик горчицы (литр)':1 / 1.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка чернил (килограмм)'] = {
        '|=Ящик чернил (литр)':1 / 1.5,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

metadict_detail['|=Банка клея (килограмм)'] = {
        '|=Ящик клея (литр)':1 / 1.5,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - (0.25 + 0.20)),
        '-Тарные банки (килограмм)':(1 / (1 - 0.25) - 1),
        '-Тарные ящики (килограмм)':(1 / (1 - 0.20) - 1),
        }

#----
# Грузоперевозки (в бочках):

metadict_detail['|=Бочка арахисового масла (килограмм)'] = {
        # Формула Для вычисления веса брутто:
            # y = x / (1 - c)
                # Где:
                # y - вес брутто.
                # x - вес нетто (1 кг).
                # c - доля тары в весе брутто (0.06-0.45)
        # Для вычисления веса тары:
            # z = x / (1 - c) - x
        '|=Бочка арахисового масла (литр)':1 / 0.91,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка красного вина (килограмм)'] = {
        '|=Бочка красного вина (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка белого вина (килограмм)'] = {
        '|=Бочка белого вина (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка ржаного кваса (килограмм)'] = {
        '|=Бочка ржаного кваса (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка скоропортящихся напитков (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка ржаного имбирно-яблочного кваса (килограмм)'] = {
        '|=Бочка ржаного имбирно-яблочного кваса (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка скоропортящихся напитков (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка ржано-гречневого кваса (килограмм)'] = {
        '|=Бочка ржано-гречневого кваса (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка скоропортящихся напитков (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка имбирного эля (килограмм)'] = {
        '|=Бочка имбирного эля (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка скоропортящихся напитков (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка ячменного пива (килограмм)'] = {
        '|=Бочка ячменного пива (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка медовухи вишнёвой (килограмм)'] = {
        '|=Бочка медовухи вишнёвой (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка кленового сиропа (килограмм)'] = {
        # http://www.novedu.ru/sprav/pl-sug.htm
        '|=Бочка кленового сиропа (литр)':1 / 1.3,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка конопляного масла (килограмм)'] = {
        '|=Бочка конопляного масла (литр)':1 / 0.93,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка льняного масла (килограмм)'] = {
        '|=Бочка льняного масла (литр)':1 / 0.94,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка кунжутного масла (килограмм)'] = {
        '|=Бочка кунжутного масла (литр)':1 / 0.94,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка мёда (килограмм)'] = {
        '|=Бочка мёда (литр)':1 / 1.4,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка оливкового масла (килограмм)'] = {
        '|=Бочка оливкового масла (литр)':1 / 0.92,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка подсолнечного масла (килограмм)'] = {
        '|=Бочка подсолнечного масла (литр)':1 / 0.92,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка соевого масла (килограмм)'] = {
        '|=Бочка соевого масла (литр)':1 / 0.92,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка соевого маргарина (килограмм)'] = {
        '|=Бочка соевого маргарина (литр)':1 / 0.96,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка соевого соуса (килограмм)'] = {
        '|=Бочка соевого соуса (литр)':1 / 0.92,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка темпе (килограмм)'] = {
        '|=Бочка темпе (литр)':1 / 0.92,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка масла какао (килограмм)'] = {
        '|=Бочка масла какао (литр)':1 / 0.96,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка яблочного сидра (килограмм)'] = {
        '|=Бочка яблочного сидра (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка скоропортящихся напитков (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка грушевого сидра (килограмм)'] = {
        '|=Бочка грушевого сидра (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка скоропортящихся напитков (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка яблочного уксуса (килограмм)'] = {
        '|=Бочка яблочного уксуса (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка виноградного уксуса (килограмм)'] = {
        '|=Бочка виноградного уксуса (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка квашеной капусты (килограмм)'] = {
        '|=Бочка квашеной капусты (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка маринованного фенхеля (килограмм)'] = {
        '|=Бочка маринованного фенхеля (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка маринованных боровиков (килограмм)'] = {
        '|=Бочка маринованных боровиков (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка солёных боровиков (килограмм)'] = {
        '|=Бочка солёных боровиков (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка квашеной свёклы (килограмм)'] = {
        '|=Бочка квашеной свёклы (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка квашеной репы (килограмм)'] = {
        '|=Бочка квашеной репы (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка солёных кабачков (килограмм)'] = {
        '|=Бочка солёных кабачков (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка маринованных оливок (килограмм)'] = {
        '|=Бочка маринованных оливок (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка маринованных каперсов (килограмм)'] = {
        '|=Бочка маринованных каперсов (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка солёных огурцов (килограмм)'] = {
        '|=Бочка солёных огурцов (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка солёных томатов (килограмм)'] = {
        '|=Бочка солёных томатов (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка мочёной вишни (килограмм)'] = {
        '|=Бочка мочёной вишни (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка мочёного крыжовника (килограмм)'] = {
        '|=Бочка мочёного крыжовника (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка мочёной сливы (килограмм)'] = {
        '|=Бочка мочёной сливы (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка мочёной морошки (килограмм)'] = {
        '|=Бочка мочёной морошки (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка мочёных груш (килограмм)'] = {
        '|=Бочка мочёных груш (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка мочёных яблок (килограмм)'] = {
        '|=Бочка мочёных яблок (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.09),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.09) - 1),
        }

metadict_detail['|=Бочка изюма (килограмм)'] = {
        '|=Бочка изюма (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка овсяной муки (килограмм)'] = {
        # TODO:
            # Нерационально перевозить муку в бочках.
        '|=Бочка овсяной муки (литр)':1 / 0.432,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка овсяной крупы (килограмм)'] = {
        '|=Бочка овсяной крупы (литр)':1 / 0.3,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка арахиса (килограмм)'] = {
        '|=Бочка арахиса (литр)':1 / 0.65,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.14),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.14) - 1),
        }

metadict_detail['|=Бочка фисташек (килограмм)'] = {
        '|=Бочка фисташек (литр)':1 / 0.65,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.14),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.14) - 1),
        }

metadict_detail['|=Бочка ячневой крупы (килограмм)'] = {
        '|=Бочка ячневой крупы (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка перловой крупы (килограмм)'] = {
        '|=Бочка перловой крупы (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка пшённой крупы (килограмм)'] = {
        '|=Бочка пшённой крупы (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка гречневой крупы (килограмм)'] = {
        '|=Бочка гречневой крупы (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка риса шлифованного (килограмм)'] = {
        '|=Бочка риса шлифованного (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка картофельного крахмала (килограмм)'] = {
        '|=Бочка картофельного крахмала (литр)':1 / 0.6,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка агар-агара (килограмм)'] = {
        '|=Бочка агар-агара (литр)':1 / 0.6,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка кукурузной крупы (килограмм)'] = {
        '|=Бочка кукурузной крупы (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка кукурузной муки (килограмм)'] = {
        '|=Бочка кукурузной муки (литр)':1 / 0.59,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка гречневой муки (килограмм)'] = {
        '|=Бочка гречневой муки (литр)':1 / 0.59,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка ячменного солода (килограмм)'] = {
        '|=Бочка ячменного солода (литр)':1 / 0.34,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка ржаного солода (килограмм)'] = {
        '|=Бочка ржаного солода (литр)':1 / 0.34,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка ржаной муки (килограмм)'] = {
        '|=Бочка ржаной муки (литр)':1 / 0.59,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка рисовой муки (килограмм)'] = {
        '|=Бочка ржаной муки (литр)':1 / 0.59,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка ячменной муки (килограмм)'] = {
        '|=Бочка ячменной муки (литр)':1 / 0.59,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка гороховой муки (килограмм)'] = {
        '|=Бочка гороховой муки (литр)':1 / 0.59,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка пшеничного солода (килограмм)'] = {
        '|=Бочка пшеничного солода (литр)':1 / 0.34,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка пшеничной муки (килограмм)'] = {
        '|=Бочка пшеничной муки (литр)':1 / 0.59,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка соевой муки (килограмм)'] = {
        '|=Бочка соевой муки (литр)':1 / 0.59,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка льняной муки (килограмм)'] = {
        '|=Бочка льняной муки (литр)':1 / 0.59,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка соевых бобов (килограмм)'] = {
        '|=Бочка соевых бобов (литр)':1 / 0.75,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.14),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.14) - 1),
        }

metadict_detail['|=Бочка сухой горчицы (килограмм)'] = {
        '|=Бочка сухой горчицы (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.18),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.18) - 1),
        }

metadict_detail['|=Бочка сушёного хмеля (килограмм)'] = {
        '|=Бочка сушёного хмеля (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.18),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.18) - 1),
        }

metadict_detail['|=Бочка какао-порошка (килограмм)'] = {
        '|=Бочка какао-порошка (литр)':1 / 0.65,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка сухого гороха (килограмм)'] = {
        '|=Бочка сухого гороха (литр)':1 / 0.80,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.14),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.14) - 1),
        }

metadict_detail['|=Бочка сухого нута (килограмм)'] = {
        '|=Бочка сухого нута (литр)':1 / 0.80,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.14),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.14) - 1),
        }

metadict_detail['|=Бочка сухого урда (килограмм)'] = {
        '|=Бочка сухого урда (литр)':1 / 0.80,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.14),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.14) - 1),
        }

metadict_detail['|=Бочка сухой чечевицы (килограмм)'] = {
        '|=Бочка сухой чечевицы (литр)':1 / 0.80,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.14),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.14) - 1),
        }

metadict_detail['|=Бочка сухой фасоли (килограмм)'] = {
        '|=Бочка сухой фасоли (литр)':1 / 0.80,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.14),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.14) - 1),
        }

metadict_detail['|=Бочка сушёной морской капусты (килограмм)'] = {
        '|=Бочка сушёной морской капусты (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка сушёного шиповника (килограмм)'] = {
        '|=Бочка сушёного шиповника (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка сушёной клюквы (килограмм)'] = {
        '|=Бочка сушёной клюквы (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка сушёной рябины (килограмм)'] = {
        '|=Бочка сушёной рябины (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка сушёной малины (килограмм)'] = {
        '|=Бочка сушёной малины (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка сушёной смородины (килограмм)'] = {
        '|=Бочка сушёной смородины (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка сушёной черники (килограмм)'] = {
        '|=Бочка сушёной черники (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка сушёных белых грибов (килограмм)'] = {
        '|=Бочка сушёных белых грибов (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка сушёной вишни (килограмм)'] = {
        '|=Бочка сушёной вишни (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка сушёной груши (килограмм)'] = {
        '|=Бочка сушёной груши (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка сушёного абрикоса (килограмм)'] = {
        '|=Бочка сушёного абрикоса (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка сушёного инжира (килограмм)'] = {
        '|=Бочка сушёного инжира (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка фиников (килограмм)'] = {
        '|=Бочка фиников (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка сушёного персика (килограмм)'] = {
        '|=Бочка сушёного персика (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка сушёной сливы (килограмм)'] = {
        '|=Бочка сушёной сливы (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка сушёной алычи (килограмм)'] = {
        '|=Бочка сушёной алычи (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка сушёных томатов (килограмм)'] = {
        '|=Бочка сушёных томатов (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка вяленых томатов (килограмм)'] = {
        '|=Бочка вяленых томатов (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка сушёных трав (килограмм)'] = {
        # TODO:
            # Не используется
        '|=Бочка сушёных трав (литр)':1 / 0.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.18),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.18) - 1),
        }

metadict_detail['|=Бочка местных трав (килограмм)'] = {
        '|=Бочка местных трав (литр)':1 / 0.5,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.18),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.18) - 1),
        }

metadict_detail['|=Бочка местных пряностей (килограмм)'] = {
        '|=Бочка местных пряностей (литр)':1 / 0.43,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.16),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.16) - 1),
        }

metadict_detail['|=Бочка сушёных яблок (килограмм)'] = {
        '|=Бочка сушёных яблок (литр)':1 / 0.76,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка соли (килограмм)'] = {
        '|=Бочка соли (литр)':1 / 1.2,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.07),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.07) - 1),
        }

metadict_detail['|=Бочка едкого натра (килограмм)'] = {
        '|=Бочка едкого натра (литр)':1 / 1.2,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.07),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.07) - 1),
        }

metadict_detail['|=Бочка хлорки (килограмм)'] = {
        '|=Бочка хлорки (литр)':1 / 1.2,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.07),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.07) - 1),
        }

metadict_detail['|=Бочка серной кислоты (килограмм)'] = {
        # TODO: ну не в деревянных бочках же перевозить!
        '|=Бочка серной кислоты (литр)':1 / 1.2,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.07),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.07) - 1),
        }

metadict_detail['|=Бочка серного эфира (килограмм)'] = {
        '|=Бочка серного эфира (литр)':1 / 1.2,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.07),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.07) - 1),
        }

metadict_detail['|=Бочка соды негашёной (килограмм)'] = {
        '|=Бочка соды негашёной (литр)':1 / 1.2,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.07),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.07) - 1),
        }

metadict_detail['|=Бочка соды пищевой (килограмм)'] = {
        '|=Бочка соды пищевой (литр)':1 / 1.2,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.07),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.07) - 1),
        }

metadict_detail['|=Бочка тростникового сахара (килограмм)'] = {
        # Сахар рафинируют в Эквестрии
        '|=Бочка тростникового сахара (литр)':1 / 0.85,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.08),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.08) - 1),
        }

metadict_detail['|=Бочка дёгтя (килограмм)'] = {
        '|=Бочка дёгтя (литр)':1 / 0.95,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка извести негашёной (килограмм)'] = {
        # TODO:
            # Добавь отдельную категорию
        '|=Бочка извести негашёной (литр)':1 / 0.85,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка цемента М400 (килограмм)'] = {
        '|=Бочка цемента М400 (литр)':1 / 1.51,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.06),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.06) - 1),
        }

metadict_detail['|=Бочка жидкого стекла (килограмм)'] = {
        '|=Бочка жидкого стекла (литр)':1 / 1.5,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.06),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.06) - 1),
        }

metadict_detail['|=Бочка стеклянной глазури (килограмм)'] = {
        '|=Бочка стеклянной глазури (литр)':1 / 1.5,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.06),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.06) - 1),
        }

metadict_detail['|=Бочка асбеста (килограмм)'] = {
        '|=Бочка асбеста (литр)':1 / 0.52,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка мелового порошка (килограмм)'] = {
        '|=Бочка мелового порошка (литр)':1 / 0.52,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка дегтярного масла (килограмм)'] = {
        '|=Бочка дегтярного масла (литр)':1 / 0.91,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка масляных красок (килограмм)'] = {
        '|=Бочка масляных красок (литр)':1 / 0.91,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка аниловых красок (килограмм)'] = {
        '|=Бочка аниловых красок (литр)':1 / 0.91,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка клея обойного (килограмм)'] = {
        '|=Бочка клея обойного (литр)':1 / 0.91,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка олифы (килограмм)'] = {
        '|=Бочка олифы (литр)':1 / 0.91,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка хозяйственного мыла (килограмм)'] = {
        '|=Бочка хозяйственного мыла (литр)':1 / 0.91,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка машинного масла (килограмм)'] = {
        '|=Бочка машинного масла (литр)':1 / 0.91,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка колёсной мази (килограмм)'] = {
        '|=Бочка колёсной мази (литр)':1 / 0.91,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.17),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.17) - 1),
        }

metadict_detail['|=Бочка пироксилина (килограмм)'] = {
        '|=Бочка пироксилина (литр)':1 / 0.91,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (брутто) (килограмм)':1 / (1 - 0.45),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.45) - 1),
        }

#----
# Грузоперевозки (в горшках):

metadict_detail['|=Горшок маринованной моркови (килограмм)'] = {
        # Пифос, объём 100 литров, вес 43 кг.
            # https://en.wikipedia.org/wiki/Pithos#Weight_and_measures
        '|=Горшок маринованной моркови (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.30),
        '-Тарные горшки (килограмм)':(1 / (1 - 0.30) - 1),
        }

metadict_detail['|=Горшок квашеной капусты кимчи (килограмм)'] = {
        '|=Горшок квашеной капусты кимчи (литр)':1 / 0.99,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (брутто) (килограмм)':1 / (1 - 0.30),
        '-Тарные горшки (килограмм)':(1 / (1 - 0.30) - 1),
        }

#----
# Импорт:

metadict_detail['|=Бочка тростникового сахара-сырца (килограмм)'] = {
        # Импорт из Эверглейдса
        '|=Бочка тростникового сахара-сырца (литр)':1 / 0.96,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия, импорт (Зебрика) (брутто) (килограмм)':1 / (1 - 0.08),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.08) - 1),
        }

metadict_detail['|=Бочка чёрной патоки (килограмм)'] = {
        '|=Бочка чёрной патоки (литр)':1 / 0.96,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия, импорт (Зебрика) (брутто) (килограмм)':1 / (1 - 0.08),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.08) - 1),
        }

metadict_detail['|=Бочка кофейных зёрен (килограмм)'] = {
        '|=Бочка кофейных зёрен (литр)':1 / 0.56,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия, импорт (Зебрика) (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Бочка какао-бобов (килограмм)'] = {
        '|=Бочка какао-бобов (литр)':1 / 0.6,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия, импорт (Зебрика) (брутто) (килограмм)':1 / (1 - 0.10),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.10) - 1),
        }

metadict_detail['|=Бочка сушёных чайных листьев (килограмм)'] = {
        '|=Бочка сушёных чайных листьев (литр)':1 / 0.43,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия, импорт (Зебрика) (брутто) (килограмм)':1 / (1 - 0.16),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.16) - 1),
        }

metadict_detail['|=Бочка импортных пряностей (килограмм)'] = {
        '|=Бочка импортных пряностей (литр)':1 / 0.43,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия, импорт (Зебрика) (брутто) (килограмм)':1 / (1 - 0.16),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.16) - 1),
        }

metadict_detail['|=Бочка сухой ванили (килограмм)'] = {
        '|=Бочка сухой ванили (литр)':1 / 0.43,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия, импорт (Зебрика) (брутто) (килограмм)':1 / (1 - 0.18),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.18) - 1),
        }

metadict_detail['|=Бочка корицы (килограмм)'] = {
        '|=Бочка корицы (литр)':1 / 0.43,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия, импорт (Зебрика) (брутто) (килограмм)':1 / (1 - 0.18),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.18) - 1),
        }

metadict_detail['|=Бочка сушёного манго (килограмм)'] = {
        '|=Бочка сушёного манго (литр)':1 / 0.43,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия, импорт (Зебрика) (брутто) (килограмм)':1 / (1 - 0.16),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.16) - 1),
        }

metadict_detail['|=Бочка сушёных бананов (килограмм)'] = {
        '|=Бочка сушёных бананов (литр)':1 / 0.43,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия, импорт (Зебрика) (брутто) (килограмм)':1 / (1 - 0.16),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.16) - 1),
        }

#----
# Импорт (фрукты):

metadict_detail['|=Мешок импортных фруктов (килограмм)'] = {
        # Считаем как продовольствие, чтобы фрукты не дублировались
        '|=Мешок импортных фруктов (литр)':1 / 0.6,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов, импорт (Зебрика) (брутто) (килограмм)':1 / (1 - 0.04),
        '-Тарные мешки (килограмм)':(1 / (1 - 0.04) - 1),
        }

metadict_detail['|=Мешок импортных авокадо (килограмм)'] = {
        '|=Мешок импортных авокадо (литр)':1 / 0.6,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов, импорт (Зебрика) (брутто) (килограмм)':1 / (1 - 0.04),
        '-Тарные мешки (килограмм)':(1 / (1 - 0.04) - 1),
        }

metadict_detail['|=Мешок импортных бананов (килограмм)'] = {
        '|=Мешок импортных бананов (литр)':1 / 0.6,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов, импорт (Зебрика) (брутто) (килограмм)':1 / (1 - 0.04),
        '-Тарные мешки (килограмм)':(1 / (1 - 0.04) - 1),
        }

metadict_detail['|=Мешок импортных манго (килограмм)'] = {
        '|=Мешок импортных манго (литр)':1 / 0.6,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов, импорт (Зебрика) (брутто) (килограмм)':1 / (1 - 0.04),
        '-Тарные мешки (килограмм)':(1 / (1 - 0.04) - 1),
        }

metadict_detail['|=Мешок импортных апельсинов (килограмм)'] = {
        '|=Мешок импортных апельсинов (литр)':1 / 0.6,
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов, импорт (Зебрика) (брутто) (килограмм)':1 / (1 - 0.04),
        '-Тарные мешки (килограмм)':(1 / (1 - 0.04) - 1),
        }

#----
# Местные перевозки, город-деревня:

metadict_detail['|=Бочка питьевой воды (килограмм)'] = {
        '|=Бочка питьевой воды (литр)':1,
        '|==Вода (тонн)':1 / 1000,
        'Доставка воды для хозяйства (брутто) (килограмм)':1 / (1 - 0.08),
        #'-Тарные бочки (килограмм)':(1 / (1 - 0.08) - 1),
        }

metadict_detail['|=Бочка хозяйственной воды (килограмм)'] = {
        '|=Бочка хозяйственной воды (литр)':1,
        '|==Вода (тонн)':1 / 1000,
        'Доставка воды для хозяйства (брутто) (килограмм)':1 / (1 - 0.08),
        #'-Тарные бочки (килограмм)':(1 / (1 - 0.08) - 1),
        }

metadict_detail['|=Бочка промышленной воды (килограмм)'] = {
        # TODO:
            # Пока что используется только для строительства.
        '|=Бочка промышленной воды (литр)':1,
        '|==Сырьё промышленное (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка воды для промышленности (брутто) (килограмм)':1 / (1 - 0.08),
        #'-Тарные бочки (килограмм)':(1 / (1 - 0.08) - 1),
        }

metadict_detail['|=Бочка кленового сока (килограмм)'] = {
        '|=Бочка кленового сока (литр)':1,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка грузов от ближайшего леса (брутто) (килограмм)':1 / (1 - 0.08),
        '-Тарные бочки (килограмм)':(1 / (1 - 0.08) - 1),
        }

metadict_detail['|=Корзина дикорастущих растений (килограмм)'] = {
        '|=Корзина дикорастущих растений (литр)':1 / 0.42,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка грузов от ближайшего леса (брутто) (килограмм)':1 / (1 - 0.16),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.16) - 1),
        }

metadict_detail['|=Корзина красных водорослей (килограмм)'] = {
        '|=Корзина красных водорослей (литр)':1 / 0.42,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка грузов от ближайшего леса (брутто) (килограмм)':1 / (1 - 0.16),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.16) - 1),
        }

metadict_detail['|=Корзина морской капусты (килограмм)'] = {
        '|=Корзина морской капусты (литр)':1 / 0.42,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка грузов от ближайшего леса (брутто) (килограмм)':1 / (1 - 0.16),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.16) - 1),
        }

metadict_detail['|=Корзина батата (килограмм)'] = {
        '|=Корзина батата (литр)':1 / 0.64,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина топинамбура (килограмм)'] = {
        '|=Корзина топинамбура (литр)':1 / 0.64,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина арбуза (килограмм)'] = {
        '|=Корзина арбуза (литр)':1 / 0.64,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина дыни (килограмм)'] = {
        '|=Корзина дыни (литр)':1 / 0.64,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина винограда (килограмм)'] = {
        '|=Корзина винограда (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина вишни (килограмм)'] = {
        '|=Корзина вишни (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина рябины (килограмм)'] = {
        '|=Корзина рябины (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина сливы (килограмм)'] = {
        '|=Корзина сливы (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина алычи (килограмм)'] = {
        '|=Корзина алычи (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина инжира (килограмм)'] = {
        '|=Корзина инжира (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина граната (килограмм)'] = {
        '|=Корзина граната (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина бананов (килограмм)'] = {
        '|=Корзина бананов (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина манго (килограмм)'] = {
        '|=Корзина манго (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина авокадо (килограмм)'] = {
        '|=Корзина авокадо (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина апельсинов (килограмм)'] = {
        '|=Корзина апельсинов (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина фиников (килограмм)'] = {
        '|=Корзина фиников (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина персика (килограмм)'] = {
        '|=Корзина персика (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина абрикоса (килограмм)'] = {
        '|=Корзина абрикоса (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина груш (килограмм)'] = {
        '|=Корзина груш (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина кабачка (килограмм)'] = {
        '|=Корзина кабачка (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина баклажанов (килограмм)'] = {
        '|=Корзина баклажанов (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина капусты белокочанной (килограмм)'] = {
        '|=Корзина капусты белокочанной (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина картофеля (килограмм)'] = {
        '|=Корзина картофеля (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина красной фасоли в стручках (килограмм)'] = {
        '|=Корзина красной фасоли в стручках (литр)':1 / 0.6,
        '|==Зернобобовые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка зернобобовых (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина соевых бобов в стручках (килограмм)'] = {
        '|=Корзина соевых бобов в стручках (литр)':1 / 0.6,
        '|==Зернобобовые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка зернобобовых (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина лука репчатого (килограмм)'] = {
        '|=Корзина лука репчатого (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина чеснока (килограмм)'] = {
        '|=Корзина чеснока (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина моркови (килограмм)'] = {
        '|=Корзина моркови (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина огурцов (килограмм)'] = {
        '|=Корзина огурцов (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина перца сладкого (килограмм)'] = {
        '|=Корзина перца сладкого (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина зерна кукурузы (килограмм)'] = {
        '|=Корзина зерна кукурузы (литр)':1 / 0.6,
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка зерновых (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина початков кукурузы (килограмм)'] = {
        '|=Корзина початков кукурузы (литр)':1 / 0.72,
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина свёклы (килограмм)'] = {
        '|=Корзина свёклы (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина томатов (килограмм)'] = {
        '|=Корзина томатов (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина тыквы (килограмм)'] = {
        '|=Корзина тыквы (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина чайных листьев (килограмм)'] = {
        '|=Корзина чайных листьев (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (Зебрика) (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина листьев карри (килограмм)'] = {
        '|=Корзина листьев карри (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (Зебрика) (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина фруктов (килограмм)'] = {
        # TODO:
            # Не используется
        '|=Корзина фруктов (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина лимонов (килограмм)'] = {
        '|=Корзина лимонов (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина яблок (килограмм)'] = {
        '|=Корзина яблок (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина арахиса в шелухе (килограмм)'] = {
        '|=Корзина арахиса в шелухе (литр)':1 / 0.27,
        '|==Зернобобовые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка зернобобовых (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина фисташек в скорлупе (килограмм)'] = {
        '|=Корзина фисташек в скорлупе (литр)':1 / 0.27,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка орехов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина миндаля в скорлупе (килограмм)'] = {
        '|=Корзина миндаля в скорлупе (литр)':1 / 0.27,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка орехов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина зерна овса (килограмм)'] = {
        '|=Корзина зерна овса (литр)':1 / 0.43,
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка зерновых (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина оливок (килограмм)'] = {
        '|=Корзина оливок (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина зерна пшеницы (килограмм)'] = {
        '|=Корзина зерна пшеницы (литр)':1 / 0.78,
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка зерновых (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина семян горчицы (килограмм)'] = {
        '|=Корзина семян горчицы (литр)':1 / 0.72,
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина семян конопли (килограмм)'] = {
        '|=Корзина семян конопли (литр)':1 / 0.72,
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка масличного сырья (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина семян льна (килограмм)'] = {
        '|=Корзина семян льна (литр)':1 / 0.72,
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка масличного сырья (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина семян джута (килограмм)'] = {
        '|=Корзина семян джута (литр)':1 / 0.72,
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка масличного сырья (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина семян хлопка (килограмм)'] = {
        '|=Корзина семян хлопка (литр)':1 / 0.72,
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка масличного сырья (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина семян кунжута (килограмм)'] = {
        '|=Корзина семян кунжута (литр)':1 / 0.72,
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка масличного сырья (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина маковых головок (килограмм)'] = {
        '|=Корзина маковых головок (литр)':1 / 0.72,
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка масличного сырья (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина семян мака (килограмм)'] = {
        '|=Корзина семян мака (литр)':1 / 0.72,
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка масличного сырья (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина семян подсолнечника (килограмм)'] = {
        '|=Корзина семян подсолнечника (литр)':1 / 0.72,
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка масличного сырья (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина цветов подсолнечника (килограмм)'] = {
        '|=Корзина цветов подсолнечника (литр)':1 / 0.42,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.16),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.16) - 1),
        }

metadict_detail['|=Корзина коробочек кунжута (килограмм)'] = {
        '|=Корзина коробочек кунжута (литр)':1 / 0.42,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (Зебрика) (брутто) (килограмм)':1 / (1 - 0.16),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.16) - 1),
        }

metadict_detail['|=Корзина плодов какао (килограмм)'] = {
        '|=Корзина плодов какао (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (Зебрика) (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина плодов пименты (килограмм)'] = {
        '|=Корзина плодов пименты (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (Зебрика) (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина плодов кофейного дерева (килограмм)'] = {
        '|=Корзина плодов кофейного дерева (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (Зебрика) (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина стручков острого перца (килограмм)'] = {
        '|=Корзина стручков острого перца (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина стручков сладко-жгучего перца (килограмм)'] = {
        '|=Корзина стручков сладко-жгучего перца (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина стручков ванили (килограмм)'] = {
        '|=Корзина стручков ванили (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (Зебрика) (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Связка сахарного тростника (килограмм)'] = {
        # TODO:
            # Ну не корзины же. И не факт, что связки.
        '|=Связка сахарного тростника (литр)':1 / 0.27,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (Зебрика) (брутто) (килограмм)':1 / (1 - 0.02),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.02) - 1),
        }

metadict_detail['|=Корзина гвоздики (килограмм)'] = {
        '|=Корзина гвоздики (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (Зебрика) (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина цветов шафрана (килограмм)'] = {
        '|=Корзина цветов шафрана (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (Зебрика) (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина гороха в стручках (килограмм)'] = {
        '|=Корзина гороха в стручках (литр)':1 / 0.6,
        '|==Зернобобовые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка зернобобовых (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина нута бараньего в стручках (килограмм)'] = {
        '|=Корзина нута бараньего в стручках (литр)':1 / 0.6,
        '|==Зернобобовые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка зернобобовых (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина урда в стручках (килограмм)'] = {
        '|=Корзина урда в стручках (литр)':1 / 0.6,
        '|==Зернобобовые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка зернобобовых (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина чечевицы (килограмм)'] = {
        '|=Корзина чечевицы (литр)':1 / 0.6,
        '|==Зернобобовые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка зернобобовых (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина зерна гречихи (килограмм)'] = {
        '|=Корзина зерна гречихи (литр)':1 / 0.6,
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка зерновых (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина зерна риса посевного (килограмм)'] = {
        '|=Корзина зерна риса посевного (литр)':1 / 0.6,
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка зерновых (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина шампиньонов (килограмм)'] = {
        '|=Корзина шампиньонов (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина вёшенок (килограмм)'] = {
        '|=Корзина вёшенок (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина дикорастущих грибов (килограмм)'] = {
        '|=Корзина дикорастущих грибов (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка грузов от ближайшего леса (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина дикорастущих орехов (килограмм)'] = {
        '|=Корзина дикорастущих орехов (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка орехов (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина дикорастущих ягод (килограмм)'] = {
        '|=Корзина дикорастущих ягод (литр)':1 / 0.6,
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка грузов от ближайшего леса (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина зерна ржи (килограмм)'] = {
        '|=Корзина зерна ржи (литр)':1 / 0.43,
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка зерновых (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина зерна ячменя (килограмм)'] = {
        '|=Корзина зерна ячменя (литр)':1 / 0.43,
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка зерновых (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина зерна просо (килограмм)'] = {
        '|=Корзина зерна просо (литр)':1 / 0.43,
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка зерновых (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина корнеплодов (килограмм)'] = {
        # TODO:
            # Не используется
        '|=Корзина корнеплодов (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина имбиря (килограмм)'] = {
        '|=Корзина имбиря (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина овощей (килограмм)'] = {
        # TODO:
            # Не используется
        '|=Корзина овощей (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина брокколи (килограмм)'] = {
        '|=Корзина брокколи (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина артишоков (килограмм)'] = {
        '|=Корзина артишоков (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина огородных растений (килограмм)'] = {
        # TODO:
            # Не используется
        '|=Корзина огородных растений (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина хмеля (килограмм)'] = {
        '|=Корзина хмеля (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина хрена (килограмм)'] = {
        '|=Корзина хрена (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина петрушки (килограмм)'] = {
        '|=Корзина петрушки (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина шпината (килограмм)'] = {
        '|=Корзина шпината (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина плодов чёрного перца (килограмм)'] = {
        '|=Корзина плодов чёрного перца (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (Зебрика) (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина ревеня (килограмм)'] = {
        '|=Корзина ревеня (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина репы (килограмм)'] = {
        '|=Корзина репы (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина редьки (килограмм)'] = {
        '|=Корзина редьки (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина редиса (килограмм)'] = {
        '|=Корзина редиса (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина брюквы (килограмм)'] = {
        '|=Корзина брюквы (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина турнепса (килограмм)'] = {
        '|=Корзина турнепса (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина латука посевного (килограмм)'] = {
        '|=Корзина латука посевного (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина сельдерея (килограмм)'] = {
        '|=Корзина сельдерея (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина пастернака (килограмм)'] = {
        '|=Корзина пастернака (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина спаржи (килограмм)'] = {
        '|=Корзина спаржи (литр)':1 / 0.6,
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина кресс-салата (килограмм)'] = {
        '|=Корзина кресс-салата (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина укропа (килограмм)'] = {
        '|=Корзина укропа (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Корзина лука зелёного (килограмм)'] = {
        '|=Корзина лука зелёного (литр)':1 / 0.6,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (брутто) (килограмм)':1 / (1 - 0.12),
        '-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

metadict_detail['|=Сноп овса (килограмм)'] = {
        # Плотность сена, соломы -- 50 кг/кубометр
        '|=Сноп овса (литр)':1 / 0.05,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.02),
        }

metadict_detail['|=Сноп овсяной соломы (килограмм)'] = {
        '|=Сноп овсяной соломы (литр)':1 / 0.05,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.02),
        }

metadict_detail['|=Сноп гречихи посевной (килограмм)'] = {
        '|=Сноп гречихи посевной (литр)':1 / 0.05,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.02),
        }

metadict_detail['|=Сноп гречишной соломы (килограмм)'] = {
        '|=Сноп гречишной соломы (литр)':1 / 0.05,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.02),
        }

metadict_detail['|=Сноп пшеницы (килограмм)'] = {
        '|=Сноп пшеницы (литр)':1 / 0.05,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.02),
        }

metadict_detail['|=Сноп пшеничной соломы (килограмм)'] = {
        '|=Сноп пшеничной соломы (литр)':1 / 0.05,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.02),
        }

metadict_detail['|=Сноп ржи (килограмм)'] = {
        '|=Сноп ржи (литр)':1 / 0.05,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.02),
        }

metadict_detail['|=Сноп ржаной соломы (килограмм)'] = {
        '|=Сноп ржаной соломы (литр)':1 / 0.05,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.02),
        }

metadict_detail['|=Сноп ячменя (килограмм)'] = {
        '|=Сноп ячменя (литр)':1 / 0.05,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.02),
        }

metadict_detail['|=Сноп ячменной соломы (килограмм)'] = {
        '|=Сноп ячменной соломы (литр)':1 / 0.05,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.02),
        }

metadict_detail['|=Сноп просо (килограмм)'] = {
        '|=Сноп просо (литр)':1 / 0.05,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.02),
        }

metadict_detail['|=Сноп просяной соломы (килограмм)'] = {
        '|=Сноп просяной соломы (литр)':1 / 0.05,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.02),
        }

metadict_detail['|=Сноп риса посевного (килограмм)'] = {
        '|=Сноп риса посевного (литр)':1 / 0.05,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.02),
        }

metadict_detail['|=Сноп рисовой соломы (килограмм)'] = {
        '|=Сноп рисовой соломы (литр)':1 / 0.05,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.02),
        }

metadict_detail['|=Сноп горчицы (килограмм)'] = {
        '|=Сноп горчицы (литр)':1 / 0.05,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.02),
        }

metadict_detail['|=Сноп конопли (килограмм)'] = {
        '|=Сноп конопли (литр)':1 / 0.05,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.02),
        }

metadict_detail['|=Сноп льна (килограмм)'] = {
        '|=Сноп льна (литр)':1 / 0.05,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.02),
        }

metadict_detail['|=Сноп джута (килограмм)'] = {
        '|=Сноп джута (литр)':1 / 0.05,
        '|==Сырьё пищевое (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (брутто) (килограмм)':1 / (1 - 0.02),
        }

#----
# Канализация и вывоз мусора:

metadict_detail['|=Корзина пищевых отходов (килограмм)'] = {
        '|=Корзина пищевых отходов (литр)':1 / 0.6,
        'Вывоз мусора (тонн)':1 / 1000,
        #'-Тарные корзины (килограмм)':(1 / (1 - 0.12) - 1),
        }

#----
# Трубопроводы:

metadict_detail['|=Трубопроводный транспорт воды (килограмм)'] = {
        # TODO:
            # Трубопроводы так-то тоже следует учесть в грузообороте.
        '|==Вода (тонн)':1 / 1000,
        'Доставка воды для хозяйства, трубопровод (нетто) (килограмм)':1,
        'Слив жидких отходов, трубопровод (нетто) (килограмм)':1,
        }

#----
# Перевозка без тары:
    # Погрузочный объём:
    # http://www.libussr.ru/doc_ussr/usr_14950.htm

metadict_detail['|=Кирпич (тонн)'] = {
        '|=Кирпич (кубометр)':1 / 2.12,
        '|==Стройматериалы (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка стройматериалов (тонн)':1,
        }

metadict_detail['|=Черепица (тонн)'] = {
        '|=Черепица (кубометр)':1 / 2.12,
        '|==Стройматериалы (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка стройматериалов (тонн)':1,
        }

metadict_detail['|=Кафель (тонн)'] = {
        '|=Кафель (кубометр)':1 / 2.12,
        '|==Стройматериалы (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка стройматериалов (тонн)':1,
        }

metadict_detail['|=Стекло листовое (килограмм)'] = {
        '|=Стекло листовое (кубометр)':2 / 1000,
        '|==Стройматериалы (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка стройматериалов (тонн)':1 / 1000,
        }

metadict_detail['|=Пиломатериалы свежие (тонн)'] = {
        '|=Пиломатериалы свежие (кубометр)':1.5,
        '|==Стройматериалы (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка стройматериалов (тонн)':1,
        }

metadict_detail['|=Доски паркетные (тонн)'] = {
        '|=Доски паркетные (кубометр)':1.5,
        '|==Стройматериалы (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка стройматериалов (тонн)':1,
        }

metadict_detail['|=Кирпич опилкобетонный лёгкий (тонн)'] = {
        '|=Кирпич опилкобетонный лёгкий (кубометр)':1 / 0.5,
        '|==Стройматериалы (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка стройматериалов (тонн)':1,
        }

metadict_detail['|=Кирпич саманный лёгкий (тонн)'] = {
        '|=Кирпич саманный лёгкий (кубометр)':1 / 0.5,
        '|==Стройматериалы (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка строительного сырья (тонн)':1,
        }

metadict_detail['|=Глина (тонн)'] = {
        '|=Глина (кубометр)':1,
        '|==Стройматериалы (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка строительного сырья (тонн)':1,
        }

metadict_detail['|=Лес круглый (тонн)'] = {
        '|=Лес круглый (кубометр)':2,
        '|==Сырьё промышленное (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка строительного сырья (тонн)':1,
        }

metadict_detail['|=Брикеты прессованного жмыха (тонн)'] = {
        '|=Брикеты прессованного жмыха (кубометр)':5,
        '|==Сырьё промышленное (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка дров (тонн)':1,
        }

metadict_detail['|=Брикеты прессованных отрубей (тонн)'] = {
        '|=Брикеты прессованных отрубей (кубометр)':5,
        '|==Сырьё промышленное (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка дров (тонн)':1,
        }

metadict_detail['|=Дрова (тонн)'] = {
        '|=Дрова (кубометр)':2,
        '|==Сырьё промышленное (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка дров (тонн)':1,
        }

metadict_detail['|=Дрова (Зебрика) (тонн)'] = {
        '|=Дрова (Зебрика) (кубометр)':2,
        '|==Сырьё промышленное (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка дров (Зебрика) (тонн)':1,
        }

metadict_detail['|=Валежник (тонн)'] = {
        '|=Валежник (кубометр)':4,
        '|==Сырьё промышленное (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка дров (тонн)':1,
        }

metadict_detail['|=Уголь древесный (тонн)'] = {
        '|=Уголь древесный (кубометр)':2,
        '|==Сырьё промышленное (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка угля (тонн)':1,
        }

metadict_detail['|=Грунт (тонн)'] = {
        '|=Грунт (кубометр)':1 / 1.6,
        #'|==Сырьё промышленное (тонн)':1,
        'Вывоз строительного мусора (тонн)':1,
        }

metadict_detail['|=Опилки древесные (тонн)'] = {
        '|=Опилки древесные (кубометр)':4,
        '|==Сырьё промышленное (тонн)':1,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка строительного сырья (тонн)':1,
        }

metadict_detail['|=Сноп сухой соломы (тонн)'] = {
        '|=Сноп сухой соломы (кубометр)':6,
        '|==Сырьё промышленное (тонн)':1,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка строительного сырья (тонн)':1,
        }

metadict_detail['|=Тюк прессованной соломы (тонн)'] = {
        '|=Тюк прессованной соломы (кубометр)':10,
        '|==Сырьё промышленное (тонн)':1,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка строительного сырья (тонн)':1,
        }

metadict_detail['|=Тюк пакли (килограмм)'] = {
        '|=Тюк пакли (кубометр)':6 / 1000,
        '|==Сырьё промышленное (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка строительного сырья (тонн)':1 / 1000,
        }

metadict_detail['|=Тюк пеньки (килограмм)'] = {
        '|=Тюк пеньки (кубометр)':6 / 1000,
        '|==Сырьё промышленное (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленного сырья (тонн)':1 / 1000,
        }

metadict_detail['|=Тюк джута-сырца (килограмм)'] = {
        '|=Тюк джута-сырца (кубометр)':6 / 1000,
        '|==Сырьё промышленное (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленного сырья (тонн)':1 / 1000,
        }

metadict_detail['|=Тюк льна-сырца (килограмм)'] = {
        '|=Тюк льна-сырца (кубометр)':6 / 1000,
        '|==Сырьё промышленное (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленного сырья (тонн)':1 / 1000,
        }

metadict_detail['|=Тюк хлопка-сырца (килограмм)'] = {
        '|=Тюк хлопка-сырца (кубометр)':6 / 1000,
        '|==Сырьё промышленное (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленного сырья (тонн)':1 / 1000,
        }

metadict_detail['|=Тюк хлопчатой ваты (килограмм)'] = {
        '|=Тюк хлопчатой ваты (кубометр)':10 / 1000,
        '|==Сырьё промышленное (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Тюк джутовой пряжи (килограмм)'] = {
        '|=Тюк джутовой пряжи (кубометр)':10 / 1000,
        '|==Сырьё промышленное (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Тюк льняной пряжи (килограмм)'] = {
        '|=Тюк льняной пряжи (кубометр)':10 / 1000,
        '|==Сырьё промышленное (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Тюк пеньковой пряжи (килограмм)'] = {
        '|=Тюк пеньковой пряжи (кубометр)':10 / 1000,
        '|==Сырьё промышленное (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Тюк хлопчатой пряжи (килограмм)'] = {
        '|=Тюк хлопчатой пряжи (кубометр)':10 / 1000,
        '|==Сырьё промышленное (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

#metadict_detail['|=Рулон глиносоломенного ковра (тонн)'] = {
#        '|=Рулон глиносоломенного ковра (кубометр)':2,
#        '|==Стройматериалы (тонн)':1,
#        'Доставка строительного сырья (тонн)':1,
#        }

metadict_detail['|=Рулон смоляной пакли (килограмм)'] = {
        '|=Рулон смоляной пакли (кубометр)':3.4 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон хлопчатого ковра (килограмм)'] = {
        '|=Рулон хлопчатого ковра (кубометр)':6 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон джутового ковра (килограмм)'] = {
        '|=Рулон джутового ковра (кубометр)':6 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон соломенного ковра (килограмм)'] = {
        '|=Рулон соломенного ковра (кубометр)':6 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка стройматериалов (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон соломенной ткани (килограмм)'] = {
        '|=Рулон соломенной ткани (кубометр)':6 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон толя (килограмм)'] = {
        '|=Рулон толя (кубометр)':2 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон обоев (килограмм)'] = {
        '|=Рулон обоев (кубометр)':4 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон бумаги (килограмм)'] = {
        '|=Рулон бумаги (кубометр)':4 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон бархата (килограмм)'] = {
        '|=Рулон бархата (кубометр)':4 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон брезента (килограмм)'] = {
        '|=Рулон брезента (кубометр)':2 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон бязи (килограмм)'] = {
        '|=Рулон бязи (кубометр)':4 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон джутовой ткани (килограмм)'] = {
        '|=Рулон джутовой ткани (кубометр)':2 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон замши (килограмм)'] = {
        '|=Рулон замши (кубометр)':4 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон кирзовой ткани (килограмм)'] = {
        '|=Рулон кирзовой ткани (кубометр)':2 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон льняной ткани (килограмм)'] = {
        '|=Рулон льняной ткани (кубометр)':4 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон парусины (килограмм)'] = {
        '|=Рулон парусины (кубометр)':4 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон сатина (килограмм)'] = {
        '|=Рулон сатина (кубометр)':4 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон мешковины (килограмм)'] = {
        '|=Рулон мешковины (кубометр)':4 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон вафельной ткани (килограмм)'] = {
        '|=Рулон вафельной ткани (кубометр)':4 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон махровой ткани (килограмм)'] = {
        '|=Рулон махровой ткани (кубометр)':4 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон фланели (килограмм)'] = {
        '|=Рулон фланели (кубометр)':4 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Катушка джутовой нити (килограмм)'] = {
        # TODO: учти катушки.
        '|=Катушка джутовой нити (кубометр)':4 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Катушка льняной нити (килограмм)'] = {
        '|=Катушка льняной нити (кубометр)':4 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Катушка пеньковой бечевы (килограмм)'] = {
        '|=Катушка пеньковой бечевы (кубометр)':4 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Катушка пеньковой нити (килограмм)'] = {
        '|=Катушка пеньковой нити (кубометр)':4 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Катушка хлопчатой нити (килограмм)'] = {
        '|=Катушка хлопчатой нити (кубометр)':4 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Рулон резины (килограмм)'] = {
        '|=Рулон резины (кубометр)':2 / 1000,
        '|==Промышленные товары (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Песок (тонн)'] = {
        '|=Песок (кубометр)':0.6,
        '|==Сырьё промышленное (тонн)':1,
        'Доставка строительного сырья (тонн)':1,
        }

metadict_detail['|=Щебень (тонн)'] = {
        '|=Щебень (кубометр)':0.55,
        '|==Сырьё промышленное (тонн)':1,
        'Доставка строительного сырья (тонн)':1,
        }

metadict_detail['|=Известняк (тонн)'] = {
        '|=Известняк (кубометр)':0.55,
        '|==Сырьё промышленное (тонн)':1,
        'Доставка строительного сырья (тонн)':1,
        }

metadict_detail['|=Гравий (тонн)'] = {
        '|=Гравий (кубометр)':1 / 1.6,
        '|==Сырьё промышленное (тонн)':1,
        'Доставка строительного сырья (тонн)':1,
        }

metadict_detail['|=Бутовый камень (тонн)'] = {
        '|=Бутовый камень (кубометр)':1 / 1.6,
        '|==Сырьё промышленное (тонн)':1,
        'Доставка строительного сырья (тонн)':1,
        }

metadict_detail['|=Смоляк (тонн)'] = {
        '|=Смоляк (кубометр)':2,
        '|==Сырьё промышленное (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка промышленного сырья (тонн)':1,
        }

metadict_detail['|=Литьё чугунное (килограмм)'] = {
        # TODO: Уточнить грузовой объём (прежде всего труб)
        '|=Литьё чугунное (кубометр)':1 / 1600,
        '|==Сырьё промышленное (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Литьё стальное (килограмм)'] = {
        '|=Литьё стальное (кубометр)':1 / 1600,
        '|==Сырьё промышленное (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }

metadict_detail['|=Прокат стальной (килограмм)'] = {
        '|=Прокат стальной (кубометр)':1 / 1600,
        '|==Сырьё промышленное (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (тонн)':1 / 1000,
        }
