#----
# Потребности (возрастные):

metadict_detail['-Младенцы'] = {
        # TODO:
            # Родильные дома, школы, больницы.
        'Основные потребности (пони)':1,
        }

metadict_detail['-Дети (1-6 лет)'] = {
        'Основные потребности (пони)':1,
        }

metadict_detail['-Школьники (7-10 лет)'] = {
        # Начальная школа, до получения метки.
        'Основные потребности (пони)':1,
        }

metadict_detail['-Школьники (11-13 лет)'] = {
        # Средняя школа, в ожидании метки.
        'Основные потребности (пони)':1,
        }

metadict_detail['-Подмастерья (14-20 лет)'] = {
        # Ученичество.
        'Основные потребности (пони)':1,
        }

metadict_detail['-Рабочие'] = {
        'Основные потребности (пони)':1,
        }

metadict_detail['-Старики'] = {
        'Основные потребности (пони)':1,
        }

#----
# Потребности (национальные):

metadict_detail['Североморские горожане бедняки'] = {
        'Североморский рацион (пони/год)':0.25,
        'Городской рацион (пони/год)':0.75,
        'Расход воды горожанами (пони/день)':360,
        'Североморское городское жильё (квадратный метр)':15,
        'Культурные потребности горожан (пони/день)':360 / 30,
        }

metadict_detail['Североморские горожане середняки'] = {
        'Североморский рацион (пони/год)':0.25,
        'Городской рацион (пони/год)':0.50,
        'Изысканный рацион (пони/год)':0.25,
        'Расход воды горожанами (пони/день)':360,
        'Частное городское жильё (квадратный метр)':30,
        'Культурные потребности горожан (пони/день)':360 / 6,
        }

metadict_detail['Североморские горожане богатеи'] = {
        'Североморский рацион (пони/год)':0.50,
        'Изысканный рацион (пони/год)':0.50,
        'Расход воды городскими богатеями (пони/день)':360,
        'Богатое городское жильё (квадратный метр)':60,
        'Культурные потребности богемы (пони/день)':360 / 3,
        }

metadict_detail['Североморские селяне бедняки'] = {
        'Североморские запасы (пони/год)':1,
        'Североморский рацион (пони/год)':1,
        'Расход воды селянами (пони/день)':360,
        'Североморское сельское жильё (квадратный метр)':15,
        'Культурные потребности селян (пони/день)':360 / 30,
        }

metadict_detail['Североморские селяне середняки'] = {
        'Североморские запасы (пони/год)':1,
        'Североморский рацион (пони/год)':0.75,
        'Изысканный рацион (пони/год)':0.25,
        'Расход воды селянами (пони/день)':360,
        'Частное сельское жильё (квадратный метр)':30,
        'Культурные потребности селян (пони/день)':360 / 6,
        }

metadict_detail['Североморские селяне богатеи'] = {
        'Североморские запасы (пони/год)':1,
        'Североморский рацион (пони/год)':0.50,
        'Изысканный рацион (пони/год)':0.50,
        'Расход воды сельскими богатеями (пони/день)':360,
        'Богатое сельское жильё (квадратный метр)':60,
        'Культурные потребности богемы (пони/день)':360 / 3,
        }

metadict_detail['Среднеземные горожане бедняки'] = {
        'Среднеземный рацион (пони/год)':0.25,
        'Городской рацион (пони/год)':0.75,
        'Расход воды горожанами (пони/день)':360,
        'Среднеземное городское жильё (квадратный метр)':15,
        'Культурные потребности горожан (пони/день)':360 / 30,
        }

metadict_detail['Среднеземные горожане середняки'] = {
        'Среднеземный рацион (пони/год)':0.25,
        'Городской рацион (пони/год)':0.50,
        'Изысканный рацион (пони/год)':0.25,
        'Расход воды горожанами (пони/день)':360,
        'Частное городское жильё (квадратный метр)':30,
        'Культурные потребности горожан (пони/день)':360 / 6,
        }

metadict_detail['Среднеземные горожане богатеи'] = {
        'Среднеземный рацион (пони/год)':0.50,
        'Изысканный рацион (пони/год)':0.50,
        'Расход воды городскими богатеями (пони/день)':360,
        'Богатое городское жильё (квадратный метр)':60,
        'Культурные потребности богемы (пони/день)':360 / 3,
        }

metadict_detail['Среднеземные селяне бедняки'] = {
        'Среднеземные запасы (пони/год)':1,
        'Среднеземный рацион (пони/год)':1,
        'Расход воды селянами (пони/день)':360,
        'Среднеземное сельское жильё (квадратный метр)':15,
        'Культурные потребности селян (пони/день)':360 / 30,
        }

metadict_detail['Среднеземные селяне середняки'] = {
        'Среднеземные запасы (пони/год)':1,
        'Среднеземный рацион (пони/год)':0.75,
        'Изысканный рацион (пони/год)':0.25,
        'Расход воды селянами (пони/день)':360,
        'Частное сельское жильё (квадратный метр)':30,
        'Культурные потребности селян (пони/день)':360 / 6,
        }

metadict_detail['Среднеземные селяне богатеи'] = {
        'Среднеземные запасы (пони/год)':1,
        'Среднеземный рацион (пони/год)':0.50,
        'Изысканный рацион (пони/год)':0.50,
        'Расход воды сельскими богатеями (пони/день)':360,
        'Богатое сельское жильё (квадратный метр)':60,
        'Культурные потребности богемы (пони/день)':360 / 3,
        }

metadict_detail['Южноморские горожане бедняки'] = {
        'Южноморский рацион (пони/год)':0.25,
        'Городской рацион (пони/год)':0.75,
        'Расход воды горожанами (пони/день)':360,
        'Южноморское городское жильё (квадратный метр)':15,
        'Культурные потребности горожан (пони/день)':360 / 30,
        }

metadict_detail['Южноморские горожане середняки'] = {
        'Южноморский рацион (пони/год)':0.25,
        'Городской рацион (пони/год)':0.50,
        'Изысканный рацион (пони/год)':0.25,
        'Расход воды горожанами (пони/день)':360,
        'Частное городское жильё (квадратный метр)':30,
        'Культурные потребности горожан (пони/день)':360 / 6,
        }

metadict_detail['Южноморские горожане богатеи'] = {
        'Южноморский рацион (пони/год)':0.50,
        'Изысканный рацион (пони/год)':0.50,
        'Расход воды городскими богатеями (пони/день)':360,
        'Богатое городское жильё (квадратный метр)':60,
        'Культурные потребности богемы (пони/день)':360 / 3,
        }

metadict_detail['Южноморские селяне бедняки'] = {
        'Южноморские запасы (пони/год)':1,
        'Южноморский рацион (пони/год)':1,
        'Расход воды селянами (пони/день)':360,
        'Южноморское сельское жильё (квадратный метр)':15,
        'Культурные потребности селян (пони/день)':360 / 30,
        }

metadict_detail['Южноморские селяне середняки'] = {
        'Южноморские запасы (пони/год)':1,
        'Южноморский рацион (пони/год)':0.75,
        'Изысканный рацион (пони/год)':0.25,
        'Расход воды селянами (пони/день)':360,
        'Частное сельское жильё (квадратный метр)':30,
        'Культурные потребности селян (пони/день)':360 / 6,
        }

metadict_detail['Южноморские селяне богатеи'] = {
        'Южноморские запасы (пони/год)':1,
        'Южноморский рацион (пони/год)':0.50,
        'Изысканный рацион (пони/год)':0.50,
        'Расход воды сельскими богатеями (пони/день)':360,
        'Богатое сельское жильё (квадратный метр)':60,
        'Культурные потребности богемы (пони/день)':360 / 3,
        }

#----
# Потребности (хозяйственная вода):

metadict_detail['Расход воды городскими богатеями (пони/день)'] = {
        'Вода для ванны (литр)':150,
        'Вода для смыва (литр)':10 * 3,
        'Вода для умывания (литр)':3 * 3,
        'Вода для мытья копыт (литр)':3 * 6,
        'Вода для уборки (литр)':60 / 6,
        'Вода для мытья вещей (литр)':(12 * 3) / 6,
        '-Городское водоснабжение (литр)':250,
        }

metadict_detail['Расход воды горожанами (пони/день)'] = {
        # TODO:
            # Не во всех городах есть водопровод.
            # Может, выделить жителей мегаполисов?
        'Вода для душа (литр)':25,
        'Вода для бани (литр)':25 / 6,
        'Вода для смыва (литр)':10 * 3,
        'Вода для умывания (литр)':3 * 3,
        'Вода для мытья копыт (литр)':3 * 6,
        'Вода для уборки (литр)':30 / 6,
        'Вода для мытья вещей (литр)':(12 * 3) / 30,
        '-Городское водоснабжение (литр)':120,
        }

metadict_detail['Расход воды сельскими богатеями (пони/день)'] = {
        'Вода для душа (литр)':25,
        'Вода для бани (литр)':25 / 6,
        'Вода для смыва (литр)':10 * 3,
        'Вода для умывания (литр)':3 * 3,
        'Вода для мытья копыт (литр)':3 * 6,
        'Вода для уборки (литр)':30 / 6,
        'Вода для мытья вещей (литр)':(12 * 3) / 30,
        '-Сельское водоснабжение (литр)':120,
        }

metadict_detail['Расход воды селянами (пони/день)'] = {
        'Вода для бани (литр)':25 / 6,
        'Вода для умывания (литр)':3,
        'Вода для мытья копыт (литр)':1 * 3,
        'Вода для уборки (литр)':15 / 6,
        'Вода для мытья вещей (литр)':(12 * 3) / 30,
        '-Сельское водоснабжение (литр)':30,
        }

#----
# Потребности (жильё):

metadict_detail['Богатое городское жильё (квадратный метр)'] = {
        # TODO:
            # И опять всё одинаково, особняков пока что нет.
        'Городское жильё (квадратный метр)':1,
        }

metadict_detail['Богатое сельское жильё (квадратный метр)'] = {
        'Сельское жильё (квадратный метр)':1,
        }

metadict_detail['Североморское городское жильё (квадратный метр)'] = {
        # TODO:
            # Городские дома в основном деревянные/глиносоломенные.
            # Потому что и города в основном маленькие.
        'Городское жильё (квадратный метр)':1,
        }

metadict_detail['Североморское сельское жильё (квадратный метр)'] = {
        'Сельское жильё (квадратный метр)':1,
        }

metadict_detail['Среднеземное городское жильё (квадратный метр)'] = {
        'Городское жильё (квадратный метр)':1,
        }

metadict_detail['Среднеземное сельское жильё (квадратный метр)'] = {
        'Сельское жильё (квадратный метр)':1,
        }

metadict_detail['Частное городское жильё (квадратный метр)'] = {
        'Городское жильё (квадратный метр)':1,
        }

metadict_detail['Частное сельское жильё (квадратный метр)'] = {
        'Сельское жильё (квадратный метр)':1,
        }

metadict_detail['Южноморское городское жильё (квадратный метр)'] = {
        'Городское жильё (квадратный метр)':1,
        }

metadict_detail['Южноморское сельское жильё (квадратный метр)'] = {
        'Сельское жильё (квадратный метр)':1,
        }

#----
# Потребности (основные):

metadict_detail['Основные потребности (пони)'] = {
        'Потребность в дорогах (метр)':20,
        }

#----
# Потребности (прочие):
    # Печатное дело в России на 1897 год (129 млн. человек, 66 000 чел/типографию)
    # Печатное дело в Германии на 1890 год (50 млн. человек, 7650 чел/типографию, 5-6 рабочих/типографию)
    # - 1885 год, общий тираж книг: ??? названий, 18.77 млн.
    # - 1893 год, общий тираж книг: 7783 названий, 27.2 млн. экземпляров (средний тираж -- 3500)
    # - 1901 год, общий тираж книг: ??? названий, 56.3 млн. экземпляров
    # - 1913 год, общий тираж книг: 30 100 названий, 98.2 млн. экземпляров (средний тираж -- 3300)**
    # Книги, печать и периодика в Российской империи
    # http://www.protown.ru/information/hide/6631.html
    # https://ru.wikisource.org/wiki/ЭСБЕ/Печать
    # https://ru.wikisource.org/wiki/ЭСБЕ/Газеты
    # https://ru.wikisource.org/wiki/ЭСБЕ/Типографское_дело

metadict_detail['Культурные потребности горожан (пони/день)'] = {
        # TODO:
            # Допилить
            # Помни о распределении. Это число дней в году, которые тратятся на развлечения.
            # А ниже, например, 0.1 -- театр, 0.2 -- книги, это процент времени дней отдыха.
        # TODO:
            # Книги, газеты, театр, путешествия.
            # Сделай распределение книг по содержанию.
        # TODO: только в 50+ тысячных мегаполисах развита культурная жизнь.
            # А у нас остальные 50% горожан во всяких Понивилях. Им приходится ездить в свои кантерлоты.
        }

metadict_detail['Культурные потребности селян (пони/день)'] = {
        }

metadict_detail['Культурные потребности богемы (пони/день)'] = {
        }

#----
# Запасы еды, перепроизводство и внешняя торговля:

metadict_detail['Североморские запасы (пони/год)'] = {
        'Североморские запасы еды (пони/день)':360,
        }

metadict_detail['Среднеземные запасы (пони/год)'] = {
        'Среднеземные запасы еды (пони/день)':360,
        }

metadict_detail['Южноморские запасы (пони/год)'] = {
        'Южноморские запасы еды (пони/день)':360,
        }

metadict_detail['Североморские запасы еды (пони/день)'] = {
        # TODO:
            # Меню изменилось. Перепилить
        'Чечевица сухая (грамм)':50,
        'Зерно овса (грамм)':100,
        'Зерно ячменя (грамм)':100,
        'Зерно пшеницы (грамм)':100,
        'Зерно ржи (грамм)':200,
        'Семена подсолнечника (грамм)':50,
        'Семена льна (грамм)':25,
        }

metadict_detail['Среднеземные запасы еды (пони/день)'] = {
        'Бобы арахиса в шелухе (грамм)':100,
        'Сухофрукты среднеземные (грамм)':50,
        'Чечевица сухая (грамм)':50,
        'Фасоль сухая (грамм)':50,
        'Зерно овса (грамм)':100,
        'Зерно пшеницы (грамм)':200,
        'Зерно кукурузы (грамм)':400,
        'Зерно риса посевного (грамм)':50,
        'Семена подсолнечника (грамм)':50,
        'Масло оливковое (грамм)':50,
        }

metadict_detail['Южноморские запасы еды (пони/день)'] = {
        # TODO:
            # Меню изменилось. Перепилить
        'Морская капуста сушёная (грамм)':10,
        'Бобы арахиса в шелухе (грамм)':25,
        'Соя сухая шлифованная (грамм)':50,
        'Сухофрукты среднеземные (грамм)':25,
        'Чечевица сухая (грамм)':50,
        'Фасоль сухая (грамм)':25,
        'Зерно пшеницы (грамм)':150,
        'Зерно кукурузы (грамм)':100,
        'Зерно риса посевного (грамм)':200,
        'Семена подсолнечника (грамм)':50,
        'Семена кунжута (грамм)':50,
        'Масло оливковое (грамм)':25,
        }

#----

metadict_detail['Снабжение для Белой гавани (зебры/год)'] = {
        # TODO:
            # Расчёты готовы, можно убрать
        # Для полумиллиона полосатых.
        'Посевы для Белой гавани (зебры/год)':500000,
        }

metadict_detail['Посевы для Белой гавани (зебры/год)'] = {
        'Урожай с полей восточной колонии (зебры/день)':360,
        }

metadict_detail['Урожай с полей восточной колонии (зебры/день)'] = {
        'Бобы арахиса в шелухе (грамм)':150,
        'Зерно пшеницы (грамм)':100,
        'Зерно кукурузы (грамм)':250,
        }
