#----
# Инструменты (понячьи аналоги):

metadict_detail['Использование автопогрузчика 5 тонн (часов)'] = {
        '_-Работа грузчика (нормо-часов)':3,
        }

metadict_detail['Использование башенного крана на 8 тонн (часов)'] = {
        'Использование 8-тонного башенного крана (часов)':1,
        }

metadict_detail['Использование бетоносмесителя передвижного 250 литров (часов)'] = {
        # Никакой автоматизации, копытная тяга.
        '_-Работа разнорабочего (нормо-часов)':1,
        'Использование 300-литрового чана для бетона (часов)':1.25,
        'Использование грузовой телеги (часов)':1.25,
        }

metadict_detail['Использование бортового автомобиля до 5 тонн (часов)'] = {
        '_-Работа пегаса с телегой (часов)':5,
        'Использование грузовой телеги (часов)':5,
        }

metadict_detail['Использование бульдозера 79 кВт (часов)'] = {
        '_-Работа землекопа (нормо-часов)':10,
        'Использование упряжного грейдера (часов)':10,
        }

metadict_detail['Использование автогрейдера среднего типа 99 кВт (часов)'] = {
        '_-Работа землекопа (нормо-часов)':10,
        'Использование упряжного грейдера (часов)':10,
        }

metadict_detail['Использование катка дорожного самоходного гладкого 13 тонн (часов)'] = {
        'Использование 8-тонного 60-кВт механического катка (часов)':2,
        }

metadict_detail['Использование катка дорожного самоходного гладкого 8 тонн (часов)'] = {
        'Использование 8-тонного 60-кВт механического катка (часов)':1,
        }

metadict_detail['Использование машины поливомоечной 6000 литров (часов)'] = {
        '_-Работа пегаса-разнорабочего (нормо-часов)':1,
        }

metadict_detail['Использование 30-кВт копателя шахтных колодцев (часов)'] = {
        'Использование 30-кВт механического копателя (часов)':1,
        }

metadict_detail['Использование вагона широкой колеи 20 тонн (часов)'] = {
        'Использование 20-тонного вагона (часов)':1,
        }

metadict_detail['Использование вибратора глубинного (часов)'] = {
        # Исправить
            # Рогатый чистит бетон от пузырьков.
            # Переведи в энергию заклинаний.
        '_-Работа единорога-волшебника (нормо-часов)':1,
        }

metadict_detail['Использование глиномешалки 4 кубометра (часов)'] = {
        # Исправить
            # Вообще-то к строительству доставляют уже мятую глину
            # Исправь или там, или здесь
        'Использование 0.5-кубометра/час механической глиномялки (часов)':8,
        '_-Работа пегаса-разнорабочего (нормо-часов)':8,
        }

metadict_detail['Использование горелки газопламенной (часов)'] = {
        # Исправить
            # Уточнить мощность горелки, считать через мощность.
            # Переведи в энергию заклинаний
        '_-Работа единорога-волшебника (нормо-часов)':1,
        }

metadict_detail['Использование установки для сварки дуговой (часов)'] = {
        # Исправить
            # Переведи в энергию заклинаний
        '_-Работа единорога-волшебника (нормо-часов)':1,
        }

metadict_detail['Использование дисковой электрической пилы (часов)'] = {
        'Использование топора для обработки древесины (часов)':4,
        '_-Работа разнорабочего (нормо-часов)':4,
        }

metadict_detail['Использование трубоукладчика для труб диаметром до 400 мм (часов)'] = {
        '_-Работа пегаса-разнорабочего (нормо-часов)':10,
        'Использование грузовой телеги (часов)':10,
        }

metadict_detail['Использование дозировщика тракторного (часов)'] = {
        '_-Работа пегаса-разнорабочего (нормо-часов)':10,
        'Использование грузовой телеги (часов)':10,
        }

metadict_detail['Использование распределителя каменной мелочи (часов)'] = {
        '_-Работа пегаса-разнорабочего (нормо-часов)':5,
        'Использование грузовой телеги (часов)':5,
        }

metadict_detail['Использование рыхлителя прицепного (часов)'] = {
        '_-Работа разнорабочего (нормо-часов)':5,
        'Использование 0.4-кВт пневматического отбойного молотка (часов)':1 * 5,
        'Использование 5-кубометров/минуту 700 кПа компрессора (часов)':0.333 * 5,
        }

metadict_detail['Использование домкрата гидравлического 25 тонн (часов)'] = {
        # https://en.wikipedia.org/wiki/Jack_(device)
        'Использование 10-тонного винтового домкрата (часов)':2,
        '_-Работа разнорабочего (нормо-часов)':2,
        }

metadict_detail['Использование дрели электрической (часов)'] = {
        'Использование коловорота (часов)':4,
        '_-Работа разнорабочего (нормо-часов)':4,
        }

metadict_detail['Использование шуруповёрта (часов)'] = {
        'Использование коловорота (часов)':4,
        '_-Работа разнорабочего (нормо-часов)':4,
        }

metadict_detail['Использование ключа путевого универсального (часов)'] = {
        'Использование гаечного ключа (часов)':4,
        '_-Работа разнорабочего (нормо-часов)':4,
        }

metadict_detail['Использование компрессора 686 кПа на 2.2 кубометров/минуту (часов)'] = {
        # Исправить
            # Эй, пони совершенно не нуждаются в компрессорах!
            # Левитация же, чем не компрессор?
            # Ага, но уравнение состояния идеального газа никто не отменяет.
                # 7 атмосфер = 1800 °C = 1.7 МДж/кубометр воздуха. Но это чистый разогрев.
                # Компрессор тратит всего: 30*60/2.2=818 кДж/куб (0.8 МДж/кубометр)
        # Компрессоры есть, пневматику пони любят и ценят.
        'Использование 5-кубометров/минуту 700 кПа компрессора (часов)':0.5,
        }

metadict_detail['Использование компрессора 686 кПа на 5 кубометров/минуту (часов)'] = {
        # Винтовой компрессор ЗИФ СВЭ 5/0,7
        # https://www.v-p-k.ru/vintovye-kompressory-zif-sve/zif_svje_5_0_7_bez_kozhuha/
        'Использование 5-кубометров/минуту 700 кПа компрессора (часов)':1,
        }

metadict_detail['Использование копры универсальной с дизель-молотом 2.5 тонн (часов)'] = {
        # Так-то кран с грузом легко выполняет задачи дизель-молота. Но мобильность так себе.
        # https://en.wikipedia.org/wiki/Pile_driver
        'Использование 8-тонного башенного крана (часов)':4,
        '_-Работа разнорабочего (нормо-часов)':4,
        }

metadict_detail['Использование костылезабивщика (часов)'] = {
        # https://upload.wikimedia.org/wikipedia/commons/6/6e/Скрепление_костылями_f02.jpg
        'Использование кувалды для забивки костылей (часов)':4,
        '_-Работа разнорабочего (нормо-часов)':4,
        }

metadict_detail['Использование крана на автомобильном ходу 10 тонн (часов)'] = {
        # Нет у понек автомобилей, приходится каждый раз краны собирать.
        'Использование 8-тонного башенного крана (часов)':2,
        '_-Работа разнорабочего (нормо-часов)':2,
        }

metadict_detail['Использование крана на железнодорожном ходу 16 тонн (часов)'] = {
        'Использование 8-тонного башенного крана (часов)':2,
        'Использование 30-тонной платформы (часов)':2,
        }

metadict_detail['Использование лебёдки электрической на 1.25 тонн (часов)'] = {
        # ТЛ-9А-1
        # http://invest-stroika.ru/kran/lebedki/lebedki-elektricheskie/lebedki-montajniie
        'Использование 0.5-тонной лебёдки (часов)':4,
        '_-Работа разнорабочего (нормо-часов)':4,
        }

metadict_detail['Использование машины для подбивки шпал (часов)'] = {
        # Исправить
            # Уточнить эффективность шпалоподбойной машины
        'Использование 0.4-кВт пневматической шпалоподбойки (часов)':1 * 10,
        'Использование 5-кубометров/минуту 700 кПа компрессора (часов)':0.333 * 10,
        }

metadict_detail['Использование путерихтовочной машины (часов)'] = {
        'Использование 10-тонного винтового домкрата (часов)':2 * 5,
        '_-Работа разнорабочего (нормо-часов)':2 * 5,
        }

metadict_detail['Использование передвижного битумного котла на 400 литров (часов)'] = {
        'Использование 300-литрового чана для варки битума (часов)':1.5,
        'Использование грузовой телеги (часов)':1.5,
        '_-Работа пегаса-разнорабочего (нормо-часов)':1.5,
        }

metadict_detail['Использование пилы с карбюраторным двигателем (часов)'] = {
        # http://www.glav-dacha.ru/obzor-benzopil-marki-druzhba/
        'Использование 2-кВт цепной механической пилы (часов)':1,
        '_-Работа пегаса-разнорабочего (нормо-часов)':1,
        }

metadict_detail['Использование пилы цепной электрической (часов)'] = {
        'Использование 2-кВт цепной механической пилы (часов)':1,
        '_-Работа пегаса-разнорабочего (нормо-часов)':1,
        }

metadict_detail['Использование платформы с роликовым транспортёром (часов)'] = {
        'Использование роликового транспортёра (часов)':1,
        'Использование 30-тонной платформы (часов)':1,
        }

metadict_detail['Использование платформы широкой колеи 71 тонн (часов)'] = {
        'Использование 30-тонной платформы (часов)':3,
        }

metadict_detail['Использование погрузчика одноковшёвого на 3 тонны (часов)'] = {
        # Исправить
            # Уточнить
        '_-Работа землекопа (нормо-часов)':10,
        }

metadict_detail['Использование подъёмника одномачтового 500 кг (часов)'] = {
        'Использование 0.5-тонного механического подъёмника (часов)':4,
        '_-Работа разнорабочего (нормо-часов)':4,
        }

metadict_detail['Использование путеподъёмника самоходного (часов)'] = {
        # Исправить
            # Уточнить
        'Использование 10-тонного винтового домкрата (часов)':2 * 5,
        '_-Работа разнорабочего (нормо-часов)':2 * 5,
        }

metadict_detail['Использование разгонщика гидравлического (часов)'] = {
        # https://ru.wikipedia.org/wiki/Гидравлический_разгонщик
        'Использование 10-тонного винтового домкрата (часов)':2,
        '_-Работа разнорабочего (нормо-часов)':2,
        }

metadict_detail['Использование растворонасоса 3 кубометра/час (часов)'] = {
        # Нужная штука, но у понек нет. По крайней мере в достаточном количестве.
        'Использование грузовой тележки (часов)':4,
        '_-Работа разнорабочего (нормо-часов)':4,
        }

metadict_detail['Использование растворосмесителя передвижного 250 литров (часов)'] = {
        '_-Работа пегаса-разнорабочего (нормо-часов)':1,
        'Использование 300-литрового чана для раствора (часов)':1.25,
        'Использование грузовой телеги (часов)':1.25,
        }

metadict_detail['Использование рихтовщика гидравлического (часов)'] = {
        'Использование 10-тонного винтового домкрата (часов)':2,
        '_-Работа разнорабочего (нормо-часов)':2,
        }

metadict_detail['Использование рубанка электрического (часов)'] = {
        'Использование рубанка (часов)':2,
        '_-Работа разнорабочего (нормо-часов)':2,
        }

metadict_detail['Использование станка рельсорезного (часов)'] = {
        # Исправить
            # Меняй на ножовки и дрели.
            # Эти задачи выполняют единорожки со своей левитацией и свёрлами.
        # https://ru.wikipedia.org/wiki/Рельсорезный_станок
        'Использование 1.5-кВт металлорежущего станка (часов)':2,
        }

metadict_detail['Использование станка рельсосверлильного (часов)'] = {
        'Использование 1.5-кВт сверлильного станка (часов)':2,
        }

metadict_detail['Использование сверлошлифовалки (часов)'] = {
        # Сверлошлифовалка СШ1 для сверления шпал и шлифовки рельсов. Мощность: 0.5 кВт
        # http://www.zaoportal.ru/product/view/115
        'Использование коловорота (часов)':2,
        '_-Работа разнорабочего (нормо-часов)':2,
        }

metadict_detail['Использование тепловоза маневрового 552 кВт (часов)'] = {
        'Использование 400-кВт маневрового локомотива (часов)':552/400,
        }

metadict_detail['Использование тепловоза маневрового 883 кВт (часов)'] = {
        'Использование 400-кВт маневрового локомотива (часов)':883/400,
        }

metadict_detail['Использование трактора на гусеничном ходу 59 кВт (часов)'] = {
        # Исправить
            # Прбблема в том, что у пегасов хоть и есть мощность, но нет сцепеления.
        '_-Работа пегаса-разнорабочего (нормо-часов)':2,
        }

metadict_detail['Использование трамбовки на базе трактора Т-130.1.Г (часов)'] = {
        # Исправить
            # Пони используют бульдозеры, как упряжные, так и здоровенные на маховиках.
            # Да, очень много сил уходит на трамбовку с простой пневматикой. Катки нужны.
        'Использование 0.3-кВт пневматической трамбовки (часов)':1 * 20,
        'Использование 5-кубометров/минуту 700 кПа компрессора (часов)':0.25 * 20,
        '_-Работа разнорабочего (нормо-часов)':20,
        }

metadict_detail['Использование виброплиты с двигателем внутреннго сгорания (часов)'] = {
        # Виброплита мощностью 2-4 кВт.
        'Использование 0.3-кВт пневматической трамбовки (часов)':1 * 5,
        'Использование 5-кубометров/минуту 700 кПа компрессора (часов)':0.25 * 5,
        }

metadict_detail['Использование трамбовки пневматической от компрессора (часов)'] = {
        'Использование 0.3-кВт пневматической трамбовки (часов)':1,
        'Использование 5-кубометров/минуту 700 кПа компрессора (часов)':0.25,
        }

metadict_detail['Использование электрошпалоподбойки (часов)'] = {
        'Использование 0.4-кВт пневматической шпалоподбойки (часов)':1,
        'Использование 5-кубометров/минуту 700 кПа компрессора (часов)':0.333,
        }

metadict_detail['Использование электростанции передвижной 4 кВт (часов)'] = {
        # Исправить
            # Не забывай про источники энергии
        }

metadict_detail['Использование установки для гидравлических испытаний трубопрводов (часов)'] = {
        # http://technomash.ltd/product/36562
        # http://www.mashprom.ru/competentions/ecology/_aview_b83/
        'Использование 90-кВт насоса высокого давления (часов)':1,
        }
