#----
# Городской рацион:
    # Жизненный уровень рабочих России (конец XIX - начало XX в.)
    # http://istmat.info/node/52

metadict_detail['Городской рацион (пони/год)'] = {
        'Городской весенний рацион (пони/день)':90,
        'Городской летний рацион (пони/день)':90,
        'Городской осенний рацион (пони/день)':90,
        'Городской зимний рацион (пони/день)':90,
        }

#----
# Городской рацион (времена года):

metadict_detail['Городской весенний рацион (пони/день)'] = {
        # В эквестрийской неделе -- 6 дней
        'Городской весенний повседневный рацион (пони/день)':5 / 6,
        'Городской весенний праздничный рацион (пони/день)':1 / 6,
        }

metadict_detail['Городской летний рацион (пони/день)'] = {
        'Городской летний повседневный рацион (пони/день)':5 / 6,
        'Городской летний праздничный рацион (пони/день)':1 / 6,
        }

metadict_detail['Городской зимний рацион (пони/день)'] = {
        'Городской зимний повседневный рацион (пони/день)':5 / 6,
        'Городской зимний праздничный рацион (пони/день)':1 / 6,
        }

metadict_detail['Городской осенний рацион (пони/день)'] = {
        'Городской осенний повседневный рацион (пони/день)':5 / 6,
        'Городской осенний праздничный рацион (пони/день)':1 / 6,
        }

#----
# Городской рацион (дни недели):

metadict_detail['Городской весенний повседневный рацион (пони/день)'] = {
        'Городской весенний повседневный завтрак':1,
        'Городской весенний повседневный обед':1,
        'Городской весенний повседневный ужин':1,
        'Городское весеннее повседневное питьё v1':3 / 3,
        'Городское весеннее повседневное питьё v2':3 / 3,
        'Городское весеннее повседневное питьё v3':3 / 3,
        }

metadict_detail['Городской весенний праздничный рацион (пони/день)'] = {
        'Городской весенний праздничный завтрак':1,
        'Городской весенний праздничный обед':1,
        'Городской весенний праздничный ужин':1,
        'Городское весеннее праздничное питьё v1':3 / 3,
        'Городское весеннее праздничное питьё v2':3 / 3,
        'Городское весеннее праздничное питьё v3':3 / 3,
        }

metadict_detail['Городской зимний повседневный рацион (пони/день)'] = {
        'Городской зимний повседневный завтрак':1,
        'Городской зимний повседневный обед':1,
        'Городской зимний повседневный ужин':1,
        'Городское зимнее повседневное питьё v1':3 / 3,
        'Городское зимнее повседневное питьё v2':3 / 3,
        'Городское зимнее повседневное питьё v3':3 / 3,
        }

metadict_detail['Городской зимний праздничный рацион (пони/день)'] = {
        'Городской зимний праздничный завтрак':1,
        'Городской зимний праздничный обед':1,
        'Городской зимний праздничный ужин':1,
        'Городское зимнее праздничное питьё v1':3 / 3,
        'Городское зимнее праздничное питьё v2':3 / 3,
        'Городское зимнее праздничное питьё v3':3 / 3,
        }

metadict_detail['Городской летний повседневный рацион (пони/день)'] = {
        'Городской летний повседневный завтрак':1,
        'Городской летний повседневный обед':1,
        'Городской летний повседневный ужин':1,
        'Городское летнее повседневное питьё v1':3 / 3,
        'Городское летнее повседневное питьё v2':3 / 3,
        'Городское летнее повседневное питьё v3':3 / 3,
        }

metadict_detail['Городской летний праздничный рацион (пони/день)'] = {
        'Городской летний праздничный завтрак':1,
        'Городской летний праздничный обед':1,
        'Городской летний праздничный ужин':1,
        'Городское летнее праздничное питьё v1':3 / 3,
        'Городское летнее праздничное питьё v2':3 / 3,
        'Городское летнее праздничное питьё v3':3 / 3,
        }

metadict_detail['Городской осенний повседневный рацион (пони/день)'] = {
        'Городской осенний повседневный завтрак':1,
        'Городской осенний повседневный обед':1,
        'Городской осенний повседневный ужин':1,
        'Городское осеннее повседневное питьё v1':3 / 3,
        'Городское осеннее повседневное питьё v2':3 / 3,
        'Городское осеннее повседневное питьё v3':3 / 3,
        }

metadict_detail['Городской осенний праздничный рацион (пони/день)'] = {
        'Городской осенний праздничный завтрак':1,
        'Городской осенний праздничный обед':1,
        'Городской осенний праздничный ужин':1,
        'Городское осеннее праздничное питьё v1':3 / 3,
        'Городское осеннее праздничное питьё v2':3 / 3,
        'Городское осеннее праздничное питьё v3':3 / 3,
        }

#----
# Городской рацион (весна):
    # Март, апрель, май

metadict_detail['Городской весенний повседневный завтрак'] = {
        'Сэндвич с яблочным джемом (грамм)':50 * 2,
        'Рис тушёный с сельдереем и кукурузой (грамм)':250,
        'Картофель тушёный со спаржей (грамм)':250,
        '||Сэндвичи (50-грамм/порция)':2,
        '||Блюдо второе горячее (250-грамм/порция)':1 * 2,
        }

metadict_detail['Городской весенний повседневный обед'] = {
        'Хлеб пшеничный домашний (грамм)':50 * 2,
        'Суп фасолевый с рисом (грамм)':250,
        'Лапша с песто и шампиньонами (грамм)':250,
        'Шпинат обжаренный с чесноком (грамм)':125,
        'Салат из варёной спаржи со шпинатом (грамм)':125,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо первое горячее (250-грамм/порция)':1,
        '||Блюдо второе горячее (250-грамм/порция)':1,
        '||Блюдо второе горячее (125-грамм/порция)':1,
        '||Антреме холодное (125-грамм/порция)':1,
        }

metadict_detail['Городской весенний повседневный ужин'] = {
        'Брускетта с луком и оливками (грамм)':50 * 2,
        'Каша овсяная (грамм)':250,
        'Морковь тушёная с турнепсом и картофелем (грамм)':250,
        '||Сэндвичи (50-грамм/порция)':2,
        '||Блюдо второе горячее (250-грамм/порция)':1,
        '||Блюдо второе холодное (250-грамм/порция)':1,
        }

metadict_detail['Городское весеннее повседневное питьё v1'] = {
        'Чай чёрный (грамм)':250 * 2,
        'Булочки пшеничные с изюмом и арахисом (грамм)':50,
        '||Питьё горячее (250-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':1,
        }

metadict_detail['Городское весеннее повседневное питьё v2'] = {
        'Чай травяной с сахаром (грамм)':250 * 2,
        'Капкейки с сухофруктами (грамм)':50,
        '||Питьё горячее (250-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':1,
        }

metadict_detail['Городское весеннее повседневное питьё v3'] = {
        'Сидр яблочный (грамм)':250,
        '||Питьё холодное (250-грамм/порция)':1,
        }

metadict_detail['Городской весенний праздничный завтрак'] = {
        'Брускетта с консервированным лечо (грамм)':50 * 2,
        'Пюре из обжаренной фасоли (грамм)':250,
        'Лапша с песто и сморчками (грамм)':250,
        '||Сэндвичи (50-грамм/порция)':2,
        '||Блюдо второе горячее (250-грамм/порция)':1 * 2,
        }

metadict_detail['Городской весенний праздничный обед'] = {
        'Пицца с кабачком и шампиньонами (грамм)':50 * 2,
        'Суп-пюре из топинамбура с кремом кешью (грамм)':250,
        'Корень сельдерея тушёный с морковью (грамм)':250,
        'Лечо со сладким перцем консервированное (грамм)':250,
        '||Выпечка (50-грамм/порция)':2,
        '||Блюдо первое горячее (250-грамм/порция)':1,
        '||Блюдо второе горячее (250-грамм/порция)':1,
        '||Блюдо второе холодное (250-грамм/порция)':1,
        }

metadict_detail['Городской весенний праздничный ужин'] = {
        'Оладьи кукурузные с кленовым сиропом (грамм)':50 * 2,
        'Пюре картофельное (грамм)':250,
        'Одуванчики жареные во фритюре (грамм)':125,
        'Фрукты весенние импортные (грамм)':250,
        '||Выпечка жареная (50-грамм/порция)':2,
        '||Блюдо второе горячее (250-грамм/порция)':1,
        '||Блюдо второе горячее (125-грамм/порция)':1,
        '||Фрукты свежие (250-грамм/порция)':1,
        }

metadict_detail['Городское весеннее праздничное питьё v1'] = {
        'Чай травяной (грамм)':250 * 2,
        'Шоколад горький (грамм)':10 * 2,
        'Шоколад с изюмом (грамм)':10 * 2,
        '||Питьё горячее (250-грамм/порция)':2,
        '||Сладости (10-грамм/порция)':4,
        }

metadict_detail['Городское весеннее праздничное питьё v2'] = {
        'Компот из сухофруктов (грамм)':250 * 2,
        '||Питьё холодное (250-грамм/порция)':2,
        }

metadict_detail['Городское весеннее праздничное питьё v3'] = {
        'Вино белое сухое (грамм)':250,
        'Пончики с мёдом и корицей (грамм)':50,
        '||Питьё холодное (250-грамм/порция)':1,
        '||Выпечка (50-грамм/порция)':1,
        }

#----
# Городской рацион (лето):
    # Июнь, июль, август

metadict_detail['Городской летний повседневный завтрак'] = {
        'Сэндвич с арахисовой пастой (грамм)':50 * 2,
        'Рис тушёный с фасолью (грамм)':250,
        'Топинамбур печёный дольками (грамм)':250,
        '||Сэндвичи (50-грамм/порция)':2,
        '||Блюдо второе горячее (250-грамм/порция)':1 * 2,
        }

metadict_detail['Городской летний повседневный обед'] = {
        'Хлеб пшеничный домашний (грамм)':50 * 2,
        'Суп томатный с чечевицей (грамм)':250,
        'Лапша с кабачковым соусом (грамм)':250,
        'Салат из брокколи с огурцами (грамм)':250,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо первое горячее (250-грамм/порция)':1,
        '||Блюдо второе горячее (250-грамм/порция)':1,
        '||Блюдо второе холодное (250-грамм/порция)':1,
        }

metadict_detail['Городской летний повседневный ужин'] = {
        'Брускетта со свежими томатами (грамм)':50 * 2,
        'Каша пшённая (грамм)':250,
        'Фрукты летние среднеземные (грамм)':250,
        '||Сэндвичи (50-грамм/порция)':2,
        '||Блюдо второе горячее (250-грамм/порция)':1,
        '||Фрукты свежие (250-грамм/порция)':1,
        }

metadict_detail['Городское летнее повседневное питьё v1'] = {
        'Кофе с сахаром (грамм)':250 * 2,
        'Пирог закрытый черничный (грамм)':50,
        '||Питьё горячее (250-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':1,
        }

metadict_detail['Городское летнее повседневное питьё v2'] = {
        'Чай травяной с сахаром (грамм)':250 * 2,
        'Капкейки вишнёвые (грамм)':50,
        '||Питьё горячее (250-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':1,
        }

metadict_detail['Городское летнее повседневное питьё v3'] = {
        'Вино красное сухое (грамм)':250,
        '||Питьё холодное (250-грамм/порция)':1,
        }

metadict_detail['Городской летний праздничный завтрак'] = {
        # TODO:
            # Замени брускетту на что-нибудь, а то грибы к грибам.
        'Брускетта с консервированными шампиньонами (грамм)':50 * 2,
        'Рис тушёный с боровиками (грамм)':250,
        'Артишоки обжаренные (грамм)':250,
        '||Сэндвичи (50-грамм/порция)':2,
        '||Блюдо второе горячее (250-грамм/порция)':1 * 2,
        }

metadict_detail['Городской летний праздничный обед'] = {
        'Пицца с кабачком и шампиньонами (грамм)':50 * 2,
        'Суп-пюре из картофеля и лука-порея с гренками (грамм)':250,
        'Лапша с белыми грибами (грамм)':250,
        'Баклажан тушёный с томатами (грамм)':125,
        'Закуска из печёного перца в маринаде (грамм)':125,
        '||Выпечка (50-грамм/порция)':2,
        '||Блюдо первое горячее (250-грамм/порция)':1,
        '||Блюдо второе горячее (250-грамм/порция)':1,
        '||Блюдо второе холодное (125-грамм/порция)':1,
        '||Антреме холодное (125-грамм/порция)':1,
        }

metadict_detail['Городской летний праздничный ужин'] = {
        'Оладьи кукурузные с клюквенным сиропом (грамм)':50 * 2,
        'Пюре бататное (грамм)':250,
        'Брокколи обжаренная (грамм)':125,
        'Фрукты летние импортные (грамм)':250,
        '||Выпечка жареная (50-грамм/порция)':2,
        '||Блюдо второе горячее (250-грамм/порция)':1,
        '||Блюдо второе горячее (125-грамм/порция)':1,
        '||Фрукты свежие (250-грамм/порция)':1,
        }

metadict_detail['Городское летнее праздничное питьё v1'] = {
        'Чай травяной (грамм)':250 * 2,
        'Пирог открытый сливовый (грамм)':50 * 2,
        '||Питьё горячее (250-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':2,
        }

metadict_detail['Городское летнее праздничное питьё v2'] = {
        'Компот из свежего ревеня (грамм)':250 * 2,
        '||Питьё холодное (250-грамм/порция)':2,
        }

metadict_detail['Городское летнее праздничное питьё v3'] = {
        'Эль имбирный (грамм)':250,
        'Пончики с глазурью (грамм)':50,
        '||Питьё холодное (250-грамм/порция)':1,
        '||Выпечка (50-грамм/порция)':1,
        }


#----
# Городской рацион (осень):
    # Сентябрь, октябрь, ноябрь

metadict_detail['Городской осенний повседневный завтрак'] = {
        'Сэндвич с грушёвым джемом (грамм)':50 * 2,
        'Суп из сезонных овощей с фасолью (грамм)':250,
        'Картофель тушёный с горошком и пряностями (грамм)':250,
        '||Сэндвичи (50-грамм/порция)':2,
        '||Блюдо первое горячее (250-грамм/порция)':1,
        '||Блюдо второе горячее (250-грамм/порция)':1,
        }

metadict_detail['Городской осенний повседневный обед'] = {
        'Хлеб пшеничный домашний (грамм)':50 * 2,
        'Суп фасолево-кукурузный с пастернаком (грамм)':250,
        'Лапша с нутом в томатном соусе (грамм)':250,
        'Салат томатный со стручковой фасолью (грамм)':125,
        'Салат из варёной свёклы (грамм)':125,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо первое горячее (250-грамм/порция)':1,
        '||Блюдо второе горячее (250-грамм/порция)':1,
        '||Блюдо второе холодное (125-грамм/порция)':2,
        }

metadict_detail['Городской осенний повседневный ужин'] = {
        'Брускетта с печёным перцем и песто (грамм)':50 * 2,
        'Салат из печёной свёклы с черникой (грамм)':250,
        'Фрукты осенние среднеземные (грамм)':250,
        '||Сэндвичи (50-грамм/порция)':2,
        '||Блюдо второе горячее (250-грамм/порция)':1,
        '||Фрукты свежие (250-грамм/порция)':1,
        }

metadict_detail['Городское осеннее повседневное питьё v1'] = {
        'Чай чёрный (грамм)':250 * 2,
        'Шарлотка яблочная (грамм)':50,
        '||Питьё горячее (250-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':1,
        }

metadict_detail['Городское осеннее повседневное питьё v2'] = {
        'Чай травяной с мёдом (грамм)':250 * 2,
        'Капкейки тыквенные (грамм)':50,
        '||Питьё горячее (250-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':1,
        }

metadict_detail['Городское осеннее повседневное питьё v3'] = {
        'Сок яблочный (грамм)':250 * 2,
        'Пирог закрытый бататный (грамм)':50,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':1,
        }

metadict_detail['Городской осенний праздничный завтрак'] = {
        'Брускетта с баклажанным соусом (грамм)':50 * 2,
        'Рис тушёный с овощами (грамм)':250,
        'Рагу овощное с шампиньонами (грамм)':250,
        '||Сэндвичи (50-грамм/порция)':2,
        '||Блюдо второе горячее (250-грамм/порция)':1 * 2,
        }

metadict_detail['Городской осенний праздничный обед'] = {
        'Пицца с кабачком и шампиньонами (грамм)':50 * 2,
        'Суп-пюре из черешков сельдерея с гренками (грамм)':250,
        'Овощи запечённые в кабачковом соусе (грамм)':250,
        'Салат огуречно-томатный со сладким перцем (грамм)':250,
        '||Выпечка (50-грамм/порция)':2,
        '||Блюдо первое горячее (250-грамм/порция)':1,
        '||Блюдо второе горячее (250-грамм/порция)':1,
        '||Блюдо второе холодное (250-грамм/порция)':1,
        }

metadict_detail['Городской осенний праздничный ужин'] = {
        'Оладьи кукурузные с мёдом (грамм)':50 * 2,
        'Каштан печёный (грамм)':250,
        'Батат печёный в медовой глазури (грамм)':125,
        'Фрукты осенние импортные (грамм)':250,
        '||Выпечка жареная (50-грамм/порция)':2,
        '||Блюдо второе горячее (250-грамм/порция)':1,
        '||Блюдо второе горячее (125-грамм/порция)':1,
        '||Фрукты свежие (250-грамм/порция)':1,
        }

metadict_detail['Городское осеннее праздничное питьё v1'] = {
        'Чай травяной (грамм)':250 * 2,
        'Безе ванильное (грамм)':10 * 4,
        '||Питьё горячее (250-грамм/порция)':2,
        '||Сладости (10-грамм/порция)':4,
        }

metadict_detail['Городское осеннее праздничное питьё v2'] = {
        'Компот из свежей вишни (грамм)':250 * 2,
        '||Питьё холодное (250-грамм/порция)':2,
        }

metadict_detail['Городское осеннее праздничное питьё v3'] = {
        'Вино белое сухое (грамм)':250,
        'Пирог открытый лимонный (грамм)':50,
        '||Питьё холодное (250-грамм/порция)':1,
        '||Выпечка (50-грамм/порция)':1,
        }

#----
# Городской рацион (зима):
    # Декабрь, январь, февраль

metadict_detail['Городской зимний повседневный завтрак'] = {
        'Сэндвич с яблочным джемом (грамм)':50 * 2,
        'Рис тушёный с тыквой и кукурузой (грамм)':250,
        'Картофель тушёный с оливками и лимоном (грамм)':250,
        '||Сэндвичи (50-грамм/порция)':2,
        '||Блюдо второе горячее (250-грамм/порция)':1 * 2,
        }

metadict_detail['Городской зимний повседневный обед'] = {
        'Хлеб пшеничный домашний (грамм)':50 * 2,
        'Суп-пюре перловый (грамм)':250,
        'Лапша с лютеницей (грамм)':250,
        'Турнепс тушёный с капустой (грамм)':250,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо первое горячее (250-грамм/порция)':1,
        '||Блюдо второе горячее (250-грамм/порция)':1,
        '||Блюдо второе холодное (250-грамм/порция)':1,
        }

metadict_detail['Городской зимний повседневный ужин'] = {
        'Оладьи картофельные (грамм)':50 * 2,
        'Каша кукурузно-мучная (грамм)':250,
        'Тыква тушёная (грамм)':250,
        '||Выпечка (50-грамм/порция)':2,
        '||Блюдо второе горячее (250-грамм/порция)':1,
        '||Блюдо второе холодное (250-грамм/порция)':1,
        }

metadict_detail['Городское зимнее повседневное питьё v1'] = {
        'Чай чёрный с сахаром и лимоном (грамм)':250 * 2,
        'Печенье овсяное с изюмом (грамм)':50,
        '||Питьё горячее (250-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':1,
        }

metadict_detail['Городское зимнее повседневное питьё v2'] = {
        'Чай травяной с сахаром (грамм)':250 * 2,
        'Капкейки морковные (грамм)':50,
        '||Питьё горячее (250-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':1,
        }

metadict_detail['Городское зимнее повседневное питьё v3'] = {
        'Сидр грушевый (грамм)':250,
        'Пирог закрытый тыквенный (грамм)':50,
        '||Питьё холодное (250-грамм/порция)':1,
        '||Выпечка (50-грамм/порция)':1,
        }

metadict_detail['Городской зимний праздничный завтрак'] = {
        'Брускетта с солёными боровиками (грамм)':50 * 2,
        'Рис тушёный со свекольным кремом (грамм)':250,
        'Морковь печёная с розмарином (грамм)':250,
        '||Сэндвичи (50-грамм/порция)':2,
        '||Блюдо второе горячее (250-грамм/порция)':1 * 2,
        }

metadict_detail['Городской зимний праздничный обед'] = {
        'Пицца с кабачком и шампиньонами (грамм)':50 * 2,
        'Суп-пюре из картофеля и лука-порея с шампиньонами (грамм)':250,
        'Винегрет с маринованными каперсами (грамм)':250,
        'Запеканка бататная с курагой (грамм)':250,
        '||Выпечка (50-грамм/порция)':2,
        '||Блюдо первое горячее (250-грамм/порция)':1,
        '||Блюдо второе горячее (250-грамм/порция)':1,
        '||Блюдо второе холодное (250-грамм/порция)':1,
        }

metadict_detail['Городской зимний праздничный ужин'] = {
        'Оладьи кукурузные с яблочным сиропом (грамм)':50 * 2,
        'Пюре бататное (грамм)':250,
        'Капуста обжаренная в сухарях (грамм)':125,
        'Фрукты зимние импортные (грамм)':250,
        '||Выпечка жареная (50-грамм/порция)':2,
        '||Блюдо второе горячее (250-грамм/порция)':1,
        '||Блюдо второе горячее (125-грамм/порция)':1,
        '||Фрукты свежие (250-грамм/порция)':1,
        }

metadict_detail['Городское зимнее праздничное питьё v1'] = {
        'Чай травяной (грамм)':250 * 2,
        'Рулет с тыквой и пеканом (грамм)':50 * 2,
        '||Питьё горячее (250-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':2,
        }

metadict_detail['Городское зимнее праздничное питьё v2'] = {
        'Компот из сухофруктов (грамм)':250 * 2,
        '||Питьё холодное (250-грамм/порция)':2,
        }

metadict_detail['Городское зимнее праздничное питьё v3'] = {
        'Эль имбирный (грамм)':250,
        'Булочки пшеничные с мёдом и пеканом (грамм)':50,
        '||Питьё холодное (250-грамм/порция)':1,
        '||Выпечка (50-грамм/порция)':1,
        }
