#----
# Химический состав пищи:
    # https://en.wikipedia.org/wiki/Staple_food
    # http://foodb.ca/

#----
# Пища (штучные --> грамм):
    # https://1001retsept.ru/tablitsa-otnosheniya-vesa-i-objema-produktov.html

metadict_detail['Вишня отборная (штука)'] = {
        # Вишня Жуковская
        # http://profermu.com/sad/derevia/vishnia/sorta-v/sorta.html
        'Вишня отборная (грамм)':5,
        }

metadict_detail['Земляника отборная (штука)'] = {
        # Мелкоплодная
        # https://nashzeleniymir.ru/земляника
        'Земляника отборная (грамм)':10,
        }

metadict_detail['Яблоко мочёное (штука)'] = {
        # Анисовка -- мелкие плоды
        # http://www.uhlib.ru/domovodstvo/jablonja/p4.php#metkadoc4
        'Яблоко мочёное (грамм)':60,
        }

metadict_detail['Морковь чищеная (штука)'] = {
        # Сорт "Нандрин F1"
        'Морковь чищеная (грамм)':75,
        }

metadict_detail['Огурцы отборные (штука)'] = {
        'Огурцы отборные (грамм)':100,
        }

metadict_detail['Лук чищеный (луковица)'] = {
        # Краснодарский Г-35
        # http://www.udec.ru/ovoshhi/rep-luk-sorta.php
        'Лук чищеный (грамм)':75,
        }

metadict_detail['Чеснок чищеный (зубчик)'] = {
        'Чеснок чищеный (грамм)':6,
        }

metadict_detail['Чеснок чищеный (головка)'] = {
        'Чеснок чищеный (грамм)':60,
        }

metadict_detail['Орех мускатный (штука)'] = {
        'Орех мускатный (грамм)':2,
        }

metadict_detail['Семена кориандра (штука)'] = {
        'Семена кориандра (грамм)':1 / 125,
        }

metadict_detail['Семена кунжута (штука)'] = {
        'Семена кунжута (грамм)':1 / 250,
        }

metadict_detail['Кардамон сушёный (капсула)'] = {
        'Кардамон сушёный (грамм)':1 / 5,
        }

metadict_detail['Лавровый лист сушёный (штука)'] = {
        'Лавровый лист сушёный (грамм)':1 / 8,
        }

metadict_detail['Базилик сушёный (100 грамм)'] = {
        'Базилик сушёный (килограмм)':1 / 10,
        }

metadict_detail['Перец душистый сушёный (горошина)'] = {
        'Перец душистый сушёный (грамм)':1 / 17,
        }

metadict_detail['Перец чёрный сушёный (горошина)'] = {
        # 1000 зерен черного перца хорошего качества должны весить 460 гр
        'Перец чёрный сушёный (грамм)':1 / 2,
        }

metadict_detail['Гвоздика сушёная (бутон)'] = {
        'Гвоздика сушёная (грамм)':1 / 15,
        }

metadict_detail['Корица палочкой (палочка)'] = {
        # На самом деле кассия
        'Корица палочкой (грамм)':8,
        }

#----
# Пища (грамм --> 100 грамм):

metadict_detail['Североморские летние фрукты (грамм)'] = {
        'Североморские летние фрукты (100 грамм)':1 / 100,
        }

metadict_detail['Среднеземные летние фрукты (грамм)'] = {
        'Среднеземные летние фрукты (100 грамм)':1 / 100,
        }

metadict_detail['Южноморские летние фрукты (грамм)'] = {
        'Южноморские летние фрукты (100 грамм)':1 / 100,
        }

metadict_detail['Североморские осенние фрукты (грамм)'] = {
        'Североморские осенние фрукты (100 грамм)':1 / 100,
        }

metadict_detail['Среднеземные осенние фрукты (грамм)'] = {
        'Среднеземные осенние фрукты (100 грамм)':1 / 100,
        }

metadict_detail['Южноморские осенние фрукты (грамм)'] = {
        'Южноморские осенние фрукты (100 грамм)':1 / 100,
        }

metadict_detail['Зверобой отборный (грамм)'] = {
        'Зверобой отборный (100 грамм)':1 / 100,
        }

metadict_detail['Таволга отборная (грамм)'] = {
        'Таволга отборная (100 грамм)':1 / 100,
        }

metadict_detail['Фенхель отборный (грамм)'] = {
        'Фенхель отборный (100 грамм)':1 / 100,
        }

metadict_detail['Чабрец отборный (грамм)'] = {
        'Чабрец отборный (100 грамм)':1 / 100,
        }

metadict_detail['Лаванда отборная (грамм)'] = {
        'Лаванда отборная (100 грамм)':1 / 100,
        }

metadict_detail['Лаванда сушёная (грамм)'] = {
        'Лаванда сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Зверобой сушёный (грамм)'] = {
        'Зверобой сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Клевер сушёный (грамм)'] = {
        'Клевер сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Крапива сушёная (грамм)'] = {
        'Крапива сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Мята сушёная (грамм)'] = {
        'Мята сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Ромашка сушёная (грамм)'] = {
        'Ромашка сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Таволга сушёная (грамм)'] = {
        'Таволга сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Фенхель сушёный (грамм)'] = {
        'Фенхель сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Чабрец сушёный (грамм)'] = {
        'Чабрец сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Пряности для щей (грамм)'] = {
        'Пряности для щей (100 грамм)':1 / 100,
        }

metadict_detail['Пряности букета гарни с петрушкой (грамм)'] = {
        'Пряности букета гарни с петрушкой (100 грамм)':1 / 100,
        }

metadict_detail['Пряности букета гарни с розмарином (грамм)'] = {
        'Пряности букета гарни с розмарином (100 грамм)':1 / 100,
        }

metadict_detail['Пряности прованские (грамм)'] = {
        'Пряности прованские (100 грамм)':1 / 100,
        }

metadict_detail['Пряности для бобовых v1 (грамм)'] = {
        'Пряности для бобовых v1 (100 грамм)':1 / 100,
        }

metadict_detail['Пряности для бобовых v2 (грамм)'] = {
        'Пряности для бобовых v2 (100 грамм)':1 / 100,
        }

metadict_detail['Пряности для тыквы (грамм)'] = {
        'Пряности для тыквы (100 грамм)':1 / 100,
        }

metadict_detail['Пряности для овощного маринада с тмином (грамм)'] = {
        'Пряности для овощного маринада с тмином (100 грамм)':1 / 100,
        }

metadict_detail['Пряности для овощного маринада (грамм)'] = {
        'Пряности для овощного маринада (100 грамм)':1 / 100,
        }

metadict_detail['Пряности для фруктового маринада (грамм)'] = {
        'Пряности для фруктового маринада (100 грамм)':1 / 100,
        }

metadict_detail['Пряности нежного карри (грамм)'] = {
        'Пряности нежного карри (100 грамм)':1 / 100,
        }

metadict_detail['Пряности гарам масала (грамм)'] = {
        'Пряности гарам масала (100 грамм)':1 / 100,
        }

metadict_detail['Пряности кондитерские (грамм)'] = {
        'Пряности кондитерские (100 грамм)':1 / 100,
        }

metadict_detail['Пряности для овощей из восьми растений (грамм)'] = {
        'Пряности для овощей из восьми растений (100 грамм)':1 / 100,
        }

metadict_detail['Пряности для овощей из трёх растений (грамм)'] = {
        'Пряности для овощей из трёх растений (100 грамм)':1 / 100,
        }

metadict_detail['Пряности для овощей из пяти растений (грамм)'] = {
        'Пряности для овощей из пяти растений (100 грамм)':1 / 100,
        }

metadict_detail['Пряности пряничные (грамм)'] = {
        'Пряности пряничные (100 грамм)':1 / 100,
        }

metadict_detail['Пряности хмели-сунели (грамм)'] = {
        'Пряности хмели-сунели (100 грамм)':1 / 100,
        }

metadict_detail['Лист дуба (грамм)'] = {
        'Лист дуба (100 грамм)':1 / 100,
        }

metadict_detail['Лист смородины (грамм)'] = {
        'Лист смородины (100 грамм)':1 / 100,
        }

metadict_detail['Лист смородины сушёный (грамм)'] = {
        'Лист смородины сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Лист лавра (грамм)'] = {
        'Лист лавра (100 грамм)':1 / 100,
        }

metadict_detail['Лист чабера (грамм)'] = {
        'Лист чабера (100 грамм)':1 / 100,
        }

metadict_detail['Лист хрена (грамм)'] = {
        'Лист хрена (100 грамм)':1 / 100,
        }

metadict_detail['Щавель отборный (грамм)'] = {
        'Щавель отборный (100 грамм)':1 / 100,
        }

metadict_detail['Крапива отборная (грамм)'] = {
        'Крапива отборная (100 грамм)':1 / 100,
        }

metadict_detail['Бадьян сушёный (грамм)'] = {
        'Бадьян сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Шафран сушёный (грамм)'] = {
        'Шафран сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Лист базилика (грамм)'] = {
        'Лист базилика (100 грамм)':1 / 100,
        }

metadict_detail['Базилик сушёный (грамм)'] = {
        'Базилик сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Душица сушёная (грамм)'] = {
        'Душица сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Зелень петрушки сушёная (грамм)'] = {
        'Зелень петрушки сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Зелень петрушки отборная (грамм)'] = {
        'Зелень петрушки отборная (100 грамм)':1 / 100,
        }

metadict_detail['Зелень сельдерея (грамм)'] = {
        'Зелень сельдерея (100 грамм)':1 / 100,
        }

metadict_detail['Зелень сельдерея сушёная (грамм)'] = {
        'Зелень сельдерея сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Стебель сельдерея (грамм)'] = {
        'Стебель сельдерея (100 грамм)':1 / 100,
        }

metadict_detail['Корень куркумы (грамм)'] = {
        'Корень куркумы (100 грамм)':1 / 100,
        }

metadict_detail['Корень сельдерея (грамм)'] = {
        'Корень сельдерея (100 грамм)':1 / 100,
        }

metadict_detail['Корень сельдерея шинкованный (грамм)'] = {
        'Корень сельдерея шинкованный (100 грамм)':1 / 100,
        }

metadict_detail['Корень сельдерея варёный (грамм)'] = {
        'Корень сельдерея варёный (100 грамм)':1 / 100,
        }

metadict_detail['Корень сельдерея жареный (грамм)'] = {
        'Корень сельдерея жареный (100 грамм)':1 / 100,
        }

metadict_detail['Семена подсолнечника (грамм)'] = {
        'Семена подсолнечника (100 грамм)':1 / 100,
        }

metadict_detail['Семена льна (грамм)'] = {
        'Семена льна (100 грамм)':1 / 100,
        }

metadict_detail['Семена конопли (грамм)'] = {
        'Семена конопли (100 грамм)':1 / 100,
        }

metadict_detail['Семена аниса (грамм)'] = {
        'Семена аниса (100 грамм)':1 / 100,
        }

metadict_detail['Семена кардамона (грамм)'] = {
        'Семена кардамона (100 грамм)':1 / 100,
        }

metadict_detail['Семена кориандра (грамм)'] = {
        'Семена кориандра (100 грамм)':1 / 100,
        }

metadict_detail['Семена кунжута (грамм)'] = {
        'Семена кунжута (100 грамм)':1 / 100,
        }

metadict_detail['Зелень кориандра отборная (грамм)'] = {
        'Зелень кориандра отборная (100 грамм)':1 / 100,
        }

metadict_detail['Зелень кориандра сушёная (грамм)'] = {
        'Зелень кориандра сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Семена фенхеля (грамм)'] = {
        'Семена фенхеля (100 грамм)':1 / 100,
        }

metadict_detail['Семена фенугрека (грамм)'] = {
        'Семена фенугрека (100 грамм)':1 / 100,
        }

metadict_detail['Тимьян сушёный (грамм)'] = {
        'Тимьян сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Майоран сушёный (грамм)'] = {
        'Майоран сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Розмарин сушёный (грамм)'] = {
        'Розмарин сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Шалфей сушёный (грамм)'] = {
        'Шалфей сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Цедра лимонная (грамм)'] = {
        'Цедра лимонная (100 грамм)':1 / 100,
        }

metadict_detail['Корень хрена (грамм)'] = {
        'Корень хрена (100 грамм)':1 / 100,
        }

metadict_detail['Хрен тёртый (грамм)'] = {
        'Хрен тёртый (100 грамм)':1 / 100,
        }

metadict_detail['Корень петрушки чищеный (грамм)'] = {
        'Корень петрушки чищеный (100 грамм)':1 / 100,
        }

metadict_detail['Спаржа чищеная (грамм)'] = {
        'Спаржа чищеная (100 грамм)':1 / 100,
        }

metadict_detail['Стебель эстрагона (грамм)'] = {
        'Стебель эстрагона (100 грамм)':1 / 100,
        }

metadict_detail['Эстрагон сушёный (грамм)'] = {
        'Эстрагон сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Ревень отборный (грамм)'] = {
        'Ревень отборный (100 грамм)':1 / 100,
        }

metadict_detail['Зелень укропа отборная (грамм)'] = {
        'Зелень укропа отборная (100 грамм)':1 / 100,
        }

metadict_detail['Зелень укропа сушёная (грамм)'] = {
        'Зелень укропа сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Чабер сушёный (грамм)'] = {
        'Чабер сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Кофе молотый (грамм)'] = {
        'Кофе молотый (100 грамм)':1 / 100,
        }

metadict_detail['Солод пшеничный (грамм)'] = {
        'Солод пшеничный (100 грамм)':1 / 100,
        }

metadict_detail['Солод ржаной (грамм)'] = {
        'Солод ржаной (100 грамм)':1 / 100,
        }

metadict_detail['Горчичный порошок (грамм)'] = {
        'Горчичный порошок (100 грамм)':1 / 100,
        }

metadict_detail['Горчица столовая (грамм)'] = {
        'Горчица столовая (100 грамм)':1 / 100,
        }

metadict_detail['Крем маслено-горчичный (грамм)'] = {
        'Крем маслено-горчичный (100 грамм)':1 / 100,
        }

metadict_detail['Гвоздика сушёная (грамм)'] = {
        'Гвоздика сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Перец красный молотый (грамм)'] = {
        'Перец красный молотый (100 грамм)':1 / 100,
        }

metadict_detail['Перец красный сушёный (грамм)'] = {
        'Перец красный сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Перец чёрный молотый (грамм)'] = {
        'Перец чёрный молотый (100 грамм)':1 / 100,
        }

metadict_detail['Перец чёрный сушёный (грамм)'] = {
        'Перец чёрный сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Перец душистый молотый (грамм)'] = {
        'Перец душистый молотый (100 грамм)':1 / 100,
        }

metadict_detail['Перец душистый сушёный (грамм)'] = {
        'Перец душистый сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Корица молотая (грамм)'] = {
        'Корица молотая (100 грамм)':1 / 100,
        }

metadict_detail['Корица палочкой (грамм)'] = {
        'Корица палочкой (100 грамм)':1 / 100,
        }

metadict_detail['Корень имбиря (грамм)'] = {
        'Корень имбиря (100 грамм)':1 / 100,
        }

metadict_detail['Орех мускатный (грамм)'] = {
        'Орех мускатный (100 грамм)':1 / 100,
        }

metadict_detail['Орех карии чищенный (грамм)'] = {
        'Орех карии чищенный (100 грамм)':1 / 100,
        }

metadict_detail['Орех пекана чищенный (грамм)'] = {
        # Исправить
            # Тащемта, пекан, это тоже кария
        'Орех пекана чищенный (100 грамм)':1 / 100,
        }

metadict_detail['Орешки кедровые (грамм)'] = {
        'Орешки кедровые (100 грамм)':1 / 100,
        }

metadict_detail['Ваниль молотая (грамм)'] = {
        'Ваниль молотая (100 грамм)':1 / 100,
        }

metadict_detail['Семена тмина (грамм)'] = {
        'Семена тмина (100 грамм)':1 / 100,
        }

metadict_detail['Семена зиры (грамм)'] = {
        'Семена зиры (100 грамм)':1 / 100,
        }

metadict_detail['Травяной сбор (грамм)'] = {
        'Травяной сбор (100 грамм)':1 / 100,
        }

metadict_detail['Лавровый лист сушёный (грамм)'] = {
        'Лавровый лист сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Вёшенки отборные (грамм)'] = {
        'Вёшенки отборные (100 грамм)':1 / 100,
        }

metadict_detail['Вёшенки варёные (грамм)'] = {
        'Вёшенки варёные (100 грамм)':1 / 100,
        }

metadict_detail['Вёшенки тушёные (грамм)'] = {
        'Вёшенки тушёные (100 грамм)':1 / 100,
        }

metadict_detail['Вёшенки жареные (грамм)'] = {
        'Вёшенки жареные (100 грамм)':1 / 100,
        }

metadict_detail['Шампиньоны отборные (грамм)'] = {
        'Шампиньоны отборные (100 грамм)':1 / 100,
        }

metadict_detail['Шампиньоны варёные (грамм)'] = {
        'Шампиньоны варёные (100 грамм)':1 / 100,
        }

metadict_detail['Шампиньоны тушёные (грамм)'] = {
        'Шампиньоны тушёные (100 грамм)':1 / 100,
        }

metadict_detail['Шампиньоны тушёные консервированные (грамм)'] = {
        'Шампиньоны тушёные консервированные (100 грамм)':1 / 100,
        }

metadict_detail['Шампиньоны жареные (грамм)'] = {
        'Шампиньоны жареные (100 грамм)':1 / 100,
        }

metadict_detail['Соус томатный (грамм)'] = {
        'Соус томатный (100 грамм)':1 / 100,
        }

metadict_detail['Соус соевый (грамм)'] = {
        'Соус соевый (100 грамм)':1 / 100,
        }

metadict_detail['Соус томатный консервированный (грамм)'] = {
        'Соус томатный консервированный (100 грамм)':1 / 100,
        }

metadict_detail['Соус баклажанный (грамм)'] = {
        'Соус баклажанный (100 грамм)':1 / 100,
        }

metadict_detail['Соус песто с томатами (грамм)'] = {
        'Соус песто с томатами (100 грамм)':1 / 100,
        }

metadict_detail['Боровики сушёные (грамм)'] = {
        'Боровики сушёные (100 грамм)':1 / 100,
        }

metadict_detail['Боровики чищеные (грамм)'] = {
        'Боровики чищеные (100 грамм)':1 / 100,
        }

metadict_detail['Боровики маринованные (грамм)'] = {
        'Боровики маринованные (100 грамм)':1 / 100,
        }

metadict_detail['Закуска из боровиков с луком (грамм)'] = {
        'Закуска из боровиков с луком (100 грамм)':1 / 100,
        }

metadict_detail['Боровики варёные (грамм)'] = {
        'Боровики варёные (100 грамм)':1 / 100,
        }

metadict_detail['Боровики жареные (грамм)'] = {
        'Боровики жареные (100 грамм)':1 / 100,
        }

metadict_detail['Боровики тушёные (грамм)'] = {
        'Боровики тушёные (100 грамм)':1 / 100,
        }

metadict_detail['Сморчки сушёные (грамм)'] = {
        'Сморчки сушёные (100 грамм)':1 / 100,
        }

metadict_detail['Сморчки варёные (грамм)'] = {
        'Сморчки варёные (100 грамм)':1 / 100,
        }

metadict_detail['Сморчки тушёные (грамм)'] = {
        'Сморчки тушёные (100 грамм)':1 / 100,
        }

metadict_detail['Сморчки чищеные (грамм)'] = {
        'Сморчки чищеные (100 грамм)':1 / 100,
        }

metadict_detail['Сморчки жареные (грамм)'] = {
        'Сморчки жареные (100 грамм)':1 / 100,
        }

metadict_detail['Сушёные чайные листья (грамм)'] = {
        'Сушёные чайные листья (100 грамм)':1 / 100,
        }

metadict_detail['Соль поваренная (грамм)'] = {
        'Соль поваренная (100 грамм)':1 / 100,
        }

metadict_detail['Сода пищевая (грамм)'] = {
        'Сода пищевая (100 грамм)':1 / 100,
        }

metadict_detail['Крахмал картофельный (грамм)'] = {
        'Крахмал картофельный (100 грамм)':1 / 100,
        }

metadict_detail['Агар-агар (грамм)'] = {
        'Агар-агар (100 грамм)':1 / 100,
        }

metadict_detail['Раствор крахмальный (грамм)'] = {
        'Раствор крахмальный (100 грамм)':1 / 100,
        }

metadict_detail['Арахис чищеный (грамм)'] = {
        'Арахис чищеный (100 грамм)':1 / 100,
        }

metadict_detail['Арахис в стручках (грамм)'] = {
        'Арахис в стручках (100 грамм)':1 / 100,
        }

metadict_detail['Арахис обжаренный (грамм)'] = {
        'Арахис обжаренный (100 грамм)':1 / 100,
        }

metadict_detail['Сухофрукты разные (грамм)'] = {
        'Сухофрукты разные (100 грамм)':1 / 100,
        }

metadict_detail['Виноград сушёный (грамм)'] = {
        'Виноград сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Черника сушёная (грамм)'] = {
        'Черника сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Смородина сушёная (грамм)'] = {
        'Смородина сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Яблоко сушёное (грамм)'] = {
        'Яблоко сушёное (100 грамм)':1 / 100,
        }

metadict_detail['Вишня сушёная (грамм)'] = {
        'Вишня сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Персик сушёный (грамм)'] = {
        'Персик сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Абрикос сушёный (грамм)'] = {
        'Абрикос сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Слива сушёная (грамм)'] = {
        'Слива сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Груша сушёная (грамм)'] = {
        'Груша сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Зелень укропа сушёная (грамм)'] = {
        'Зелень укропа сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Зерно пшеницы (грамм)'] = {
        'Зерно пшеницы (100 грамм)':1 / 100,
        }

metadict_detail['Зерно овса (грамм)'] = {
        'Зерно овса (100 грамм)':1 / 100,
        }

metadict_detail['Зерно ячменя (грамм)'] = {
        'Зерно ячменя (100 грамм)':1 / 100,
        }

metadict_detail['Зерно ржи (грамм)'] = {
        'Зерно ржи (100 грамм)':1 / 100,
        }

metadict_detail['Мука пшеничная (грамм)'] = {
        'Мука пшеничная (100 грамм)':1 / 100,
        }

metadict_detail['Мука кукурузная (грамм)'] = {
        'Мука кукурузная (100 грамм)':1 / 100,
        }

metadict_detail['Мука гречневая (грамм)'] = {
        'Мука гречневая (100 грамм)':1 / 100,
        }

metadict_detail['Мука гороховая (грамм)'] = {
        'Мука гороховая (100 грамм)':1 / 100,
        }

metadict_detail['Мука ячменная (грамм)'] = {
        'Мука ячменная (100 грамм)':1 / 100,
        }

metadict_detail['Мука ржаная (грамм)'] = {
        'Мука ржаная (100 грамм)':1 / 100,
        }

metadict_detail['Мука овсяная (грамм)'] = {
        'Мука овсяная (100 грамм)':1 / 100,
        }

metadict_detail['Мука соевая (грамм)'] = {
        'Мука соевая (100 грамм)':1 / 100,
        }

metadict_detail['Темпе (грамм)'] = {
        'Темпе (100 грамм)':1 / 100,
        }

metadict_detail['Темпе обжаренный (грамм)'] = {
        'Темпе обжаренный (100 грамм)':1 / 100,
        }

metadict_detail['Соя варёная (грамм)'] = {
        'Соя варёная (100 грамм)':1 / 100,
        }

metadict_detail['Соя замоченная (грамм)'] = {
        'Соя замоченная (100 грамм)':1 / 100,
        }

metadict_detail['Мука льняная (грамм)'] = {
        'Мука льняная (100 грамм)':1 / 100,
        }

metadict_detail['Крупа овсяная (грамм)'] = {
        'Крупа овсяная (100 грамм)':1 / 100,
        }

metadict_detail['Зерно кукурузы (грамм)'] = {
        'Зерно кукурузы (100 грамм)':1 / 100,
        }

metadict_detail['Крупа кукурузная (грамм)'] = {
        'Крупа кукурузная (100 грамм)':1 / 100,
        }

metadict_detail['Крупа гречневая отборная (грамм)'] = {
        'Крупа гречневая отборная (100 грамм)':1 / 100,
        }

metadict_detail['Продел гречневый (грамм)'] = {
        'Продел гречневый (100 грамм)':1 / 100,
        }

metadict_detail['Крупа ячневая (грамм)'] = {
        'Крупа ячневая (100 грамм)':1 / 100,
        }

metadict_detail['Зерно риса посевного (грамм)'] = {
        'Зерно риса посевного (100 грамм)':1 / 100,
        }

metadict_detail['Рис шлифованный (грамм)'] = {
        'Рис шлифованный (100 грамм)':1 / 100,
        }

metadict_detail['Рис замоченный (грамм)'] = {
        'Рис замоченный (100 грамм)':1 / 100,
        }

metadict_detail['Рис варёный (грамм)'] = {
        'Рис варёный (100 грамм)':1 / 100,
        }

metadict_detail['Рис варёный с соевым соусом (грамм)'] = {
        'Рис варёный с соевым соусом (100 грамм)':1 / 100,
        }

metadict_detail['Рис варёный с томатным соусом (грамм)'] = {
        'Рис варёный с томатным соусом (100 грамм)':1 / 100,
        }

metadict_detail['Рис варёный с консервированными овощами (грамм)'] = {
        'Рис варёный с консервированными овощами (100 грамм)':1 / 100,
        }

metadict_detail['Рис варёный с фасолью (грамм)'] = {
        'Рис варёный с фасолью (100 грамм)':1 / 100,
        }

metadict_detail['Рис варёный с кукурузой (грамм)'] = {
        'Рис варёный с кукурузой (100 грамм)':1 / 100,
        }

metadict_detail['Рис варёный с тыквой и кукурузой (грамм)'] = {
        'Рис варёный с тыквой и кукурузой (100 грамм)':1 / 100,
        }

metadict_detail['Рис обжарено-варёный (грамм)'] = {
        'Рис обжарено-варёный (100 грамм)':1 / 100,
        }

metadict_detail['Рис обжаренный с квашеной капустой (грамм)'] = {
        'Рис обжаренный с квашеной капустой (100 грамм)':1 / 100,
        }

metadict_detail['Рис обжаренный с капустой и спаржей (грамм)'] = {
        'Рис обжаренный с капустой и спаржей (100 грамм)':1 / 100,
        }

metadict_detail['Рис обжаренный с капустой и овощами (грамм)'] = {
        'Рис обжаренный с капустой и овощами (100 грамм)':1 / 100,
        }

metadict_detail['Рис обжаренный с капустой и грибами (грамм)'] = {
        'Рис обжаренный с капустой и грибами (100 грамм)':1 / 100,
        }

metadict_detail['Фасоль сухая (грамм)'] = {
        'Фасоль сухая (100 грамм)':1 / 100,
        }

metadict_detail['Чечевица сухая (грамм)'] = {
        'Чечевица сухая (100 грамм)':1 / 100,
        }

metadict_detail['Чечевица замоченная (грамм)'] = {
        'Чечевица замоченная (100 грамм)':1 / 100,
        }

metadict_detail['Чечевица варёная (грамм)'] = {
        'Чечевица варёная (100 грамм)':1 / 100,
        }

metadict_detail['Чечевица тушёная (грамм)'] = {
        'Чечевица тушёная (100 грамм)':1 / 100,
        }

metadict_detail['Горох сухой (грамм)'] = {
        'Горох сухой (100 грамм)':1 / 100,
        }

metadict_detail['Горох варёный (грамм)'] = {
        'Горох варёный (100 грамм)':1 / 100,
        }

metadict_detail['Горох замоченный (грамм)'] = {
        'Горох замоченный (100 грамм)':1 / 100,
        }

metadict_detail['Горошек зелёный (грамм)'] = {
        'Горошек зелёный (100 грамм)':1 / 100,
        }

metadict_detail['Фасоль замоченная (грамм)'] = {
        'Фасоль замоченная (100 грамм)':1 / 100,
        }

metadict_detail['Бобы соевые (грамм)'] = {
        'Бобы соевые (100 грамм)':1 / 100,
        }

metadict_detail['Ростки соевые (грамм)'] = {
        'Ростки соевые (100 грамм)':1 / 100,
        }

metadict_detail['Брокколи чищеные (грамм)'] = {
        'Брокколи чищеные (100 грамм)':1 / 100,
        }

metadict_detail['Брокколи варёные (грамм)'] = {
        'Брокколи варёные (100 грамм)':1 / 100,
        }

metadict_detail['Брокколи обжаренные (грамм)'] = {
        'Брокколи обжаренные (100 грамм)':1 / 100,
        }

metadict_detail['Ромашка отборная (грамм)'] = {
        'Ромашка отборная (100 грамм)':1 / 100,
        }

metadict_detail['Клевер отборный (грамм)'] = {
        'Клевер отборный (100 грамм)':1 / 100,
        }

metadict_detail['Одуванчик чищеный (грамм)'] = {
        'Одуванчик чищеный (100 грамм)':1 / 100,
        }

metadict_detail['Спаржа варёная (грамм)'] = {
        'Спаржа варёная (100 грамм)':1 / 100,
        }

metadict_detail['Одуванчик варёный (грамм)'] = {
        'Одуванчик варёный (100 грамм)':1 / 100,
        }

metadict_detail['Одуванчики обжаренные (грамм)'] = {
        'Одуванчики обжаренные (100 грамм)':1 / 100,
        }

metadict_detail['Одуванчик сушёный (грамм)'] = {
        'Одуванчик сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Батат чищеный (грамм)'] = {
        'Батат чищеный (100 грамм)':1 / 100,
        }

metadict_detail['Батат печёный (грамм)'] = {
        'Батат печёный (100 грамм)':1 / 100,
        }

metadict_detail['Батат печёный дольками (грамм)'] = {
        'Батат печёный дольками (100 грамм)':1 / 100,
        }

metadict_detail['Картофель чищеный (грамм)'] = {
        'Картофель чищеный (100 грамм)':1 / 100,
        }

metadict_detail['Картофель тушёный с морковью (грамм)'] = {
        'Картофель тушёный с морковью (100 грамм)':1 / 100,
        }

metadict_detail['Картофель тушёный в соевом соусе (грамм)'] = {
        'Картофель тушёный в соевом соусе (100 грамм)':1 / 100,
        }

metadict_detail['Картофель тушёный с горошком и пряностями (грамм)'] = {
        'Картофель тушёный с горошком и пряностями (100 грамм)':1 / 100,
        }

metadict_detail['Картофель тушёный с оливками и лимоном (грамм)'] = {
        'Картофель тушёный с оливками и лимоном (100 грамм)':1 / 100,
        }

metadict_detail['Картофель тушёный с яблоками (грамм)'] = {
        'Картофель тушёный с яблоками (100 грамм)':1 / 100,
        }

metadict_detail['Картофель тушёный со спаржей (грамм)'] = {
        'Картофель тушёный со спаржей (100 грамм)':1 / 100,
        }

metadict_detail['Картофель варёный (грамм)'] = {
        'Картофель варёный (100 грамм)':1 / 100,
        }

metadict_detail['Картофель жареный соломкой (грамм)'] = {
        'Картофель жареный соломкой (100 грамм)':1 / 100,
        }

metadict_detail['Картофель печёный (грамм)'] = {
        'Картофель печёный (100 грамм)':1 / 100,
        }

metadict_detail['Картофель печёный дольками (грамм)'] = {
        'Картофель печёный дольками (100 грамм)':1 / 100,
        }

metadict_detail['Запеканка картофельная с боровиками (грамм)'] = {
        'Запеканка картофельная с боровиками (100 грамм)':1 / 100,
        }

metadict_detail['Запеканка картофельная со свёклой (грамм)'] = {
        'Запеканка картофельная со свёклой (100 грамм)':1 / 100,
        }

metadict_detail['Шарики фасолевые в панировке (грамм)'] = {
        'Шарики фасолевые в панировке (100 грамм)':1 / 100,
        }

metadict_detail['Шарики чечевичные в панировке (грамм)'] = {
        'Шарики чечевичные в панировке (100 грамм)':1 / 100,
        }

metadict_detail['Зразы картофельные с боровиками (грамм)'] = {
        'Зразы картофельные с боровиками (100 грамм)':1 / 100,
        }

metadict_detail['Зразы картофельные со сморчками (грамм)'] = {
        'Зразы картофельные со сморчками (100 грамм)':1 / 100,
        }

metadict_detail['Суфле брюквенно-морковное (грамм)'] = {
        'Суфле брюквенно-морковное (100 грамм)':1 / 100,
        }

metadict_detail['Суфле картофельно-тыквенное (грамм)'] = {
        'Суфле картофельно-тыквенное (100 грамм)':1 / 100,
        }

metadict_detail['Суфле картофельно-морковное (грамм)'] = {
        'Суфле картофельно-морковное (100 грамм)':1 / 100,
        }

metadict_detail['Суфле картофельно-гороховое (грамм)'] = {
        'Суфле картофельно-гороховое (100 грамм)':1 / 100,
        }

metadict_detail['Суфле картофельное (грамм)'] = {
        'Суфле картофельное (100 грамм)':1 / 100,
        }

metadict_detail['Суфле гороховое (грамм)'] = {
        'Суфле гороховое (100 грамм)':1 / 100,
        }

metadict_detail['Свёкла чищеная (грамм)'] = {
        'Свёкла чищеная (100 грамм)':1 / 100,
        }

metadict_detail['Ботвинья-свекольник (грамм)'] = {
        'Ботвинья-свекольник (100 грамм)':1 / 100,
        }

metadict_detail['Заправка зелёная для ботвиньи (грамм)'] = {
        'Заправка зелёная для ботвиньи (100 грамм)':1 / 100,
        }

metadict_detail['Заправка овощная для ботвиньи (грамм)'] = {
        'Заправка овощная для ботвиньи (100 грамм)':1 / 100,
        }

metadict_detail['Основа квасная для ботвиньи (грамм)'] = {
        'Основа квасная для ботвиньи (100 грамм)':1 / 100,
        }

metadict_detail['Ботва свекольная (грамм)'] = {
        'Ботва свекольная (100 грамм)':1 / 100,
        }

metadict_detail['Морковь чищеная (грамм)'] = {
        'Морковь чищеная (100 грамм)':1 / 100,
        }

metadict_detail['Репа чищеная (грамм)'] = {
        'Репа чищеная (100 грамм)':1 / 100,
        }

metadict_detail['Репа варёная (грамм)'] = {
        'Репа варёная (100 грамм)':1 / 100,
        }

metadict_detail['Репа печёная (грамм)'] = {
        'Репа печёная (100 грамм)':1 / 100,
        }

metadict_detail['Репа фаршированная горохом (грамм)'] = {
        'Репа фаршированная горохом (100 грамм)':1 / 100,
        }

metadict_detail['Репа печёная с ягодами (грамм)'] = {
        'Репа печёная с ягодами (100 грамм)':1 / 100,
        }

metadict_detail['Брюква чищеная (грамм)'] = {
        'Брюква чищеная (100 грамм)':1 / 100,
        }

metadict_detail['Брюква печёная (грамм)'] = {
        'Брюква печёная (100 грамм)':1 / 100,
        }

metadict_detail['Брюква печёная с кедровыми орехами (грамм)'] = {
        'Брюква печёная с кедровыми орехами (100 грамм)':1 / 100,
        }

metadict_detail['Перец сладкий чищеный (грамм)'] = {
        'Перец сладкий чищеный (100 грамм)':1 / 100,
        }

metadict_detail['Рагу овощное (грамм)'] = {
        'Рагу овощное (100 грамм)':1 / 100,
        }

metadict_detail['Лечо со сладким перцем (грамм)'] = {
        'Лечо со сладким перцем (100 грамм)':1 / 100,
        }

metadict_detail['Лечо со сладким перцем консервированное (грамм)'] = {
        'Лечо со сладким перцем консервированное (100 грамм)':1 / 100,
        }

metadict_detail['Перец фаршированный овощами (грамм)'] = {
        'Перец фаршированный овощами (100 грамм)':1 / 100,
        }

metadict_detail['Перец печёный (грамм)'] = {
        'Перец печёный (100 грамм)':1 / 100,
        }

metadict_detail['Перец обжаренный (грамм)'] = {
        'Перец обжаренный (100 грамм)':1 / 100,
        }

metadict_detail['Баклажан печёный (грамм)'] = {
        'Баклажан печёный (100 грамм)':1 / 100,
        }

metadict_detail['Баклажан обжаренный с овощами (грамм)'] = {
        'Баклажан обжаренный с овощами (100 грамм)':1 / 100,
        }

metadict_detail['Кабачок печёный (грамм)'] = {
        'Кабачок печёный (100 грамм)':1 / 100,
        }

metadict_detail['Голубцы фаршированные овощами (грамм)'] = {
        'Голубцы фаршированные овощами (100 грамм)':1 / 100,
        }

metadict_detail['Фарш овощной (грамм)'] = {
        'Фарш овощной (100 грамм)':1 / 100,
        }

metadict_detail['Лимон отборный (грамм)'] = {
        'Лимон отборный (100 грамм)':1 / 100,
        }

metadict_detail['Лук чищеный (грамм)'] = {
        'Лук чищеный (100 грамм)':1 / 100,
        }

metadict_detail['Лук зелёный отборный (грамм)'] = {
        'Лук зелёный отборный (100 грамм)':1 / 100,
        }

metadict_detail['Чеснок чищеный (грамм)'] = {
        'Чеснок чищеный (100 грамм)':1 / 100,
        }

metadict_detail['Чеснок сушёный (грамм)'] = {
        'Чеснок сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Тыква чищеная (грамм)'] = {
        'Тыква чищеная (100 грамм)':1 / 100,
        }

metadict_detail['Томаты отборные (грамм)'] = {
        'Томаты отборные (100 грамм)':1 / 100,
        }

metadict_detail['Оливки чищеные (грамм)'] = {
        'Оливки чищеные (100 грамм)':1 / 100,
        }

metadict_detail['Оливки солёные (грамм)'] = {
        'Оливки солёные (100 грамм)':1 / 100,
        }

metadict_detail['Томаты сушёные (грамм)'] = {
        'Томаты сушёные (100 грамм)':1 / 100,
        }

metadict_detail['Баклажан чищеный (грамм)'] = {
        'Баклажан чищеный (100 грамм)':1 / 100,
        }

metadict_detail['Кабачок чищеный (грамм)'] = {
        'Кабачок чищеный (100 грамм)':1 / 100,
        }

metadict_detail['Огурцы отборные (грамм)'] = {
        'Огурцы отборные (100 грамм)':1 / 100,
        }

metadict_detail['Кресс-салат отборный (грамм)'] = {
        'Кресс-салат отборный (100 грамм)':1 / 100,
        }

metadict_detail['Салат-латук чищеный (грамм)'] = {
        'Салат-латук чищеный (100 грамм)':1 / 100,
        }

metadict_detail['Артишоки чищеные (грамм)'] = {
        'Артишоки чищеные (100 грамм)':1 / 100,
        }

metadict_detail['Артишоки обжаренные (грамм)'] = {
        'Артишоки обжаренные (100 грамм)':1 / 100,
        }

metadict_detail['Артишоки варёные (грамм)'] = {
        'Артишоки варёные (100 грамм)':1 / 100,
        }

metadict_detail['Артишоки тушёные с сельдереем (грамм)'] = {
        'Артишоки тушёные с сельдереем (100 грамм)':1 / 100,
        }

metadict_detail['Морская капуста отборная (грамм)'] = {
        'Морская капуста отборная (100 грамм)':1 / 100,
        }

metadict_detail['Морская капуста обжаренная (грамм)'] = {
        'Морская капуста обжаренная (100 грамм)':1 / 100,
        }

metadict_detail['Морская капуста замоченная (грамм)'] = {
        'Морская капуста замоченная (100 грамм)':1 / 100,
        }

metadict_detail['Морская капуста сушёная (грамм)'] = {
        'Морская капуста сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Капуста чищеная (грамм)'] = {
        'Капуста чищеная (100 грамм)':1 / 100,
        }

metadict_detail['Дыня чищеная (грамм)'] = {
        'Дыня чищеная (100 грамм)':1 / 100,
        }

metadict_detail['Арбуз чищеный (грамм)'] = {
        'Арбуз чищеный (100 грамм)':1 / 100,
        }

metadict_detail['Яблоко чищеное (грамм)'] = {
        'Яблоко чищеное (100 грамм)':1 / 100,
        }

metadict_detail['Яблоко отборное (грамм)'] = {
        'Яблоко отборное (100 грамм)':1 / 100,
        }

metadict_detail['Груша чищеная (грамм)'] = {
        'Груша чищеная (100 грамм)':1 / 100,
        }

metadict_detail['Груша отборная (грамм)'] = {
        'Груша отборная (100 грамм)':1 / 100,
        }

metadict_detail['Персик отборный (грамм)'] = {
        'Персик отборный (100 грамм)':1 / 100,
        }

metadict_detail['Абрикос отборный (грамм)'] = {
        'Абрикос отборный (100 грамм)':1 / 100,
        }

metadict_detail['Слива отборная (грамм)'] = {
        'Слива отборная (100 грамм)':1 / 100,
        }

metadict_detail['Вишня отборная (грамм)'] = {
        'Вишня отборная (100 грамм)':1 / 100,
        }

metadict_detail['Инжир сушёный (грамм)'] = {
        'Инжир сушёный (100 грамм)':1 / 100,
        }

metadict_detail['Инжир отборный (грамм)'] = {
        'Инжир отборный (100 грамм)':1 / 100,
        }

metadict_detail['Виноград отборный (грамм)'] = {
        'Виноград отборный (100 грамм)':1 / 100,
        }

metadict_detail['Черника отборная (грамм)'] = {
        'Черника отборная (100 грамм)':1 / 100,
        }

metadict_detail['Земляника отборная (грамм)'] = {
        'Земляника отборная (100 грамм)':1 / 100,
        }

metadict_detail['Малина отборная (грамм)'] = {
        'Малина отборная (100 грамм)':1 / 100,
        }

metadict_detail['Морошка отборная (грамм)'] = {
        'Морошка отборная (100 грамм)':1 / 100,
        }

metadict_detail['Смородина отборная (грамм)'] = {
        'Смородина отборная (100 грамм)':1 / 100,
        }

metadict_detail['Кукуруза чищеная (грамм)'] = {
        'Кукуруза чищеная (100 грамм)':1 / 100,
        }

metadict_detail['Кукуруза варёная (грамм)'] = {
        'Кукуруза варёная (100 грамм)':1 / 100,
        }

metadict_detail['Кукуруза печёная с соевым соусом (грамм)'] = {
        'Кукуруза печёная с соевым соусом (100 грамм)':1 / 100,
        }

metadict_detail['Хлеб пшеничный домашний (грамм)'] = {
        'Хлеб пшеничный домашний (100 грамм)':1 / 100,
        }

metadict_detail['Хлеб кукурузный домашний (грамм)'] = {
        'Хлеб кукурузный домашний (100 грамм)':1 / 100,
        }

metadict_detail['Хлеб соевый домашний (грамм)'] = {
        'Хлеб соевый домашний (100 грамм)':1 / 100,
        }

metadict_detail['Хлеб ржаной домашний (грамм)'] = {
        'Хлеб ржаной домашний (100 грамм)':1 / 100,
        }

metadict_detail['Хлеб ячменный домашний (грамм)'] = {
        'Хлеб ячменный домашний (100 грамм)':1 / 100,
        }

metadict_detail['Сэндвичи с арахисовой пастой (грамм)'] = {
        'Сэндвичи с арахисовой пастой (100 грамм)':1 / 100,
        }

metadict_detail['Сэндвичи с пекановой пастой (грамм)'] = {
        'Сэндвичи с пекановой пастой (100 грамм)':1 / 100,
        }

metadict_detail['Сэндвичи с яблочным джемом (грамм)'] = {
        'Сэндвичи с яблочным джемом (100 грамм)':1 / 100,
        }

metadict_detail['Сэндвичи с мёдом (грамм)'] = {
        'Сэндвичи с мёдом (100 грамм)':1 / 100,
        }

metadict_detail['Сухари пшеничные (грамм)'] = {
        'Сухари пшеничные (100 грамм)':1 / 100,
        }

metadict_detail['Сухари ржаные (грамм)'] = {
        'Сухари ржаные (100 грамм)':1 / 100,
        }

metadict_detail['Печенье овсяное (грамм)'] = {
        'Печенье овсяное (100 грамм)':1 / 100,
        }

metadict_detail['Пряники медовые (грамм)'] = {
        'Пряники медовые (100 грамм)':1 / 100,
        }

metadict_detail['Блины ржаные (грамм)'] = {
        'Блины ржаные (100 грамм)':1 / 100,
        }

metadict_detail['Блины пшенично-гречневые (грамм)'] = {
        'Блины пшенично-гречневые (100 грамм)':1 / 100,
        }

metadict_detail['Оладьи рисовые (грамм)'] = {
        'Оладьи рисовые (100 грамм)':1 / 100,
        }

metadict_detail['Оладьи рисовые с яблочным сиропом (грамм)'] = {
        'Оладьи рисовые с яблочным сиропом (100 грамм)':1 / 100,
        }

metadict_detail['Оладьи рисовые с лимонным сиропом (грамм)'] = {
        'Оладьи рисовые с лимонным сиропом (100 грамм)':1 / 100,
        }

metadict_detail['Оладьи овсяные (грамм)'] = {
        'Оладьи овсяные (100 грамм)':1 / 100,
        }

metadict_detail['Оладьи овсяные с кленовым сиропом (грамм)'] = {
        'Оладьи овсяные с кленовым сиропом (100 грамм)':1 / 100,
        }

metadict_detail['Оладьи овсяные с яблочным сиропом (грамм)'] = {
        'Оладьи овсяные с яблочным сиропом (100 грамм)':1 / 100,
        }

metadict_detail['Оладьи овсяные с мёдом (грамм)'] = {
        'Оладьи овсяные с мёдом (100 грамм)':1 / 100,
        }

metadict_detail['Оладьи кукурузные (грамм)'] = {
        'Оладьи кукурузные (100 грамм)':1 / 100,
        }

metadict_detail['Оладьи кукурузные с кленовым сиропом (грамм)'] = {
        'Оладьи кукурузные с кленовым сиропом (100 грамм)':1 / 100,
        }

metadict_detail['Оладьи кукурузные с яблочным сиропом (грамм)'] = {
        'Оладьи кукурузные с яблочным сиропом (100 грамм)':1 / 100,
        }

metadict_detail['Оладьи кукурузные с мёдом (грамм)'] = {
        'Оладьи кукурузные с мёдом (100 грамм)':1 / 100,
        }

metadict_detail['Пончики с глазурью (грамм)'] = {
        'Пончики с глазурью (100 грамм)':1 / 100,
        }

metadict_detail['Маффины кукурузные (грамм)'] = {
        'Маффины кукурузные (100 грамм)':1 / 100,
        }

metadict_detail['Маффины морковные (грамм)'] = {
        'Маффины морковные (100 грамм)':1 / 100,
        }

metadict_detail['Маффины тыквенные (грамм)'] = {
        'Маффины тыквенные (100 грамм)':1 / 100,
        }

metadict_detail['Маффины вишнёвые (грамм)'] = {
        'Маффины вишнёвые (100 грамм)':1 / 100,
        }

metadict_detail['Маффины с джемом из ревеня (грамм)'] = {
        'Маффины с джемом из ревеня (100 грамм)':1 / 100,
        }

metadict_detail['Маффины с яблочным джемом (грамм)'] = {
        'Маффины с яблочным джемом (100 грамм)':1 / 100,
        }

metadict_detail['Маффины с сухофруктами (грамм)'] = {
        'Маффины с сухофруктами (100 грамм)':1 / 100,
        }

metadict_detail['Суп хлебный с земляникой (грамм)'] = {
        'Суп хлебный с земляникой (100 грамм)':1 / 100,
        }

metadict_detail['Пудинг смородиновый (грамм)'] = {
        'Пудинг смородиновый (100 грамм)':1 / 100,
        }

metadict_detail['Пудинг кукурузный (грамм)'] = {
        'Пудинг кукурузный (100 грамм)':1 / 100,
        }

metadict_detail['Пудинг морковный (грамм)'] = {
        'Пудинг морковный (100 грамм)':1 / 100,
        }

metadict_detail['Пудинг тыквенный (грамм)'] = {
        'Пудинг тыквенный (100 грамм)':1 / 100,
        }

metadict_detail['Пирог открытый кленовый (грамм)'] = {
        'Пирог открытый кленовый (100 грамм)':1 / 100,
        }

metadict_detail['Пирог открытый пекановый (грамм)'] = {
        'Пирог открытый пекановый (100 грамм)':1 / 100,
        }

metadict_detail['Пирог открытый лимонный (грамм)'] = {
        'Пирог открытый лимонный (100 грамм)':1 / 100,
        }

metadict_detail['Пирог открытый тыквенный (грамм)'] = {
        'Пирог открытый тыквенный (100 грамм)':1 / 100,
        }

metadict_detail['Пирог открытый вишнёвый (грамм)'] = {
        'Пирог открытый вишнёвый (100 грамм)':1 / 100,
        }

metadict_detail['Пицца с брокколи (грамм)'] = {
        'Пицца с брокколи (100 грамм)':1 / 100,
        }

metadict_detail['Пицца с кабачками (грамм)'] = {
        'Пицца с кабачками (100 грамм)':1 / 100,
        }

metadict_detail['Пицца с артишоками (грамм)'] = {
        'Пицца с артишоками (100 грамм)':1 / 100,
        }

metadict_detail['Пицца с шампиньонами (грамм)'] = {
        'Пицца с шампиньонами (100 грамм)':1 / 100,
        }

metadict_detail['Пирожки тыквенные (грамм)'] = {
        'Пирожки тыквенные (100 грамм)':1 / 100,
        }

metadict_detail['Пирожки морковные (грамм)'] = {
        'Пирожки морковные (100 грамм)':1 / 100,
        }

metadict_detail['Пирожки с ревенем (грамм)'] = {
        'Пирожки с ревенем (100 грамм)':1 / 100,
        }

metadict_detail['Пирожки с грушей (грамм)'] = {
        'Пирожки с грушей (100 грамм)':1 / 100,
        }

metadict_detail['Пирожки земляничные (грамм)'] = {
        'Пирожки земляничные (100 грамм)':1 / 100,
        }

metadict_detail['Пирожки черничные (грамм)'] = {
        'Пирожки черничные (100 грамм)':1 / 100,
        }

metadict_detail['Пирожки капустные (грамм)'] = {
        'Пирожки капустные (100 грамм)':1 / 100,
        }

metadict_detail['Пирожки с картофелем (грамм)'] = {
        'Пирожки с картофелем (100 грамм)':1 / 100,
        }

metadict_detail['Пирожки с картофелем и спаржей (грамм)'] = {
        'Пирожки с картофелем и спаржей (100 грамм)':1 / 100,
        }

metadict_detail['Пирожки яблочные (грамм)'] = {
        'Пирожки яблочные (100 грамм)':1 / 100,
        }

metadict_detail['Шарлотка яблочная (грамм)'] = {
        'Шарлотка яблочная (100 грамм)':1 / 100,
        }

metadict_detail['Шарлотка земляничная (грамм)'] = {
        'Шарлотка земляничная (100 грамм)':1 / 100,
        }

metadict_detail['Желе лимонное (грамм)'] = {
        'Желе лимонное (100 грамм)':1 / 100,
        }

metadict_detail['Желе виноградное (грамм)'] = {
        'Желе виноградное (100 грамм)':1 / 100,
        }

metadict_detail['Желе яблочное (грамм)'] = {
        'Желе яблочное (100 грамм)':1 / 100,
        }

metadict_detail['Желе из ревеня (грамм)'] = {
        'Желе из ревеня (100 грамм)':1 / 100,
        }

metadict_detail['Кисель овсяной (грамм)'] = {
        'Кисель овсяной (100 грамм)':1 / 100,
        }

metadict_detail['Кисель гороховый (грамм)'] = {
        'Кисель гороховый (100 грамм)':1 / 100,
        }

metadict_detail['Напиток из орехов карии (грамм)'] = {
        'Напиток из орехов карии (100 грамм)':1 / 100,
        }

metadict_detail['Напиток из орехов карии с мёдом (грамм)'] = {
        'Напиток из орехов карии с мёдом (100 грамм)':1 / 100,
        }

metadict_detail['Мусс из орехов карии с мёдом (грамм)'] = {
        'Мусс из орехов карии с мёдом (100 грамм)':1 / 100,
        }

metadict_detail['Чай одуванчиковый (грамм)'] = {
        'Чай одуванчиковый (100 грамм)':1 / 100,
        }

metadict_detail['Чай одуванчиковый с кленовым сиропом (грамм)'] = {
        'Чай одуванчиковый с кленовым сиропом (100 грамм)':1 / 100,
        }

metadict_detail['Чай из листьев смородины (грамм)'] = {
        'Чай из листьев смородины (100 грамм)':1 / 100,
        }

metadict_detail['Напиток рисовый (грамм)'] = {
        'Напиток рисовый (100 грамм)':1 / 100,
        }

metadict_detail['Напиток овсяной (грамм)'] = {
        'Напиток овсяной (100 грамм)':1 / 100,
        }

metadict_detail['Напиток овсяной с мёдом (грамм)'] = {
        'Напиток овсяной с мёдом (100 грамм)':1 / 100,
        }

metadict_detail['Тесто пряничное медовое заварное (грамм)'] = {
        'Тесто пряничное медовое заварное (100 грамм)':1 / 100,
        }

metadict_detail['Тесто пшеничное дрожжевое (грамм)'] = {
        'Тесто пшеничное дрожжевое (100 грамм)':1 / 100,
        }

metadict_detail['Тесто пшеничное для пончиков (грамм)'] = {
        'Тесто пшеничное для пончиков (100 грамм)':1 / 100,
        }

metadict_detail['Тесто пшенично-соевое дрожжевое (грамм)'] = {
        'Тесто пшенично-соевое дрожжевое (100 грамм)':1 / 100,
        }

metadict_detail['Тесто пшенично-кукурузное дрожжевое (грамм)'] = {
        'Тесто пшенично-кукурузное дрожжевое (100 грамм)':1 / 100,
        }

metadict_detail['Тесто пшенично-кукурузное для маффинов (грамм)'] = {
        'Тесто пшенично-кукурузное для маффинов (100 грамм)':1 / 100,
        }

metadict_detail['Тесто пшенично-ячменное дрожжевое (грамм)'] = {
        'Тесто пшенично-ячменное дрожжевое (100 грамм)':1 / 100,
        }

metadict_detail['Тесто пшенично-гречневое для блинов (грамм)'] = {
        'Тесто пшенично-гречневое для блинов (100 грамм)':1 / 100,
        }

metadict_detail['Тесто пшеничное дрожжевое для пирогов (грамм)'] = {
        'Тесто пшеничное дрожжевое для пирогов (100 грамм)':1 / 100,
        }

metadict_detail['Тесто пшеничное бездрожжевое для пирогов (грамм)'] = {
        'Тесто пшеничное бездрожжевое для пирогов (100 грамм)':1 / 100,
        }

metadict_detail['Тесто пшеничное бездрожжевое для лапши (грамм)'] = {
        'Тесто пшеничное бездрожжевое для лапши (100 грамм)':1 / 100,
        }

metadict_detail['Тесто пшенично-овсяное для оладий (грамм)'] = {
        'Тесто пшенично-овсяное для оладий (100 грамм)':1 / 100,
        }

metadict_detail['Тесто кукурузное для оладий (грамм)'] = {
        'Тесто кукурузное для оладий (100 грамм)':1 / 100,
        }

metadict_detail['Тесто ржаное на закваске (грамм)'] = {
        'Тесто ржаное на закваске (100 грамм)':1 / 100,
        }

metadict_detail['Опара овсяная (грамм)'] = {
        'Опара овсяная (100 грамм)':1 / 100,
        }

metadict_detail['Опара пшенично-гречневая (грамм)'] = {
        'Опара пшенично-гречневая (100 грамм)':1 / 100,
        }

metadict_detail['Опара ржаная (грамм)'] = {
        'Опара ржаная (100 грамм)':1 / 100,
        }

metadict_detail['Заварка ржаная (грамм)'] = {
        'Заварка ржаная (100 грамм)':1 / 100,
        }

metadict_detail['Закваска ржаная (грамм)'] = {
        'Закваска ржаная (100 грамм)':1 / 100,
        }

metadict_detail['Дрожжи жидкие (грамм)'] = {
        'Дрожжи жидкие (100 грамм)':1 / 100,
        }

metadict_detail['Опара пшеничная (грамм)'] = {
        'Опара пшеничная (100 грамм)':1 / 100,
        }

metadict_detail['Щи из квашеной капусты (грамм)'] = {
        'Щи из квашеной капусты (100 грамм)':1 / 100,
        }

metadict_detail['Щи из квашеной капусты с грибами (грамм)'] = {
        'Щи из квашеной капусты с грибами (100 грамм)':1 / 100,
        }

metadict_detail['Пюре из обжаренной фасоли (грамм)'] = {
        'Пюре из обжаренной фасоли (100 грамм)':1 / 100,
        }

metadict_detail['Пюре картофельное (грамм)'] = {
        'Пюре картофельное (100 грамм)':1 / 100,
        }

metadict_detail['Пюре брюквенное (грамм)'] = {
        'Пюре брюквенное (100 грамм)':1 / 100,
        }

metadict_detail['Пюре морковное (грамм)'] = {
        'Пюре морковное (100 грамм)':1 / 100,
        }

metadict_detail['Пюре бататное (грамм)'] = {
        'Пюре бататное (100 грамм)':1 / 100,
        }

metadict_detail['Пюре тыквенное (грамм)'] = {
        'Пюре тыквенное (100 грамм)':1 / 100,
        }

metadict_detail['Суп-лапша с бататом и солёными томатами (грамм)'] = {
        'Суп-лапша с бататом и солёными томатами (100 грамм)':1 / 100,
        }

metadict_detail['Суп-лапша с кабачком и свежими томатами (грамм)'] = {
        'Суп-лапша с кабачком и свежими томатами (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре чечевичный с пряностями (грамм)'] = {
        'Суп-пюре чечевичный с пряностями (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре фасолевый с пряностями (грамм)'] = {
        'Суп-пюре фасолевый с пряностями (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре гороховый с пряностями (грамм)'] = {
        'Суп-пюре гороховый с пряностями (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре томатный (грамм)'] = {
        'Суп-пюре томатный (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре томатный с гренками (грамм)'] = {
        'Суп-пюре томатный с гренками (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре из батата со сладким перцем (грамм)'] = {
        'Суп-пюре из батата со сладким перцем (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре из корня сельдерея (грамм)'] = {
        'Суп-пюре из корня сельдерея (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре из корня сельдерея с гренками (грамм)'] = {
        'Суп-пюре из корня сельдерея с гренками (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре морковный (грамм)'] = {
        'Суп-пюре морковный (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре морковный с пряностями (грамм)'] = {
        'Суп-пюре морковный с пряностями (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре морковный с кремом (грамм)'] = {
        'Суп-пюре морковный с кремом (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре свекольный (грамм)'] = {
        'Суп-пюре свекольный (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре свекольный с кремом (грамм)'] = {
        'Суп-пюре свекольный с кремом (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре картофельный (грамм)'] = {
        'Суп-пюре картофельный (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре картофельный с гренками (грамм)'] = {
        'Суп-пюре картофельный с гренками (100 грамм)':1 / 100,
        }

metadict_detail['Суп-пюре картофельный с шампиньонами (грамм)'] = {
        'Суп-пюре картофельный с шампиньонами (100 грамм)':1 / 100,
        }

metadict_detail['Аквафаба чечевичная (грамм)'] = {
        'Аквафаба чечевичная (100 грамм)':1 / 100,
        }

metadict_detail['Бульон чечевичный (грамм)'] = {
        'Бульон чечевичный (100 грамм)':1 / 100,
        }

metadict_detail['Бульон фасолевый (грамм)'] = {
        'Бульон фасолевый (100 грамм)':1 / 100,
        }

metadict_detail['Похлёбка фасолевая (грамм)'] = {
        'Похлёбка фасолевая (100 грамм)':1 / 100,
        }

metadict_detail['Похлёбка томатная с фасолью (грамм)'] = {
        'Похлёбка томатная с фасолью (100 грамм)':1 / 100,
        }

metadict_detail['Похлёбка томатная с чечевицей (грамм)'] = {
        'Похлёбка томатная с чечевицей (100 грамм)':1 / 100,
        }

metadict_detail['Похлёбка чечевичная (грамм)'] = {
        'Похлёбка чечевичная (100 грамм)':1 / 100,
        }

metadict_detail['Похлёбка картофельная (грамм)'] = {
        'Похлёбка картофельная (100 грамм)':1 / 100,
        }

metadict_detail['Похлёбка с морской капустой (грамм)'] = {
        'Похлёбка с морской капустой (100 грамм)':1 / 100,
        }

metadict_detail['Лапша варёная (грамм)'] = {
        'Лапша варёная (100 грамм)':1 / 100,
        }

metadict_detail['Лапша с томатным соусом (грамм)'] = {
        'Лапша с томатным соусом (100 грамм)':1 / 100,
        }

metadict_detail['Лапша с соусом песто (грамм)'] = {
        'Лапша с соусом песто (100 грамм)':1 / 100,
        }

metadict_detail['Лапша с песто и овощами (грамм)'] = {
        'Лапша с песто и овощами (100 грамм)':1 / 100,
        }

metadict_detail['Лапша с песто и шампиньонами (грамм)'] = {
        'Лапша с песто и шампиньонами (100 грамм)':1 / 100,
        }

metadict_detail['Лапша с песто и сморчками (грамм)'] = {
        'Лапша с песто и сморчками (100 грамм)':1 / 100,
        }

metadict_detail['Лапша сушёная (грамм)'] = {
        'Лапша сушёная (100 грамм)':1 / 100,
        }

metadict_detail['Каша рисовая (грамм)'] = {
        'Каша рисовая (100 грамм)':1 / 100,
        }

metadict_detail['Каша рисовая с чечевицей (грамм)'] = {
        'Каша рисовая с чечевицей (100 грамм)':1 / 100,
        }

metadict_detail['Каша рисовая с чечевицей и спаржей (грамм)'] = {
        'Каша рисовая с чечевицей и спаржей (100 грамм)':1 / 100,
        }

metadict_detail['Каша рисовая с чечевицей и горошком (грамм)'] = {
        'Каша рисовая с чечевицей и горошком (100 грамм)':1 / 100,
        }

metadict_detail['Каша рисовая с чечевицей и овощами (грамм)'] = {
        'Каша рисовая с чечевицей и овощами (100 грамм)':1 / 100,
        }

metadict_detail['Каша овсяная (грамм)'] = {
        'Каша овсяная (100 грамм)':1 / 100,
        }

metadict_detail['Каша овсяная с мёдом (грамм)'] = {
        'Каша овсяная с мёдом (100 грамм)':1 / 100,
        }

metadict_detail['Каша овсяная с кленовым сиропом (грамм)'] = {
        'Каша овсяная с кленовым сиропом (100 грамм)':1 / 100,
        }

metadict_detail['Фасоль тушёная (грамм)'] = {
        'Фасоль тушёная (100 грамм)':1 / 100,
        }

metadict_detail['Фасоль варёная (грамм)'] = {
        'Фасоль варёная (100 грамм)':1 / 100,
        }

metadict_detail['Каша гречневая (грамм)'] = {
        'Каша гречневая (100 грамм)':1 / 100,
        }

metadict_detail['Каша гречневая с грибами (грамм)'] = {
        'Каша гречневая с грибами (100 грамм)':1 / 100,
        }

metadict_detail['Каша горохово-гречневая (грамм)'] = {
        'Каша горохово-гречневая (100 грамм)':1 / 100,
        }

metadict_detail['Каша ячневая (грамм)'] = {
        'Каша ячневая (100 грамм)':1 / 100,
        }

metadict_detail['Каша гороховая (грамм)'] = {
        'Каша гороховая (100 грамм)':1 / 100,
        }

metadict_detail['Пюре гороховое с пряностями (грамм)'] = {
        'Пюре гороховое с пряностями (100 грамм)':1 / 100,
        }

metadict_detail['Каша чечевичная (грамм)'] = {
        'Каша чечевичная (100 грамм)':1 / 100,
        }

metadict_detail['Каша кукурузно-мучная (грамм)'] = {
        'Каша кукурузно-мучная (100 грамм)':1 / 100,
        }

metadict_detail['Каша кукурузная (грамм)'] = {
        'Каша кукурузная (100 грамм)':1 / 100,
        }

metadict_detail['Каша кукурузная с фруктами (грамм)'] = {
        'Каша кукурузная с фруктами (100 грамм)':1 / 100,
        }

metadict_detail['Каша кукурузная с сухофруктами (грамм)'] = {
        'Каша кукурузная с сухофруктами (100 грамм)':1 / 100,
        }

metadict_detail['Крем заварной (грамм)'] = {
        'Крем заварной (100 грамм)':1 / 100,
        }

metadict_detail['Крем кленовый (грамм)'] = {
        'Крем кленовый (100 грамм)':1 / 100,
        }

metadict_detail['Крем лимонный (грамм)'] = {
        'Крем лимонный (100 грамм)':1 / 100,
        }

metadict_detail['Крем масленый (грамм)'] = {
        'Крем масленый (100 грамм)':1 / 100,
        }

metadict_detail['Маргарин соевый (грамм)'] = {
        'Маргарин соевый (100 грамм)':1 / 100,
        }

metadict_detail['Масло арахисовое (грамм)'] = {
        'Масло арахисовое (100 грамм)':1 / 100,
        }

metadict_detail['Паста арахисовая (грамм)'] = {
        'Паста арахисовая (100 грамм)':1 / 100,
        }

metadict_detail['Паста пекановая (грамм)'] = {
        'Паста пекановая (100 грамм)':1 / 100,
        }

metadict_detail['Масло соевое (грамм)'] = {
        'Масло соевое (100 грамм)':1 / 100,
        }

metadict_detail['Масло подсолнечное (грамм)'] = {
        'Масло подсолнечное (100 грамм)':1 / 100,
        }

metadict_detail['Масло оливковое (грамм)'] = {
        'Масло оливковое (100 грамм)':1 / 100,
        }

metadict_detail['Масло ароматизированное для щей (грамм)'] = {
        'Масло ароматизированное для щей (100 грамм)':1 / 100,
        }

metadict_detail['Масло ароматизированное для овощей (грамм)'] = {
        'Масло ароматизированное для овощей (100 грамм)':1 / 100,
        }

metadict_detail['Масло ароматизированное для бобов (грамм)'] = {
        'Масло ароматизированное для бобов (100 грамм)':1 / 100,
        }

metadict_detail['Масло ароматизированное для картофеля (грамм)'] = {
        'Масло ароматизированное для картофеля (100 грамм)':1 / 100,
        }

metadict_detail['Масло льняное (грамм)'] = {
        'Масло льняное (100 грамм)':1 / 100,
        }

metadict_detail['Масло кунжутное (грамм)'] = {
        'Масло кунжутное (100 грамм)':1 / 100,
        }

metadict_detail['Масло конопляное (грамм)'] = {
        'Масло конопляное (100 грамм)':1 / 100,
        }

metadict_detail['Масло соевое (грамм)'] = {
        'Масло соевое (100 грамм)':1 / 100,
        }

metadict_detail['Сахарная пудра (грамм)'] = {
        'Сахарная пудра (100 грамм)':1 / 100,
        }

metadict_detail['Сахар-песок (грамм)'] = {
        'Сахар-песок (100 грамм)':1 / 100,
        }

metadict_detail['Сахар свекловичный (грамм)'] = {
        'Сахар свекловичный-сырец (100 грамм)':1 / 100,
        }

metadict_detail['Сахар тростниковый (грамм)'] = {
        'Сахар тростниковый (100 грамм)':1 / 100,
        }

metadict_detail['Сироп сахарный (грамм)'] = {
        'Сироп сахарный (100 грамм)':1 / 100,
        }

metadict_detail['Сироп лимонный (грамм)'] = {
        'Сироп лимонный (100 грамм)':1 / 100,
        }

metadict_detail['Сироп яблочный (грамм)'] = {
        'Сироп яблочный (100 грамм)':1 / 100,
        }

metadict_detail['Сок яблочный (грамм)'] = {
        'Сок яблочный (100 грамм)':1 / 100,
        }

metadict_detail['Сок лимонный (грамм)'] = {
        'Сок лимонный (100 грамм)':1 / 100,
        }

metadict_detail['Сок виноградный (грамм)'] = {
        'Сок виноградный (100 грамм)':1 / 100,
        }

metadict_detail['Сок ревеня (грамм)'] = {
        'Сок ревеня (100 грамм)':1 / 100,
        }

metadict_detail['Сироп кленовый (грамм)'] = {
        'Сироп кленовый (100 грамм)':1 / 100,
        }

metadict_detail['Шоколад горький (грамм)'] = {
        'Шоколад горький (100 грамм)':1 / 100,
        }

metadict_detail['Какао-порошок (грамм)'] = {
        'Какао-порошок (100 грамм)':1 / 100,
        }

metadict_detail['Какао-масло (грамм)'] = {
        'Какао-масло (100 грамм)':1 / 100,
        }

metadict_detail['Какао-бобы (грамм)'] = {
        'Какао-бобы (100 грамм)':1 / 100,
        }

metadict_detail['Мёд жидкий (грамм)'] = {
        'Мёд жидкий (100 грамм)':1 / 100,
        }

metadict_detail['Мёд засахаренный (грамм)'] = {
        'Мёд засахаренный (100 грамм)':1 / 100,
        }

metadict_detail['Кисель яблочный (грамм)'] = {
        'Кисель яблочный (100 грамм)':1 / 100,
        }

metadict_detail['Кисель из ревеня (грамм)'] = {
        'Кисель из ревеня (100 грамм)':1 / 100,
        }

metadict_detail['Варенье одуванчиковое (грамм)'] = {
        'Варенье одуванчиковое (100 грамм)':1 / 100,
        }

metadict_detail['Варенье земляничное (грамм)'] = {
        'Варенье земляничное (100 грамм)':1 / 100,
        }

metadict_detail['Варенье смородиновое (грамм)'] = {
        'Варенье смородиновое (100 грамм)':1 / 100,
        }

metadict_detail['Компот из сухофруктов (грамм)'] = {
        'Компот из сухофруктов (100 грамм)':1 / 100,
        }

metadict_detail['Компот из свежего ревеня (грамм)'] = {
        'Компот из свежего ревеня (100 грамм)':1 / 100,
        }

metadict_detail['Компот из свежей вишни (грамм)'] = {
        'Компот из свежей вишни (100 грамм)':1 / 100,
        }

metadict_detail['Компот из свежих персиков (грамм)'] = {
        'Компот из свежих персиков (100 грамм)':1 / 100,
        }

metadict_detail['Компот черничный (грамм)'] = {
        'Компот черничный (100 грамм)':1 / 100,
        }

metadict_detail['Вино красное сухое (грамм)'] = {
        'Вино красное сухое (100 грамм)':1 / 100,
        }

metadict_detail['Джем яблочный (грамм)'] = {
        'Джем яблочный (100 грамм)':1 / 100,
        }

metadict_detail['Джем из ревеня (грамм)'] = {
        'Джем из ревеня (100 грамм)':1 / 100,
        }

metadict_detail['Сидр яблочный (грамм)'] = {
        'Сидр яблочный (100 грамм)':1 / 100,
        }

metadict_detail['Сидр грушевый (грамм)'] = {
        'Сидр грушевый (100 грамм)':1 / 100,
        }

metadict_detail['Уксус яблочный 3% (грамм)'] = {
        'Уксус яблочный 3% (100 грамм)':1 / 100,
        }

metadict_detail['Уксус яблочный 6% (грамм)'] = {
        'Уксус яблочный 6% (100 грамм)':1 / 100,
        }

metadict_detail['Уксус виноградный 6% (грамм)'] = {
        'Уксус виноградный 6% (100 грамм)':1 / 100,
        }

metadict_detail['Яблоко мочёное (грамм)'] = {
        'Яблоко мочёное (100 грамм)':1 / 100,
        }

metadict_detail['Груша мочёная (грамм)'] = {
        'Груша мочёная (100 грамм)':1 / 100,
        }

metadict_detail['Слива мочёная (грамм)'] = {
        'Слива мочёная (100 грамм)':1 / 100,
        }

metadict_detail['Капуста квашеная (грамм)'] = {
        'Капуста квашеная (100 грамм)':1 / 100,
        }

metadict_detail['Капуста квашеная с соевым соусом (грамм)'] = {
        'Капуста квашеная с соевым соусом (100 грамм)':1 / 100,
        }

metadict_detail['Капуста квашено-тушёная (грамм)'] = {
        'Капуста квашено-тушёная (100 грамм)':1 / 100,
        }

metadict_detail['Капуста тушёная (грамм)'] = {
        'Капуста тушёная (100 грамм)':1 / 100,
        }

metadict_detail['Капуста варёная с пряностями (грамм)'] = {
        'Капуста варёная с пряностями (100 грамм)':1 / 100,
        }

metadict_detail['Капуста обжаренная в сухарях (грамм)'] = {
        'Капуста обжаренная в сухарях (100 грамм)':1 / 100,
        }

metadict_detail['Винегрет фруктово-овощной (грамм)'] = {
        'Винегрет фруктово-овощной (100 грамм)':1 / 100,
        }

metadict_detail['Винегрет с боровиками (грамм)'] = {
        'Винегрет с боровиками (100 грамм)':1 / 100,
        }

metadict_detail['Винегрет овощной (грамм)'] = {
        'Винегрет овощной (100 грамм)':1 / 100,
        }

metadict_detail['Салат зелёный с томатами (грамм)'] = {
        'Салат зелёный с томатами (100 грамм)':1 / 100,
        }

metadict_detail['Салат томатный со сладким перцем (грамм)'] = {
        'Салат томатный со сладким перцем (100 грамм)':1 / 100,
        }

metadict_detail['Салат из морской капусты (грамм)'] = {
        'Салат из морской капусты (100 грамм)':1 / 100,
        }

metadict_detail['Салат огуречный с соевым соусом (грамм)'] = {
        'Салат огуречный с соевым соусом (100 грамм)':1 / 100,
        }

metadict_detail['Салат из брокколи (грамм)'] = {
        'Салат из брокколи (100 грамм)':1 / 100,
        }

metadict_detail['Салат из варёной спаржи (грамм)'] = {
        'Салат из варёной спаржи (100 грамм)':1 / 100,
        }

metadict_detail['Салат из квашеной капусты (грамм)'] = {
        'Салат из квашеной капусты (100 грамм)':1 / 100,
        }

metadict_detail['Салат из варёной свёклы (грамм)'] = {
        'Салат из варёной свёклы (100 грамм)':1 / 100,
        }

metadict_detail['Салат из консервированных кабачков (грамм)'] = {
        'Салат из консервированных кабачков (100 грамм)':1 / 100,
        }

metadict_detail['Свёкла квашеная (грамм)'] = {
        'Свёкла квашеная (100 грамм)':1 / 100,
        }

metadict_detail['Кабачок консервированный (грамм)'] = {
        'Кабачок консервированный (100 грамм)':1 / 100,
        }

metadict_detail['Огурцы солёные (грамм)'] = {
        'Огурцы солёные (100 грамм)':1 / 100,
        }

metadict_detail['Томаты солёные (грамм)'] = {
        'Томаты солёные (100 грамм)':1 / 100,
        }

metadict_detail['Яблоко печёное с мёдом (грамм)'] = {
        'Яблоко печёное с мёдом (100 грамм)':1 / 100,
        }

metadict_detail['Свёкла печёная (грамм)'] = {
        'Свёкла печёная (100 грамм)':1 / 100,
        }

metadict_detail['Свёкла печёная с фруктами (грамм)'] = {
        'Свёкла печёная с фруктами (100 грамм)':1 / 100,
        }

metadict_detail['Свёкла печёная с ягодами (грамм)'] = {
        'Свёкла печёная с ягодами (100 грамм)':1 / 100,
        }

metadict_detail['Свёкла печёная с кресс-салатом (грамм)'] = {
        'Свёкла печёная с кресс-салатом (100 грамм)':1 / 100,
        }

metadict_detail['Свёкла фаршированная боровиками (грамм)'] = {
        'Свёкла фаршированная боровиками (100 грамм)':1 / 100,
        }

metadict_detail['Тыква варёная (грамм)'] = {
        'Тыква варёная (100 грамм)':1 / 100,
        }

metadict_detail['Тыква печёная (грамм)'] = {
        'Тыква печёная (100 грамм)':1 / 100,
        }

metadict_detail['Тыква фаршированная картофелем с пряностями (грамм)'] = {
        'Тыква фаршированная картофелем с пряностями (100 грамм)':1 / 100,
        }

metadict_detail['Тыква фаршированная лечо и чечевицей (грамм)'] = {
        'Тыква фаршированная лечо и чечевицей (100 грамм)':1 / 100,
        }

metadict_detail['Тыква фаршированная гречкой (грамм)'] = {
        'Тыква фаршированная гречкой (100 грамм)':1 / 100,
        }

metadict_detail['Тыква тушёная (грамм)'] = {
        'Тыква тушёная (100 грамм)':1 / 100,
        }

metadict_detail['Батат варёный (грамм)'] = {
        'Батат варёный (100 грамм)':1 / 100,
        }

metadict_detail['Свёкла варёная (грамм)'] = {
        'Свёкла варёная (100 грамм)':1 / 100,
        }

metadict_detail['Морковь маринованная (грамм)'] = {
        'Морковь маринованная (100 грамм)':1 / 100,
        }

metadict_detail['Морковь варёная (грамм)'] = {
        'Морковь варёная (100 грамм)':1 / 100,
        }

metadict_detail['Морковь печёная (грамм)'] = {
        'Морковь печёная (100 грамм)':1 / 100,
        }

metadict_detail['Морковь тушёная (грамм)'] = {
        'Морковь тушёная (100 грамм)':1 / 100,
        }

metadict_detail['Морковь обжаренная (грамм)'] = {
        'Морковь обжаренная (100 грамм)':1 / 100,
        }

metadict_detail['Морковь в медовой глазури (грамм)'] = {
        'Морковь в медовой глазури (100 грамм)':1 / 100,
        }

metadict_detail['Репа варёная (грамм)'] = {
        'Репа варёная (100 грамм)':1 / 100,
        }

metadict_detail['Лук варёный (грамм)'] = {
        'Лук варёный (100 грамм)':1 / 100,
        }

metadict_detail['Лук обжаренный (грамм)'] = {
        'Лук обжаренный (100 грамм)':1 / 100,
        }

metadict_detail['Чай травяной (грамм)'] = {
        'Чай травяной (100 грамм)':1 / 100,
        }

metadict_detail['Чай травяной с сахаром (грамм)'] = {
        'Чай травяной с сахаром (100 грамм)':1 / 100,
        }

metadict_detail['Чай травяной с мёдом (грамм)'] = {
        'Чай травяной с мёдом (100 грамм)':1 / 100,
        }

metadict_detail['Чай травяной с кленовым сиропом (грамм)'] = {
        'Чай травяной с кленовым сиропом (100 грамм)':1 / 100,
        }

metadict_detail['Чай чёрный (грамм)'] = {
        'Чай чёрный (100 грамм)':1 / 100,
        }

metadict_detail['Чай чёрный с сахаром (грамм)'] = {
        'Чай чёрный с сахаром (100 грамм)':1 / 100,
        }

metadict_detail['Чай чёрный с мёдом (грамм)'] = {
        'Чай чёрный с мёдом (100 грамм)':1 / 100,
        }

metadict_detail['Чай чёрный с кленовым сиропом (грамм)'] = {
        'Чай чёрный с кленовым сиропом (100 грамм)':1 / 100,
        }

metadict_detail['Квас ржаной имбирно-яблочный (грамм)'] = {
        'Квас ржаной имбирно-яблочный (100 грамм)':1 / 100,
        }

metadict_detail['Квас ржаной хлебный (грамм)'] = {
        'Квас ржаной хлебный (100 грамм)':1 / 100,
        }

metadict_detail['Эль имбирный (грамм)'] = {
        'Эль имбирный (100 грамм)':1 / 100,
        }

metadict_detail['Заправка для салатов медово-горчичная (грамм)'] = {
        'Заправка для салатов медово-горчичная (100 грамм)':1 / 100,
        }

metadict_detail['Заправка для салатов на соевом соусе (грамм)'] = {
        'Заправка для салатов на соевом соусе (100 грамм)':1 / 100,
        }

metadict_detail['Заправка для салатов на подсолнечном масле (грамм)'] = {
        'Заправка для салатов на подсолнечном масле (100 грамм)':1 / 100,
        }

metadict_detail['Заправка для салатов на конопляном масле (грамм)'] = {
        'Заправка для салатов на конопляном масле (100 грамм)':1 / 100,
        }

metadict_detail['Заправка для салатов на оливковом масле (грамм)'] = {
        'Заправка для салатов на оливковом масле (100 грамм)':1 / 100,
        }

metadict_detail['Рассол для квашения капусты (грамм)'] = {
        'Рассол для квашения капусты (100 грамм)':1 / 100,
        }

metadict_detail['Рассол для консервации овощей (грамм)'] = {
        'Рассол для консервации овощей (100 грамм)':1 / 100,
        }

metadict_detail['Маринад для консервации грибов (грамм)'] = {
        'Маринад для консервации грибов (100 грамм)':1 / 100,
        }

metadict_detail['Рассол для мочения фруктов (грамм)'] = {
        'Рассол для мочения фруктов (100 грамм)':1 / 100,
        }

metadict_detail['Вода кипячёная (грамм)'] = {
        'Вода кипячёная (100 грамм)':1 / 100,
        }

metadict_detail['Вода для готовки (грамм)'] = {
        'Вода для готовки (100 грамм)':1 / 100,
        }

#----
# Пища многокомпонентная (100 грамм --> килограмм):

metadict_detail['Североморские летние фрукты (100 грамм)'] = {
        'Североморские летние фрукты (килограмм)':1 / 10,
        }

metadict_detail['Среднеземные летние фрукты (100 грамм)'] = {
        'Среднеземные летние фрукты (килограмм)':1 / 10,
        }

metadict_detail['Южноморские летние фрукты (100 грамм)'] = {
        'Южноморские летние фрукты (килограмм)':1 / 10,
        }

metadict_detail['Североморские осенние фрукты (100 грамм)'] = {
        'Североморские осенние фрукты (килограмм)':1 / 10,
        }

metadict_detail['Среднеземные осенние фрукты (100 грамм)'] = {
        'Среднеземные осенние фрукты (килограмм)':1 / 10,
        }

metadict_detail['Южноморские осенние фрукты (100 грамм)'] = {
        'Южноморские осенние фрукты (килограмм)':1 / 10,
        }

metadict_detail['Масло ароматизированное для щей (100 грамм)'] = {
        'Масло ароматизированное для щей (килограмм)':1 / 10,
        }

metadict_detail['Масло ароматизированное для овощей (100 грамм)'] = {
        'Масло ароматизированное для овощей (килограмм)':1 / 10,
        }

metadict_detail['Масло ароматизированное для бобов (100 грамм)'] = {
        'Масло ароматизированное для бобов (килограмм)':1 / 10,
        }

metadict_detail['Масло ароматизированное для картофеля (100 грамм)'] = {
        'Масло ароматизированное для картофеля (килограмм)':1 / 10,
        }

metadict_detail['Пряности для щей (100 грамм)'] = {
        'Пряности для щей (килограмм)':1 / 10,
        }

metadict_detail['Пряности букета гарни с петрушкой (100 грамм)'] = {
        'Пряности букета гарни с петрушкой (килограмм)':1 / 10,
        }

metadict_detail['Пряности букета гарни с розмарином (100 грамм)'] = {
        'Пряности букета гарни с розмарином (килограмм)':1 / 10,
        }

metadict_detail['Пряности прованские (100 грамм)'] = {
        'Пряности прованские (килограмм)':1 / 10,
        }

metadict_detail['Пряности для тыквы (100 грамм)'] = {
        'Пряности для тыквы (килограмм)':1 / 10,
        }

metadict_detail['Пряности для бобовых v1 (100 грамм)'] = {
        'Пряности для бобовых v1 (килограмм)':1 / 10,
        }

metadict_detail['Пряности для бобовых v2 (100 грамм)'] = {
        'Пряности для бобовых v2 (килограмм)':1 / 10,
        }

metadict_detail['Пряности для овощного маринада с тмином (100 грамм)'] = {
        'Пряности для овощного маринада с тмином (килограмм)':1 / 10,
        }

metadict_detail['Пряности для овощного маринада (100 грамм)'] = {
        'Пряности для овощного маринада (килограмм)':1 / 10,
        }

metadict_detail['Пряности для фруктового маринада (100 грамм)'] = {
        'Пряности для фруктового маринада (килограмм)':1 / 10,
        }

metadict_detail['Пряности нежного карри (100 грамм)'] = {
        'Пряности нежного карри (килограмм)':1 / 10,
        }

metadict_detail['Пряности гарам масала (100 грамм)'] = {
        'Пряности гарам масала (килограмм)':1 / 10,
        }

metadict_detail['Пряности кондитерские (100 грамм)'] = {
        'Пряности кондитерские (килограмм)':1 / 10,
        }

metadict_detail['Пряности для овощей из восьми растений (100 грамм)'] = {
        'Пряности для овощей из восьми растений (килограмм)':1 / 10,
        }

metadict_detail['Пряности для овощей из трёх растений (100 грамм)'] = {
        'Пряности для овощей из трёх растений (килограмм)':1 / 10,
        }

metadict_detail['Пряности для овощей из пяти растений (100 грамм)'] = {
        'Пряности для овощей из пяти растений (килограмм)':1 / 10,
        }

metadict_detail['Пряности пряничные (100 грамм)'] = {
        'Пряности пряничные (килограмм)':1 / 10,
        }

metadict_detail['Пряности хмели-сунели (100 грамм)'] = {
        'Пряности хмели-сунели (килограмм)':1 / 10,
        }

metadict_detail['Ботвинья-свекольник (100 грамм)'] = {
        'Ботвинья-свекольник (килограмм)':1 / 10,
        }

metadict_detail['Заправка зелёная для ботвиньи (100 грамм)'] = {
        'Заправка зелёная для ботвиньи (килограмм)':1 / 10,
        }

metadict_detail['Заправка овощная для ботвиньи (100 грамм)'] = {
        'Заправка овощная для ботвиньи (килограмм)':1 / 10,
        }

metadict_detail['Основа квасная для ботвиньи (100 грамм)'] = {
        'Основа квасная для ботвиньи (килограмм)':1 / 10,
        }

metadict_detail['Крем маслено-горчичный (100 грамм)'] = {
        'Крем маслено-горчичный (килограмм)':1/10,
        }

metadict_detail['Горчица столовая (100 грамм)'] = {
        'Горчица столовая (килограмм)':1/10,
        }

metadict_detail['Крем заварной (100 грамм)'] = {
        'Крем заварной (килограмм)':1/10,
        }

metadict_detail['Крем кленовый (100 грамм)'] = {
        'Крем кленовый (килограмм)':1/10,
        }

metadict_detail['Крем лимонный (100 грамм)'] = {
        'Крем лимонный (килограмм)':1/10,
        }

metadict_detail['Крем масленый (100 грамм)'] = {
        'Крем масленый (килограмм)':1/10,
        }

metadict_detail['Маргарин соевый (100 грамм)'] = {
        'Маргарин соевый (килограмм)':1/10,
        }

metadict_detail['Мёд засахаренный (100 грамм)'] = {
        'Мёд засахаренный (килограмм)':1/10,
        }

metadict_detail['Хрен тёртый (100 грамм)'] = {
        'Хрен тёртый (килограмм)':1 / 10,
        }

metadict_detail['Зелень укропа сушёная (100 грамм)'] = {
        'Зелень укропа сушёная (килограмм)':1 / 10,
        }

metadict_detail['Чабер сушёный (100 грамм)'] = {
        'Чабер сушёный (килограмм)':1 / 10,
        }

metadict_detail['Чеснок сушёный (100 грамм)'] = {
        'Чеснок сушёный (килограмм)':1 / 10,
        }

metadict_detail['Черника сушёная (100 грамм)'] = {
        'Черника сушёная (килограмм)':1 / 10,
        }

metadict_detail['Смородина сушёная (100 грамм)'] = {
        'Смородина сушёная (килограмм)':1 / 10,
        }

metadict_detail['Яблоко сушёное (100 грамм)'] = {
        'Яблоко сушёное (килограмм)':1 / 10,
        }

metadict_detail['Вишня сушёная (100 грамм)'] = {
        'Вишня сушёная (килограмм)':1 / 10,
        }

metadict_detail['Персик сушёный (100 грамм)'] = {
        'Персик сушёный (килограмм)':1 / 10,
        }

metadict_detail['Абрикос сушёный (100 грамм)'] = {
        'Абрикос сушёный (килограмм)':1 / 10,
        }

metadict_detail['Слива сушёная (100 грамм)'] = {
        'Слива сушёная (килограмм)':1 / 10,
        }

metadict_detail['Груша сушёная (100 грамм)'] = {
        'Груша сушёная (килограмм)':1 / 10,
        }

metadict_detail['Инжир сушёный (100 грамм)'] = {
        'Инжир сушёный (килограмм)':1 / 10,
        }

metadict_detail['Томаты сушёные (100 грамм)'] = {
        'Томаты сушёные (килограмм)':1 / 10,
        }

metadict_detail['Виноград сушёный (100 грамм)'] = {
        'Виноград сушёный (килограмм)':1 / 10,
        }

metadict_detail['Лавровый лист сушёный (100 грамм)'] = {
        'Лавровый лист сушёный (килограмм)':1 / 10,
        }

metadict_detail['Вёшенки варёные (100 грамм)'] = {
        'Вёшенки варёные (килограмм)':1 / 10,
        }

metadict_detail['Вёшенки тушёные (100 грамм)'] = {
        'Вёшенки тушёные (килограмм)':1 / 10,
        }

metadict_detail['Вёшенки жареные (100 грамм)'] = {
        'Вёшенки жареные (килограмм)':1 / 10,
        }

metadict_detail['Шампиньоны варёные (100 грамм)'] = {
        'Шампиньоны варёные (килограмм)':1 / 10,
        }

metadict_detail['Шампиньоны тушёные (100 грамм)'] = {
        'Шампиньоны тушёные (килограмм)':1 / 10,
        }

metadict_detail['Шампиньоны тушёные консервированные (100 грамм)'] = {
        'Шампиньоны тушёные консервированные (килограмм)':1 / 10,
        }

metadict_detail['Шампиньоны жареные (100 грамм)'] = {
        'Шампиньоны жареные (килограмм)':1 / 10,
        }

metadict_detail['Соус соевый (100 грамм)'] = {
        'Соус соевый (килограмм)':1 / 10,
        }

metadict_detail['Темпе (100 грамм)'] = {
        'Темпе (килограмм)':1 / 10,
        }

metadict_detail['Темпе обжаренный (100 грамм)'] = {
        'Темпе обжаренный (килограмм)':1 / 10,
        }

metadict_detail['Соя варёная (100 грамм)'] = {
        'Соя варёная (килограмм)':1 / 10,
        }

metadict_detail['Соя замоченная (100 грамм)'] = {
        'Соя замоченная (килограмм)':1 / 10,
        }

metadict_detail['Соус томатный (100 грамм)'] = {
        'Соус томатный (килограмм)':1 / 10,
        }

metadict_detail['Соус томатный консервированный (100 грамм)'] = {
        'Соус томатный консервированный (килограмм)':1 / 10,
        }

metadict_detail['Соус баклажанный (100 грамм)'] = {
        'Соус баклажанный (килограмм)':1 / 10,
        }

metadict_detail['Соус песто с томатами (100 грамм)'] = {
        'Соус песто с томатами (килограмм)':1 / 10,
        }

metadict_detail['Боровики сушёные (100 грамм)'] = {
        'Боровики сушёные (килограмм)':1 / 10,
        }

metadict_detail['Боровики сушёные (100 грамм)'] = {
        'Боровики сушёные (килограмм)':1 / 10,
        }

metadict_detail['Боровики маринованные (100 грамм)'] = {
        'Боровики маринованные (килограмм)':1 / 10,
        }

metadict_detail['Закуска из боровиков с луком (100 грамм)'] = {
        'Закуска из боровиков с луком (килограмм)':1 / 10,
        }

metadict_detail['Боровики жареные (100 грамм)'] = {
        'Боровики жареные (килограмм)':1 / 10,
        }

metadict_detail['Боровики тушёные (100 грамм)'] = {
        'Боровики тушёные (килограмм)':1 / 10,
        }

metadict_detail['Боровики варёные (100 грамм)'] = {
        'Боровики варёные (килограмм)':1 / 10,
        }

metadict_detail['Сморчки сушёные (100 грамм)'] = {
        'Сморчки сушёные (килограмм)':1 / 10,
        }

metadict_detail['Сморчки жареные (100 грамм)'] = {
        'Сморчки жареные (килограмм)':1 / 10,
        }

metadict_detail['Сморчки варёные (100 грамм)'] = {
        'Сморчки варёные (килограмм)':1 / 10,
        }

metadict_detail['Сморчки тушёные (100 грамм)'] = {
        'Сморчки тушёные (килограмм)':1 / 10,
        }

metadict_detail['Чечевица варёная (100 грамм)'] = {
        'Чечевица варёная (килограмм)':1/10,
        }

metadict_detail['Чечевица тушёная (100 грамм)'] = {
        'Чечевица тушёная (килограмм)':1/10,
        }

metadict_detail['Чечевица замоченная (100 грамм)'] = {
        'Чечевица замоченная (килограмм)':1/10,
        }

metadict_detail['Горох варёный (100 грамм)'] = {
        'Горох варёный (килограмм)':1/10,
        }

metadict_detail['Горох замоченный (100 грамм)'] = {
        'Горох замоченный (килограмм)':1/10,
        }

metadict_detail['Фасоль замоченная (100 грамм)'] = {
        'Фасоль замоченная (килограмм)':1 / 10,
        }

metadict_detail['Продел гречневый (100 грамм)'] = {
        'Продел гречневый (килограмм)':1 / 10,
        }

metadict_detail['Чай травяной (100 грамм)'] = {
        'Чай травяной (килограмм)':1 / 10,
        }

metadict_detail['Чай травяной с сахаром (100 грамм)'] = {
        'Чай травяной с сахаром (килограмм)':1 / 10,
        }

metadict_detail['Чай травяной с мёдом (100 грамм)'] = {
        'Чай травяной с мёдом (килограмм)':1 / 10,
        }

metadict_detail['Чай травяной с кленовым сиропом (100 грамм)'] = {
        'Чай травяной с кленовым сиропом (килограмм)':1 / 10,
        }

metadict_detail['Чай чёрный (100 грамм)'] = {
        'Чай чёрный (килограмм)':1 / 10,
        }

metadict_detail['Чай чёрный с сахаром (100 грамм)'] = {
        'Чай чёрный с сахаром (килограмм)':1 / 10,
        }

metadict_detail['Чай чёрный с мёдом (100 грамм)'] = {
        'Чай чёрный с мёдом (килограмм)':1 / 10,
        }

metadict_detail['Чай чёрный с кленовым сиропом (100 грамм)'] = {
        'Чай чёрный с кленовым сиропом (килограмм)':1 / 10,
        }

metadict_detail['Кисель яблочный (100 грамм)'] = {
        'Кисель яблочный (килограмм)':1 / 10,
        }

metadict_detail['Кисель из ревеня (100 грамм)'] = {
        'Кисель из ревеня (килограмм)':1 / 10,
        }

metadict_detail['Варенье одуванчиковое (100 грамм)'] = {
        'Варенье одуванчиковое (килограмм)':1 / 10,
        }

metadict_detail['Варенье земляничное (100 грамм)'] = {
        'Варенье земляничное (килограмм)':1 / 10,
        }

metadict_detail['Варенье смородиновое (100 грамм)'] = {
        'Варенье смородиновое (килограмм)':1 / 10,
        }

metadict_detail['Компот из сухофруктов (100 грамм)'] = {
        'Компот из сухофруктов (килограмм)':1 / 10,
        }

metadict_detail['Компот из свежего ревеня (100 грамм)'] = {
        'Компот из свежего ревеня (килограмм)':1 / 10,
        }

metadict_detail['Компот из свежей вишни (100 грамм)'] = {
        'Компот из свежей вишни (килограмм)':1 / 10,
        }

metadict_detail['Компот из свежих персиков (100 грамм)'] = {
        'Компот из свежих персиков (килограмм)':1 / 10,
        }

metadict_detail['Компот черничный (100 грамм)'] = {
        'Компот черничный (килограмм)':1 / 10,
        }

metadict_detail['Яблоко печёное с мёдом (100 грамм)'] = {
        'Яблоко печёное с мёдом (килограмм)':1 / 10,
        }

metadict_detail['Репа варёная (100 грамм)'] = {
        'Репа варёная (килограмм)':1 / 10,
        }

metadict_detail['Репа печёная (100 грамм)'] = {
        'Репа печёная (килограмм)':1 / 10,
        }

metadict_detail['Репа фаршированная горохом (100 грамм)'] = {
        'Репа фаршированная горохом (килограмм)':1 / 10,
        }

metadict_detail['Репа печёная с ягодами (100 грамм)'] = {
        'Репа печёная с ягодами (килограмм)':1 / 10,
        }

metadict_detail['Брюква печёная (100 грамм)'] = {
        'Брюква печёная (килограмм)':1 / 10,
        }

metadict_detail['Брюква печёная с кедровыми орехами (100 грамм)'] = {
        'Брюква печёная с кедровыми орехами (килограмм)':1 / 10,
        }

metadict_detail['Свёкла печёная (100 грамм)'] = {
        'Свёкла печёная (килограмм)':1 / 10,
        }

metadict_detail['Свёкла печёная с фруктами (100 грамм)'] = {
        'Свёкла печёная с фруктами (килограмм)':1 / 10,
        }

metadict_detail['Свёкла печёная с ягодами (100 грамм)'] = {
        'Свёкла печёная с ягодами (килограмм)':1 / 10,
        }

metadict_detail['Свёкла печёная с кресс-салатом (100 грамм)'] = {
        'Свёкла печёная с кресс-салатом (килограмм)':1 / 10,
        }

metadict_detail['Свёкла фаршированная боровиками (100 грамм)'] = {
        'Свёкла фаршированная боровиками (килограмм)':1 / 10,
        }

metadict_detail['Рагу овощное (100 грамм)'] = {
        'Рагу овощное (килограмм)':1 / 10,
        }

metadict_detail['Лечо со сладким перцем (100 грамм)'] = {
        'Лечо со сладким перцем (килограмм)':1 / 10,
        }

metadict_detail['Лечо со сладким перцем консервированное (100 грамм)'] = {
        'Лечо со сладким перцем консервированное (килограмм)':1 / 10,
        }

metadict_detail['Перец фаршированный овощами (100 грамм)'] = {
        'Перец фаршированный овощами (килограмм)':1 / 10,
        }

metadict_detail['Перец печёный (100 грамм)'] = {
        'Перец печёный (килограмм)':1 / 10,
        }

metadict_detail['Перец обжаренный (100 грамм)'] = {
        'Перец обжаренный (килограмм)':1 / 10,
        }

metadict_detail['Баклажан печёный (100 грамм)'] = {
        'Баклажан печёный (килограмм)':1 / 10,
        }

metadict_detail['Баклажан обжаренный с овощами (100 грамм)'] = {
        'Баклажан обжаренный с овощами (килограмм)':1 / 10,
        }

metadict_detail['Кабачок печёный (100 грамм)'] = {
        'Кабачок печёный (килограмм)':1 / 10,
        }

metadict_detail['Голубцы фаршированные овощами (100 грамм)'] = {
        'Голубцы фаршированные овощами (килограмм)':1 / 10,
        }

metadict_detail['Фарш овощной (100 грамм)'] = {
        'Фарш овощной (килограмм)':1 / 10,
        }

metadict_detail['Тыква варёная (100 грамм)'] = {
        'Тыква варёная (килограмм)':1 / 10,
        }

metadict_detail['Тыква печёная (100 грамм)'] = {
        'Тыква печёная (килограмм)':1 / 10,
        }

metadict_detail['Тыква фаршированная картофелем с пряностями (100 грамм)'] = {
        'Тыква фаршированная картофелем с пряностями (килограмм)':1 / 10,
        }

metadict_detail['Тыква фаршированная лечо и чечевицей (100 грамм)'] = {
        'Тыква фаршированная лечо и чечевицей (килограмм)':1 / 10,
        }

metadict_detail['Тыква фаршированная гречкой (100 грамм)'] = {
        'Тыква фаршированная гречкой (килограмм)':1 / 10,
        }

metadict_detail['Тыква тушёная (100 грамм)'] = {
        'Тыква тушёная (килограмм)':1 / 10,
        }

metadict_detail['Спаржа варёная (100 грамм)'] = {
        'Спаржа варёная (килограмм)':1 / 10,
        }

metadict_detail['Брокколи варёные (100 грамм)'] = {
        'Брокколи варёные (килограмм)':1 / 10,
        }

metadict_detail['Брокколи обжаренные (100 грамм)'] = {
        'Брокколи обжаренные (килограмм)':1 / 10,
        }

metadict_detail['Артишоки обжаренные (100 грамм)'] = {
        'Артишоки обжаренные (килограмм)':1 / 10,
        }

metadict_detail['Артишоки варёные (100 грамм)'] = {
        'Артишоки варёные (килограмм)':1 / 10,
        }

metadict_detail['Артишоки тушёные с сельдереем (100 грамм)'] = {
        'Артишоки тушёные с сельдереем (килограмм)':1 / 10,
        }

metadict_detail['Одуванчик варёный (100 грамм)'] = {
        'Одуванчик варёный (килограмм)':1 / 10,
        }

metadict_detail['Одуванчики обжаренные (100 грамм)'] = {
        'Одуванчики обжаренные (килограмм)':1 / 10,
        }

metadict_detail['Одуванчик сушёный (100 грамм)'] = {
        'Одуванчик сушёный (килограмм)':1 / 10,
        }

metadict_detail['Лист смородины сушёный (100 грамм)'] = {
        'Лист смородины сушёный (килограмм)':1 / 10,
        }

metadict_detail['Зелень укропа сушёная (100 грамм)'] = {
        'Зелень укропа сушёная (килограмм)':1 / 10,
        }

metadict_detail['Батат варёный (100 грамм)'] = {
        'Батат варёный (килограмм)':1 / 10,
        }

metadict_detail['Батат печёный (100 грамм)'] = {
        'Батат печёный (килограмм)':1 / 10,
        }

metadict_detail['Батат печёный дольками (100 грамм)'] = {
        'Батат печёный дольками (килограмм)':1 / 10,
        }

metadict_detail['Кукуруза варёная (100 грамм)'] = {
        'Кукуруза варёная (килограмм)':1 / 10,
        }

metadict_detail['Кукуруза печёная с соевым соусом (100 грамм)'] = {
        'Кукуруза печёная с соевым соусом (килограмм)':1 / 10,
        }

metadict_detail['Картофель тушёный с морковью (100 грамм)'] = {
        'Картофель тушёный с морковью (килограмм)':1 / 10,
        }

metadict_detail['Картофель тушёный в соевом соусе (100 грамм)'] = {
        'Картофель тушёный в соевом соусе (килограмм)':1 / 10,
        }

metadict_detail['Картофель тушёный с горошком и пряностями (100 грамм)'] = {
        'Картофель тушёный с горошком и пряностями (килограмм)':1 / 10,
        }

metadict_detail['Картофель тушёный с оливками и лимоном (100 грамм)'] = {
        'Картофель тушёный с оливками и лимоном (килограмм)':1 / 10,
        }

metadict_detail['Картофель тушёный с яблоками (100 грамм)'] = {
        'Картофель тушёный с яблоками (килограмм)':1 / 10,
        }

metadict_detail['Картофель тушёный со спаржей (100 грамм)'] = {
        'Картофель тушёный со спаржей (килограмм)':1 / 10,
        }

metadict_detail['Картофель варёный (100 грамм)'] = {
        'Картофель варёный (килограмм)':1 / 10,
        }

metadict_detail['Картофель печёный (100 грамм)'] = {
        'Картофель печёный (килограмм)':1 / 10,
        }

metadict_detail['Картофель жареный соломкой (100 грамм)'] = {
        'Картофель жареный соломкой (килограмм)':1 / 10,
        }

metadict_detail['Картофель печёный дольками (100 грамм)'] = {
        'Картофель печёный дольками (килограмм)':1 / 10,
        }

metadict_detail['Запеканка картофельная с боровиками (100 грамм)'] = {
        'Запеканка картофельная с боровиками (килограмм)':1 / 10,
        }

metadict_detail['Запеканка картофельная со свёклой (100 грамм)'] = {
        'Запеканка картофельная со свёклой (килограмм)':1 / 10,
        }

metadict_detail['Шарики фасолевые в панировке (100 грамм)'] = {
        'Шарики фасолевые в панировке (килограмм)':1 / 10,
        }

metadict_detail['Шарики чечевичные в панировке (100 грамм)'] = {
        'Шарики чечевичные в панировке (килограмм)':1 / 10,
        }

metadict_detail['Зразы картофельные с боровиками (100 грамм)'] = {
        'Зразы картофельные с боровиками (килограмм)':1 / 10,
        }

metadict_detail['Зразы картофельные со сморчками (100 грамм)'] = {
        'Зразы картофельные со сморчками (килограмм)':1 / 10,
        }

metadict_detail['Суфле брюквенно-морковное (100 грамм)'] = {
        'Суфле брюквенно-морковное (килограмм)':1 / 10,
        }

metadict_detail['Суфле картофельно-тыквенное (100 грамм)'] = {
        'Суфле картофельно-тыквенное (килограмм)':1 / 10,
        }

metadict_detail['Суфле картофельно-морковное (100 грамм)'] = {
        'Суфле картофельно-морковное (килограмм)':1 / 10,
        }

metadict_detail['Суфле картофельно-гороховое (100 грамм)'] = {
        'Суфле картофельно-гороховое (килограмм)':1 / 10,
        }

metadict_detail['Суфле картофельное (100 грамм)'] = {
        'Суфле картофельное (килограмм)':1 / 10,
        }

metadict_detail['Суфле гороховое (100 грамм)'] = {
        'Суфле гороховое (килограмм)':1 / 10,
        }

metadict_detail['Свёкла варёная (100 грамм)'] = {
        'Свёкла варёная (килограмм)':1 / 10,
        }

metadict_detail['Морковь маринованная (100 грамм)'] = {
        'Морковь маринованная (килограмм)':1 / 10,
        }

metadict_detail['Морковь варёная (100 грамм)'] = {
        'Морковь варёная (килограмм)':1 / 10,
        }

metadict_detail['Морковь печёная (100 грамм)'] = {
        'Морковь печёная (килограмм)':1 / 10,
        }

metadict_detail['Морковь тушёная (100 грамм)'] = {
        'Морковь тушёная (килограмм)':1 / 10,
        }

metadict_detail['Морковь обжаренная (100 грамм)'] = {
        'Морковь обжаренная (килограмм)':1 / 10,
        }

metadict_detail['Морковь в медовой глазури (100 грамм)'] = {
        'Морковь в медовой глазури (килограмм)':1 / 10,
        }

metadict_detail['Репа варёная (100 грамм)'] = {
        'Репа варёная (килограмм)':1 / 10,
        }

metadict_detail['Лук варёный (100 грамм)'] = {
        'Лук варёный (килограмм)':1 / 10,
        }

metadict_detail['Лук обжаренный (100 грамм)'] = {
        'Лук обжаренный (килограмм)':1 / 10,
        }

metadict_detail['Щи из квашеной капусты (100 грамм)'] = {
        'Щи из квашеной капусты (килограмм)':1 / 10,
        }

metadict_detail['Щи из квашеной капусты с грибами (100 грамм)'] = {
        'Щи из квашеной капусты с грибами (килограмм)':1 / 10,
        }

metadict_detail['Аквафаба чечевичная (100 грамм)'] = {
        'Аквафаба чечевичная (килограмм)':1 / 10,
        }

metadict_detail['Бульон чечевичный (100 грамм)'] = {
        'Бульон чечевичный (килограмм)':1 / 10,
        }

metadict_detail['Бульон фасолевый (100 грамм)'] = {
        'Бульон фасолевый (килограмм)':1 / 10,
        }

metadict_detail['Пюре из обжаренной фасоли (100 грамм)'] = {
        'Пюре из обжаренной фасоли (килограмм)':1 / 10,
        }

metadict_detail['Пюре картофельное (100 грамм)'] = {
        'Пюре картофельное (килограмм)':1 / 10,
        }

metadict_detail['Пюре брюквенное (100 грамм)'] = {
        'Пюре брюквенное (килограмм)':1 / 10,
        }

metadict_detail['Пюре морковное (100 грамм)'] = {
        'Пюре морковное (килограмм)':1 / 10,
        }

metadict_detail['Пюре бататное (100 грамм)'] = {
        'Пюре бататное (килограмм)':1 / 10,
        }

metadict_detail['Пюре тыквенное (100 грамм)'] = {
        'Пюре тыквенное (килограмм)':1 / 10,
        }

metadict_detail['Суп-лапша с бататом и солёными томатами (100 грамм)'] = {
        'Суп-лапша с бататом и солёными томатами (килограмм)':1 / 10,
        }

metadict_detail['Суп-лапша с кабачком и свежими томатами (100 грамм)'] = {
        'Суп-лапша с кабачком и свежими томатами (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре чечевичный с пряностями (100 грамм)'] = {
        'Суп-пюре чечевичный с пряностями (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре фасолевый с пряностями (100 грамм)'] = {
        'Суп-пюре фасолевый с пряностями (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре гороховый с пряностями (100 грамм)'] = {
        'Суп-пюре гороховый с пряностями (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре картофельный (100 грамм)'] = {
        'Суп-пюре картофельный (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре картофельный с гренками (100 грамм)'] = {
        'Суп-пюре картофельный с гренками (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре картофельный с шампиньонами (100 грамм)'] = {
        'Суп-пюре картофельный с шампиньонами (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре томатный (100 грамм)'] = {
        'Суп-пюре томатный (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре томатный с гренками (100 грамм)'] = {
        'Суп-пюре томатный с гренками (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре из батата со сладким перцем (100 грамм)'] = {
        'Суп-пюре из батата со сладким перцем (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре из корня сельдерея (100 грамм)'] = {
        'Суп-пюре из корня сельдерея (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре из корня сельдерея с гренками (100 грамм)'] = {
        'Суп-пюре из корня сельдерея с гренками (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре морковный (100 грамм)'] = {
        'Суп-пюре морковный (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре морковный с пряностями (100 грамм)'] = {
        'Суп-пюре морковный с пряностями (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре морковный с кремом (100 грамм)'] = {
        'Суп-пюре морковный с кремом (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре свекольный (100 грамм)'] = {
        'Суп-пюре свекольный (килограмм)':1 / 10,
        }

metadict_detail['Суп-пюре свекольный с кремом (100 грамм)'] = {
        'Суп-пюре свекольный с кремом (килограмм)':1 / 10,
        }

metadict_detail['Похлёбка чечевичная (100 грамм)'] = {
        'Похлёбка чечевичная (килограмм)':1 / 10,
        }

metadict_detail['Похлёбка фасолевая (100 грамм)'] = {
        'Похлёбка фасолевая (килограмм)':1 / 10,
        }

metadict_detail['Похлёбка томатная с фасолью (100 грамм)'] = {
        'Похлёбка томатная с фасолью (килограмм)':1 / 10,
        }

metadict_detail['Похлёбка томатная с чечевицей (100 грамм)'] = {
        'Похлёбка томатная с чечевицей (килограмм)':1 / 10,
        }

metadict_detail['Похлёбка картофельная (100 грамм)'] = {
        'Похлёбка картофельная (килограмм)':1 / 10,
        }

metadict_detail['Похлёбка с морской капустой (100 грамм)'] = {
        'Похлёбка с морской капустой (килограмм)':1 / 10,
        }

metadict_detail['Лапша варёная (100 грамм)'] = {
        'Лапша варёная (килограмм)':1 / 10,
        }

metadict_detail['Лапша с томатным соусом (100 грамм)'] = {
        'Лапша с томатным соусом (килограмм)':1 / 10,
        }

metadict_detail['Лапша с соусом песто (100 грамм)'] = {
        'Лапша с соусом песто (килограмм)':1 / 10,
        }

metadict_detail['Лапша с песто и овощами (100 грамм)'] = {
        'Лапша с песто и овощами (килограмм)':1 / 10,
        }

metadict_detail['Лапша с песто и шампиньонами (100 грамм)'] = {
        'Лапша с песто и шампиньонами (килограмм)':1 / 10,
        }

metadict_detail['Лапша с песто и сморчками (100 грамм)'] = {
        'Лапша с песто и сморчками (килограмм)':1 / 10,
        }

metadict_detail['Лапша сушёная (100 грамм)'] = {
        'Лапша сушёная (килограмм)':1 / 10,
        }

metadict_detail['Каша рисовая (100 грамм)'] = {
        'Каша рисовая (килограмм)':1 / 10,
        }

metadict_detail['Каша рисовая с чечевицей (100 грамм)'] = {
        'Каша рисовая с чечевицей (килограмм)':1 / 10,
        }

metadict_detail['Каша рисовая с чечевицей и спаржей (100 грамм)'] = {
        'Каша рисовая с чечевицей и спаржей (килограмм)':1 / 10,
        }

metadict_detail['Каша рисовая с чечевицей и горошком (100 грамм)'] = {
        'Каша рисовая с чечевицей и горошком (килограмм)':1 / 10,
        }

metadict_detail['Каша рисовая с чечевицей и овощами (100 грамм)'] = {
        'Каша рисовая с чечевицей и овощами (килограмм)':1 / 10,
        }

metadict_detail['Каша овсяная (100 грамм)'] = {
        'Каша овсяная (килограмм)':1 / 10,
        }

metadict_detail['Каша овсяная с мёдом (100 грамм)'] = {
        'Каша овсяная с мёдом (килограмм)':1 / 10,
        }

metadict_detail['Каша овсяная с кленовым сиропом (100 грамм)'] = {
        'Каша овсяная с кленовым сиропом (килограмм)':1 / 10,
        }

metadict_detail['Желе лимонное (100 грамм)'] = {
        'Желе лимонное (килограмм)':1 / 10,
        }

metadict_detail['Желе виноградное (100 грамм)'] = {
        'Желе виноградное (килограмм)':1 / 10,
        }

metadict_detail['Желе яблочное (100 грамм)'] = {
        'Желе яблочное (килограмм)':1 / 10,
        }

metadict_detail['Желе из ревеня (100 грамм)'] = {
        'Желе из ревеня (килограмм)':1 / 10,
        }

metadict_detail['Кисель овсяной (100 грамм)'] = {
        'Кисель овсяной (килограмм)':1 / 10,
        }

metadict_detail['Кисель гороховый (100 грамм)'] = {
        'Кисель гороховый (килограмм)':1 / 10,
        }

metadict_detail['Напиток из орехов карии (100 грамм)'] = {
        'Напиток из орехов карии (килограмм)':1 / 10,
        }

metadict_detail['Напиток из орехов карии с мёдом (100 грамм)'] = {
        'Напиток из орехов карии с мёдом (килограмм)':1 / 10,
        }

metadict_detail['Мусс из орехов карии с мёдом (100 грамм)'] = {
        'Мусс из орехов карии с мёдом (килограмм)':1 / 10,
        }

metadict_detail['Чай одуванчиковый (100 грамм)'] = {
        'Чай одуванчиковый (килограмм)':1 / 10,
        }

metadict_detail['Чай одуванчиковый с кленовым сиропом (100 грамм)'] = {
        'Чай одуванчиковый с кленовым сиропом (килограмм)':1 / 10,
        }

metadict_detail['Чай из листьев смородины (100 грамм)'] = {
        'Чай из листьев смородины (килограмм)':1 / 10,
        }

metadict_detail['Напиток рисовый (100 грамм)'] = {
        'Напиток рисовый (килограмм)':1 / 10,
        }

metadict_detail['Напиток овсяной (100 грамм)'] = {
        'Напиток овсяной (килограмм)':1 / 10,
        }

metadict_detail['Напиток овсяной с мёдом (100 грамм)'] = {
        'Напиток овсяной с мёдом (килограмм)':1 / 10,
        }

metadict_detail['Тесто пряничное медовое заварное (100 грамм)'] = {
        'Тесто пряничное медовое заварное (килограмм)':1 / 10,
        }

metadict_detail['Тесто пшеничное дрожжевое (100 грамм)'] = {
        'Тесто пшеничное дрожжевое (килограмм)':1 / 10,
        }

metadict_detail['Тесто пшеничное для пончиков (100 грамм)'] = {
        'Тесто пшеничное для пончиков (килограмм)':1 / 10,
        }

metadict_detail['Тесто пшенично-ячменное дрожжевое (100 грамм)'] = {
        'Тесто пшенично-ячменное дрожжевое (килограмм)':1 / 10,
        }

metadict_detail['Тесто пшенично-соевое дрожжевое (100 грамм)'] = {
        'Тесто пшенично-соевое дрожжевое (килограмм)':1 / 10,
        }

metadict_detail['Тесто пшенично-кукурузное дрожжевое (100 грамм)'] = {
        'Тесто пшенично-кукурузное дрожжевое (килограмм)':1 / 10,
        }

metadict_detail['Тесто пшенично-кукурузное для маффинов (100 грамм)'] = {
        'Тесто пшенично-кукурузное для маффинов (килограмм)':1 / 10,
        }

metadict_detail['Тесто пшенично-гречневое для блинов (100 грамм)'] = {
        'Тесто пшенично-гречневое для блинов (килограмм)':1 / 10,
        }

metadict_detail['Тесто пшеничное дрожжевое для пирогов (100 грамм)'] = {
        'Тесто пшеничное дрожжевое для пирогов (килограмм)':1 / 10,
        }

metadict_detail['Тесто пшенично-овсяное для оладий (100 грамм)'] = {
        'Тесто пшенично-овсяное для оладий (килограмм)':1 / 10,
        }

metadict_detail['Тесто кукурузное для оладий (100 грамм)'] = {
        'Тесто кукурузное для оладий (килограмм)':1 / 10,
        }

metadict_detail['Тесто пшеничное бездрожжевое для пирогов (100 грамм)'] = {
        'Тесто пшеничное бездрожжевое для пирогов (килограмм)':1 / 10,
        }

metadict_detail['Тесто пшеничное бездрожжевое для лапши (100 грамм)'] = {
        'Тесто пшеничное бездрожжевое для лапши (килограмм)':1 / 10,
        }

metadict_detail['Тесто ржаное на закваске (100 грамм)'] = {
        'Тесто ржаное на закваске (килограмм)':1 / 10,
        }

metadict_detail['Опара овсяная (100 грамм)'] = {
        'Опара овсяная (килограмм)':1 / 10,
        }

metadict_detail['Опара пшенично-гречневая (100 грамм)'] = {
        'Опара пшенично-гречневая (килограмм)':1 / 10,
        }

metadict_detail['Опара ржаная (100 грамм)'] = {
        'Опара ржаная (килограмм)':1 / 10,
        }

metadict_detail['Заварка ржаная (100 грамм)'] = {
        'Заварка ржаная (килограмм)':1 / 10,
        }

metadict_detail['Закваска ржаная (100 грамм)'] = {
        'Закваска ржаная (килограмм)':1 / 10,
        }

metadict_detail['Дрожжи жидкие (100 грамм)'] = {
        'Дрожжи жидкие (килограмм)':1 / 10,
        }

metadict_detail['Опара пшеничная (100 грамм)'] = {
        'Опара пшеничная (килограмм)':1 / 10,
        }

metadict_detail['Каша гречневая (100 грамм)'] = {
        'Каша гречневая (килограмм)':1 / 10,
        }

metadict_detail['Каша гречневая с грибами (100 грамм)'] = {
        'Каша гречневая с грибами (килограмм)':1 / 10,
        }

metadict_detail['Каша горохово-гречневая (100 грамм)'] = {
        'Каша горохово-гречневая (килограмм)':1 / 10,
        }

metadict_detail['Каша ячневая (100 грамм)'] = {
        'Каша ячневая (килограмм)':1 / 10,
        }

metadict_detail['Фасоль тушёная (100 грамм)'] = {
        'Фасоль тушёная (килограмм)':1 / 10,
        }

metadict_detail['Фасоль варёная (100 грамм)'] = {
        'Фасоль варёная (килограмм)':1 / 10,
        }

metadict_detail['Каша гороховая (100 грамм)'] = {
        'Каша гороховая (килограмм)':1 / 10,
        }

metadict_detail['Пюре гороховое с пряностями (100 грамм)'] = {
        'Пюре гороховое с пряностями (килограмм)':1 / 10,
        }

metadict_detail['Каша чечевичная (100 грамм)'] = {
        'Каша чечевичная (килограмм)':1 / 10,
        }

metadict_detail['Каша кукурузно-мучная (100 грамм)'] = {
        'Каша кукурузно-мучная (килограмм)':1 / 10,
        }

metadict_detail['Каша кукурузная (100 грамм)'] = {
        'Каша кукурузная (килограмм)':1 / 10,
        }

metadict_detail['Каша кукурузная с фруктами (100 грамм)'] = {
        'Каша кукурузная с фруктами (килограмм)':1 / 10,
        }

metadict_detail['Каша кукурузная с сухофруктами (100 грамм)'] = {
        'Каша кукурузная с сухофруктами (килограмм)':1 / 10,
        }

metadict_detail['Хлеб ржаной домашний (100 грамм)'] = {
        'Хлеб ржаной домашний (килограмм)':1 / 10,
        }

metadict_detail['Хлеб ячменный домашний (100 грамм)'] = {
        'Хлеб ячменный домашний (килограмм)':1 / 10,
        }

metadict_detail['Сэндвичи с арахисовой пастой (100 грамм)'] = {
        'Сэндвичи с арахисовой пастой (килограмм)':1 / 10,
        }

metadict_detail['Сэндвичи с пекановой пастой (100 грамм)'] = {
        'Сэндвичи с пекановой пастой (килограмм)':1 / 10,
        }

metadict_detail['Сэндвичи с яблочным джемом (100 грамм)'] = {
        'Сэндвичи с яблочным джемом (килограмм)':1 / 10,
        }

metadict_detail['Сэндвичи с мёдом (100 грамм)'] = {
        'Сэндвичи с мёдом (килограмм)':1 / 10,
        }

metadict_detail['Сухари пшеничные (100 грамм)'] = {
        'Сухари пшеничные (килограмм)':1 / 10,
        }

metadict_detail['Сухари ржаные (100 грамм)'] = {
        'Сухари ржаные (килограмм)':1 / 10,
        }

metadict_detail['Хлеб пшеничный домашний (100 грамм)'] = {
        'Хлеб пшеничный домашний (килограмм)':1 / 10,
        }

metadict_detail['Хлеб кукурузный домашний (100 грамм)'] = {
        'Хлеб кукурузный домашний (килограмм)':1 / 10,
        }

metadict_detail['Хлеб соевый домашний (100 грамм)'] = {
        'Хлеб соевый домашний (килограмм)':1 / 10,
        }

metadict_detail['Мука гороховая (100 грамм)'] = {
        'Мука гороховая (килограмм)':1 / 10,
        }

metadict_detail['Мука ячменная (100 грамм)'] = {
        'Мука ячменная (килограмм)':1 / 10,
        }

metadict_detail['Мука гречневая (100 грамм)'] = {
        'Мука гречневая (килограмм)':1 / 10,
        }

metadict_detail['Печенье овсяное (100 грамм)'] = {
        'Печенье овсяное (килограмм)':1 / 10,
        }

metadict_detail['Суп хлебный с земляникой (100 грамм)'] = {
        'Суп хлебный с земляникой (килограмм)':1 / 10,
        }

metadict_detail['Пудинг смородиновый (100 грамм)'] = {
        'Пудинг смородиновый (килограмм)':1 / 10,
        }

metadict_detail['Пудинг кукурузный (100 грамм)'] = {
        'Пудинг кукурузный (килограмм)':1 / 10,
        }

metadict_detail['Пудинг морковный (100 грамм)'] = {
        'Пудинг морковный (килограмм)':1 / 10,
        }

metadict_detail['Пудинг тыквенный (100 грамм)'] = {
        'Пудинг тыквенный (килограмм)':1 / 10,
        }

metadict_detail['Пряники медовые (100 грамм)'] = {
        'Пряники медовые (килограмм)':1 / 10,
        }

metadict_detail['Блины ржаные (100 грамм)'] = {
        'Блины ржаные (килограмм)':1 / 10,
        }

metadict_detail['Блины пшенично-гречневые (100 грамм)'] = {
        'Блины пшенично-гречневые (килограмм)':1 / 10,
        }

metadict_detail['Оладьи рисовые (100 грамм)'] = {
        'Оладьи рисовые (килограмм)':1 / 10,
        }

metadict_detail['Оладьи рисовые с яблочным сиропом (100 грамм)'] = {
        'Оладьи рисовые с яблочным сиропом (килограмм)':1 / 10,
        }

metadict_detail['Оладьи рисовые с лимонным сиропом (100 грамм)'] = {
        'Оладьи рисовые с лимонным сиропом (килограмм)':1 / 10,
        }

metadict_detail['Оладьи овсяные (100 грамм)'] = {
        'Оладьи овсяные (килограмм)':1 / 10,
        }

metadict_detail['Оладьи овсяные с кленовым сиропом (100 грамм)'] = {
        'Оладьи овсяные с кленовым сиропом (килограмм)':1 / 10,
        }

metadict_detail['Оладьи овсяные с яблочным сиропом (100 грамм)'] = {
        'Оладьи овсяные с яблочным сиропом (килограмм)':1 / 10,
        }

metadict_detail['Оладьи овсяные с мёдом (100 грамм)'] = {
        'Оладьи овсяные с мёдом (килограмм)':1 / 10,
        }

metadict_detail['Оладьи кукурузные (100 грамм)'] = {
        'Оладьи кукурузные (килограмм)':1 / 10,
        }

metadict_detail['Оладьи кукурузные с кленовым сиропом (100 грамм)'] = {
        'Оладьи кукурузные с кленовым сиропом (килограмм)':1 / 10,
        }

metadict_detail['Оладьи кукурузные с яблочным сиропом (100 грамм)'] = {
        'Оладьи кукурузные с яблочным сиропом (килограмм)':1 / 10,
        }

metadict_detail['Оладьи кукурузные с мёдом (100 грамм)'] = {
        'Оладьи кукурузные с мёдом (килограмм)':1 / 10,
        }

metadict_detail['Пончики с глазурью (100 грамм)'] = {
        'Пончики с глазурью (килограмм)':1 / 10,
        }

metadict_detail['Маффины кукурузные (100 грамм)'] = {
        'Маффины кукурузные (килограмм)':1 / 10,
        }

metadict_detail['Маффины морковные (100 грамм)'] = {
        'Маффины морковные (килограмм)':1 / 10,
        }

metadict_detail['Маффины тыквенные (100 грамм)'] = {
        'Маффины тыквенные (килограмм)':1 / 10,
        }

metadict_detail['Маффины вишнёвые (100 грамм)'] = {
        'Маффины вишнёвые (килограмм)':1 / 10,
        }

metadict_detail['Маффины с джемом из ревеня (100 грамм)'] = {
        'Маффины с джемом из ревеня (килограмм)':1 / 10,
        }

metadict_detail['Маффины с яблочным джемом (100 грамм)'] = {
        'Маффины с яблочным джемом (килограмм)':1 / 10,
        }

metadict_detail['Маффины с сухофруктами (100 грамм)'] = {
        'Маффины с сухофруктами (килограмм)':1 / 10,
        }

metadict_detail['Пирог открытый кленовый (100 грамм)'] = {
        'Пирог открытый кленовый (килограмм)':1 / 10,
        }

metadict_detail['Пирог открытый пекановый (100 грамм)'] = {
        'Пирог открытый пекановый (килограмм)':1 / 10,
        }

metadict_detail['Пирог открытый лимонный (100 грамм)'] = {
        'Пирог открытый лимонный (килограмм)':1 / 10,
        }

metadict_detail['Пирог открытый тыквенный (100 грамм)'] = {
        'Пирог открытый тыквенный (килограмм)':1 / 10,
        }

metadict_detail['Пирог открытый вишнёвый (100 грамм)'] = {
        'Пирог открытый вишнёвый (килограмм)':1 / 10,
        }

metadict_detail['Пицца с брокколи (100 грамм)'] = {
        'Пицца с брокколи (килограмм)':1 / 10,
        }

metadict_detail['Пицца с кабачками (100 грамм)'] = {
        'Пицца с кабачками (килограмм)':1 / 10,
        }

metadict_detail['Пицца с артишоками (100 грамм)'] = {
        'Пицца с артишоками (килограмм)':1 / 10,
        }

metadict_detail['Пицца с шампиньонами (100 грамм)'] = {
        'Пицца с шампиньонами (килограмм)':1 / 10,
        }

metadict_detail['Пирожки тыквенные (100 грамм)'] = {
        'Пирожки тыквенные (килограмм)':1 / 10,
        }

metadict_detail['Пирожки морковные (100 грамм)'] = {
        'Пирожки морковные (килограмм)':1 / 10,
        }

metadict_detail['Пирожки с ревенем (100 грамм)'] = {
        'Пирожки с ревенем (килограмм)':1 / 10,
        }

metadict_detail['Пирожки с грушей (100 грамм)'] = {
        'Пирожки с грушей (килограмм)':1 / 10,
        }

metadict_detail['Пирожки земляничные (100 грамм)'] = {
        'Пирожки земляничные (килограмм)':1 / 10,
        }

metadict_detail['Пирожки черничные (100 грамм)'] = {
        'Пирожки черничные (килограмм)':1 / 10,
        }

metadict_detail['Пирожки яблочные (100 грамм)'] = {
        'Пирожки яблочные (килограмм)':1 / 10,
        }

metadict_detail['Шарлотка яблочная (100 грамм)'] = {
        'Шарлотка яблочная (килограмм)':1 / 10,
        }

metadict_detail['Шарлотка земляничная (100 грамм)'] = {
        'Шарлотка земляничная (килограмм)':1 / 10,
        }

metadict_detail['Пирожки капустные (100 грамм)'] = {
        'Пирожки капустные (килограмм)':1 / 10,
        }

metadict_detail['Пирожки с картофелем (100 грамм)'] = {
        'Пирожки с картофелем (килограмм)':1 / 10,
        }

metadict_detail['Пирожки с картофелем и спаржей (100 грамм)'] = {
        'Пирожки с картофелем и спаржей (килограмм)':1 / 10,
        }

metadict_detail['Сахарная пудра (100 грамм)'] = {
        'Сахарная пудра (килограмм)':1 / 10,
        }

metadict_detail['Сухофрукты разные (100 грамм)'] = {
        'Сухофрукты разные (килограмм)':1 / 10,
        }

metadict_detail['Травяной сбор (100 грамм)'] = {
        'Травяной сбор (килограмм)':1 / 10,
        }

metadict_detail['Корица молотая (100 грамм)'] = {
        'Корица молотая (килограмм)':1 / 10,
        }

metadict_detail['Зелень петрушки сушёная (100 грамм)'] = {
        'Зелень петрушки сушёная (килограмм)':1 / 10,
        }

metadict_detail['Зелень кориандра сушёная (100 грамм)'] = {
        'Зелень кориандра сушёная (килограмм)':1 / 10,
        }

metadict_detail['Зелень сельдерея сушёная (100 грамм)'] = {
        'Зелень сельдерея сушёная (килограмм)':1 / 10,
        }

metadict_detail['Перец чёрный молотый (100 грамм)'] = {
        'Перец чёрный молотый (килограмм)':1 / 10,
        }

metadict_detail['Эстрагон сушёный (100 грамм)'] = {
        'Эстрагон сушёный (килограмм)':1 / 10,
        }

#----
# Пища переработанная (100 грамм --> килограмм):

metadict_detail['Корень сельдерея шинкованный (100 грамм)'] = {
        'Корень сельдерея шинкованный (килограмм)':1 / 10,
        }

metadict_detail['Корень сельдерея варёный (100 грамм)'] = {
        'Корень сельдерея варёный (килограмм)':1 / 10,
        }

metadict_detail['Корень сельдерея жареный (100 грамм)'] = {
        'Корень сельдерея жареный (килограмм)':1 / 10,
        }

metadict_detail['Рис замоченный (100 грамм)'] = {
        'Рис замоченный (килограмм)':1 / 10,
        }

metadict_detail['Рис варёный (100 грамм)'] = {
        'Рис варёный (килограмм)':1 / 10,
        }

metadict_detail['Рис варёный с соевым соусом (100 грамм)'] = {
        'Рис варёный с соевым соусом (килограмм)':1 / 10,
        }

metadict_detail['Рис варёный с томатным соусом (100 грамм)'] = {
        'Рис варёный с томатным соусом (килограмм)':1 / 10,
        }

metadict_detail['Рис варёный с консервированными овощами (100 грамм)'] = {
        'Рис варёный с консервированными овощами (килограмм)':1 / 10,
        }

metadict_detail['Рис варёный с фасолью (100 грамм)'] = {
        'Рис варёный с фасолью (килограмм)':1 / 10,
        }

metadict_detail['Рис варёный с кукурузой (100 грамм)'] = {
        'Рис варёный с кукурузой (килограмм)':1 / 10,
        }

metadict_detail['Рис варёный с тыквой и кукурузой (100 грамм)'] = {
        'Рис варёный с тыквой и кукурузой (килограмм)':1 / 10,
        }

metadict_detail['Рис обжарено-варёный (100 грамм)'] = {
        'Рис обжарено-варёный (килограмм)':1 / 10,
        }

metadict_detail['Рис обжаренный с квашеной капустой (100 грамм)'] = {
        'Рис обжаренный с квашеной капустой (килограмм)':1 / 10,
        }

metadict_detail['Рис обжаренный с капустой и спаржей (100 грамм)'] = {
        'Рис обжаренный с капустой и спаржей (килограмм)':1 / 10,
        }

metadict_detail['Рис обжаренный с капустой и овощами (100 грамм)'] = {
        'Рис обжаренный с капустой и овощами (килограмм)':1 / 10,
        }

metadict_detail['Рис обжаренный с капустой и грибами (100 грамм)'] = {
        'Рис обжаренный с капустой и грибами (килограмм)':1 / 10,
        }

metadict_detail['Зверобой сушёный (100 грамм)'] = {
        'Зверобой сушёный (килограмм)':1 / 10,
        }

metadict_detail['Клевер сушёный (100 грамм)'] = {
        'Клевер сушёный (килограмм)':1 / 10,
        }

metadict_detail['Крапива сушёная (100 грамм)'] = {
        'Крапива сушёная (килограмм)':1 / 10,
        }

metadict_detail['Ромашка сушёная (100 грамм)'] = {
        'Ромашка сушёная (килограмм)':1 / 10,
        }

metadict_detail['Таволга сушёная (100 грамм)'] = {
        'Таволга сушёная (килограмм)':1 / 10,
        }

metadict_detail['Фенхель сушёный (100 грамм)'] = {
        'Фенхель сушёный (килограмм)':1 / 10,
        }

metadict_detail['Чабрец сушёный (100 грамм)'] = {
        'Чабрец сушёный (килограмм)':1 / 10,
        }

metadict_detail['Лаванда сушёная (100 грамм)'] = {
        'Лаванда сушёная (килограмм)':1 / 10,
        }

metadict_detail['Морская капуста замоченная (100 грамм)'] = {
        'Морская капуста замоченная (килограмм)':1 / 10,
        }

metadict_detail['Морская капуста обжаренная (100 грамм)'] = {
        'Морская капуста обжаренная (килограмм)':1 / 10,
        }

metadict_detail['Морская капуста сушёная (100 грамм)'] = {
        'Морская капуста сушёная (килограмм)':1 / 10,
        }

metadict_detail['Сидр яблочный (100 грамм)'] = {
        'Сидр яблочный (килограмм)':1/10,
        }

metadict_detail['Сидр грушевый (100 грамм)'] = {
        'Сидр грушевый (килограмм)':1/10,
        }

metadict_detail['Вино красное сухое (100 грамм)'] = {
        'Вино красное сухое (килограмм)':1/10,
        }

metadict_detail['Уксус яблочный 3% (100 грамм)'] = {
        'Уксус яблочный 3% (килограмм)':1/10,
        }

metadict_detail['Уксус яблочный 6% (100 грамм)'] = {
        'Уксус яблочный 6% (килограмм)':1/10,
        }

metadict_detail['Уксус виноградный 6% (100 грамм)'] = {
        'Уксус виноградный 6% (килограмм)':1/10,
        }

metadict_detail['Сироп сахарный (100 грамм)'] = {
        'Сироп сахарный (килограмм)':1 / 10,
        }

metadict_detail['Сироп лимонный (100 грамм)'] = {
        'Сироп лимонный (килограмм)':1 / 10,
        }

metadict_detail['Сироп яблочный (100 грамм)'] = {
        'Сироп яблочный (килограмм)':1 / 10,
        }

metadict_detail['Сок яблочный (100 грамм)'] = {
        'Сок яблочный (килограмм)':1 / 10,
        }

metadict_detail['Сок лимонный (100 грамм)'] = {
        'Сок лимонный (килограмм)':1 / 10,
        }

metadict_detail['Сок виноградный (100 грамм)'] = {
        'Сок виноградный (килограмм)':1 / 10,
        }

metadict_detail['Сок ревеня (100 грамм)'] = {
        'Сок ревеня (килограмм)':1 / 10,
        }

metadict_detail['Квас ржаной имбирно-яблочный (100 грамм)'] = {
        'Квас ржаной имбирно-яблочный (килограмм)':1 / 10,
        }

metadict_detail['Квас ржаной хлебный (100 грамм)'] = {
        'Квас ржаной хлебный (килограмм)':1 / 10,
        }

metadict_detail['Эль имбирный (100 грамм)'] = {
        'Эль имбирный (килограмм)':1 / 10,
        }

metadict_detail['Капуста квашеная (100 грамм)'] = {
        'Капуста квашеная (килограмм)':1/10,
        }

metadict_detail['Капуста квашеная с соевым соусом (100 грамм)'] = {
        'Капуста квашеная с соевым соусом (килограмм)':1/10,
        }

metadict_detail['Капуста квашено-тушёная (100 грамм)'] = {
        'Капуста квашено-тушёная (килограмм)':1 / 10,
        }

metadict_detail['Капуста тушёная (100 грамм)'] = {
        'Капуста тушёная (килограмм)':1 / 10,
        }

metadict_detail['Капуста варёная с пряностями (100 грамм)'] = {
        'Капуста варёная с пряностями (килограмм)':1 / 10,
        }

metadict_detail['Капуста обжаренная в сухарях (100 грамм)'] = {
        'Капуста обжаренная в сухарях (килограмм)':1 / 10,
        }

metadict_detail['Кабачок консервированный (100 грамм)'] = {
        'Кабачок консервированный (килограмм)':1/10,
        }

metadict_detail['Огурцы солёные (100 грамм)'] = {
        'Огурцы солёные (килограмм)':1/10,
        }

metadict_detail['Томаты солёные (100 грамм)'] = {
        'Томаты солёные (килограмм)':1/10,
        }

metadict_detail['Оливки солёные (100 грамм)'] = {
        'Оливки солёные (килограмм)':1/10,
        }

metadict_detail['Винегрет с боровиками (100 грамм)'] = {
        'Винегрет с боровиками (килограмм)':1/10,
        }

metadict_detail['Винегрет фруктово-овощной (100 грамм)'] = {
        'Винегрет фруктово-овощной (килограмм)':1/10,
        }

metadict_detail['Винегрет овощной (100 грамм)'] = {
        'Винегрет овощной (килограмм)':1/10,
        }

metadict_detail['Салат зелёный с томатами (100 грамм)'] = {
        'Салат зелёный с томатами (килограмм)':1/10,
        }

metadict_detail['Салат томатный со сладким перцем (100 грамм)'] = {
        'Салат томатный со сладким перцем (килограмм)':1/10,
        }

metadict_detail['Салат из морской капусты (100 грамм)'] = {
        'Салат из морской капусты (килограмм)':1/10,
        }

metadict_detail['Салат огуречный с соевым соусом (100 грамм)'] = {
        'Салат огуречный с соевым соусом (килограмм)':1/10,
        }

metadict_detail['Салат из брокколи (100 грамм)'] = {
        'Салат из брокколи (килограмм)':1/10,
        }

metadict_detail['Салат из варёной спаржи (100 грамм)'] = {
        'Салат из варёной спаржи (килограмм)':1/10,
        }

metadict_detail['Салат из варёной свёклы (100 грамм)'] = {
        'Салат из варёной свёклы (килограмм)':1/10,
        }

metadict_detail['Салат из консервированных кабачков (100 грамм)'] = {
        'Салат из консервированных кабачков (килограмм)':1/10,
        }

metadict_detail['Салат из квашеной капусты (100 грамм)'] = {
        'Салат из квашеной капусты (килограмм)':1/10,
        }

metadict_detail['Свёкла квашеная (100 грамм)'] = {
        'Свёкла квашеная (килограмм)':1/10,
        }

metadict_detail['Яблоко мочёное (100 грамм)'] = {
        'Яблоко мочёное (килограмм)':1/10,
        }

metadict_detail['Груша мочёная (100 грамм)'] = {
        'Груша мочёная (килограмм)':1/10,
        }

metadict_detail['Слива мочёная (100 грамм)'] = {
        'Слива мочёная (килограмм)':1/10,
        }

metadict_detail['Заправка для салатов медово-горчичная (100 грамм)'] = {
        'Заправка для салатов медово-горчичная (килограмм)':1 / 10,
        }

metadict_detail['Заправка для салатов на соевом соусе (100 грамм)'] = {
        'Заправка для салатов на соевом соусе (килограмм)':1 / 10,
        }

metadict_detail['Заправка для салатов на подсолнечном масле (100 грамм)'] = {
        'Заправка для салатов на подсолнечном масле (килограмм)':1 / 10,
        }

metadict_detail['Заправка для салатов на конопляном масле (100 грамм)'] = {
        'Заправка для салатов на конопляном масле (килограмм)':1 / 10,
        }

metadict_detail['Заправка для салатов на оливковом масле (100 грамм)'] = {
        'Заправка для салатов на оливковом масле (килограмм)':1 / 10,
        }

metadict_detail['Рассол для квашения капусты (100 грамм)'] = {
        'Рассол для квашения капусты (килограмм)':1 / 10,
        }

metadict_detail['Рассол для консервации овощей (100 грамм)'] = {
        'Рассол для консервации овощей (килограмм)':1 / 10,
        }

metadict_detail['Маринад для консервации грибов (100 грамм)'] = {
        'Маринад для консервации грибов (килограмм)':1 / 10,
        }

metadict_detail['Рассол для мочения фруктов (100 грамм)'] = {
        'Рассол для мочения фруктов (килограмм)':1 / 10,
        }

metadict_detail['Вода кипячёная (100 грамм)'] = {
        'Вода кипячёная (литр)':1 / 10,
        }

metadict_detail['Вода для готовки (100 грамм)'] = {
        'Вода для готовки (литр)':1 / 10,
        }

#----
# Пища переработанная (100 грамм --> килограмм):

metadict_detail['Масло арахисовое (100 грамм)'] = {
        'Масло арахисовое (килограмм)':1/10,
        #'_-Потребление пищи (килограмм)':1/10,
        '-Белки (грамм)':0.0,
        '-Жиры (грамм)':99.9,
        '-Углеводы (грамм)':0.0,
        }

metadict_detail['Масло подсолнечное (100 грамм)'] = {
        'Масло подсолнечное (килограмм)':1/10,
        #'_-Потребление пищи (килограмм)':1/10,
        '-Белки (грамм)':0.0,
        '-Жиры (грамм)':99.9,
        '-Углеводы (грамм)':0.0,
        }

metadict_detail['Масло оливковое (100 грамм)'] = {
        'Масло оливковое (килограмм)':1/10,
        #'_-Потребление пищи (килограмм)':1/10,
        '-Белки (грамм)':0.0,
        '-Жиры (грамм)':99.9,
        '-Углеводы (грамм)':0.0,
        }

metadict_detail['Масло конопляное (100 грамм)'] = {
        'Масло конопляное (килограмм)':1/10,
        #'_-Потребление пищи (килограмм)':1/10,
        '-Белки (грамм)':0.0,
        '-Жиры (грамм)':99.9,
        '-Углеводы (грамм)':0.0,
        }

metadict_detail['Масло льняное (100 грамм)'] = {
        'Масло льняное (килограмм)':1/10,
        #'_-Потребление пищи (килограмм)':1/10,
        '-Белки (грамм)':0.0,
        '-Жиры (грамм)':99.9,
        '-Углеводы (грамм)':0.0,
        }

metadict_detail['Масло кунжутное (100 грамм)'] = {
        'Масло кунжутное (килограмм)':1/10,
        '-Белки (грамм)':0.0,
        '-Жиры (грамм)':99.9,
        '-Углеводы (грамм)':0.0,
        }

metadict_detail['Масло соевое (100 грамм)'] = {
        'Масло соевое (килограмм)':1/10,
        #'_-Потребление пищи (килограмм)':1/10,
        '-Белки (грамм)':0.0,
        '-Жиры (грамм)':99.9,
        '-Углеводы (грамм)':0.0,
        }

metadict_detail['Сироп кленовый (100 грамм)'] = {
        'Сироп кленовый (килограмм)':1/10,
        #'_-Потребление пищи (килограмм)':1/10,
        '-Белки (грамм)':0.0,
        '-Жиры (грамм)':0.1,
        '-Углеводы (грамм)':67.4,
        }

metadict_detail['Шоколад горький (100 грамм)'] = {
        'Шоколад горький (килограмм)':1/10,
        #'_-Потребление пищи (килограмм)':1/10,
        '-Белки (грамм)':6.2,
        '-Жиры (грамм)':35.4,
        '-Углеводы (грамм)':48.2,
        }

metadict_detail['Сахар-песок (100 грамм)'] = {
        'Сахар-песок (килограмм)':1/10,
        #'_-Потребление пищи (килограмм)':1/10,
        '-Белки (грамм)':0.0,
        '-Жиры (грамм)':0.0,
        '-Углеводы (грамм)':99.7,
        }

metadict_detail['Сахар тростниковый (100 грамм)'] = {
        'Сахар тростниковый (килограмм)':1/10,
        #'_-Потребление пищи (килограмм)':1/10,
        '-Белки (грамм)':0.0,
        '-Жиры (грамм)':0.0,
        '-Углеводы (грамм)':99.4,
        }

metadict_detail['Вёшенки отборные (100 грамм)'] = {
        'Вёшенки отборные (килограмм)':1 / 10,
        '-Белки (грамм)':3.3,
        '-Жиры (грамм)':0.4,
        '-Углеводы (грамм)':4.2,
        }

metadict_detail['Шампиньоны отборные (100 грамм)'] = {
        'Шампиньоны отборные (килограмм)':1 / 10,
        '-Белки (грамм)':4.3,
        '-Жиры (грамм)':1.0,
        '-Углеводы (грамм)':1.0,
        }

metadict_detail['Боровики чищеные (100 грамм)'] = {
        'Боровики чищеные (килограмм)':1 / 10,
        '-Белки (грамм)':3.7,
        '-Жиры (грамм)':1.7,
        '-Углеводы (грамм)':1.1,
        }

metadict_detail['Сморчки чищеные (100 грамм)'] = {
        # Канадский Morel Mushroom
        # https://en.wikipedia.org/wiki/Morchella
        'Сморчки чищеные (килограмм)':1 / 10,
        '-Белки (грамм)':3.1,
        '-Жиры (грамм)':0.6,
        '-Углеводы (грамм)':5.1,
        }

#----
# Пища обработанная (100 грамм --> килограмм):

metadict_detail['Джем яблочный (100 грамм)'] = {
        'Джем яблочный (килограмм)':1/10,
        }

metadict_detail['Джем из ревеня (100 грамм)'] = {
        'Джем из ревеня (килограмм)':1/10,
        }

metadict_detail['Арахис обжаренный (100 грамм)'] = {
        'Арахис обжаренный (килограмм)':1/10,
        }

metadict_detail['Паста арахисовая (100 грамм)'] = {
        'Паста арахисовая (килограмм)':1/10,
        }

metadict_detail['Паста пекановая (100 грамм)'] = {
        'Паста пекановая (килограмм)':1/10,
        }

metadict_detail['Раствор крахмальный (100 грамм)'] = {
        'Раствор крахмальный (килограмм)':1 / 10,
        }

metadict_detail['Крахмал картофельный (100 грамм)'] = {
        'Крахмал картофельный (килограмм)':1 / 10,
        }

metadict_detail['Агар-агар (100 грамм)'] = {
        'Агар-агар (килограмм)':1 / 10,
        }

metadict_detail['Соль поваренная (100 грамм)'] = {
        'Соль поваренная (килограмм)':1 / 10,
        }

metadict_detail['Сода пищевая (100 грамм)'] = {
        'Сода пищевая (килограмм)':1 / 10,
        }

metadict_detail['Зверобой отборный (100 грамм)'] = {
        'Зверобой отборный (килограмм)':1 / 10,
        }

metadict_detail['Таволга отборная (100 грамм)'] = {
        'Таволга отборная (килограмм)':1 / 10,
        }

metadict_detail['Фенхель отборный (100 грамм)'] = {
        'Фенхель отборный (килограмм)':1 / 10,
        }

metadict_detail['Чабрец отборный (100 грамм)'] = {
        'Чабрец отборный (килограмм)':1 / 10,
        }

metadict_detail['Бадьян сушёный (100 грамм)'] = {
        'Бадьян сушёный (килограмм)':1 / 10,
        '-Белки (грамм)':18.0,
        '-Жиры (грамм)':16.0,
        '-Углеводы (грамм)':50.0,
        }

metadict_detail['Шафран сушёный (100 грамм)'] = {
        'Шафран сушёный (килограмм)':1 / 10,
        '-Белки (грамм)':11.4,
        '-Жиры (грамм)':5.9,
        '-Углеводы (грамм)':65.4,
        }

metadict_detail['Лист базилика (100 грамм)'] = {
        'Лист базилика (килограмм)':1 / 10,
        '-Белки (грамм)':2.5,
        '-Жиры (грамм)':0.6,
        '-Углеводы (грамм)':4.3,
        }

metadict_detail['Душица сушёная (100 грамм)'] = {
        'Душица сушёная (килограмм)':1 / 10,
        '-Белки (грамм)':9.0,
        '-Жиры (грамм)':4.3,
        '-Углеводы (грамм)':68.9,
        }

metadict_detail['Зелень петрушки отборная (100 грамм)'] = {
        'Зелень петрушки отборная (килограмм)':1 / 10,
        '-Белки (грамм)':3.7,
        '-Жиры (грамм)':0.4,
        '-Углеводы (грамм)':7.6,
        }

metadict_detail['Лист хрена (100 грамм)'] = {
        'Лист хрена (килограмм)':1 / 10,
        '-Белки (грамм)':9.4,
        '-Жиры (грамм)':1.4,
        '-Углеводы (грамм)':6.2,
        }

metadict_detail['Мята сушёная (100 грамм)'] = {
        'Мята сушёная (килограмм)':1 / 10,
        '-Белки (грамм)':19.9,
        '-Жиры (грамм)':6.0,
        '-Углеводы (грамм)':22.2,
        }

metadict_detail['Семена подсолнечника (100 грамм)'] = {
        'Семена подсолнечника (килограмм)':1 / 10,
        '-Белки (грамм)':20.8,
        '-Жиры (грамм)':52.9,
        '-Углеводы (грамм)':20.0,
        }

metadict_detail['Семена льна (100 грамм)'] = {
        'Семена льна (килограмм)':1 / 10,
        '-Белки (грамм)':18.3,
        '-Жиры (грамм)':42.2,
        '-Углеводы (грамм)':28.9,
        }

metadict_detail['Семена конопли (100 грамм)'] = {
        'Семена льна (килограмм)':1 / 10,
        '-Белки (грамм)':20.0,
        '-Жиры (грамм)':32.5,
        '-Углеводы (грамм)':14.0,
        }

metadict_detail['Семена аниса (100 грамм)'] = {
        'Семена аниса (килограмм)':1 / 10,
        '-Белки (грамм)':17.6,
        '-Жиры (грамм)':15.9,
        '-Углеводы (грамм)':35.4,
        }

metadict_detail['Семена кардамона (100 грамм)'] = {
        'Семена кардамона (килограмм)':1 / 10,
        '-Белки (грамм)':10.8,
        '-Жиры (грамм)':6.7,
        '-Углеводы (грамм)':68.5,
        }

metadict_detail['Семена кориандра (100 грамм)'] = {
        'Семена кориандра (килограмм)':1 / 10,
        '-Белки (грамм)':12.3,
        '-Жиры (грамм)':17.7,
        '-Углеводы (грамм)':13.3,
        }

metadict_detail['Семена кунжута (100 грамм)'] = {
        'Семена кунжута (килограмм)':1 / 10,
        '-Белки (грамм)':19.4,
        '-Жиры (грамм)':48.7,
        '-Углеводы (грамм)':12.2,
        }

metadict_detail['Зелень кориандра отборная (100 грамм)'] = {
        # Кинза
        'Зелень кориандра отборная (килограмм)':1 / 10,
        '-Белки (грамм)':2.1,
        '-Жиры (грамм)':0.5,
        '-Углеводы (грамм)':1.9,
        }

metadict_detail['Семена тмина (100 грамм)'] = {
        'Семена тмина (килограмм)':1 / 10,
        '-Белки (грамм)':19.8,
        '-Жиры (грамм)':14.6,
        '-Углеводы (грамм)':11.9,
        }

metadict_detail['Семена зиры (100 грамм)'] = {
        'Семена зиры (килограмм)':1 / 10,
        '-Белки (грамм)':17.8,
        '-Жиры (грамм)':22.3,
        '-Углеводы (грамм)':44.3,
        }

metadict_detail['Семена фенхеля (100 грамм)'] = {
        'Семена фенхеля (килограмм)':1 / 10,
        '-Белки (грамм)':12.3,
        '-Жиры (грамм)':17.7,
        '-Углеводы (грамм)':13.3,
        }

metadict_detail['Семена фенугрека (100 грамм)'] = {
        # Исправить
            # Переименуй в пажитник
        'Семена фенугрека (килограмм)':1 / 10,
        '-Белки (грамм)':23.0,
        '-Жиры (грамм)':6.4,
        '-Углеводы (грамм)':58.3,
        }

metadict_detail['Тимьян сушёный (100 грамм)'] = {
        'Тимьян сушёный (килограмм)':1 / 10,
        '-Белки (грамм)':9.1,
        '-Жиры (грамм)':7.4,
        '-Углеводы (грамм)':26.9,
        }

metadict_detail['Цедра лимонная (100 грамм)'] = {
        'Цедра лимонная (килограмм)':1 / 10,
        '-Белки (грамм)':0.9,
        '-Жиры (грамм)':0.1,
        '-Углеводы (грамм)':3.0,
        }

metadict_detail['Лист дуба (100 грамм)'] = {
        'Лист дуба (килограмм)':1 / 10,
        '-Белки (грамм)':0.1,
        '-Жиры (грамм)':0.0,
        '-Углеводы (грамм)':0.1,
        }

metadict_detail['Лист смородины (100 грамм)'] = {
        'Лист смородины (килограмм)':1 / 10,
        '-Белки (грамм)':0.1,
        '-Жиры (грамм)':0.0,
        '-Углеводы (грамм)':0.1,
        }

metadict_detail['Лист лавра (100 грамм)'] = {
        # Непросушеный, свежий.
        'Лист лавра (килограмм)':1 / 10,
        '-Белки (грамм)':0.9,
        '-Жиры (грамм)':1.0,
        '-Углеводы (грамм)':6.1,
        }

metadict_detail['Лист чабера (100 грамм)'] = {
        # Дикорастущая замена чёрного перца
        'Лист чабера (килограмм)':1 / 10,
        '-Белки (грамм)':0.8,
        '-Жиры (грамм)':0.7,
        '-Углеводы (грамм)':8.6,
        }

metadict_detail['Щавель отборный (100 грамм)'] = {
        'Щавель отборный (килограмм)':1 / 10,
        '-Белки (грамм)':1.5,
        '-Жиры (грамм)':0.3,
        '-Углеводы (грамм)':2.9,
        }

metadict_detail['Крапива отборная (100 грамм)'] = {
        'Крапива отборная (килограмм)':1 / 10,
        '-Белки (грамм)':1.5,
        '-Жиры (грамм)':0.0,
        '-Углеводы (грамм)':5.0,
        }

metadict_detail['Зелень сельдерея (100 грамм)'] = {
        'Зелень сельдерея (килограмм)':1 / 10,
        '-Белки (грамм)':0.9,
        '-Жиры (грамм)':0.1,
        '-Углеводы (грамм)':2.1,
        }

metadict_detail['Стебель сельдерея (100 грамм)'] = {
        'Стебель сельдерея (килограмм)':1 / 10,
        '-Белки (грамм)':0.9,
        '-Жиры (грамм)':0.1,
        '-Углеводы (грамм)':2.1,
        }

metadict_detail['Корень сельдерея (100 грамм)'] = {
        'Стебель сельдерея (килограмм)':1 / 10,
        '-Белки (грамм)':1.3,
        '-Жиры (грамм)':0.3,
        '-Углеводы (грамм)':6.5,
        }

metadict_detail['Корень куркумы (100 грамм)'] = {
        # Исправить
            # Это сушёный корень.
            # Переименуй в "Куркума сушёная"
        'Корень куркумы (килограмм)':1 / 10,
        '-Белки (грамм)':12.7,
        '-Жиры (грамм)':13.8,
        '-Углеводы (грамм)':58.2,
        }

metadict_detail['Спаржа чищеная (100 грамм)'] = {
        # Спаржа зелёная
        'Спаржа чищеная (килограмм)':1 / 10,
        '-Белки (грамм)':1.9,
        '-Жиры (грамм)':0.1,
        '-Углеводы (грамм)':3.1,
        }

metadict_detail['Лаванда отборная (100 грамм)'] = {
        'Лаванда отборная (килограмм)':1 / 10,
        '-Белки (грамм)':4.0,
        '-Жиры (грамм)':0.7,
        '-Углеводы (грамм)':0.2,
        }

metadict_detail['Стебель эстрагона (100 грамм)'] = {
        'Стебель эстрагона (килограмм)':1 / 10,
        '-Белки (грамм)':1.5,
        '-Жиры (грамм)':0.0,
        '-Углеводы (грамм)':5.0,
        }

metadict_detail['Ревень отборный (100 грамм)'] = {
        'Ревень отборный (килограмм)':1 / 10,
        '-Белки (грамм)':0.7,
        '-Жиры (грамм)':0.1,
        '-Углеводы (грамм)':2.5,
        }

metadict_detail['Корень хрена (100 грамм)'] = {
        'Корень хрена (килограмм)':1 / 10,
        '-Белки (грамм)':3.2,
        '-Жиры (грамм)':0.0,
        '-Углеводы (грамм)':10.5,
        }

metadict_detail['Корень петрушки чищеный (100 грамм)'] = {
        'Корень петрушки чищеный (килограмм)':1 / 10,
        '-Белки (грамм)':1.5,
        '-Жиры (грамм)':0.6,
        '-Углеводы (грамм)':10.1,
        }

metadict_detail['Зелень укропа отборная (100 грамм)'] = {
        # http://vseoteplicah.ru/wp-content/uploads/2014/05/Tablica-sostava-ukropa.jpg
        'Зелень укропа отборная (килограмм)':1 / 10,
        '-Белки (грамм)':2.5,
        '-Жиры (грамм)':0.5,
        '-Углеводы (грамм)':6.3,
        }

metadict_detail['Кофе молотый (100 грамм)'] = {
        'Кофе молотый (килограмм)':1 / 10,
        '-Белки (грамм)':13.9,
        '-Жиры (грамм)':14.4,
        '-Углеводы (грамм)':4.1,
        }

metadict_detail['Солод пшеничный (100 грамм)'] = {
        'Солод пшеничный (килограмм)':1 / 10,
        '-Белки (грамм)':19.2,
        '-Жиры (грамм)':1.2,
        '-Углеводы (грамм)':64.9,
        }

metadict_detail['Солод ржаной (100 грамм)'] = {
        'Солод ржаной (килограмм)':1 / 10,
        '-Белки (грамм)':19.0,
        '-Жиры (грамм)':1.0,
        '-Углеводы (грамм)':61.8,
        }

metadict_detail['Горчичный порошок (100 грамм)'] = {
        'Горчичный порошок (килограмм)':1 / 10,
        '-Белки (грамм)':37.1,
        '-Жиры (грамм)':11.1,
        '-Углеводы (грамм)':32.6,
        }

metadict_detail['Гвоздика сушёная (100 грамм)'] = {
        'Гвоздика сушёная (килограмм)':1 / 10,
        '-Белки (грамм)':6.0,
        '-Жиры (грамм)':20.1,
        '-Углеводы (грамм)':27.0,
        }

metadict_detail['Перец красный сушёный (100 грамм)'] = {
        'Перец красный сушёный (килограмм)':1 / 10,
        '-Белки (грамм)':12.0,
        '-Жиры (грамм)':17.3,
        '-Углеводы (грамм)':29.4,
        }

metadict_detail['Перец чёрный сушёный (100 грамм)'] = {
        'Перец чёрный сушёный (килограмм)':1 / 10,
        '-Белки (грамм)':14.7,
        '-Жиры (грамм)':3.0,
        '-Углеводы (грамм)':41.6,
        }

metadict_detail['Перец душистый сушёный (100 грамм)'] = {
        'Перец душистый сушёный (килограмм)':1 / 10,
        '-Белки (грамм)':6.1,
        '-Жиры (грамм)':8.7,
        '-Углеводы (грамм)':50.5,
        }

metadict_detail['Майоран сушёный (100 грамм)'] = {
        'Майоран сушёный (килограмм)':1 / 10,
        '-Белки (грамм)':12.7,
        '-Жиры (грамм)':7.0,
        '-Углеводы (грамм)':60.6,
        }

metadict_detail['Розмарин сушёный (100 грамм)'] = {
        'Розмарин сушёный (килограмм)':1 / 10,
        '-Белки (грамм)':4.8,
        '-Жиры (грамм)':15.2,
        '-Углеводы (грамм)':64.0,
        }

metadict_detail['Шалфей сушёный (100 грамм)'] = {
        'Шалфей сушёный (килограмм)':1 / 10,
        '-Белки (грамм)':10.6,
        '-Жиры (грамм)':12.8,
        '-Углеводы (грамм)':20.4,
        }

metadict_detail['Корица палочкой (100 грамм)'] = {
        'Корица палочкой (килограмм)':1 / 10,
        '-Белки (грамм)':3.9,
        '-Жиры (грамм)':3.2,
        '-Углеводы (грамм)':79.8,
        }

metadict_detail['Корень имбиря (100 грамм)'] = {
        'Корень имбиря (килограмм)':1 / 10,
        '-Белки (грамм)':1.8,
        '-Жиры (грамм)':0.8,
        '-Углеводы (грамм)':15.8,
        }

metadict_detail['Орех мускатный (100 грамм)'] = {
        'Орех мускатный (килограмм)':1 / 10,
        '-Белки (грамм)':20.0,
        '-Жиры (грамм)':50.0,
        '-Углеводы (грамм)':7.0,
        }

metadict_detail['Орешки кедровые (100 грамм)'] = {
        'Орешки кедровые (килограмм)':1 / 10,
        '-Белки (грамм)':15.6,
        '-Жиры (грамм)':56.0,
        '-Углеводы (грамм)':28.4,
        }

metadict_detail['Орех карии чищенный (100 грамм)'] = {
        # https://en.wikipedia.org/wiki/Carya_ovalis
        # http://bioimages.vanderbilt.edu/pages/carya-fruits.htm
        'Орех карии чищенный (килограмм)':1 / 10,
        '-Белки (грамм)':12.7,
        '-Жиры (грамм)':64.2,
        '-Углеводы (грамм)':18.3,
        }

metadict_detail['Орех пекана чищенный (100 грамм)'] = {
        # https://en.wikipedia.org/wiki/Pecan
        'Орех пекана чищенный (килограмм)':1 / 10,
        '-Белки (грамм)':9.2,
        '-Жиры (грамм)':72.0,
        '-Углеводы (грамм)':4.3,
        }

metadict_detail['Ваниль молотая (100 грамм)'] = {
        'Ваниль молотая (килограмм)':1 / 10,
        '-Белки (грамм)':1.2,
        '-Жиры (грамм)':0.1,
        '-Углеводы (грамм)':12.5,
        }

metadict_detail['Сушёные чайные листья (100 грамм)'] = {
        'Сушёные чайные листья (килограмм)':1 / 10,
        '-Белки (грамм)':20.0,
        '-Жиры (грамм)':5.1,
        '-Углеводы (грамм)':6.9,
        }

metadict_detail['Какао-порошок (100 грамм)'] = {
        'Какао-порошок (килограмм)':1/10,
        '-Белки (грамм)':24.2,
        '-Жиры (грамм)':17.5,
        '-Углеводы (грамм)':31.9,
        }

metadict_detail['Какао-масло (100 грамм)'] = {
        'Какао-масло (килограмм)':1/10,
        '-Белки (грамм)':0.0,
        '-Жиры (грамм)':99.9,
        '-Углеводы (грамм)':0.0,
        }

metadict_detail['Какао-бобы (100 грамм)'] = {
        'Какао-бобы (килограмм)':1/10,
        '-Белки (грамм)':12.6,
        '-Жиры (грамм)':53.1,
        '-Углеводы (грамм)':9.5,
        }

metadict_detail['Арахис чищеный (100 грамм)'] = {
        'Арахис чищеный (килограмм)':1/10,
        '-Белки (грамм)':26.3,
        '-Жиры (грамм)':45.2,
        '-Углеводы (грамм)':9.9,
        }

metadict_detail['Арахис в стручках (100 грамм)'] = {
        'Арахис в стручках (килограмм)':1/10,
        '-Белки (грамм)':26.3,
        '-Жиры (грамм)':45.2,
        '-Углеводы (грамм)':9.9,
        }

metadict_detail['Зерно пшеницы (100 грамм)'] = {
        'Зерно пшеницы (килограмм)':1/10,
        '-Белки (грамм)':13.0,
        '-Жиры (грамм)':2.5,
        '-Углеводы (грамм)':57.5,
        }

metadict_detail['Зерно овса (100 грамм)'] = {
        'Зерно овса (килограмм)':1/10,
        '-Белки (грамм)':10.0,
        '-Жиры (грамм)':6.2,
        '-Углеводы (грамм)':55.1,
        }

metadict_detail['Зерно ячменя (100 грамм)'] = {
        'Зерно ячменя (килограмм)':1/10,
        '-Белки (грамм)':10.3,
        '-Жиры (грамм)':2.4,
        '-Углеводы (грамм)':56.4,
        }

metadict_detail['Зерно ржи (100 грамм)'] = {
        'Зерно ржи (килограмм)':1/10,
        '-Белки (грамм)':9.9,
        '-Жиры (грамм)':2.2,
        '-Углеводы (грамм)':55.8,
        }

metadict_detail['Мука пшеничная (100 грамм)'] = {
        'Мука пшеничная (килограмм)':1/10,
        '-Белки (грамм)':9.2,
        '-Жиры (грамм)':1.2,
        '-Углеводы (грамм)':74.9,
        }

metadict_detail['Мука ржаная (100 грамм)'] = {
        'Мука ржаная (килограмм)':1/10,
        '-Белки (грамм)':9.0,
        '-Жиры (грамм)':1.0,
        '-Углеводы (грамм)':73.0,
        }

metadict_detail['Мука овсяная (100 грамм)'] = {
        'Мука овсяная (килограмм)':1/10,
        '-Белки (грамм)':13.0,
        '-Жиры (грамм)':6.8,
        '-Углеводы (грамм)':64.9,
        }

metadict_detail['Мука соевая (100 грамм)'] = {
        'Мука соевая (килограмм)':1/10,
        '-Белки (грамм)':36.5,
        '-Жиры (грамм)':18.6,
        '-Углеводы (грамм)':17.9,
        }

metadict_detail['Мука льняная (100 грамм)'] = {
        'Мука льняная (килограмм)':1/10,
        '-Белки (грамм)':36.0,
        '-Жиры (грамм)':10.0,
        '-Углеводы (грамм)':9.0,
        }

metadict_detail['Мука кукурузная (100 грамм)'] = {
        'Мука кукурузная (килограмм)':1/10,
        '-Белки (грамм)':8.3,
        '-Жиры (грамм)':1.2,
        '-Углеводы (грамм)':75,
        }

metadict_detail['Зерно кукурузы (100 грамм)'] = {
        'Зерно кукурузы (килограмм)':1/10,
        '-Белки (грамм)':8.3,
        '-Жиры (грамм)':1.2,
        '-Углеводы (грамм)':75,
        }

metadict_detail['Крупа кукурузная (100 грамм)'] = {
        'Крупа кукурузная (килограмм)':1/10,
        '-Белки (грамм)':8.3,
        '-Жиры (грамм)':1.2,
        '-Углеводы (грамм)':75,
        }

metadict_detail['Крупа гречневая отборная (100 грамм)'] = {
        'Крупа гречневая отборная (килограмм)':1/10,
        '-Белки (грамм)':12.6,
        '-Жиры (грамм)':3.3,
        '-Углеводы (грамм)':62.1,
        }

metadict_detail['Зерно риса посевного (100 грамм)'] = {
        'Зерно риса посевного (килограмм)':1/10,
        '-Белки (грамм)':7.5,
        '-Жиры (грамм)':2.6,
        '-Углеводы (грамм)':62.3,
        }

metadict_detail['Рис шлифованный (100 грамм)'] = {
        'Рис шлифованный (килограмм)':1/10,
        '-Белки (грамм)':6.7,
        '-Жиры (грамм)':0.7,
        '-Углеводы (грамм)':78.9,
        }

metadict_detail['Крупа ячневая (100 грамм)'] = {
        'Крупа ячневая (килограмм)':1/10,
        '-Белки (грамм)':10.4,
        '-Жиры (грамм)':1.3,
        '-Углеводы (грамм)':66.3,
        }

metadict_detail['Крупа овсяная (100 грамм)'] = {
        'Крупа овсяная (килограмм)':1/10,
        '-Белки (грамм)':12.3,
        '-Жиры (грамм)':6.1,
        '-Углеводы (грамм)':59.5,
        }

metadict_detail['Бобы соевые (100 грамм)'] = {
        'Бобы соевые (килограмм)':1/10,
        '-Белки (грамм)':34.9,
        '-Жиры (грамм)':17.3,
        '-Углеводы (грамм)':17.3,
        }

metadict_detail['Ростки соевые (100 грамм)'] = {
        'Ростки соевые (килограмм)':1/10,
        '-Белки (грамм)':13.1,
        '-Жиры (грамм)':6.7,
        '-Углеводы (грамм)':9.6,
        }

metadict_detail['Фасоль сухая (100 грамм)'] = {
        'Фасоль сухая (килограмм)':1/10,
        '-Белки (грамм)':21.1,
        '-Жиры (грамм)':1.2,
        '-Углеводы (грамм)':41.4,
        }

metadict_detail['Горох сухой (100 грамм)'] = {
        'Горох сухой (килограмм)':1/10,
        '-Белки (грамм)':20.5,
        '-Жиры (грамм)':2.0,
        '-Углеводы (грамм)':53.3,
        }

metadict_detail['Горошек зелёный (100 грамм)'] = {
        'Горошек зелёный (килограмм)':1/10,
        '-Белки (грамм)':5.0,
        '-Жиры (грамм)':0.2,
        '-Углеводы (грамм)':13.8,
        }

metadict_detail['Чечевица сухая (100 грамм)'] = {
        # Чечевица чёрная
        'Чечевица сухая (килограмм)':1/10,
        '-Белки (грамм)':24.0,
        '-Жиры (грамм)':1.5,
        '-Углеводы (грамм)':42.7,
        }

metadict_detail['Мёд жидкий (100 грамм)'] = {
        'Мёд жидкий (килограмм)':1/10,
        '-Белки (грамм)':0.8,
        '-Жиры (грамм)':0.0,
        '-Углеводы (грамм)':81.6,
        }

metadict_detail['Арбуз чищеный (100 грамм)'] = {
        'Арбуз чищеный (килограмм)':1/10,
        '-Белки (грамм)':0.6,
        '-Жиры (грамм)':0.1,
        '-Углеводы (грамм)':5.8,
        }

metadict_detail['Дыня чищеная (100 грамм)'] = {
        'Дыня чищеная (килограмм)':1/10,
        '-Белки (грамм)':0.6,
        '-Жиры (грамм)':0.3,
        '-Углеводы (грамм)':7.4,
        }

metadict_detail['Яблоко чищеное (100 грамм)'] = {
        # Антоновка
        # http://findfood.ru/product/jabloki-antonovka
        'Яблоко чищеное (килограмм)':1/10,
        '-Белки (грамм)':0.3,
        '-Жиры (грамм)':0.0,
        '-Углеводы (грамм)':11.5,
        }

metadict_detail['Яблоко отборное (100 грамм)'] = {
        # Исправить
            # Так-то это яблоко с учётом семечек
            # Но всё равно дублировать нехорошо.
        'Яблоко отборное (килограмм)':1/10,
        '-Белки (грамм)':0.3,
        '-Жиры (грамм)':0.0,
        '-Углеводы (грамм)':11.5,
        }

metadict_detail['Груша чищеная (100 грамм)'] = {
        'Груша чищеная (килограмм)':1/10,
        '-Белки (грамм)':0.4,
        '-Жиры (грамм)':0.3,
        '-Углеводы (грамм)':10.9,
        }

metadict_detail['Груша отборная (100 грамм)'] = {
        'Груша отборная (килограмм)':1/10,
        '-Белки (грамм)':0.4,
        '-Жиры (грамм)':0.3,
        '-Углеводы (грамм)':10.9,
        }

metadict_detail['Вишня отборная (100 грамм)'] = {
        'Вишня отборная (килограмм)':1/10,
        '-Белки (грамм)':0.8,
        '-Жиры (грамм)':0.5,
        '-Углеводы (грамм)':11.3,
        }

metadict_detail['Персик отборный (100 грамм)'] = {
        'Персик отборный (килограмм)':1/10,
        '-Белки (грамм)':0.9,
        '-Жиры (грамм)':0.1,
        '-Углеводы (грамм)':9.5,
        }

metadict_detail['Абрикос отборный (100 грамм)'] = {
        'Абрикос отборный (килограмм)':1/10,
        '-Белки (грамм)':0.9,
        '-Жиры (грамм)':0.1,
        '-Углеводы (грамм)':9.0,
        }

metadict_detail['Слива отборная (100 грамм)'] = {
        'Слива отборная (килограмм)':1/10,
        '-Белки (грамм)':0.8,
        '-Жиры (грамм)':0.3,
        '-Углеводы (грамм)':9.6,
        }

metadict_detail['Брокколи чищеные (100 грамм)'] = {
        # Исправить
            # Очень уж калорийно получается для капусты.
        'Брокколи чищеные (килограмм)':1/10,
        '-Белки (грамм)':3.0,
        '-Жиры (грамм)':0.4,
        '-Углеводы (грамм)':5.2,
        }

metadict_detail['Ромашка отборная (100 грамм)'] = {
        'Ромашка отборная (килограмм)':1/10,
        '-Белки (грамм)':0.0,
        '-Жиры (грамм)':0.0,
        '-Углеводы (грамм)':0.0,
        }

metadict_detail['Клевер отборный (100 грамм)'] = {
        'Клевер отборный (килограмм)':1/10,
        '-Белки (грамм)':1.0,
        '-Жиры (грамм)':0.0,
        '-Углеводы (грамм)':5.0,
        }

metadict_detail['Одуванчик чищеный (100 грамм)'] = {
        'Одуванчик чищеный (килограмм)':1/10,
        '-Белки (грамм)':2.7,
        '-Жиры (грамм)':0.7,
        '-Углеводы (грамм)':6.7,
        }

metadict_detail['Батат чищеный (100 грамм)'] = {
        'Батат чищеный (килограмм)':1/10,
        '-Белки (грамм)':1.6,
        '-Жиры (грамм)':0.1,
        '-Углеводы (грамм)':16.9,
        }

metadict_detail['Картофель чищеный (100 грамм)'] = {
        'Картофель чищеный (килограмм)':1/10,
        '-Белки (грамм)':2.0,
        '-Жиры (грамм)':0.4,
        '-Углеводы (грамм)':16.1,
        }

metadict_detail['Морковь чищеная (100 грамм)'] = {
        'Морковь чищеная (килограмм)':1/10,
        '-Белки (грамм)':1.3,
        '-Жиры (грамм)':0.1,
        '-Углеводы (грамм)':6.9,
        }

metadict_detail['Лук чищеный (100 грамм)'] = {
        'Лук чищеный (килограмм)':1/10,
        '-Белки (грамм)':1.4,
        '-Жиры (грамм)':0.0,
        '-Углеводы (грамм)':10.4,
        }

metadict_detail['Лук зелёный отборный (100 грамм)'] = {
        'Лук зелёный отборный (килограмм)':1/10,
        '-Белки (грамм)':1.3,
        '-Жиры (грамм)':0.0,
        '-Углеводы (грамм)':4.6,
        }

metadict_detail['Чеснок чищеный (100 грамм)'] = {
        'Чеснок чищеный (килограмм)':1/10,
        '-Белки (грамм)':6.5,
        '-Жиры (грамм)':0.5,
        '-Углеводы (грамм)':29.9,
        }

metadict_detail['Репа чищеная (100 грамм)'] = {
        'Репа чищеная (килограмм)':1/10,
        '-Белки (грамм)':1.5,
        '-Жиры (грамм)':0.1,
        '-Углеводы (грамм)':6.2,
        }

metadict_detail['Брюква чищеная (100 грамм)'] = {
        'Брюква чищеная (килограмм)':1/10,
        '-Белки (грамм)':1.2,
        '-Жиры (грамм)':0.1,
        '-Углеводы (грамм)':7.7,
        }

metadict_detail['Свёкла чищеная (100 грамм)'] = {
        'Свёкла чищеная (килограмм)':1/10,
        '-Белки (грамм)':1.8,
        '-Жиры (грамм)':0.0,
        '-Углеводы (грамм)':10.8,
        }

metadict_detail['Ботва свекольная (100 грамм)'] = {
        'Ботва свекольная (килограмм)':1/10,
        '-Белки (грамм)':2.2,
        '-Жиры (грамм)':0.1,
        '-Углеводы (грамм)':4.3,
        }

metadict_detail['Тыква чищеная (100 грамм)'] = {
        'Тыква чищеная (килограмм)':1/10,
        '-Белки (грамм)':1.3,
        '-Жиры (грамм)':0.3,
        '-Углеводы (грамм)':7.7,
        }

metadict_detail['Томаты отборные (100 грамм)'] = {
        'Томаты отборные (килограмм)':1/10,
        '-Белки (грамм)':1.1,
        '-Жиры (грамм)':0.2,
        '-Углеводы (грамм)':3.7,
        }

metadict_detail['Оливки чищеные (100 грамм)'] = {
        'Оливки чищеные (килограмм)':1/10,
        '-Белки (грамм)':1.3,
        '-Жиры (грамм)':15.3,
        '-Углеводы (грамм)':3.8,
        }

metadict_detail['Баклажан чищеный (100 грамм)'] = {
        'Баклажан чищеный (килограмм)':1/10,
        '-Белки (грамм)':1.2,
        '-Жиры (грамм)':0.1,
        '-Углеводы (грамм)':4.5,
        }

metadict_detail['Кабачок чищеный (100 грамм)'] = {
        # Цуккини
        'Кабачок чищеный (килограмм)':1/10,
        '-Белки (грамм)':1.5,
        '-Жиры (грамм)':0.2,
        '-Углеводы (грамм)':3.0,
        }

metadict_detail['Огурцы отборные (100 грамм)'] = {
        'Огурцы отборные (килограмм)':1/10,
        '-Белки (грамм)':0.8,
        '-Жиры (грамм)':0.1,
        '-Углеводы (грамм)':2.8,
        }

metadict_detail['Кресс-салат отборный (100 грамм)'] = {
        'Кресс-салат отборный (килограмм)':1/10,
        '-Белки (грамм)':2.3,
        '-Жиры (грамм)':0.1,
        '-Углеводы (грамм)':1.3,
        }

metadict_detail['Салат-латук чищеный (100 грамм)'] = {
        'Салат-латук чищеный (килограмм)':1 / 10,
        '-Белки (грамм)':1.2,
        '-Жиры (грамм)':0.3,
        '-Углеводы (грамм)':1.3,
        }

metadict_detail['Артишоки чищеные (100 грамм)'] = {
        'Артишоки чищеные (килограмм)':1 / 10,
        '-Белки (грамм)':1.2,
        '-Жиры (грамм)':0.1,
        '-Углеводы (грамм)':6.0,
        }

metadict_detail['Морская капуста отборная (100 грамм)'] = {
        'Морская капуста отборная (килограмм)':1/10,
        '-Белки (грамм)':0.9,
        '-Жиры (грамм)':0.2,
        '-Углеводы (грамм)':3.0,
        }

metadict_detail['Капуста чищеная (100 грамм)'] = {
        'Капуста чищеная (килограмм)':1/10,
        '-Белки (грамм)':1.8,
        '-Жиры (грамм)':0.1,
        '-Углеводы (грамм)':4.7,
        }

metadict_detail['Перец сладкий чищеный (100 грамм)'] = {
        'Перец сладкий чищеный (килограмм)':1/10,
        '-Белки (грамм)':1.3,
        '-Жиры (грамм)':0.0,
        '-Углеводы (грамм)':5.3,
        }

metadict_detail['Лимон отборный (100 грамм)'] = {
        'Лимон отборный (килограмм)':1/10,
        '-Белки (грамм)':0.9,
        '-Жиры (грамм)':0.1,
        '-Углеводы (грамм)':3.0,
        }

metadict_detail['Инжир отборный (100 грамм)'] = {
        'Инжир отборный (килограмм)':1/10,
        '-Белки (грамм)':0.7,
        '-Жиры (грамм)':0.2,
        '-Углеводы (грамм)':13.7,
        }

metadict_detail['Виноград отборный (100 грамм)'] = {
        'Виноград отборный (килограмм)':1/10,
        '-Белки (грамм)':0.6,
        '-Жиры (грамм)':0.2,
        '-Углеводы (грамм)':16.8,
        }

metadict_detail['Черника отборная (100 грамм)'] = {
        'Черника отборная (килограмм)':1/10,
        '-Белки (грамм)':1.1,
        '-Жиры (грамм)':0.4,
        '-Углеводы (грамм)':7.6,
        }

metadict_detail['Земляника отборная (100 грамм)'] = {
        'Земляника отборная (килограмм)':1/10,
        '-Белки (грамм)':0.8,
        '-Жиры (грамм)':0.4,
        '-Углеводы (грамм)':7.5,
        }

metadict_detail['Малина отборная (100 грамм)'] = {
        'Малина отборная (килограмм)':1/10,
        '-Белки (грамм)':0.8,
        '-Жиры (грамм)':0.5,
        '-Углеводы (грамм)':8.3,
        }

metadict_detail['Морошка отборная (100 грамм)'] = {
        'Морошка отборная (килограмм)':1/10,
        '-Белки (грамм)':0.8,
        '-Жиры (грамм)':0.0,
        '-Углеводы (грамм)':9.8,
        }

metadict_detail['Смородина отборная (100 грамм)'] = {
        'Смородина отборная (килограмм)':1/10,
        '-Белки (грамм)':1.0,
        '-Жиры (грамм)':0.4,
        '-Углеводы (грамм)':7.3,
        }

metadict_detail['Кукуруза чищеная (100 грамм)'] = {
        # Молодая, сладкая кукуруза.
        'Кукуруза чищеная (килограмм)':1/10,
        '-Белки (грамм)':3.5,
        '-Жиры (грамм)':2.8,
        '-Углеводы (грамм)':15.6,
        }

#----
# Процессы (грамм --> 100 грамм):

metadict_detail['Сусло соевое (фильтрация/грамм)'] = {
        'Сусло соевое (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['Сусло соевое (брожение/грамм)'] = {
        'Сусло соевое (брожение/100 грамм)':1 / 100,
        }

metadict_detail['Яблоко чищеное (фильтрация/грамм)'] = {
        'Яблоко чищеное (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['Корень имбиря (фильтрация/грамм)'] = {
        'Корень имбиря (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['Лимон отборный (фильтрация/грамм)'] = {
        'Лимон отборный (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['Виноград отборный (фильтрация/грамм)'] = {
        'Виноград отборный (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['Ревень отборный (фильтрация/грамм)'] = {
        'Ревень отборный (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['Картофель чищеный (крахмализация/грамм)'] = {
        'Картофель чищеный (крахмализация/100 грамм)':1 / 100,
        }

metadict_detail['Орех карии чищенный (фильтрация/грамм)'] = {
        'Орех карии чищенный (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['Сухари ржаные (фильтрация/грамм)'] = {
        'Сухари ржаные (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['Опара овсяная (фильтрация/грамм)'] = {
        'Опара овсяная (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['Рис замоченный (фильтрация/грамм)'] = {
        'Рис замоченный (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['Сахар-песок (брожение/грамм)'] = {
        'Сахар-песок (брожение/100 грамм)':1 / 100,
        }

metadict_detail['Капуста (брожение/грамм)'] = {
        'Капуста (брожение/100 грамм)':1 / 100,
        }

metadict_detail['Кабачок (брожение/грамм)'] = {
        'Кабачок (брожение/100 грамм)':1 / 100,
        }

metadict_detail['Огурцы (брожение/грамм)'] = {
        'Огурцы (брожение/100 грамм)':1 / 100,
        }

metadict_detail['Боровики (брожение/грамм)'] = {
        'Боровики (брожение/100 грамм)':1 / 100,
        }

metadict_detail['Томаты (брожение/грамм)'] = {
        'Томаты (брожение/100 грамм)':1 / 100,
        }

metadict_detail['Свёкла (брожение/грамм)'] = {
        'Свёкла (брожение/100 грамм)':1 / 100,
        }

metadict_detail['Яблоко отборное (брожение/грамм)'] = {
        'Яблоко отборное (брожение/100 грамм)':1 / 100,
        }

metadict_detail['Сидр яблочный (окисление/грамм)'] = {
        'Сидр яблочный (окисление/100 грамм)':1 / 100,
        }

metadict_detail['Сусло яблочное (спиртовое брожение/грамм)'] = {
        'Сусло яблочное (спиртовое брожение/100 грамм)':1 / 100,
        }

metadict_detail['Сусло яблочное (фильтрация/грамм)'] = {
        'Сусло яблочное (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['Сусло виноградное (спиртовое брожение/грамм)'] = {
        'Сусло виноградное (спиртовое брожение/100 грамм)':1 / 100,
        }

metadict_detail['Сусло виноградное (фильтрация/грамм)'] = {
        'Сусло виноградное (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['Вино красное сухое (окисление/грамм)'] = {
        'Вино красное сухое (окисление/100 грамм)':1 / 100,
        }

metadict_detail['Сусло грушевое (брожение/грамм)'] = {
        'Сусло грушевое (брожение/100 грамм)':1 / 100,
        }

metadict_detail['Сусло грушевое (фильтрация/грамм)'] = {
        'Сусло грушевое (фильтрация/100 грамм)':1 / 100,
        }

metadict_detail['Груша (брожение/грамм)'] = {
        'Груша (брожение/100 грамм)':1 / 100,
        }

metadict_detail['Слива (брожение/грамм)'] = {
        'Слива (брожение/100 грамм)':1 / 100,
        }

#----
# Процессы (100 грамм --> килограмм):

metadict_detail['Сусло соевое (фильтрация/100 грамм)'] = {
        '-Белки (грамм)':9.1 * -0.6,
        '-Жиры (грамм)':3.7 * -0.6,
        '-Углеводы (грамм)':16.7 * -0.6,
        }

metadict_detail['Сусло соевое (брожение/100 грамм)'] = {
        '-Белки (грамм)':9.1 * 0.5,
        '-Жиры (грамм)':3.7 * -0.4,
        '-Углеводы (грамм)':16.7 * -0.2,
        }

metadict_detail['Яблоко чищеное (фильтрация/100 грамм)'] = {
        '-Белки (грамм)':0.3 * -0.6,
        '-Жиры (грамм)':0.0 * -0.6,
        '-Углеводы (грамм)':11.5 * -0.6,
        }

metadict_detail['Корень имбиря (фильтрация/100 грамм)'] = {
        '-Белки (грамм)':1.8 * -0.6,
        '-Жиры (грамм)':0.8 * -0.6,
        '-Углеводы (грамм)':15.8 * -0.6,
        }

metadict_detail['Лимон отборный (фильтрация/100 грамм)'] = {
        '-Белки (грамм)':0.9 * -0.5,
        '-Жиры (грамм)':0.1 * -0.5,
        '-Углеводы (грамм)':3.0 * -0.5,
        }

metadict_detail['Виноград отборный (фильтрация/100 грамм)'] = {
        '-Белки (грамм)':0.6 * -0.5,
        '-Жиры (грамм)':0.2 * -0.5,
        '-Углеводы (грамм)':16.8 * -0.5,
        }

metadict_detail['Ревень отборный (фильтрация/100 грамм)'] = {
        '-Белки (грамм)':0.7 * -0.5,
        '-Жиры (грамм)':0.1 * -0.5,
        '-Углеводы (грамм)':2.5 * -0.5,
        }

metadict_detail['Картофель чищеный (крахмализация/100 грамм)'] = {
        '-Белки (грамм)':2.0 * -1,
        '-Жиры (грамм)':0.4 * -1,
        '-Углеводы (грамм)':16.1 * -0.76,
        }

metadict_detail['Орех карии чищенный (фильтрация/100 грамм)'] = {
        # Из напитка отфильтровывается 50% ореха, калорийность падает.
        '-Белки (грамм)':12.7 * -0.5,
        '-Жиры (грамм)':64.2 * -0.5,
        '-Углеводы (грамм)':18.3 * -0.5,
        }

metadict_detail['Сухари ржаные (фильтрация/100 грамм)'] = {
        '-Белки (грамм)':9.7 * -0.5,
        '-Жиры (грамм)':1.0 * -0.5,
        '-Углеводы (грамм)':71.9 * -0.5,
        }

metadict_detail['Опара овсяная (фильтрация/100 грамм)'] = {
        '-Белки (грамм)':4.3 * -0.5,
        '-Жиры (грамм)':2.1 * -0.5,
        '-Углеводы (грамм)':20.1 * -0.5,
        }

metadict_detail['Рис замоченный (фильтрация/100 грамм)'] = {
        '-Белки (грамм)':3.4 * -0.5,
        '-Жиры (грамм)':0.4 * -0.5,
        '-Углеводы (грамм)':39.4 * -0.5,
        }

metadict_detail['Сахар-песок (брожение/100 грамм)'] = {
        # Глюкоза превращается в этиловый спир, выделяется углекислый газ:
        # https://alcodistillers.ru/distill3.html
        '-Углеводы (грамм)':99.4 * -1,
        '-Этанол (грамм)':99.4 * 0.511 * 0.9,
        }

metadict_detail['Капуста (брожение/100 грамм)'] = {
        # Длительное молочно-кислое брожение, потеря 50% питательных веществ.
        # https://znaytovar.ru/s/Kvashenaya-kapusta.html
        '-Белки (грамм)':1.8 * -0.5,
        '-Жиры (грамм)':0.1 * -0.5,
        '-Углеводы (грамм)':4.7 * -0.5,
        }

metadict_detail['Кабачок (брожение/100 грамм)'] = {
        '-Белки (грамм)':1.5 * -0.5,
        '-Жиры (грамм)':0.2 * -0.5,
        '-Углеводы (грамм)':3.0 * -0.5,
        }

metadict_detail['Огурцы (брожение/100 грамм)'] = {
        '-Белки (грамм)':0.8 * -0.5,
        '-Жиры (грамм)':0.1 * -0.5,
        '-Углеводы (грамм)':2.8 * -0.5,
        }

metadict_detail['Боровики (брожение/100 грамм)'] = {
        '-Белки (грамм)':3.7 * -0.5,
        '-Жиры (грамм)':1.7 * -0.5,
        '-Углеводы (грамм)':1.1 * -0.5,
        }

metadict_detail['Томаты (брожение/100 грамм)'] = {
        '-Белки (грамм)':1.1 * -0.5,
        '-Жиры (грамм)':0.2 * -0.5,
        '-Углеводы (грамм)':3.7 * -0.5,
        }

metadict_detail['Свёкла (брожение/100 грамм)'] = {
        '-Белки (грамм)':1.8 * -0.5,
        '-Жиры (грамм)':0.0 * -0.5,
        '-Углеводы (грамм)':10.8 * -0.5,
        }

metadict_detail['Яблоко отборное (брожение/100 грамм)'] = {
        # Молочно-кислое брожение
        '-Белки (грамм)':0.3 * -0.5,
        '-Жиры (грамм)':0.0 * -0.5,
        '-Углеводы (грамм)':11.5 * -0.5,
        }

metadict_detail['Сусло яблочное (спиртовое брожение/100 грамм)'] = {
        # Спиртовое брожение
        '-Углеводы (грамм)':11.5 * -0.5,
        '-Этанол (грамм)':11.5 * 0.5 * 0.511 * 0.8,
        }

metadict_detail['Сусло яблочное (фильтрация/100 грамм)'] = {
        # Спиртовое брожение
        '-Белки (грамм)':0.3 * -0.5,
        '-Жиры (грамм)':0.0 * -0.5,
        '-Углеводы (грамм)':11.5 * -0.5,
        }

metadict_detail['Сидр яблочный (окисление/100 грамм)'] = {
        # Уксуснокислое брожение
        '-Этанол (грамм)':11.5 * 0.511 * 0.8 * -1,
        '-Уксусная кислота (грамм)':11.5 * 0.511 * 0.8,
        }

metadict_detail['Сусло виноградное (спиртовое брожение/100 грамм)'] = {
        '-Углеводы (грамм)':16.8 * -0.5,
        '-Этанол (грамм)':16.8 * 0.5 * 0.511 * 0.8,
        }

metadict_detail['Сусло виноградное (фильтрация/100 грамм)'] = {
        '-Белки (грамм)':0.6 * -0.5,
        '-Жиры (грамм)':0.2 * -0.5,
        '-Углеводы (грамм)':16.8 * -0.5,
        }

metadict_detail['Вино красное сухое (окисление/100 грамм)'] = {
        '-Этанол (грамм)':16.8 * 0.511 * 0.8 * -1,
        '-Уксусная кислота (грамм)':16.8 * 0.511 * 0.8,
        }

metadict_detail['Груша (брожение/100 грамм)'] = {
        '-Белки (грамм)':0.4 * -0.5,
        '-Жиры (грамм)':0.3 * -0.5,
        '-Углеводы (грамм)':10.9 * -0.5,
        }

metadict_detail['Сусло грушевое (брожение/100 грамм)'] = {
        '-Углеводы (грамм)':10.9 * -0.5,
        '-Этанол (грамм)':10.9 * 0.5 * 0.511 * 0.8,
        }

metadict_detail['Сусло грушевое (фильтрация/100 грамм)'] = {
        '-Белки (грамм)':0.4 * -0.5,
        '-Жиры (грамм)':0.3 * -0.5,
        '-Углеводы (грамм)':10.9 * -0.5,
        }

metadict_detail['Слива (брожение/100 грамм)'] = {
        '-Белки (грамм)':0.8 * -0.5,
        '-Жиры (грамм)':0.3 * -0.5,
        '-Углеводы (грамм)':9.6 * -0.5,
        }

#----
# Энергетическая ценность пищи (проверка):

metadict_detail['-Белки (грамм)'] = {
        '--Калорийность белков (килокалорий)':4,
        '--Питательные вещества (грамм)':1,
        }

metadict_detail['-Жиры (грамм)'] = {
        '--Калорийность жиров (килокалорий)':9,
        '--Питательные вещества (грамм)':1,
        }

metadict_detail['-Углеводы (грамм)'] = {
        '--Калорийность углеводов (килокалорий)':4,
        '--Питательные вещества (грамм)':1,
        }

metadict_detail['-Этанол (грамм)'] = {
        '--Этанол (миллилитров)':1 / 0.7893,
        '--Калорийность этанола (килокалорий)':7.1,
        '--Питательные вещества (грамм)':1,
        }

#----
# Энергетическая ценность (группировка):

metadict_detail['--Калорийность этанола (килокалорий)'] = {                                          
        '---Калорийность пищи (килокалорий)':1,
        }

metadict_detail['--Калорийность белков (килокалорий)'] = {
        '---Калорийность пищи (килокалорий)':1,
        }

metadict_detail['--Калорийность жиров (килокалорий)'] = {
        '---Калорийность пищи (килокалорий)':1,
        }

metadict_detail['--Калорийность углеводов (килокалорий)'] = {
        '---Калорийность пищи (килокалорий)':1,
        }

#----
# Считаем потребление алкоголя:
    # https://ru.wikipedia.org/wiki/Этанол

metadict_detail['--Этанол (миллилитров)'] = {
        '---Алкоголь (литров)':1 / 1000,
        }
