#----
# Заметки:
    # Профессиональная перепись Германии (1895 годы, 52.5 млн. населения)
    # | Профессия                                   | Рабочих    | На 10 000 населения
    # | ------------------------------------------- | ---------- | -------------------
    # | Сельское хозяйство                          | 8 156 045  | 1 554
    # | Мукомольное дело                            |   103 716  |    20
    # | Хлебопечение                                |   218 502  |    42
    # | Заготовка мяса                              |   176 671  |    34
    # | Пивоварение (~200 литров/человека-год)      |    87 000  |    17
    # | Табачное производство                       |   146 719  |    30
    # | Производство обуви                          |   404 686  |    77
    # | Производство одежды и белья                 |   804 410  |   153
    # | Производство шляп и украшений               |   115 475  |    22
    # | Текстильная промышленность                  |   945 191  |   180
    # | Кирпичное производство                      |   183 911  |    35
    # | Цементное производство                      |    15 000  |     3
    # | Стекольное производство                     |    52 388  |    10
    # | Горнозаводская промышленность               |   567 774  |   108
    # | Железноделательная и машиностроение         | 1 247 258  |   238
    # | Химическое производство                     |   102 923  |    20
    # | Столярные и плотницкие работы               |   557 487  |   106
    # | Строительные работы                         |   485 373  |    93
    # | Бондарное производство                      |    55 533  |    11
    # | Кожевенное производство                     |    46 252  |     9
    # | Производство мыла, свечей                   |    32 190  |     6
    # | Производство бумаги                         |    71 029  |    14
    # | Газовые и электрические заводы              |    14 407  |     3
    # | Средства сообщения                          |   615 331  |   117
    # | Гос. склады, хлебные и мяс. лавки           | 1 205 133  |   230
    # | Почта и телеграф                            |   147 000  |    28
    # | Полиграфические профессии                   |   177 798  |    34
    # | Переплётное мастерство                      |    61 183  |    12
    # | Парикмахерское, прачечное дело и т.п.       |   190 553  |    36
    # | Кондитерское производство и сахаровар.      |   155 555  |    30
    # | Шорное и седельное производство             |    71 232  |    14
    # | Корзинное производство                      |    82 548  |    16
    # | Производство обоев                          |    30 643  |     6
    # | Заготовка дров и деревянные изделия         |    80 053  |    15
    # | Производство других дерев. изделий          |    71 577  |    14
    # | Клеёночное, резиновое, гутаперчеевое        |    13 565  |     3
    # | Маляры, стекольщики, кровельщики, печники   |   259 219  |    49
    # | Обработка ископаемых камней, каменоломни    |   250 016  |    48
    # | Рабочие (прочие)                            |   738 769  |   141
    # Всего: 16 408 414 (31% населения)
    # https://istmat.info/node/27471

#----
# Гигиена:

metadict_detail['_-Гигиена, баня (нормо-часов)'] = {
        '_--Гигиена (нормо-часов)':1,
        }

metadict_detail['_-Гигиена, ванна (нормо-часов)'] = {
        '_--Гигиена (нормо-часов)':1,
        }

metadict_detail['_-Гигиена, душ (нормо-часов)'] = {
        '_--Гигиена (нормо-часов)':1,
        }

metadict_detail['_-Гигиена, уборная (нормо-часов)'] = {
        '_--Гигиена (нормо-часов)':1,
        }

metadict_detail['_-Гигиена, умывание (нормо-часов)'] = {
        '_--Гигиена (нормо-часов)':1,
        }

#----
# Образование:

metadict_model['_-Работа ученика, начальная школа (нормо-часов)'] = {
        '_-Образование, ученики (нормо-часов)':1,
        }

metadict_model['_-Работа ученика, средняя школа (нормо-часов)'] = {
        '_-Образование, ученики (нормо-часов)':1,
        }

metadict_model['_-Работа ученика, старшая школа (нормо-часов)'] = {
        '_-Образование, ученики (нормо-часов)':1,
        }

metadict_model['_-Работа ученика, университет (нормо-часов)'] = {
        '_-Образование, ученики (нормо-часов)':1,
        }

metadict_model['_-Работа учителя, начальная школа (нормо-часов)'] = {
        '_-Образование, учителя (нормо-часов)':1,
        }

metadict_model['_-Работа учителя, средняя школа (нормо-часов)'] = {
        '_-Образование, учителя (нормо-часов)':1,
        }

metadict_model['_-Работа учителя, старшая школа (нормо-часов)'] = {
        '_-Образование, учителя (нормо-часов)':1,
        }

metadict_model['_-Работа учителя, университет (нормо-часов)'] = {
        '_-Образование, учителя (нормо-часов)':1,
        }

#----
# Типографское дело, книгопечатание, печать:

metadict_detail['_-Работа наборщика (нормо-часов)'] = {
        '_-Работа персонала типографии (нормо-часов)':1,
        }

metadict_detail['_-Работа над матрицей и стереотипом страницы (нормо-часов)'] = {
        '_-Работа персонала типографии (нормо-часов)':1,
        }

metadict_detail['_-Работа переплётчика (нормо-часов)'] = {
        '_-Работа персонала типографии (нормо-часов)':1,
        }

metadict_detail['_-Работа печатчика (нормо-часов)'] = {
        '_-Работа персонала типографии (нормо-часов)':1,
        }

#----
# Работа бригад рабочих, артелей:

metadict_model['_-Работа бригады землекопов (нормо-часов)'] = {
        # TODO:
            # Учти инструменты. Не только лопаты, но и насосы.
            # А грейдеры и скреперы учтены на уровне проектов.
            # Кроме рабочих есть чистые управленцы, в работе бригады их нужно учесть.
        '_-Работа землекопа (нормо-часов)':1,
        }

metadict_model['_-Работа бригады водопроводчиков (нормо-часов)'] = {
        # TODO:
            # Не отличаются от землекопов.
            # Использование специального оборудования учтено в проектах.
        '_-Работа водопроводчика (нормо-часов)':1,
        }

metadict_model['_-Работа бригады дорожных строителей (нормо-часов)'] = {
        # Работают в пределах кантона, 15-30 километров, нуждаются во временном жилье.
        '_-Работа на дорожном строительстве (нормо-часов)':1,
        'Использование общежития, дорожные строители (часов)':3,
        }

metadict_model['_-Работа бригады железнодорожных строителей (нормо-часов)'] = {
        # 12 монтёров, работают с верхним строением пути.
        '_-Работа железнодорожного монтёра (нормо-часов)':1,
        'Использование инструментов железнодорожно-монтажных личных (часов)':1,
        'Использование инструментов железнодорожно-монтажных групповых (часов)':1 / 4,
        'Использование инструментов железнодорожно-монтажных бригадных (часов)':1 / 12,
        'Использование общежития, железнодорожные строители (часов)':3,
        }

metadict_model['_-Работа бригады путевых смотрителей (нормо-часов)'] = {
        # 12 монтёров, обслуживают околоток (участок пути). Его длина 15-30 километров.
        '_-Работа путевого смотрителя (нормо-часов)':1,
        'Использование инструментов железнодорожно-монтажных личных (часов)':1,
        'Использование инструментов железнодорожно-монтажных групповых (часов)':1 / 4,
        #'Использование инструментов железнодорожно-монтажных бригадных (часов)':1 / 12,
        'Использование общежития, путевые смотрители (часов)':3,
        }

metadict_model['_-Работа бригады каменщиков (нормо-часов)'] = {
        # Работают в пределах кантона, 15-30 километров, нуждаются во временном жилье.
        '_-Работа каменщика (нормо-часов)':1,
        'Использование инструментов каменщика личных (часов)':1,
        'Использование инструментов каменщика групповых (часов)':1 / 4,
        'Использование инструментов каменщика бригадных (часов)':1 / 12,
        'Использование общежития, каменщики (часов)':3,
        }

metadict_model['_-Работа бригады печников (нормо-часов)'] = {
        '_-Работа печника (нормо-часов)':1,
        'Использование инструментов каменщика личных (часов)':1,
        'Использование инструментов каменщика групповых (часов)':1 / 4,
        'Использование общежития, каменщики (часов)':3,
        }

metadict_model['_-Работа бригады плотников (нормо-часов)'] = {
        # Работают в пределах кантона, 15-30 километров, нуждаются во временном жилье.
        '_-Работа плотника (нормо-часов)':1,
        'Использование общежития, плотники (часов)':3,
        }

metadict_model['_-Работа бригады плотников-мостовиков (нормо-часов)'] = {
        '_-Работа плотника (нормо-часов)':1,
        }

metadict_model['_-Работа бригады маляров (нормо-часов)'] = {
        '_-Работа маляра (нормо-часов)':1,
        'Использование инструментов маляра личных (часов)':1,
        'Использование инструментов маляра групповых (часов)':1 / 4,
        'Использование общежития, маляры (часов)':3,
        }

metadict_model['_-Работа бригады штукатуров (нормо-часов)'] = {
        '_-Работа штукатура (нормо-часов)':1,
        'Использование инструментов штукатура личных (часов)':1,
        'Использование инструментов штукатура групповых (часов)':1 / 4,
        'Использование инструментов штукатура бригадных (часов)':1 / 12,
        'Использование общежития, штукатуры (часов)':3,
        }

metadict_model['_-Работа бригады лесорубов (нормо-часов)'] = {
        '_-Работа лесоруба (нормо-часов)':1,
        'Использование общежития, лесорубы (часов)':3,
        }

metadict_model['_-Работа бригады грузчиков (нормо-часов)'] = {
        '_-Работа грузчика (нормо-часов)':1,
        }

metadict_model['_-Работа бригады грузчиков-зебр (нормо-часов)'] = {
        '_-Транспортные работы зебр (нормо-часов)':1,
        }

metadict_detail['_-Работа грузчика-зебры с тележкой (нормо-часов)'] = {
        '_-Транспортные работы зебр (нормо-часов)':1,
        }

metadict_detail['_-Работа зебры-возничего (нормо-часов)'] = {
        '_-Транспортные работы зебр (нормо-часов)':1,
        }

metadict_detail['_-Работа персонала типографии (нормо-часов)'] = {
        '_-Типографское дело (нормо-часов)':1,
        #'-Рабочие типографии':1 / (8 * 200),
        }

#----
# Работа экипажей:

metadict_model['_-Работа экипажа товарного поезда, 400 тонн, 50 км/час 640 кВт-час (нормо-часов)'] = {
        # Крылосила = 30 кВт.
        '_-Работа пегаса-железнодорожника (нормо-часов)':22,
        '_-Работа железнодорожника (нормо-часов)':2,
        }

metadict_model['_-Работа экипажа грузового планёра (нормо-часов)'] = {
        # 18 пегасов, нужно 540 кВт для 5-тонного планёра (3 тонны грузов).
        '_-Работа капитана грузового планёра (нормо-часов)':1,
        '_-Работа пегаса-лётчика (нормо-часов)':18,
        }

metadict_model['_-Работа экипажа грузового барка (нормо-часов)'] = {
        # 50 пони, из них 24 пегаски вместо движков
        '_-Работа капитана грузового барка (нормо-часов)':1,
        '_-Работа пегаса-моряка (нормо-часов)':24,
        '_-Работа моряка (нормо-часов)':25,
        }

metadict_model['_-Работа экипажа грузовой баржи (нормо-часов)'] = {
        # 10 пони, из них 8 пегасок вместо движков
        '_-Работа капитана грузовой баржи (нормо-часов)':1,
        '_-Работа пегаса-моряка (нормо-часов)':8,
        '_-Работа моряка (нормо-часов)':1,
        }

#----
# Процессы (упрощение):
    # Приготовление пищи -- нарезка, варение, жарение
    # Обработка пищи -- соление, сушка, чистка овощей

metadict_model['_-Сервировка холодного супа (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Уваривание сиропа (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Уваривание томатов (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Приготовление желе (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Взбивание крема (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Взбивание аквафабы (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Вымешивание пудинга (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Заворачивание пудинга (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Вымешивание теста (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Обминка теста (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Разделка теста (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Раскатка теста (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Растягивание теста (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Формовка теста (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Заваривание муки (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Выращивание дрожжей (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Посев грибковой культуры (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Уход за грибковой культурой (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Вымешивание соевого сусла (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Приготовление соевого соуса (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Вымешивание соуса (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Вымешивание раствора (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Приготовление рассола (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Приготовление горчицы (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Приготовление кваса (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Приготовление эля (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Приготовление закваски (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Варка мёда (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Варка медовухи (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Варка напитка (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Вымешивание мёда (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Варка бобов (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Варка грибов (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Варка овощей (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Томление овощей (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Томление пудинга (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Томление каши (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Варка орехов (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Варка соуса (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Варка похлёбки (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Варка супа (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Варка лапши (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Варка борща (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Варка щей (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Варка бульона (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Уваривание бульона (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Процеживание бульона (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Варка хлебного супа (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Варка пудинга (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Варка идли (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Варка фруктового пюре (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Варка фруктов (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Варка сиропа (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Варка сахарного сиропа (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Варка мёда (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Варка яблочного сиропа (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Выпечка пудинга (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Выпечка суфле (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Выпечка капкейков (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Выпечка лепёшек (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Выпечка блинов (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Выпечка оладий (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Выпечка кексов (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Выпечка пирога (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Выпечка пирожков (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Жарение темпе (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Жарение пончиков (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Жарение грибов (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Жарение овощей (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Жарение фруктов (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Жарение хлеба (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Жарение муки (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Жарение пряностей (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Жарение орехов (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Прокаливание крупы (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Прокаливание муки (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Запекание овощей (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Запекание корнеплодов (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Запекание фруктов (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Запекание орехов (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Замачивание бобов (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Замачивание орехов (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Замачивание грибов (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Замачивание зерна (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Замачивание овощей (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Замачивание фруктов (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Замачивание сладостей (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Мытьё крупы (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Мытьё грибов (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Мытьё орехов (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Нарезка фруктов (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Нарезка орехов (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Нарезка овощей (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Нарезка зелени (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Шинковка овощей (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Шинковка грибов (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Шинковка зелени (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Шинковка фруктов (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Шинковка орехов (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Нарезка хлеба (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Натирание хлеба чесноком (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Сервировка стола (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Нарезка лапши (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Бланширование лапши (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Бланширование орехов (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Сушка лапши (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Сушка сладостей (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Протирание овощей (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Протирание зелени (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Протирание бобов (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Протирание орехов (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Протирание крупы (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Протирание семян (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Протирание фруктов (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Машинная переработка картофеля (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Перебор крупы (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Перебор бобов (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Перебор сухофруктов (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Перебор овощей (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Перебор грибов (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Перебор трав (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Перебор фруктов (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Перебор ягод (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Приготовление опары (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Сушка крахмала (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Сушка сухарей (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Сушка пастилы (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Тушение грибов (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Тушение бобов (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Тушение овощей (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Чистка орехов (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Чистка фиников (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Варка каши (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Варка риса (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Варка пшена (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Варка киселя (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Варка корнеплодов (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Варка сухофруктов (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Варка яблочного джема (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Варка варенья (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Кипячение воды (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Кипячение консервов (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Уваривание сока (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Варка семян (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Растопка печи (нормо-часов)'] = {
        '_-Обслуживание (нормо-часов)':1,
        }

metadict_model['_-Растопка очага (нормо-часов)'] = {
        '_-Обслуживание (нормо-часов)':1,
        }

metadict_model['_-Выпечка хлеба (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Выпечка пряников (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Выпечка печенья (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Выпечка пудинга (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Мочение фруктов (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Квашение капусты (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Мытьё корнеплодов (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Мытьё овощей (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Мытьё растений (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Мытьё сухофруктов (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Мытьё фруктов (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Нарезка темпе (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Нарезка фруктов (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Нарезка чайных листьев (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Обжаривание крупы (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Обжаривание бобов (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Обжаривание орехов (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Обжаривание арахиса (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Обжаривание семян (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Обжаривание кофе (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Отжим соевого сусла (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Проверка соевого сусла (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Приготовление сидра (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Приготовление вина (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Отжим фруктов (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Отжим овощей (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Раскладка варенья по банкам (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Смешивание еды (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Смешивание питья (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Смешивание сиропа (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Вымешивание пасты (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Вымешивание рассола (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Помол сухарей (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Помол сахара-песка (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Помол кофейных зёрен (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Помол орехов (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Помол пряностей (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Помол семян (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Помол семян на масло (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Помол бобов на масло (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Приготовление сэндвичей (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Приготовление террина (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Фаршировка (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Панировка (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Смазывание оладьев соусом (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Украшение еды (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Приготовление крема (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Приготовление мусса (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Приготовление кофе (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Работа на производстве солода (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Работа на производстве пива (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Конширование горького шоколада (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Формирование горького шоколада (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Приготовление пшеничного солода (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Проращивание бобов (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Проращивание зерна (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Замачивание риса (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Ферментация стручков ванили (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Ферментация кофейных зёрен (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Ферментация какао-бобов (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Приготовление ржаного солода (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Заваривание чая (нормо-часов)'] = {
        '_-Приготовление пищи (нормо-часов)':1,
        }

metadict_model['_-Прокатка чайных листьев (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Работа на заготовке ивовых прутьев (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Работа на плетении корзин (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Рубка овощей (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Сортировка корнеплодов (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Сортировка орехов (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Сортировка овощей (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Сортировка растений (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Сортировка фруктов (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Сушка растений (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Выдавливание чеснока (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Чистка корнеплодов (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Чистка овощей (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Чистка растений (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Сбор кленового сока (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Сбор валежника (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Чистка фруктов (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Квашение овощей (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Соление овощей (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Соление грибов (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Маринование овощей (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Маринование грибов (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Маринование фруктов (нормо-часов)'] = {
        '_-Обработка пищи (нормо-часов)':1,
        }

metadict_model['_-Работа с воротом колодца (нормо-часов)'] = {
        # TODO:
            # Вообще-то фермеры часто нанимают местных пегасов.
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Работа водовоза (нормо-часов)'] = {
        '_-Транспортировка (нормо-часов)':1,
        }

metadict_model['_-Работа водопроводчика (нормо-часов)'] = {
        '_-Транспортировка (нормо-часов)':1,
        }

metadict_model['_-Уборка помещений (нормо-часов)'] = {
        '_-Обслуживание (нормо-часов)':1,
        }

metadict_model['_-Мытьё посуды (нормо-часов)'] = {
        '_-Обслуживание (нормо-часов)':1,
        }

metadict_detail['_-Замачивание текстильных вещей (нормо-часов)'] = {
        '_-Обслуживание (нормо-часов)':1,
        }

metadict_detail['_-Разглаживание текстильных вещей (нормо-часов)'] = {
        '_-Обслуживание (нормо-часов)':1,
        }

metadict_detail['_-Стирка текстильных вещей (нормо-часов)'] = {
        '_-Обслуживание (нормо-часов)':1,
        }

metadict_model['_-Работа землекопа (нормо-часов)'] = {
        '_-Строительство (нормо-часов)':1,
        }

metadict_model['_-Работа водопроводчика (нормо-часов)'] = {
        '_-Строительство (нормо-часов)':1,
        }

metadict_model['_-Работа разнорабочего (нормо-часов)'] = {
        '_-Строительство (нормо-часов)':1,
        }

metadict_model['_-Работа пегаса-разнорабочего (нормо-часов)'] = {
        '_-Строительство (нормо-часов)':1,
        }

metadict_model['_-Работа единорога-волшебника (нормо-часов)'] = {
        # TODO:
            # В этом случае единорожку используют как газовую горелку и дуговую сварку.
            # А ведь они гораздо универсальнее.
        '_-Строительство (нормо-часов)':1,
        }

metadict_model['_-Корчёвка пней (нормо-часов)'] = {
        '_-Строительство (нормо-часов)':1,
        }

metadict_model['_-Работа печника (нормо-часов)'] = {
        '_-Строительство (нормо-часов)':1,
        }

metadict_model['_-Работа каменщика (нормо-часов)'] = {
        '_-Строительство (нормо-часов)':1,
        }

metadict_model['_-Работа штукатура (нормо-часов)'] = {
        '_-Строительство (нормо-часов)':1,
        }

metadict_model['_-Работа маляра (нормо-часов)'] = {
        '_-Строительство (нормо-часов)':1,
        }

metadict_model['_-Работа плотника (нормо-часов)'] = {
        '_-Строительство (нормо-часов)':1,
        }

metadict_model['_-Работа строительной бригады (нормо-часов)'] = {
        '_-Строительство (нормо-часов)':1,
        }

metadict_model['_-Работа на дорожном строительстве (нормо-часов)'] = {
        '_-Строительство (нормо-часов)':1,
        }

metadict_model['_-Работа железнодорожного монтёра (нормо-часов)'] = {
        '_-Строительство (нормо-часов)':1,
        }

metadict_model['_-Работа путевого смотрителя (нормо-часов)'] = {
        '_-Обслуживание (нормо-часов)':1,
        }

metadict_model['_-Работа на производстве пресованной соломы (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Работа на пропитке глиной соломенных ковров (нормо-часов)'] = {
        # TODO: вообще-то это категория "лёгкая промышленность"
        '_-Строительство (нормо-часов)':1,
        }

metadict_model['_-Работа на производстве цемента (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Работа на производстве извести (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Работа на производстве бетона (нормо-часов)'] = {
        '_-Строительство (нормо-часов)':1,
        }

metadict_model['_-Работа на производстве кладочного раствора (нормо-часов)'] = {
        '_-Строительство (нормо-часов)':1,
        }

metadict_model['_-Работа на производстве отделочного раствора (нормо-часов)'] = {
        '_-Строительство (нормо-часов)':1,
        }

metadict_model['_-Работа на производстве щебня (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Работа сапёра (нормо-часов)'] = {
        # Взрывает щебень на карьерах.
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Работа на мыловарне (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Работа на производстве мятой глины (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Работа на производстве кирпича (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Работа на производстве черепицы (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Работа на производстве кафеля (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Работа лесоруба (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

#----
# Обработка древесины

metadict_detail['_-Работа на производстве паркета (нормо-часов)'] = {
        # TODO: нужен набор столярных инструментов.
        '_-Обработка сырья (нормо-часов)':1,
        }

#----
# Бумагодельное производство

metadict_detail['_-Работа на производстве бумаги (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

#----
# Текстильная промышленность

metadict_detail['_-Работа портного (нормо-часов)'] = {
        '_-Обработка ткани (нормо-часов)':1,
        #'-Портной':1 / (8 * 200),
        }

metadict_detail['_-Работа сапожника (нормо-часов)'] = {
        '_-Обработка ткани (нормо-часов)':1,
        #'-Сапожник':1 / (8 * 200),
        }

metadict_detail['_-Работа швеи (нормо-часов)'] = {
        '_-Обработка ткани (нормо-часов)':1,
        #'-Швея':1 / (8 * 200),
        }

metadict_detail['_-Работа ткача (нормо-часов)'] = {
        '_-Текстильная промышленность (нормо-часов)':1,
        #'-Ткач':1 / (8 * 200),
        }

metadict_detail['_-Беление ткани фабричное (нормо-часов)'] = {
        '_-Текстильная промышленность (нормо-часов)':1,
        #'-Красильщик':1 / (8 * 200),
        }

metadict_detail['_-Окраска ткани фабричная (нормо-часов)'] = {
        '_-Текстильная промышленность (нормо-часов)':1,
        #'-Красильщик':1 / (8 * 200),
        }

metadict_detail['_-Отжим и разглаживание ткани (нормо-часов)'] = {
        '_-Текстильная промышленность (нормо-часов)':1,
        #'-Красильщик':1 / (8 * 200),
        }

metadict_detail['_-Промывка ткани фабричная (нормо-часов)'] = {
        '_-Текстильная промышленность (нормо-часов)':1,
        #'-Красильщик':1 / (8 * 200),
        }

metadict_model['_-Работа на производстве соломенных ковров (нормо-часов)'] = {
        # TODO: вообще-то это категория "лёгкая промышленность"
        '_-Строительство (нормо-часов)':1,
        }

#----
# Переработка

metadict_model['_-Утилизация белья (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Утилизация обуви (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Утилизация одежды (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Утилизация утвари (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

#----
# Транспортировка

metadict_model['_-Работа вьючного пони (нормо-часов)'] = {
        '_--Транспортировка (нормо-часов)':1,
        }

metadict_model['_-Работа грузчика (нормо-часов)'] = {
        '_--Транспортировка (нормо-часов)':1,
        }

metadict_model['_-Работа грузчика с тележкой (нормо-часов)'] = {
        '_--Транспортировка (нормо-часов)':1,
        }

metadict_model['_-Работа пегаса с планёром (нормо-часов)'] = {
        '_--Транспортировка (нормо-часов)':1,
        }

metadict_model['_-Работа пегаса с катком (нормо-часов)'] = {
        '_--Транспортировка (нормо-часов)':1,
        }

metadict_model['_-Работа пегаса с телегой (нормо-часов)'] = {
        '_--Транспортировка (нормо-часов)':1,
        }

metadict_model['_-Работа пегаса-возничего (нормо-часов)'] = {
        '_--Транспортировка (нормо-часов)':1,
        }

metadict_model['_-Работа пегаса-таксиста (нормо-часов)'] = {
        '_--Транспортировка (нормо-часов)':1,
        }

metadict_detail['_-Работа пегаса-почтальона (нормо-часов)'] = {
        '_--Транспортировка (нормо-часов)':1,
        #'-Почтальон-пегас':1 / (8 * 200),
        }

metadict_model['_-Работа пегаса-лётчика (нормо-часов)'] = {
        '_--Транспортировка (нормо-часов)':1,
        }

metadict_model['_-Работа капитана грузового планёра (нормо-часов)'] = {
        '_--Транспортировка (нормо-часов)':1,
        }

metadict_detail['_-Работа библиотекаря (нормо-часов)'] = {
        '_-Обслуживание (нормо-часов)':1,
        #'-Библиотекарь':1 / (8 * 200),
        }

metadict_detail['_-Работа персонала почтового учреждения (нормо-часов)'] = {
        '_-Обслуживание (нормо-часов)':1,
        #'-Почтальон-служащий':1 / (8 * 200),
        }

metadict_model['_-Работа железнодорожника (нормо-часов)'] = {
        '_--Транспортировка (нормо-часов)':1,
        }

metadict_model['_-Работа пегаса-железнодорожника (нормо-часов)'] = {
        '_--Транспортировка (нормо-часов)':1,
        }

metadict_model['_-Работа капитана грузового барка (нормо-часов)'] = {
        '_--Транспортировка (нормо-часов)':1,
        }

metadict_model['_-Работа капитана грузовой баржи (нормо-часов)'] = {
        '_--Транспортировка (нормо-часов)':1,
        }

metadict_model['_-Работа моряка (нормо-часов)'] = {
        '_--Транспортировка (нормо-часов)':1,
        }

metadict_model['_-Работа пегаса-моряка (нормо-часов)'] = {
        '_--Транспортировка (нормо-часов)':1,
        }

metadict_model['_-Работа пегаса скорой помощи (нормо-часов)'] = {
        '_--Транспортировка (нормо-часов)':1,
        }

metadict_model['_-Работа врача больницы (нормо-часов)'] = {
        '_-Здравоохранение (нормо-часов)':1,
        }

metadict_model['_-Работа врача поликлиники (нормо-часов)'] = {
        '_-Здравоохранение (нормо-часов)':1,
        }

metadict_model['_-Работа фельдшера больницы (нормо-часов)'] = {
        '_-Здравоохранение (нормо-часов)':1,
        }

metadict_model['_-Работа фельдшера поликлиники (нормо-часов)'] = {
        '_-Здравоохранение (нормо-часов)':1,
        }

metadict_model['_-Работа фельдшера скорой помощи (нормо-часов)'] = {
        '_-Здравоохранение (нормо-часов)':1,
        }

#----
# Сельскохозяйственные работы (группировка)

metadict_model['_-Работа на грибоводстве (нормо-часов)'] = {
        '_--Полевые работы (нормо-часов)':1,
        }

metadict_model['_-Работа в саду (нормо-часов)'] = {
        '_--Полевые работы (нормо-часов)':1,
        }

metadict_model['_-Работа зебр на плантациях (нормо-часов)'] = {
        '_-Полевые работы зебр (нормо-часов)':1,
        }

metadict_model['_-Работа зебр на сборе дикоросов (нормо-часов)'] = {
        '_-Полевые работы зебр (нормо-часов)':1,
        }

metadict_model['_-Работа лесника (нормо-часов)'] = {
        '_--Полевые работы (нормо-часов)':1,
        }

metadict_model['_-Работа на огороде (нормо-часов)'] = {
        '_--Полевые работы (нормо-часов)':1,
        }

metadict_model['_-Работа на полях бобовых (нормо-часов)'] = {
        '_--Полевые работы (нормо-часов)':1,
        }

metadict_model['_-Работа на полях зерновых (нормо-часов)'] = {
        '_--Полевые работы (нормо-часов)':1,
        }

metadict_model['_-Работа на полях масличных (нормо-часов)'] = {
        '_--Полевые работы (нормо-часов)':1,
        }

metadict_model['_-Работа на полях технических культур (нормо-часов)'] = {
        '_--Полевые работы (нормо-часов)':1,
        }

metadict_model['_-Работа на сборе морских растений (нормо-часов)'] = {
        '_--Полевые работы (нормо-часов)':1,
        }

metadict_model['_-Работа на сборе дикорастущих растений (нормо-часов)'] = {
        '_--Полевые работы (нормо-часов)':1,
        }

metadict_model['_-Работа на сборе дикорастущих грибов (нормо-часов)'] = {
        '_--Полевые работы (нормо-часов)':1,
        }

metadict_model['_-Работа на сборе дикорастущих орехов (нормо-часов)'] = {
        '_--Полевые работы (нормо-часов)':1,
        }

metadict_model['_-Работа на сборе дикорастущих ягод (нормо-часов)'] = {
        '_--Полевые работы (нормо-часов)':1,
        }

metadict_model['_-Работа пчеловода (нормо-часов)'] = {
        '_--Полевые работы (нормо-часов)':1,
        }

metadict_model['_-Колка дров (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Колка дров (Зебрика) (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Колка пней на смоляк (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Корчёвка сосновых пней (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Работа на лесопилке (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Работа персонала смолокурни (нормо-часов)'] = {
        '_-Обработка сырья (нормо-часов)':1,
        }

metadict_model['_-Отжим сахарного тростника (нормо-часов)'] = {
        '_-Обработка сырья зебрами (нормо-часов)':1,
        }

metadict_model['_-Очистка сока сахарного тростника (нормо-часов)'] = {
        '_-Обработка сырья зебрами (нормо-часов)':1,
        }

metadict_model['_-Выпаривание сока сахарного тросника (нормо-часов)'] = {
        '_-Обработка сырья зебрами (нормо-часов)':1,
        }

#metadict_model['_-Кристаллизация сиропа в сахар-сырец (нормо-часов)'] = {
#        '_-Обработка сырья зебрами (нормо-часов)':1,
#        }

metadict_model['_-Потребление антреме (нормо-часов)'] = {
        '_-Потребление пищи (нормо-часов)':1,
        }

metadict_model['_-Потребление второго блюда (нормо-часов)'] = {
        '_-Потребление пищи (нормо-часов)':1,
        }

metadict_model['_-Потребление выпечки (нормо-часов)'] = {
        '_-Потребление пищи (нормо-часов)':1,
        }

metadict_model['_-Потребление горячего питья (нормо-часов)'] = {
        '_-Потребление питья (нормо-часов)':1,
        }

metadict_model['_-Потребление десерта (нормо-часов)'] = {
        '_-Потребление пищи (нормо-часов)':1,
        }

metadict_model['_-Потребление жареной выпечки (нормо-часов)'] = {
        '_-Потребление пищи (нормо-часов)':1,
        }

metadict_model['_-Потребление орешков (нормо-часов)'] = {
        '_-Потребление пищи (нормо-часов)':1,
        }

metadict_model['_-Потребление первого блюда (нормо-часов)'] = {
        '_-Потребление пищи (нормо-часов)':1,
        }

metadict_model['_-Потребление сладостей (нормо-часов)'] = {
        '_-Потребление пищи (нормо-часов)':1,
        }

metadict_model['_-Потребление сэндвичей (нормо-часов)'] = {
        '_-Потребление пищи (нормо-часов)':1,
        }

metadict_model['_-Потребление фруктов (нормо-часов)'] = {
        '_-Потребление пищи (нормо-часов)':1,
        }

metadict_model['_-Потребление хлеба (нормо-часов)'] = {
        '_-Потребление пищи (нормо-часов)':1,
        }

metadict_model['_-Потребление холодного питья (нормо-часов)'] = {
        '_-Потребление питья (нормо-часов)':1,
        }

#----
# Хозяйственные работы (группировка)

metadict_model['_--Полевые работы (нормо-часов)'] = {
        '-|1 Полевые работы (нормо-часов)':1,
        '-|- Трудозатраты (нормо-часов)':1,
        }

metadict_model['_-Строительство (нормо-часов)'] = {
        '-|2 Хозяйственные работы (нормо-часов)':1,
        '-|- Трудозатраты (нормо-часов)':1,
        }

metadict_model['_-Типографское дело (нормо-часов)'] = {
        '-|2 Хозяйственные работы (нормо-часов)':1,
        '-|- Трудозатраты (нормо-часов)':1,
        }

metadict_model['_-Текстильная промышленность (нормо-часов)'] = {
        '-|2 Хозяйственные работы (нормо-часов)':1,
        '-|- Трудозатраты (нормо-часов)':1,
        }

metadict_model['_-Обработка ткани (нормо-часов)'] = {
        '-|2 Хозяйственные работы (нормо-часов)':1,
        '-|- Трудозатраты (нормо-часов)':1,
        }

metadict_model['_-Обработка сырья (нормо-часов)'] = {
        '-|2 Хозяйственные работы (нормо-часов)':1,
        '-|- Трудозатраты (нормо-часов)':1,
        }

metadict_model['_-Приготовление пищи (нормо-часов)'] = {
        '-|4 Приготовление пищи (нормо-часов)':1,
        '-|- Трудозатраты (нормо-часов)':1,
        }

metadict_model['_-Обработка пищи (нормо-часов)'] = {
        '-|3 Обработка пищи (нормо-часов)':1,
        '-|- Трудозатраты (нормо-часов)':1,
        }

metadict_model['_--Транспортировка (нормо-часов)'] = {
        '-|5 Транспортировка (нормо-часов)':1,
        '-|- Трудозатраты (нормо-часов)':1,
        }

metadict_model['_-Обслуживание (нормо-часов)'] = {
        '-|6 Обслуживание (нормо-часов)':1,
        '-|- Трудозатраты (нормо-часов)':1,
        }

metadict_model['_-Образование, ученики (нормо-часов)'] = {
        # Школьники не учитываются в трудовых ресурсах.
        #'-|6 Обслуживание (нормо-часов)':1,
        #'-|- Трудозатраты (нормо-часов)':1,
        }

metadict_model['_-Образование, учителя (нормо-часов)'] = {
        '-|6 Обслуживание (нормо-часов)':1,
        '-|- Трудозатраты (нормо-часов)':1,
        }

metadict_model['_-Здравоохранение (нормо-часов)'] = {
        '-|6 Обслуживание (нормо-часов)':1,
        '-|- Трудозатраты (нормо-часов)':1,
        }

metadict_model['_--Гигиена (нормо-часов)'] = {
        # Души, бани. Нужно отдельно учитывать, как время отдыха.
        #'-|6 Обслуживание (нормо-часов)':1,
        #'-|- Трудозатраты (нормо-часов)':1,
        }

metadict_model['_--Досуг (нормо-часов)'] = {
        #'-|6 Обслуживание (нормо-часов)':1,
        #'-|- Трудозатраты (нормо-часов)':1,
        }

metadict_model['_-Полевые работы зебр (нормо-часов)'] = {
        # TODO: Работа полосатых загрязняет статистику.
        #'_--4 Полевые работы (нормо-часов)':1,
        }

metadict_model['_-Транспортные работы зебр (нормо-часов)'] = {
        # TODO: Работа полосатых загрязняет статистику.
        #'_--5 Транспортировка (нормо-часов)':1,
        }

metadict_model['_-Обработка сырья зебрами (нормо-часов)'] = {
        #'_--3 Хозяйственные работы (нормо-часов)':1,
        }

#----
# Отдых (группировка)

metadict_model['_-Потребление пищи (нормо-часов)'] = {
        '_--Досуг (нормо-часов)':1,
        }

metadict_model['_-Потребление питья (нормо-часов)'] = {
        '_--Досуг (нормо-часов)':1,
        }

#----
# Чтение, письмо:

metadict_detail['_-Упаковка посылки (нормо-часов)'] = {
        '_--Досуг (нормо-часов)':1,
        }

metadict_detail['_-Писательство, письма (нормо-часов)'] = {
        '_--Письмо (нормо-часов)':1,
        }

metadict_detail['_-Чтение писем (нормо-часов)'] = {
        '_--Чтение (нормо-часов)':1,
        }

metadict_detail['_-Чтение газеты (нормо-часов)'] = {
        '_--Чтение (нормо-часов)':1,
        }

metadict_detail['_-Чтение журнала (нормо-часов)'] = {
        '_--Чтение (нормо-часов)':1,
        }

metadict_detail['_-Чтение книги (нормо-часов)'] = {
        '_--Чтение (нормо-часов)':1,
        }

#----
# Чтение, письмо:

metadict_detail['_--Письмо (нормо-часов)'] = {
        '_--Досуг (нормо-часов)':1,
        }

metadict_detail['_--Чтение (нормо-часов)'] = {
        '_--Досуг (нормо-часов)':1,
        }
