#----
# Городские пони:

metadict_army['Балтимэрские городские пони'] = {
        'Южноморские горожане':1,
        'Земнопони':0.25,
        'Единороги':0.35,
        'Пегасы':0.40,
        }

metadict_army['Ванхуверские городские пони'] = {
        'Североморские горожане':1,
        'Земнопони':0.25,
        'Единороги':0.35,
        'Пегасы':0.40,
        }

metadict_army['Доджтаунские городские пони'] = {
        'Среднеземные горожане':1,
        'Земнопони':0.25,
        'Единороги':0.35,
        'Пегасы':0.40,
        }

metadict_army['Кантерлотские городские пони'] = {
        'Среднеземные горожане':1,
        'Земнопони':0.15,
        'Единороги':0.65,
        'Пегасы':0.20,
        }

metadict_army['Клаудсдэйлские городские пони'] = {
        'Среднеземные горожане':1,
        'Земнопони':0.05,
        'Единороги':0.10,
        'Пегасы':0.85,
        }

metadict_army['Мэйнхеттенские городские пони'] = {
        'Североморские горожане':1,
        'Земнопони':0.25,
        'Единороги':0.35,
        'Пегасы':0.40,
        }

metadict_army['Понивильские городские пони'] = {
        'Среднеземные горожане':1,
        'Земнопони':0.55,
        'Единороги':0.35,
        'Пегасы':0.10,
        }

metadict_army['Северо-восточные городские пони'] = {
        'Североморские горожане':1,
        'Земнопони':0.25,
        'Единороги':0.35,
        'Пегасы':0.40,
        }

metadict_army['Северо-западные городские пони'] = {
        'Североморские горожане':1,
        'Земнопони':0.25,
        'Единороги':0.35,
        'Пегасы':0.40,
        }

metadict_army['Среднеземные городские пони'] = {
        'Среднеземные горожане':1,
        'Земнопони':0.25,
        'Единороги':0.35,
        'Пегасы':0.40,
        }

metadict_army['Сталлионградские городские пони'] = {
        'Североморские горожане':1,
        'Земнопони':0.25,
        'Единороги':0.35,
        'Пегасы':0.40,
        }

metadict_army['Троттингемские городские пони'] = {
        'Южноморские горожане':1,
        'Земнопони':0.25,
        'Единороги':0.35,
        'Пегасы':0.40,
        }

metadict_army['Филлидельфийские городские пони'] = {
        'Среднеземные горожане':1,
        'Земнопони':0.25,
        'Единороги':0.35,
        'Пегасы':0.40,
        }

metadict_army['Хуффингтоские городские пони'] = {
        'Среднеземные горожане':1,
        'Земнопони':0.25,
        'Единороги':0.35,
        'Пегасы':0.40,
        }

metadict_army['Эпплузские городские пони'] = {
        'Среднеземные горожане':1,
        'Земнопони':0.25,
        'Единороги':0.35,
        'Пегасы':0.40,
        }

metadict_army['Юго-восточные городские пони'] = {
        'Южноморские горожане':1,
        'Земнопони':0.25,
        'Единороги':0.35,
        'Пегасы':0.40,
        }

#----
# Сельские пони:

metadict_army['Северо-восточные сельские пони'] = {
        'Североморские селяне':1,
        'Земнопони':0.90,
        'Единороги':0.02,
        'Пегасы':0.08,
        }

metadict_army['Северо-западные сельские пони'] = {
        'Североморские селяне':1,
        'Земнопони':0.90,
        'Единороги':0.02,
        'Пегасы':0.08,
        }

metadict_army['Среднеземные сельские пони'] = {
        'Среднеземные селяне':1,
        'Земнопони':0.90,
        'Единороги':0.02,
        'Пегасы':0.08,
        }

metadict_army['Юго-восточные сельские пони'] = {
        'Южноморские селяне':1,
        'Земнопони':0.90,
        'Единороги':0.02,
        'Пегасы':0.08,
        }

#----
# Благосостояние:

metadict_army['Североморские горожане'] = {
        # Исправить
            # Распределение Парето работает, но всё же.
            # Надо потом перепроверить по распределению ВВП.
        # Доходы середняков в 4 раза больше бедняцких, у богатых в 16 раз.
        'Североморские горожане бедняки':0.8,
        'Североморские горожане середняки':0.15,
        'Североморские горожане богатеи':0.05,
        }

metadict_army['Среднеземные горожане'] = {
        'Среднеземные горожане бедняки':0.8,
        'Среднеземные горожане середняки':0.15,
        'Среднеземные горожане богатеи':0.05,
        }

metadict_army['Южноморские горожане'] = {
        'Южноморские горожане бедняки':0.8,
        'Южноморские горожане середняки':0.15,
        'Южноморские горожане богатеи':0.05,
        }

metadict_army['Североморские селяне'] = {
        'Североморские селяне бедняки':0.8,
        'Североморские селяне середняки':0.15,
        'Североморские селяне богатеи':0.05,
        }

metadict_army['Среднеземные селяне'] = {
        'Среднеземные селяне бедняки':0.8,
        'Среднеземные селяне середняки':0.15,
        'Среднеземные селяне богатеи':0.05,
        }

metadict_army['Южноморские селяне'] = {
        'Южноморские селяне бедняки':0.8,
        'Южноморские селяне середняки':0.15,
        'Южноморские селяне богатеи':0.05,
        }

#----
# Распределение полов

metadict_army['Земнопони'] = {
        'Кобылки-земнопони':0.58333,
        'Жеребцы-земнопони':0.41667,
        }

metadict_army['Пегасы'] = {
        'Кобылки-пегаски':0.65,
        'Жеребцы-пегасы':0.35,
        }

metadict_army['Единороги'] = {
        'Кобылки-единорожки':0.587,
        'Жеребцы-единороги':0.413,
        }

#----
# Распределение возрастов

metadict_army['Жеребцы-единороги'] = {
        # Исправить
            # Подправь рост населения, ведь число понек выросло вдесятеро.
        'Жеребцы-единороги (0 лет)':0.01501,
        'Жеребцы-единороги (1-10 лет)':0.14163,
        'Жеребцы-единороги (11-20 лет)':0.14163,
        'Жеребцы-единороги (21-30 лет)':0.13589,
        'Жеребцы-единороги (31-40 лет)':0.12941,
        'Жеребцы-единороги (41-50 лет)':0.12127,
        'Жеребцы-единороги (51-60 лет)':0.10976,
        'Жеребцы-единороги (61-70 лет)':0.09218,
        'Жеребцы-единороги (71-80 лет)':0.06588,
        'Жеребцы-единороги (81-90 лет)':0.03334,
        'Жеребцы-единороги (91-100 лет)':0.00811,
        'Жеребцы-единороги (101-110 лет)':0.00042,
        }

metadict_army['Жеребцы-земнопони'] = {
        'Жеребцы-земнопони (0 лет)':0.01501,
        'Жеребцы-земнопони (1-10 лет)':0.14163,
        'Жеребцы-земнопони (11-20 лет)':0.14163,
        'Жеребцы-земнопони (21-30 лет)':0.13589,
        'Жеребцы-земнопони (31-40 лет)':0.12941,
        'Жеребцы-земнопони (41-50 лет)':0.12127,
        'Жеребцы-земнопони (51-60 лет)':0.10976,
        'Жеребцы-земнопони (61-70 лет)':0.09218,
        'Жеребцы-земнопони (71-80 лет)':0.06588,
        'Жеребцы-земнопони (81-90 лет)':0.03334,
        'Жеребцы-земнопони (91-100 лет)':0.00811,
        'Жеребцы-земнопони (101-110 лет)':0.00042,
        }

metadict_army['Жеребцы-пегасы'] = {
        'Жеребцы-пегасы (0 лет)':0.01501,
        'Жеребцы-пегасы (1-10 лет)':0.14163,
        'Жеребцы-пегасы (11-20 лет)':0.14163,
        'Жеребцы-пегасы (21-30 лет)':0.13589,
        'Жеребцы-пегасы (31-40 лет)':0.12941,
        'Жеребцы-пегасы (41-50 лет)':0.12127,
        'Жеребцы-пегасы (51-60 лет)':0.10976,
        'Жеребцы-пегасы (61-70 лет)':0.09218,
        'Жеребцы-пегасы (71-80 лет)':0.06588,
        'Жеребцы-пегасы (81-90 лет)':0.03334,
        'Жеребцы-пегасы (91-100 лет)':0.00811,
        'Жеребцы-пегасы (101-110 лет)':0.00042,
        }

metadict_army['Кобылки-единорожки'] = {
        'Кобылки-единорожки (0 лет)':0.01501,
        'Кобылки-единорожки (1-10 лет)':0.14163,
        'Кобылки-единорожки (11-20 лет)':0.14163,
        'Кобылки-единорожки (21-30 лет)':0.13589,
        'Кобылки-единорожки (31-40 лет)':0.12941,
        'Кобылки-единорожки (41-50 лет)':0.12127,
        'Кобылки-единорожки (51-60 лет)':0.10976,
        'Кобылки-единорожки (61-70 лет)':0.09218,
        'Кобылки-единорожки (71-80 лет)':0.06588,
        'Кобылки-единорожки (81-90 лет)':0.03334,
        'Кобылки-единорожки (91-100 лет)':0.00811,
        'Кобылки-единорожки (101-110 лет)':0.00042,
        }

metadict_army['Кобылки-земнопони'] = {
        'Кобылки-земнопони (0 лет)':0.01501,
        'Кобылки-земнопони (1-10 лет)':0.14163,
        'Кобылки-земнопони (11-20 лет)':0.14163,
        'Кобылки-земнопони (21-30 лет)':0.13589,
        'Кобылки-земнопони (31-40 лет)':0.12941,
        'Кобылки-земнопони (41-50 лет)':0.12127,
        'Кобылки-земнопони (51-60 лет)':0.10976,
        'Кобылки-земнопони (61-70 лет)':0.09218,
        'Кобылки-земнопони (71-80 лет)':0.06588,
        'Кобылки-земнопони (81-90 лет)':0.03334,
        'Кобылки-земнопони (91-100 лет)':0.00811,
        'Кобылки-земнопони (101-110 лет)':0.00042,
        }

metadict_army['Кобылки-пегаски'] = {
        'Кобылки-пегаски (0 лет)':0.01501,
        'Кобылки-пегаски (1-10 лет)':0.14163,
        'Кобылки-пегаски (11-20 лет)':0.14163,
        'Кобылки-пегаски (21-30 лет)':0.13589,
        'Кобылки-пегаски (31-40 лет)':0.12941,
        'Кобылки-пегаски (41-50 лет)':0.12127,
        'Кобылки-пегаски (51-60 лет)':0.10976,
        'Кобылки-пегаски (61-70 лет)':0.09218,
        'Кобылки-пегаски (71-80 лет)':0.06588,
        'Кобылки-пегаски (81-90 лет)':0.03334,
        'Кобылки-пегаски (91-100 лет)':0.00811,
        'Кобылки-пегаски (101-110 лет)':0.00042,
        }

#----
# Профессии

metadict_army['Жеребцы-единороги (0 лет)'] = {                       
        'Единороги-младенцы':1,
        }

metadict_army['Жеребцы-единороги (1-10 лет)'] = {
        'Единороги-дети':6/9,
        'Единороги-школьники':3/9,
        }

metadict_army['Жеребцы-единороги (11-20 лет)'] = {
        'Единороги-школьники':4/9,
        'Единороги-подмастерья':5/9,
        }

metadict_army['Жеребцы-единороги (21-30 лет)'] = {
        'Единороги-рабочие':1,
        }

metadict_army['Жеребцы-единороги (31-40 лет)'] = {
        'Единороги-рабочие':1,
        }

metadict_army['Жеребцы-единороги (41-50 лет)'] = {
        'Единороги-рабочие':1,
        }

metadict_army['Жеребцы-единороги (51-60 лет)'] = {
        'Единороги-рабочие':1,
        }

metadict_army['Жеребцы-единороги (61-70 лет)'] = {
        'Единороги-старики':1,
        }

metadict_army['Жеребцы-единороги (71-80 лет)'] = {
        'Единороги-старики':1,
        }

metadict_army['Жеребцы-единороги (81-90 лет)'] = {
        'Единороги-старики':1,
        }

metadict_army['Жеребцы-единороги (91-100 лет)'] = {
        'Единороги-старики':1,
        }

metadict_army['Жеребцы-единороги (101-110 лет)'] = {
        'Единороги-старики':1,
        }

metadict_army['Жеребцы-земнопони (0 лет)'] = {
        'Земнопони-младенцы':1,
        }

metadict_army['Жеребцы-земнопони (1-10 лет)'] = {
        'Земнопони-дети':6/9,
        'Земнопони-школьники':3/9,
        }

metadict_army['Жеребцы-земнопони (11-20 лет)'] = {
        'Земнопони-школьники':4/9,
        'Земнопони-подмастерья':5/9,
        }

metadict_army['Жеребцы-земнопони (21-30 лет)'] = {
        'Земнопони-рабочие':1,
        }

metadict_army['Жеребцы-земнопони (31-40 лет)'] = {
        'Земнопони-рабочие':1,
        }

metadict_army['Жеребцы-земнопони (41-50 лет)'] = {
        'Земнопони-рабочие':1,
        }

metadict_army['Жеребцы-земнопони (51-60 лет)'] = {
        'Земнопони-рабочие':1,
        }

metadict_army['Жеребцы-земнопони (61-70 лет)'] = {
        'Земнопони-старики':1,
        }

metadict_army['Жеребцы-земнопони (71-80 лет)'] = {
        'Земнопони-старики':1,
        }

metadict_army['Жеребцы-земнопони (81-90 лет)'] = {
        'Земнопони-старики':1,
        }

metadict_army['Жеребцы-земнопони (91-100 лет)'] = {
        'Земнопони-старики':1,
        }

metadict_army['Жеребцы-земнопони (101-110 лет)'] = {
        'Земнопони-старики':1,
        }

metadict_army['Жеребцы-пегасы (0 лет)'] = {
        'Пегасы-младенцы':1,
        }

metadict_army['Жеребцы-пегасы (1-10 лет)'] = {
        'Пегасы-дети':6/9,
        'Пегасы-школьники':3/9,
        }

metadict_army['Жеребцы-пегасы (11-20 лет)'] = {
        'Пегасы-школьники':4/9,
        'Пегасы-подмастерья':5/9,
        }

metadict_army['Жеребцы-пегасы (21-30 лет)'] = {
        'Пегасы-рабочие':1,
        }

metadict_army['Жеребцы-пегасы (31-40 лет)'] = {
        'Пегасы-рабочие':1,
        }

metadict_army['Жеребцы-пегасы (41-50 лет)'] = {
        'Пегасы-рабочие':1,
        }

metadict_army['Жеребцы-пегасы (51-60 лет)'] = {
        'Пегасы-рабочие':1,
        }

metadict_army['Жеребцы-пегасы (61-70 лет)'] = {
        'Пегасы-старики':1,
        }

metadict_army['Жеребцы-пегасы (71-80 лет)'] = {
        'Пегасы-старики':1,
        }

metadict_army['Жеребцы-пегасы (81-90 лет)'] = {
        'Пегасы-старики':1,
        }

metadict_army['Жеребцы-пегасы (91-100 лет)'] = {
        'Пегасы-старики':1,
        }

metadict_army['Жеребцы-пегасы (101-110 лет)'] = {
        'Пегасы-старики':1,
        }

metadict_army['Кобылки-единорожки (0 лет)'] = {                           
        'Единороги-младенцы':1,
        }

metadict_army['Кобылки-единорожки (1-10 лет)'] = {
        'Единороги-дети':6/9,
        'Единороги-школьники':3/9,
        }

metadict_army['Кобылки-единорожки (11-20 лет)'] = {
        'Единороги-школьники':4/9,
        'Единороги-подмастерья':5/9,
        }

metadict_army['Кобылки-единорожки (21-30 лет)'] = {
        'Единороги-рабочие':1,
        }

metadict_army['Кобылки-единорожки (31-40 лет)'] = {
        'Единороги-рабочие':1,
        }

metadict_army['Кобылки-единорожки (41-50 лет)'] = {
        'Единороги-рабочие':1,
        }

metadict_army['Кобылки-единорожки (51-60 лет)'] = {
        'Единороги-рабочие':1,
        }

metadict_army['Кобылки-единорожки (61-70 лет)'] = {
        'Единороги-старики':1,
        }

metadict_army['Кобылки-единорожки (71-80 лет)'] = {
        'Единороги-старики':1,
        }

metadict_army['Кобылки-единорожки (81-90 лет)'] = {
        'Единороги-старики':1,
        }

metadict_army['Кобылки-единорожки (91-100 лет)'] = {
        'Единороги-старики':1,
        }

metadict_army['Кобылки-единорожки (101-110 лет)'] = {
        'Единороги-старики':1,
        }

metadict_army['Кобылки-земнопони (0 лет)'] = {
        'Земнопони-младенцы':1,
        }

metadict_army['Кобылки-земнопони (1-10 лет)'] = {
        'Земнопони-дети':6/9,
        'Земнопони-школьники':3/9,
        }

metadict_army['Кобылки-земнопони (11-20 лет)'] = {
        'Земнопони-школьники':4/9,
        'Земнопони-подмастерья':5/9,
        }

metadict_army['Кобылки-земнопони (21-30 лет)'] = {
        'Земнопони-рабочие':1,
        }

metadict_army['Кобылки-земнопони (31-40 лет)'] = {
        'Земнопони-рабочие':1,
        }

metadict_army['Кобылки-земнопони (41-50 лет)'] = {
        'Земнопони-рабочие':1,
        }

metadict_army['Кобылки-земнопони (51-60 лет)'] = {
        'Земнопони-рабочие':1,
        }

metadict_army['Кобылки-земнопони (61-70 лет)'] = {
        'Земнопони-старики':1,
        }

metadict_army['Кобылки-земнопони (71-80 лет)'] = {
        'Земнопони-старики':1,
        }

metadict_army['Кобылки-земнопони (81-90 лет)'] = {
        'Земнопони-старики':1,
        }

metadict_army['Кобылки-земнопони (91-100 лет)'] = {
        'Земнопони-старики':1,
        }

metadict_army['Кобылки-земнопони (101-110 лет)'] = {
        'Земнопони-старики':1,
        }

metadict_army['Кобылки-пегаски (0 лет)'] = {
        'Пегасы-младенцы':1,
        }

metadict_army['Кобылки-пегаски (1-10 лет)'] = {
        'Пегасы-дети':6/9,
        'Пегасы-школьники':3/9,
        }

metadict_army['Кобылки-пегаски (11-20 лет)'] = {
        'Пегасы-школьники':4/9,
        'Пегасы-подмастерья':5/9,
        }

metadict_army['Кобылки-пегаски (21-30 лет)'] = {
        'Пегасы-рабочие':1,
        }

metadict_army['Кобылки-пегаски (31-40 лет)'] = {
        'Пегасы-рабочие':1,
        }

metadict_army['Кобылки-пегаски (41-50 лет)'] = {
        'Пегасы-рабочие':1,
        }

metadict_army['Кобылки-пегаски (51-60 лет)'] = {
        'Пегасы-рабочие':1,
        }

metadict_army['Кобылки-пегаски (61-70 лет)'] = {
        'Пегасы-старики':1,
        }

metadict_army['Кобылки-пегаски (71-80 лет)'] = {
        'Пегасы-старики':1,
        }

metadict_army['Кобылки-пегаски (81-90 лет)'] = {
        'Пегасы-старики':1,
        }

metadict_army['Кобылки-пегаски (91-100 лет)'] = {
        'Пегасы-старики':1,
        }

metadict_army['Кобылки-пегаски (101-110 лет)'] = {
        'Пегасы-старики':1,
        }

#----
# Трудовые ресурсы

metadict_army['Единороги-младенцы'] = {
        # Исправить
            # Здесь же рассчитай потребность в родильных домах, школах, больницах.
        '-Младенцы':1,
        }

metadict_army['Единороги-дети'] = {
        '-Дети':1,
        }

metadict_army['Единороги-школьники'] = {
        '-Школьники':1,
        }

metadict_army['Единороги-подмастерья'] = {
        '_+Работа единорога (дней/год)':200 / 2,
        '-Подмастерья':1,
        }

metadict_army['Единороги-рабочие'] = {
        '_+Работа единорога (дней/год)':200,
        '-Рабочие':1,
        }

metadict_army['Единороги-старики'] = {
        '_+Работа единорога (дней/год)':200 / 2,
        '-Старики':1,
        }

metadict_army['Земнопони-младенцы'] = {
        '-Младенцы':1,
        }

metadict_army['Земнопони-дети'] = {
        '-Дети':1,
        }

metadict_army['Земнопони-школьники'] = {
        '-Школьники':1,
        }

metadict_army['Земнопони-подмастерья'] = {
        '_+Работа земнопони (дней/год)':200 / 2,
        '-Подмастерья':1,
        }

metadict_army['Земнопони-рабочие'] = {
        '_+Работа земнопони (дней/год)':200,
        '-Рабочие':1,
        }

metadict_army['Земнопони-старики'] = {
        '_+Работа земнопони (дней/год)':200 / 2,
        '-Старики':1,
        }

metadict_army['Пегасы-младенцы'] = {
        '-Младенцы':1,
        }

metadict_army['Пегасы-дети'] = {
        '-Дети':1,
        }

metadict_army['Пегасы-школьники'] = {
        '-Школьники':1,
        }

metadict_army['Пегасы-подмастерья'] = {
        '_+Работа пегаса (дней/год)':200 / 2,
        '-Подмастерья':1,
        }

metadict_army['Пегасы-рабочие'] = {
        '_+Работа пегаса (дней/год)':200,
        '-Рабочие':1,
        }

metadict_army['Пегасы-старики'] = {
        '_+Работа пегаса (дней/год)':200 / 2,
        '-Старики':1,
        }

#----
# Трудовые ресурсы (трудодни --> нормо-часы)

metadict_army['_+Работа единорога (дней/год)'] = {
        '_+Работа единорога (нормо-часов)':8,
        }

metadict_army['_+Работа земнопони (дней/год)'] = {
        '_+Работа земнопони (нормо-часов)':8,
        }

metadict_army['_+Работа пегаса (дней/год)'] = {
        '_+Работа пегаса (нормо-часов)':8,
        }
