#----
# Потребление пищи, обслуживание, развлечения:

metadict_detail['||Блюдо первое горячее (200-грамм/порция)'] = {
        # Обычно пони обедают компаниями в 10-25 носов.
            # Еду подают в больших мисках с носиками, каждый берёт себе сам.
            # Пони не едят ложками. Пользуются своей посудой и собственным языком.
        '_-Потребление блюда первого, горячего (килограмм)':0.2,
        'Использование миски 0.5-литровой для еды (часов)':30 / 60,
        }

metadict_detail['||Блюдо первое холодное (200-грамм/порция)'] = {
        # Мытьё посуды присобачено в tools.
        '_-Потребление блюда первого, холодного (килограмм)':0.2,
        'Использование миски 0.5-литровой для еды (часов)':30 / 60,
        }

metadict_detail['||Блюдо второе горячее (200-грамм/порция)'] = {
        '_-Потребление блюда второго, горячего (килограмм)':0.2,
        'Использование миски 0.5-литровой для еды (часов)':30 / 60,
        }

metadict_detail['||Блюдо второе холодное (200-грамм/порция)'] = {
        '_-Потребление блюда второго, холодного (килограмм)':0.2,
        'Использование миски 0.5-литровой для еды (часов)':30 / 60,
        }

metadict_detail['||Антреме горячее (200-грамм/порция)'] = {
        '_-Потребление блюда второго, горячего (килограмм)':0.2,
        'Использование миски 0.5-литровой для еды (часов)':30 / 60,
        }

metadict_detail['||Антреме холодное (200-грамм/порция)'] = {
        '_-Потребление блюда второго, холодного (килограмм)':0.2,
        'Использование миски 0.5-литровой для еды (часов)':30 / 60,
        }

metadict_detail['||Блюдо первое горячее (100-грамм/порция)'] = {
        # Вообще-то называть порцию в 100 грамм первым блюдом некорректно.
        # Это всё традиции южан, у которых не блюда, а пиалы с острыми супами и соусами.
        '_-Потребление блюда первого, горячего (килограмм)':0.100,
        'Использование чашки 0.25-литровой для еды (часов)':30 / 60,
        }

metadict_detail['||Блюдо первое холодное (100-грамм/порция)'] = {
        # Блюдца неудобно брать копытами. Пони используют чашки и свои длинные языки.
        '_-Потребление блюда первого, холодного (килограмм)':0.100,
        'Использование чашки 0.25-литровой для еды (часов)':30 / 60,
        }

metadict_detail['||Блюдо второе горячее (100-грамм/порция)'] = {
        '_-Потребление блюда второго, горячего (килограмм)':0.100,
        'Использование чашки 0.25-литровой для еды (часов)':30 / 60,
        }

metadict_detail['||Блюдо второе холодное (100-грамм/порция)'] = {
        '_-Потребление блюда второго, холодного (килограмм)':0.100,
        'Использование чашки 0.25-литровой для еды (часов)':30 / 60,
        }

metadict_detail['||Антреме горячее (100-грамм/порция)'] = {
        '_-Потребление блюда второго, горячего (килограмм)':0.100,
        'Использование чашки 0.25-литровой для еды (часов)':30 / 60,
        }

metadict_detail['||Антреме холодное (100-грамм/порция)'] = {
        '_-Потребление блюда второго, холодного (килограмм)':0.100,
        'Использование чашки 0.25-литровой для еды (часов)':30 / 60,
        }

metadict_detail['||Десерт горячий (100-грамм/порция)'] = {
        '_-Потребление десерта, горячего (килограмм)':0.100,
        'Использование чашки 0.25-литровой для еды (часов)':30 / 60,
        }

metadict_detail['||Десерт горячий (50-грамм/порция)'] = {
        # Суфле
        '_-Потребление десерта, горячего (килограмм)':0.05,
        'Использование чашки 0.25-литровой для еды (часов)':15 / 60,
        }

metadict_detail['||Десерт холодный (100-грамм/порция)'] = {
        '_-Потребление десерта, холодного (килограмм)':0.100,
        'Использование чашки 0.25-литровой для еды (часов)':30 / 60,
        }

metadict_detail['||Фрукты консервированные (200-грамм/порция)'] = {
        '_-Потребление фруктов, консервированных (килограмм)':0.2,
        'Использование миски 0.5-литровой для еды (часов)':30 / 60,
        }

metadict_detail['||Фрукты консервированные (100-грамм/порция)'] = {
        '_-Потребление фруктов, консервированных (килограмм)':0.100,
        'Использование чашки 0.25-литровой для еды (часов)':30 / 60,
        }

metadict_detail['||Питьё горячее (200-грамм/порция)'] = {
        '_-Потребление питья, горячего (килограмм)':0.2,
        'Использование кружки 0.5-литровой для питья (часов)':30 / 60,
        }

metadict_detail['||Питьё холодное (200-грамм/порция)'] = {
        '_-Потребление питья, холодного (килограмм)':0.2,
        'Использование кружки 0.5-литровой для питья (часов)':30 / 60,
        }

#----
# Порции в общей посуде:

metadict_detail['||Фрукты свежие (200-грамм/порция)'] = {
        '_-Потребление фруктов, свежих (килограмм)':0.2,
        'Использование корзинки для подачи фруктов (часов/килограмм)':1 / 4,
        }

metadict_detail['||Фрукты свежие (100-грамм/порция)'] = {
        '_-Потребление фруктов, свежих (килограмм)':0.100,
        'Использование корзинки для подачи фруктов (часов/килограмм)':1 / 8,
        }

metadict_detail['||Выпечка (200-грамм/порция)'] = {
        '_-Потребление выпечки, печёной (килограмм)':0.2,
        'Использование миски для подачи выпечки (часов/килограмм)':1 / 4,
        }

metadict_detail['||Выпечка (50-грамм/порция)'] = {
        '_-Потребление выпечки, печёной (килограмм)':0.05,
        'Использование корзинки для подачи выпечки (часов/килограмм)':1 / 20,
        }

metadict_detail['||Выпечка жареная (50-грамм/порция)'] = {
        '_-Потребление выпечки, жареной (килограмм)':0.05,
        'Использование корзинки для подачи жареной выпечки (часов/килограмм)':1 / 20,
        }

metadict_detail['||Выпечка жареная (25-грамм/порция)'] = {
        '_-Потребление выпечки, жареной (килограмм)':0.025,
        'Использование корзинки для подачи жареной выпечки (часов/килограмм)':1 / 40,
        }

metadict_detail['||Хлеб (50-грамм/порция)'] = {
        '_-Нарезка хлеба (килограмм)':0.05,
        '_-Потребление выпечки, хлеба (килограмм)':0.05,
        'Использование корзинки для подачи хлеба (часов/килограмм)':1 / 20,
        }

metadict_detail['||Сэндвичи (50-грамм/порция)'] = {
        '_-Потребление выпечки, сэндвичей (килограмм)':0.05,
        'Использование корзинки для подачи сэндвичей (часов/килограмм)':1 / 20,
        }

metadict_detail['||Соус холодный (25-грамм/порция)'] = {
        '_-Потребление блюда второго, холодного (килограмм)':0.025,
        'Использование чашки для подачи соуса (часов/килограмм)':1 / 40,
        }

metadict_detail['||Орешки (10-грамм/порция)'] = {
        '_-Потребление десерта, орешков (килограмм)':0.01,
        'Использование корзинки для подачи орешков (часов/килограмм)':1 / 100,
        }

metadict_detail['||Сладости (10-грамм/порция)'] = {
        '_-Потребление десерта, конфет (килограмм)':0.01,
        'Использование корзинки для подачи сладостей (часов/килограмм)':1 / 100,
        }

metadict_detail['||Изделия из варёного теста (10-грамм/порция)'] = {
        '_-Потребление десерта, горячего (килограмм)':0.01,
        'Использование миски для подачи вареников (часов/килограмм)':1 / 100,
        }
