#----
# Всю эту домашнюю утварь и инструменты потом подсчитаем, когда будет готова денежная система:

metadict_detail['|Бинокль'] = {
        }

metadict_detail['|Блюдо для еды (2 литра)'] = {
        }

metadict_detail['|Блюдце для еды (0.5 литра)'] = {
        }

metadict_detail['|Бункер для раствора (кубометр)'] = {
        }

metadict_detail['|Бучарда штукатурная'] = {
        }

metadict_detail['|Валик для окраски поверхностей'] = {
        }

metadict_detail['|Ванночка с сеткой'] = {
        }

metadict_detail['|Ведро деревянное (10 литров)'] = {
        }

metadict_detail['|Визирки (для определения величины просадок)'] = {
        }

metadict_detail['|Вилы щебёночные'] = {
        }

metadict_detail['|Воронка кухонная'] = {
        }

metadict_detail['|Вышка передвижная сборно-разборная'] = {
        }

metadict_detail['|Гладилка стальная большая'] = {
        }

metadict_detail['|Гладилка стальная малая'] = {
        }

metadict_detail['|Горшок для углей (10 литров)'] = {
        }

metadict_detail['|Горшок печной (1 литр)'] = {
        }

metadict_detail['|Горшок печной (2 литра)'] = {
        }

metadict_detail['|Горшок печной (5 литров)'] = {
        }

metadict_detail['|Дексель (для затёски шпал)'] = {
        }

metadict_detail['|Деревянная бочка (300 литров)'] = {
        }

metadict_detail['|Деревянная кадка (100 литров)'] = {
        }

metadict_detail['|Деревянная кадка (300 литров)'] = {
        }

metadict_detail['|Деревянное ведро (10 литров)'] = {
        }

metadict_detail['|Диван'] = {
        }

metadict_detail['|Лавка'] = {
        }

metadict_detail['|Долото'] = {
        }

metadict_detail['|Домкрат винтовой (10 тонн)'] = {
        }

metadict_detail['|Доска для овощей'] = {
        }

metadict_detail['|Доска для теста'] = {
        }

metadict_detail['|Дрель пневматическая (0.5 кВт)'] = {
        }

metadict_detail['|Дровяная печь (5.5 кВт)'] = {
        }

metadict_detail['|Дровяная печь (2.5 кВт)'] = {
        }

metadict_detail['|Дуршлаг кухонный'] = {
        }

metadict_detail['|Душ'] = {
        }

metadict_detail['|Жернова (1-кг/час)'] = {
        }

metadict_detail['|Зеркало'] = {
        }

metadict_detail['|Зеркало (для осмотра рельсов)'] = {
        }

metadict_detail['|Зубило кузнечное'] = {
        }

metadict_detail['|Зубило слесарное'] = {
        }

metadict_detail['|Инвентарные шарнирно-панельные подмостки'] = {
        }

metadict_detail['|Каска строительная'] = {
        }

metadict_detail['|Квашня деревянная (25 литров)'] = {
        }

metadict_detail['|Кельма для каменных работ'] = {
        }

metadict_detail['|Кельма штукатурная'] = {
        }

metadict_detail['|Кирка остроконечная'] = {
        }

metadict_detail['|Кисть маховая'] = {
        }

metadict_detail['|Кисть филенчатая'] = {
        }

metadict_detail['|Кисть флейцовая КФ-62'] = {
        }

metadict_detail['|Кисть-макловица'] = {
        }

metadict_detail['|Кисть-ручник КР-35'] = {
        }

metadict_detail['|Клещи обыкновенные'] = {
        }

metadict_detail['|Клещи шпальные'] = {
        }

metadict_detail['|Ключ путевой рожковый'] = {
        }

metadict_detail['|Ключ торцовый (гаечный)'] = {
        }

metadict_detail['|Ключ торцовый (шурупный)'] = {
        }

metadict_detail['|Ковш деревянный (5 литров)'] = {
        }

metadict_detail['|Ковш для отделочных работ'] = {
        }

metadict_detail['|Ковшик для питья (1 литр)'] = {
        }

metadict_detail['|Ковёр (квадратный метр)'] = {
        }

metadict_detail['|Когти для щебня'] = {
        }

metadict_detail['|Коловорот (по дереву)'] = {
        }

metadict_detail['|Коловорот (по металлу)'] = {
        }

metadict_detail['|Комод'] = {
        }

metadict_detail['|Компрессор винтовой (30 кВт)'] = {
        }

metadict_detail['|Водонагревный котёл (100 кВт)'] = {
        # Материал — сталь
        # Масса 3 тонны
        # Габариты 2x2x2 метра.
        # Топливо — уголь. КПД — 70%
        }

metadict_detail['|Парогенератор (5 кВт)'] = {
        }

metadict_detail['|Радиатор отопления, чугунный (2 кВт)'] = {
        }

metadict_detail['|Котёл чугунный (25 литров)'] = {
        }

metadict_detail['|Котелок чугунный (10 литров)'] = {
        }

metadict_detail['|Кочерга литая'] = {
        }

metadict_detail['|Кран для воды'] = {
        }

metadict_detail['|Кровать двуспальная'] = {
        }

metadict_detail['|Кровать односпальная'] = {
        }

metadict_detail['|Кружка для питья (0.5 литра)'] = {
        }

metadict_detail['|Кружка мерная (для суфляжа)'] = {
        }

metadict_detail['|Кувалда (5 килограмм)'] = {
        }

metadict_detail['|Кувшин глиняный (3 литра)'] = {
        }

metadict_detail['|Кувшин глиняный (5 литров)'] = {
        }

metadict_detail['|Лампа светляковая (1200 Лм)'] = {
        }

metadict_detail['|Лампа светокристальная (1200 Лм)'] = {
        }

metadict_detail['|Лампа светокристальная (600 Лм)'] = {
        }

metadict_detail['|Линейка для расшивки швов'] = {
        }

metadict_detail['|Линейка измерительная металлическая'] = {
        }

metadict_detail['|Линейка метровая (для измерения неровностей рельсов)'] = {
        }

metadict_detail['|Лом лапчатый'] = {
        }

metadict_detail['|Лом монтажный'] = {
        }

metadict_detail['|Лом остроконечный'] = {
        }

metadict_detail['|Лопата деревянная'] = {
        }

metadict_detail['|Лопата печная'] = {
        }

metadict_detail['|Лопата растворная'] = {
        }

metadict_detail['|Лопата совковая'] = {
        }

metadict_detail['|Лопата суфляжная'] = {
        }

metadict_detail['|Лопата штыковая'] = {
        }

metadict_detail['|Лопатка кухонная'] = {
        }

metadict_detail['|Лупа (для осмотра рельсов)'] = {
        }

metadict_detail['|Метла'] = {
        }

metadict_detail['|Метр металлический'] = {
        }

metadict_detail['|Метр складной металлический'] = {
        }

metadict_detail['|Метёлка печная'] = {
        }

metadict_detail['|Механический насос (35 литров/минуту)'] = {
        }

metadict_detail['|Миска глиняная (3 литра)'] = {
        }

metadict_detail['|Миска глиняная (5 литров)'] = {
        }

metadict_detail['|Миска для еды (1 литр)'] = {
        }

metadict_detail['|Молоток (для остукивания рельсов)'] = {
        }

metadict_detail['|Молоток костыльный'] = {
        }

metadict_detail['|Молоток слесарный'] = {
        }

metadict_detail['|Молоток штукатурный'] = {
        }

metadict_detail['|Молоток-кирочка'] = {
        }

metadict_detail['|Наддёргиватель путевых костылей'] = {
        }

metadict_detail['|Напильник трёхгранный (150 мм)'] = {
        }

metadict_detail['|Напольная раковина'] = {
        }

metadict_detail['|Нож кухонный (10 см)'] = {
        }

metadict_detail['|Нож кухонный (6 см)'] = {
        }

metadict_detail['|Нож столовый'] = {
        }

metadict_detail['|Нож штукатурный'] = {
        }

metadict_detail['|Нож-овощечистка'] = {
        }

metadict_detail['|Ножницы для резки металла'] = {
        }

metadict_detail['|Ножницы кухонные'] = {
        }

metadict_detail['|Ножовка по дереву широкая'] = {
        }

metadict_detail['|Обводной привод'] = {
        }

metadict_detail['|Острогубцы (кусачки)'] = {
        }

metadict_detail['|Отвес строительный'] = {
        }

metadict_detail['|Отрезовка'] = {
        }

metadict_detail['|Очки защитные'] = {
        }

metadict_detail['|Пила механическая цепная (2 кВт)'] = {
        }

metadict_detail['|Пила ножовка поперечная по дереву'] = {
        }

metadict_detail['|Пила поперечная'] = {
        }

metadict_detail['|Пила-ножовка'] = {
        }

metadict_detail['|Поварёшка деревянная (0.25 литра)'] = {
        }

metadict_detail['|Поварёшка стальная (0.125 литра)'] = {
        }

metadict_detail['|Поддон с металлическими крючьями'] = {
        }

metadict_detail['|Подмости панельные для кирпичной кладки'] = {
        }

metadict_detail['|Полотенце кухонное'] = {
        }

metadict_detail['|Полутёрка деревянная'] = {
        }

metadict_detail['|Поэтажная ёмкость 0.35'] = {
        }

metadict_detail['|Пояс монтажный'] = {
        }

metadict_detail['|Правило'] = {
        }

metadict_detail['|Правило окованное'] = {
        }

metadict_detail['|Правило прижимное'] = {
        }

metadict_detail['|Правило усеночное'] = {
        }

metadict_detail['|Прибор стяжной (для перешивки пути)'] = {
        }

metadict_detail['|Приспособление для шлифовки поверхностей'] = {
        }

metadict_detail['|Прозорник стыковой'] = {
        }

metadict_detail['|Прозорник-прокладка'] = {
        }

metadict_detail['|Противень жестяной (12 литров)'] = {
        }

metadict_detail['|Путевой ключ механичесикй (0.4 кВт)'] = {
        }

metadict_detail['|Разгонщик гидравлический'] = {
        }

metadict_detail['|Раковина'] = {
        }

metadict_detail['|Расшивка'] = {
        }

metadict_detail['|Расшивка (выпуклая и вогнутая)'] = {
        }

metadict_detail['|Рейка контрольная длиной 2 м'] = {
        }

metadict_detail['|Рейка с отвесом'] = {
        }

metadict_detail['|Рейка-порядовка'] = {
        }

metadict_detail['|Рейкодержатель винтовой'] = {
        }

metadict_detail['|Рейкодержатель дуговой'] = {
        }

metadict_detail['|Рейкодержатель универсальный'] = {
        }

metadict_detail['|Рейкодержатель штыревой'] = {
        }

metadict_detail['|Респиратор ШБ1'] = {
        }

metadict_detail['|Решето рогожно-деревянное'] = {
        }

metadict_detail['|Рихтовщик гидравлический'] = {
        }

metadict_detail['|Рубанок'] = {
        }

metadict_detail['|Рулетка (30 метров)'] = {
        }

metadict_detail['|Рулетка металлическая'] = {
        }

metadict_detail['|Рулетки измерительные металлические'] = {
        }

metadict_detail['|Самовар медный (5 литров)'] = {
        }

metadict_detail['|Сито для муки'] = {
        }

metadict_detail['|Скалка кухонная'] = {
        }

metadict_detail['|Скоба (для перегонки шпал)'] = {
        }

metadict_detail['|Скобы литые'] = {
        }

metadict_detail['|Сковорода чугунная (1 литр)'] = {
        }

metadict_detail['|Сковородник'] = {
        }

metadict_detail['|Скрапели диаметром 8 и 10 мм'] = {
        }

metadict_detail['|Скребок'] = {
        }

metadict_detail['|Скребок металлический'] = {
        }

metadict_detail['|Совок печной'] = {
        }

metadict_detail['|Сокол дюралюминиевый'] = {
        }

metadict_detail['|Сотейник чугунный (2 литра)'] = {
        }

metadict_detail['|Стаместка'] = {
        }

metadict_detail['|Станок рельсорезный (1.5 кВт)'] = {
        }

metadict_detail['|Станок рельсосверлильный (1.5 кВт)'] = {
        }

metadict_detail['|Станок рельсошлифовальный (1 кВт)'] = {
        }

metadict_detail['|Стол кухонный'] = {
        }

metadict_detail['|Стол обеденный'] = {
        }

metadict_detail['|Стол письменный'] = {
        }

metadict_detail['|Столик складной двух высотный'] = {
        }

metadict_detail['|Строп 4-х ветвевой (6 метров)'] = {
        }

metadict_detail['|Строп кольцевой (20 метров)'] = {
        }

metadict_detail['|Струбница (для стягивания накладок)'] = {
        }

metadict_detail['|Ступка кухонная'] = {
        }

metadict_detail['|Таз эмалированный (10 литров)'] = {
        }

metadict_detail['|Тесак кухонный (20 см)'] = {
        }

metadict_detail['|Топор плотничий'] = {
        }

metadict_detail['|Трамбовка простая'] = {
        }

metadict_detail['|Тёрка деревянная'] = {
        }

metadict_detail['|Тёрка для овощей'] = {
        }

metadict_detail['|Тёрка поролоновая'] = {
        }

metadict_detail['|Угольник деревянный'] = {
        }

metadict_detail['|Угольник для каменных работ'] = {
        }

metadict_detail['|Угольник путевой (для проверки стыков)'] = {
        }

metadict_detail['|Угольник специальный'] = {
        }

metadict_detail['|Умывальник'] = {
        }

metadict_detail['|Уровень гибкий'] = {
        }

metadict_detail['|Уровень строительный'] = {
        }

metadict_detail['|Ухват литой'] = {
        }

metadict_detail['|Форма для выпечки хлеба (2 литра)'] = {
        }

metadict_detail['|Форма для выпечки пирога (0.5 литра)'] = {
        }

metadict_detail['|Форма для выпечки маффинов (0.125 литра)'] = {
        }

metadict_detail['|Футляр траверсный (грузоподъёмность 1.5 тонны)'] = {
        }

metadict_detail['|Чайник фарфоровый (1 литр)'] = {
        }

metadict_detail['|Чашка для питья (0.5 литра)'] = {
        }

metadict_detail['|Чугунок (1 литр)'] = {
        }

metadict_detail['|Чугунок (3 литра)'] = {
        }

metadict_detail['|Чугунок (5 литров)'] = {
        }

metadict_detail['|Чугунок эмалированый (5 литров)'] = {
        }

metadict_detail['|Шаблон для устройства откосов'] = {
        }

metadict_detail['|Шкаф-буфет'] = {
        }

metadict_detail['|Шкаф-витрина'] = {
        }

metadict_detail['|Шкаф-гардероб'] = {
        }

metadict_detail['|Шкаф-стеллаж'] = {
        }

metadict_detail['|Шкаф-стеллаж, книжный'] = {
        }

metadict_detail['|Шнур причальный (30 метров)'] = {
        }

metadict_detail['|Шнур разметочный'] = {
        }

metadict_detail['|Шнур разметочный в корпусе'] = {
        }

metadict_detail['|Шпалоноска'] = {
        }

metadict_detail['|Шпалоподбойка пневматическая (0.4 кВт)'] = {
        }

metadict_detail['|Шпалоподбойка торцовая'] = {
        }

metadict_detail['|Шпатель малярный ШД-45'] = {
        }

metadict_detail['|Шпатель малярный ШМ-75'] = {
        }

metadict_detail['|Шпатель с ванночкой'] = {
        }

metadict_detail['|Шторы водонепроницаемые (квадратный метр)'] = {
        }

metadict_detail['|Шуруповёрт механический (1.7 кВт)'] = {
        }

metadict_detail['|Щипцы для дров'] = {
        }

metadict_detail['|Щуп (комплект)'] = {
        }

metadict_detail['|Щётка торцевая ЩТ-1'] = {
        }

metadict_detail['|Щётка-овощемойка'] = {
        }

metadict_detail['|Ящик для раствора (0.35 кубометра)'] = {
        }

metadict_detail['|Дверца каминная'] = {
        }

metadict_detail['|Дверца поддувала'] = {
        }

metadict_detail['|Дверца прочистная'] = {
        }

metadict_detail['|Дверца топки'] = {
        }

metadict_detail['|Задвижка дымохода'] = {
        }

metadict_detail['|Задвижка печная'] = {
        }

metadict_detail['|Решётка колосниковая'] = {
        }

metadict_detail['|Самоварник'] = {
        }

metadict_detail['|Дверь амбарная 3000x4000x50 мм'] = {
        }

metadict_detail['|Дверь внешняя 1500x800x50 мм'] = {
        }

metadict_detail['|Дверь внутренняя 1500x800x25 мм'] = {
        }

metadict_detail['|Люк подвальный 1500x800x50 мм'] = {
        }

metadict_detail['|Люк чердачный 1500x800x50 мм'] = {
        }

metadict_detail['|Парта'] = {
        }

metadict_detail['|Чертёжная доска'] = {
        }

#----
# Инструменты (вычисляем количество через потребности)

metadict_detail['||Ёмкость бондарная (бочка)'] = {
        }

metadict_detail['||Ёмкость бондарная (ведро)'] = {
        }

metadict_detail['||Ёмкость бондарная (кадка)'] = {
        }

metadict_detail['||Ёмкость деревянная пиленая (лоток)'] = {
        }

metadict_detail['||Ёмкость деревянная пиленая (ящик)'] = {
        }

metadict_detail['||Ёмкость керамическая (горшок)'] = {
        }

metadict_detail['||Ёмкость керамическая (пифос)'] = {
        }

metadict_detail['||Ёмкость плетёная (корзина)'] = {
        }

metadict_detail['||Ёмкость стальная кованая (чан)'] = {
        }

metadict_detail['||Ёмкость чугунная литая (чан)'] = {
        }

metadict_detail['||Бумага листовая (газетный лист)'] = {
        # TODO; Уточнить площадь листов понячьих газет.
        '-Бумага газетная старая (требуется/квадратный метр)':1,
        }

metadict_detail['||Посуда деревянная долблёная (ложка)'] = {
        }

metadict_detail['||Посуда деревянная долблёная (лопатка)'] = {
        }

metadict_detail['||Посуда деревянная долблёная (поварёшка)'] = {
        }

metadict_detail['||Посуда деревянная долблёная (скалка)'] = {
        }

metadict_detail['||Посуда деревянная долблёная (ступа)'] = {
        }

metadict_detail['||Посуда деревянная долблёная (уголок)'] = {
        }

metadict_detail['||Инструмент деревянный пиленый (вышка сборная)'] = {
        }

metadict_detail['||Инструмент деревянный пиленый (доска)'] = {
        }

metadict_detail['||Инструмент деревянный пиленый (лопата)'] = {
        }

metadict_detail['||Инструмент деревянный пиленый (поддон)'] = {
        }

metadict_detail['||Инструмент деревянный пиленый (подмостки)'] = {
        }

metadict_detail['||Инструмент деревянный пиленый (совок)'] = {
        }

metadict_detail['||Инструмент деревянный пиленый (сокол)'] = {
        }

metadict_detail['||Инструмент деревянный пиленый (трамбовка)'] = {
        }

metadict_detail['||Инструмент деревянный пиленый (тёрка)'] = {
        }

metadict_detail['||Инструмент измерительный (линейка)'] = {
        }

metadict_detail['||Инструмент измерительный (отвес)'] = {
        }

metadict_detail['||Инструмент измерительный (рейка)'] = {
        }

metadict_detail['||Инструмент измерительный (рулетка)'] = {
        }

metadict_detail['||Инструмент измерительный (угольник)'] = {
        }

metadict_detail['||Инструмент измерительный (уровень)'] = {
        }

metadict_detail['||Инструмент измерительный (шнур/метр)'] = {
        }

metadict_detail['||Инструмент измерительный (штангенциркуль)'] = {
        }

metadict_detail['||Инструмент измерительный ртутный (термометр)'] = {
        }

metadict_detail['||Инструмент плетёный мочальный (валик)'] = {
        }

metadict_detail['||Инструмент плетёный мочальный (венчик)'] = {
        }

metadict_detail['||Инструмент плетёный мочальный (кисть)'] = {
        }

metadict_detail['||Инструмент плетёный мочальный (метёлка)'] = {
        }

metadict_detail['||Инструмент стальной кованый (вилы)'] = {
        }

metadict_detail['||Инструмент стальной кованый (гладилка)'] = {
        }

metadict_detail['||Инструмент стальной кованый (зубило)'] = {
        }

metadict_detail['||Инструмент стальной кованый (кельмо)'] = {
        }

metadict_detail['||Инструмент стальной кованый (кирка)'] = {
        }

metadict_detail['||Инструмент стальной кованый (клещи)'] = {
        }

metadict_detail['||Инструмент стальной кованый (ключ гаечный)'] = {
        }

metadict_detail['||Инструмент стальной кованый (крюк)'] = {
        }

metadict_detail['||Инструмент стальной кованый (лом)'] = {
        }

metadict_detail['||Инструмент стальной кованый (лопата)'] = {
        }

metadict_detail['||Инструмент стальной кованый (молоток)'] = {
        }

metadict_detail['||Инструмент стальной кованый (нож)'] = {
        }

metadict_detail['||Инструмент стальной кованый (нож-овощечистка)'] = {
        }

metadict_detail['||Инструмент стальной кованый (ножовка)'] = {
        }

metadict_detail['||Инструмент стальной кованый (поварёшка)'] = {
        }

metadict_detail['||Инструмент стальной кованый (рубанок)'] = {
        }

metadict_detail['||Инструмент стальной кованый (скоба)'] = {
        }

metadict_detail['||Инструмент стальной кованый (скребок)'] = {
        }

metadict_detail['||Инструмент стальной кованый (струбница)'] = {
        }

metadict_detail['||Инструмент стальной кованый (тесак)'] = {
        }

metadict_detail['||Инструмент стальной кованый (топор)'] = {
        }

metadict_detail['||Инструмент стальной кованый (тёрка кухонная)'] = {
        }

metadict_detail['||Инструмент стальной кованый (формочка)'] = {
        }

metadict_detail['||Инструмент стальной кованый (шпатель)'] = {
        }

metadict_detail['||Инструмент стальной кованый (шумовка)'] = {
        }

metadict_detail['||Инструмент стальной кованый (щипцы)'] = {
        }

metadict_detail['||Инструмент чугунный литой (кочерга)'] = {
        }

metadict_detail['||Инструмент чугунный литой (кувалда)'] = {
        }

metadict_detail['||Инструмент чугунный литой (прут)'] = {
        }

metadict_detail['||Инструмент чугунный литой (сковородник)'] = {
        }

metadict_detail['||Инструмент чугунный литой (ухват)'] = {
        }

metadict_detail['||Инструмент чугунный литой (щипцы)'] = {
        }

metadict_detail['||Мебель деревянная пиленая (стол)'] = {
        }

metadict_detail['||Механизм винтовой (жернова)'] = {
        }

metadict_detail['||Механизм винтовой (пресс для фруктов)'] = {
        }

metadict_detail['||Механизм винтовой (пресс для соломы)'] = {
        }

metadict_detail['||Механизм винтовой (разгонщик)'] = {
        }

metadict_detail['||Механизм винтовой (рихтовщик)'] = {
        }

metadict_detail['||Механизм колёсный (грейдер)'] = {
        }

metadict_detail['||Механизм колёсный (скрепер)'] = {
        }

metadict_detail['||Механизм колёсный самоходный (каток)'] = {
        }

metadict_detail['||Механизм пневматический (компрессор)'] = {
        }

metadict_detail['||Механизм пневматический (трамбовка)'] = {
        }

metadict_detail['||Механизм пневматический (шпалоподбойка)'] = {
        }

metadict_detail['||Механизм стальной (домкрат)'] = {
        }

metadict_detail['||Механизм стальной (дрель)'] = {
        }

metadict_detail['||Механизм стальной (костылевыдёргиватель)'] = {
        }

metadict_detail['||Механизм стальной (мегафон)'] = {
        }

metadict_detail['||Механизм стальной (пресс-пюре)'] = {
        }

metadict_detail['||Посуда медная кованая (самовар)'] = {
        }

metadict_detail['||Механизм строительный (башенный кран)'] = {
        }

metadict_detail['||Механизм строительный (копатель)'] = {
        }

metadict_detail['||Механизм строительный (буровой станок)'] = {
        }

metadict_detail['||Механизм строительный (лебёдка)'] = {
        }

metadict_detail['||Механизм строительный (роликовый транспортёр)'] = {
        }

metadict_detail['||Механизм фабричный (черепичный пресс)'] = {
        }

metadict_detail['||Механизм фабричный (вальцовый пресс мощный)'] = {
        }

metadict_detail['||Механизм фабричный (вальцовый пресс)'] = {
        }

metadict_detail['||Механизм фабричный (глиномялка)'] = {
        }

metadict_detail['||Механизм фабричный (дробилка)'] = {
        }

metadict_detail['||Механизм фабричный (лесопильная рама)'] = {
        }

metadict_detail['||Механизм фабричный (молотилка)'] = {
        }

metadict_detail['||Механизм фабричный (мельница вальцовая)'] = {
        }

metadict_detail['||Механизм фабричный (мельница жерновная)'] = {
        }

metadict_detail['||Механизм фабричный (моечная машина)'] = {
        }

metadict_detail['||Механизм фабричный (рафинирочное сито)'] = {
        }

metadict_detail['||Механизм фабричный (тёрочный барабан)'] = {
        }

metadict_detail['||Посуда деревянная долблёная (воронка)'] = {
        }

metadict_detail['||Посуда деревянная долблёная (ковш)'] = {
        }

metadict_detail['||Посуда деревянная долблёная (солонка)'] = {
        }

metadict_detail['||Посуда жестяная кованая (противень)'] = {
        }

metadict_detail['||Посуда керамическая (кружка)'] = {
        }

metadict_detail['||Посуда керамическая (кувшин)'] = {
        }

metadict_detail['||Посуда керамическая (миска)'] = {
        }

metadict_detail['||Посуда керамическая (мисочка)'] = {
        }

metadict_detail['||Посуда керамическая (чашка)'] = {
        }

metadict_detail['||Посуда плетёная (корзинка)'] = {
        }

metadict_detail['||Посуда чугунная литая (котелок)'] = {
        }

metadict_detail['||Посуда чугунная литая (котёл)'] = {
        }

metadict_detail['||Посуда чугунная литая (сковорода)'] = {
        }

metadict_detail['||Посуда чугунная литая (сотейник)'] = {
        }

metadict_detail['||Посуда чугунная литая (чугунок)'] = {
        }

metadict_detail['||Снаряжение защитное (каска)'] = {
        }

metadict_detail['||Снаряжение защитное (маска)'] = {
        }

metadict_detail['||Снаряжение защитное (очки)'] = {
        }

metadict_detail['||Снаряжение защитное (пояс страховой)'] = {
        }

metadict_detail['||Станок простой (ткацкий)'] = {
        }

metadict_detail['||Станок механический (кирпичнорезный)'] = {
        }

metadict_detail['||Станок механический (металлорежущий)'] = {
        }

metadict_detail['||Станок механический (сверлильно-шлифовальный)'] = {
        }

metadict_detail['||Станок механический (сверлильный)'] = {
        }

metadict_detail['||Станок механический (шлифовальный)'] = {
        }

metadict_detail['||Транспорт железндорожный (вагон)'] = {
        }

metadict_detail['||Транспорт железндорожный (платформа)'] = {
        }

metadict_detail['||Транспорт железнодорожный (локомотив)'] = {
        }

metadict_detail['||Транспорт колёсный грузовой (телега)'] = {
        }

metadict_detail['||Транспорт колёсный грузовой (тележка)'] = {
        }

metadict_detail['||Транспорт воздушный пассажирский (лёгкий планёр)'] = {
        }

metadict_detail['||Транспорт морской грузовой (барк)'] = {
        }

metadict_detail['||Транспорт речной грузовой (баржа)'] = {
        }

metadict_detail['||Устройство тепловое (смоляная печь)'] = {
        }

metadict_detail['||Устройство тепловое (штабель кирпича большой)'] = {
        }

metadict_detail['||Устройство тепловое (штабель кирпича малый)'] = {
        }

metadict_detail['||Утварь соломенная (коврик)'] = {
        }

metadict_detail['||Инструмент текстильный (канат/метр)'] = {
        }

metadict_detail['||Утварь текстильная (мешочек)'] = {
        }

metadict_detail['||Утварь текстильная (полотенце)'] = {
        }

metadict_detail['||Утварь текстильная (ветошь)'] = {
        }

metadict_detail['||Утварь текстильная (сито)'] = {
        }

metadict_detail['||Утварь текстильная (скатерть)'] = {
        }

metadict_detail['||Утварь текстильная (холст)'] = {
        }

metadict_detail['||Инструмент текстильный (шнур/метр)'] = {
        }

metadict_detail['||Инструмент чугунный литой (утюг)'] = {
        }

metadict_detail['||Механизм гидравлический (насос)'] = {
        }

metadict_detail['||Инструмент чугунный литой (мангал)'] = {
        }

#----
# Здания:

metadict_detail['||Больничное место (койка)'] = {
        }

metadict_detail['||Больничное место (кабинет)'] = {
        }

metadict_detail['||Общежитие (койка)'] = {
        }

metadict_detail['||Школьное место (парта)'] = {
        }
