#----
# Среднеземный рацион:
    # https://en.wikipedia.org/wiki/Mediterranean_cuisine

metadict_detail['Среднеземный рацион (пони/год)'] = {
        'Среднеземный весенний рацион (пони/день)':90,
        'Среднеземный летний рацион (пони/день)':90,
        'Среднеземный осенний рацион (пони/день)':90,
        'Среднеземный зимний рацион (пони/день)':90,
        }

#----
# Среднеземный рацион (времена года):

metadict_detail['Среднеземный весенний рацион (пони/день)'] = {
        # В эквестрийской неделе -- 6 дней
        'Среднеземный весенний повседневный рацион (пони/день)':5 / 6,
        'Среднеземный весенний праздничный рацион (пони/день)':1 / 6,
        }

metadict_detail['Среднеземный летний рацион (пони/день)'] = {
        'Среднеземный летний повседневный рацион (пони/день)':5 / 6,
        'Среднеземный летний праздничный рацион (пони/день)':1 / 6,
        }

metadict_detail['Среднеземный зимний рацион (пони/день)'] = {
        'Среднеземный зимний повседневный рацион (пони/день)':5 / 6,
        'Среднеземный зимний праздничный рацион (пони/день)':1 / 6,
        }

metadict_detail['Среднеземный осенний рацион (пони/день)'] = {
        'Среднеземный осенний повседневный рацион (пони/день)':5 / 6,
        'Среднеземный осенний праздничный рацион (пони/день)':1 / 6,
        }

#----
# Среднеземный рацион (дни недели):

metadict_detail['Среднеземный весенний повседневный рацион (пони/день)'] = {
        'Среднеземный весенний повседневный завтрак':1,
        'Среднеземный весенний повседневный обед':1,
        'Среднеземный весенний повседневный ужин':1,
        'Среднеземное весеннее повседневное питьё v1':3 / 3,
        'Среднеземное весеннее повседневное питьё v2':3 / 3,
        'Среднеземное весеннее повседневное питьё v3':3 / 3,
        }

metadict_detail['Среднеземный весенний праздничный рацион (пони/день)'] = {
        'Среднеземный весенний праздничный завтрак':1,
        'Среднеземный весенний праздничный обед':1,
        'Среднеземный весенний праздничный ужин':1,
        'Среднеземное весеннее праздничное питьё v1':3 / 3,
        'Среднеземное весеннее праздничное питьё v2':3 / 3,
        'Среднеземное весеннее праздничное питьё v3':3 / 3,
        }

metadict_detail['Среднеземный зимний повседневный рацион (пони/день)'] = {
        'Среднеземный зимний повседневный завтрак':1,
        'Среднеземный зимний повседневный обед':1,
        'Среднеземный зимний повседневный ужин':1,
        'Среднеземное зимнее повседневное питьё v1':3 / 3,
        'Среднеземное зимнее повседневное питьё v2':3 / 3,
        'Среднеземное зимнее повседневное питьё v3':3 / 3,
        }

metadict_detail['Среднеземный зимний праздничный рацион (пони/день)'] = {
        'Среднеземный зимний праздничный завтрак':1,
        'Среднеземный зимний праздничный обед':1,
        'Среднеземный зимний праздничный ужин':1,
        'Среднеземное зимнее праздничное питьё v1':3 / 3,
        'Среднеземное зимнее праздничное питьё v2':3 / 3,
        'Среднеземное зимнее праздничное питьё v3':3 / 3,
        }

metadict_detail['Среднеземный летний повседневный рацион (пони/день)'] = {
        'Среднеземный летний повседневный завтрак':1,
        'Среднеземный летний повседневный обед':1,
        'Среднеземный летний повседневный ужин':1,
        'Среднеземное летнее повседневное питьё v1':3 / 3,
        'Среднеземное летнее повседневное питьё v2':3 / 3,
        'Среднеземное летнее повседневное питьё v3':3 / 3,
        }

metadict_detail['Среднеземный летний праздничный рацион (пони/день)'] = {
        'Среднеземный летний праздничный завтрак':1,
        'Среднеземный летний праздничный обед':1,
        'Среднеземный летний праздничный ужин':1,
        'Среднеземное летнее праздничное питьё v1':3 / 3,
        'Среднеземное летнее праздничное питьё v2':3 / 3,
        'Среднеземное летнее праздничное питьё v3':3 / 3,
        }

metadict_detail['Среднеземный осенний повседневный рацион (пони/день)'] = {
        'Среднеземный осенний повседневный завтрак':1,
        'Среднеземный осенний повседневный обед':1,
        'Среднеземный осенний повседневный ужин':1,
        'Среднеземное осеннее повседневное питьё v1':3 / 3,
        'Среднеземное осеннее повседневное питьё v2':3 / 3,
        'Среднеземное осеннее повседневное питьё v3':3 / 3,
        }

metadict_detail['Среднеземный осенний праздничный рацион (пони/день)'] = {
        'Среднеземный осенний праздничный завтрак':1,
        'Среднеземный осенний праздничный обед':1,
        'Среднеземный осенний праздничный ужин':1,
        'Среднеземное осеннее праздничное питьё v1':3 / 3,
        'Среднеземное осеннее праздничное питьё v2':3 / 3,
        'Среднеземное осеннее праздничное питьё v3':3 / 3,
        }

#----
# Среднеземный рацион (весна):
    # Март, апрель, май

metadict_detail['Среднеземный весенний повседневный завтрак'] = {
        'Лепёшки пшеничные с фасолевой пастой (грамм)':50 * 2,
        'Рис тушёный с сельдереем и кукурузой (грамм)':200,
        'Картофель тушёный со спаржей (грамм)':200,
        '||Сэндвичи (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1 * 2,
        }

metadict_detail['Среднеземный весенний повседневный обед'] = {
        'Лепёшки кукурузные (грамм)':50 * 2,
        'Фасоль тушёная с корнеплодами (грамм)':200,
        'Лапша с песто и шампиньонами (грамм)':200,
        'Салат из варёной спаржи со шпинатом (грамм)':200,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо первое горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе холодное (200-грамм/порция)':1,
        }

metadict_detail['Среднеземный весенний повседневный ужин'] = {
        'Брускетта с луком и оливками (грамм)':50 * 2,
        'Каша овсяная (грамм)':200,
        'Морковь тушёная с турнепсом и картофелем (грамм)':200,
        '||Сэндвичи (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе холодное (200-грамм/порция)':1,
        }

metadict_detail['Среднеземное весеннее повседневное питьё v1'] = {
        'Чай чёрный (грамм)':200 * 2,
        'Капкейки с джемом из ревеня (грамм)':50,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':1,
        }

metadict_detail['Среднеземное весеннее повседневное питьё v2'] = {
        'Чай травяной (грамм)':200 * 2,
        'Капкейки с сухофруктами (грамм)':50,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':1,
        }

metadict_detail['Среднеземное весеннее повседневное питьё v3'] = {
        'Сидр яблочный (грамм)':200,
        'Оладьи кукурузные с мёдом (грамм)':50,
        '||Питьё холодное (200-грамм/порция)':1,
        '||Выпечка жареная (50-грамм/порция)':1,
        }

metadict_detail['Среднеземный весенний праздничный завтрак'] = {
        'Брускетта с консервированным лечо (грамм)':50 * 2,
        'Фасоль томлёная с патокой (грамм)':200,
        'Топинамбур печёный со спаржей (грамм)':100,
        'Сморчки жареные во фритюре (грамм)':100,
        '||Сэндвичи (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':2,
        }

metadict_detail['Среднеземный весенний праздничный обед'] = {
        'Пицца с кабачком и шампиньонами (грамм)':50 * 2,
        'Суп-пюре из спаржи с кремом (грамм)':200,
        'Корень сельдерея тушёный с морковью (грамм)':100,
        'Лечо со сладким перцем консервированное (грамм)':100,
        'Пудинг варёный сливовый (грамм)':100,
        '||Выпечка (50-грамм/порция)':2,
        '||Блюдо первое горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        '||Антреме холодное (100-грамм/порция)':1,
        '||Десерт горячий (100-грамм/порция)':1,
        }

metadict_detail['Среднеземный весенний праздничный ужин'] = {
        'Оладьи кукурузные с кленовым сиропом (грамм)':50 * 2,
        'Пюре картофельное (грамм)':200,
        'Одуванчики жареные во фритюре (грамм)':100,
        '||Выпечка жареная (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        }

metadict_detail['Среднеземное весеннее праздничное питьё v1'] = {
        'Чай травяной (грамм)':200 * 2,
        'Пирог открытый кленовый (грамм)':50 * 2,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':2,
        }

metadict_detail['Среднеземное весеннее праздничное питьё v2'] = {
        'Компот из сухофруктов (грамм)':200 * 2,
        '||Питьё холодное (200-грамм/порция)':2,
        }

metadict_detail['Среднеземное весеннее праздничное питьё v3'] = {
        'Вино белое сухое (грамм)':200,
        'Пирог открытый с тыквой и пеканом (грамм)':50,
        '||Питьё холодное (200-грамм/порция)':1,
        '||Выпечка (50-грамм/порция)':1,
        }

#----
# Среднеземный рацион (лето):
    # Июнь, июль, август

metadict_detail['Среднеземный летний повседневный завтрак'] = {
        'Лепёшки кукурузные с пастой из миндаля и брокколи (грамм)':50 * 2,
        'Рис тушёный с фасолью (грамм)':200,
        'Картофель печёный с розмарином (грамм)':200,
        '||Сэндвичи (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1 * 2,
        }

metadict_detail['Среднеземный летний повседневный обед'] = {
        'Лепёшки кукурузные (грамм)':50 * 2,
        'Суп-пюре холодный томатно-огуречный (грамм)':200,
        'Лапша с кабачковым соусом (грамм)':200,
        'Салат из брокколи с огурцами (грамм)':200,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо первое холодное (200-грамм/порция)':1,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе холодное (200-грамм/порция)':1,
        }

metadict_detail['Среднеземный летний повседневный ужин'] = {
        'Брускетта со свежими томатами (грамм)':50 * 2,
        'Каша кукурузно-мучная (грамм)':200,
        'Фрукты летние среднеземные (грамм)':200,
        '||Сэндвичи (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Фрукты свежие (200-грамм/порция)':1,
        }

metadict_detail['Среднеземное летнее повседневное питьё v1'] = {
        'Чай чёрный (грамм)':200 * 2,
        'Пирог закрытый черничный (грамм)':50,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':1,
        }

metadict_detail['Среднеземное летнее повседневное питьё v2'] = {
        'Чай травяной (грамм)':200 * 2,
        'Шарлотка земляничная (грамм)':100,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Десерт горячий (100-грамм/порция)':1,
        }

metadict_detail['Среднеземное летнее повседневное питьё v3'] = {
        'Вино красное сухое (грамм)':200,
        'Оладьи кукурузные с яблочным сиропом (грамм)':50,
        '||Питьё холодное (200-грамм/порция)':1,
        '||Выпечка жареная (50-грамм/порция)':1,
        }

metadict_detail['Среднеземный летний праздничный завтрак'] = {
        # TODO: Замени брускетту на что-нибудь, а то грибы к грибам.
        'Брускетта с консервированными шампиньонами (грамм)':50 * 2,
        'Рис тушёный с боровиками (грамм)':200,
        'Томаты зелёные жареные во фритюре (грамм)':100,
        'Артишоки обжаренные (грамм)':100,
        '||Сэндвичи (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':2,
        }

metadict_detail['Среднеземный летний праздничный обед'] = {
        'Пицца с кабачком и шампиньонами (грамм)':50 * 2,
        'Суп-пюре из картофеля и лука-порея с гренками (грамм)':200,
        'Лапша с белыми грибами (грамм)':200,
        'Баклажан тушёный со стручковой фасолью (грамм)':100,
        'Долма фаршированная фасолью и рисом (грамм)':100,
        '||Выпечка (50-грамм/порция)':2,
        '||Блюдо первое горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        '||Антреме холодное (100-грамм/порция)':1,
        }

metadict_detail['Среднеземный летний праздничный ужин'] = {
        'Вареники с маком и мёдом (грамм)':10 * 10,
        'Пюре бататное (грамм)':200,
        'Брокколи обжаренная (грамм)':100,
        '||Изделия из варёного теста (10-грамм/порция)':10,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        }

metadict_detail['Среднеземное летнее праздничное питьё v1'] = {
        'Чай травяной с кленовым сиропом (грамм)':200 * 2,
        'Пирог открытый сливовый (грамм)':50 * 2,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':2,
        }

metadict_detail['Среднеземное летнее праздничное питьё v2'] = {
        'Компот из свежего ревеня (грамм)':200 * 2,
        '||Питьё холодное (200-грамм/порция)':2,
        }

metadict_detail['Среднеземное летнее праздничное питьё v3'] = {
        'Эль имбирный (грамм)':200,
        'Капкейки миндальные (грамм)':50,
        '||Питьё холодное (200-грамм/порция)':1,
        '||Выпечка (50-грамм/порция)':1,
        }


#----
# Среднеземный рацион (осень):
    # Сентябрь, октябрь, ноябрь

metadict_detail['Среднеземный осенний повседневный завтрак'] = {
        'Лепёшки кукурузные с пекановой пастой (грамм)':50 * 2,
        'Фасоль тушёная со свежей кукурузой (грамм)':200,
        'Картофель тушёный с горошком и пряностями (грамм)':200,
        '||Сэндвичи (50-грамм/порция)':2,
        '||Блюдо первое горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        }

metadict_detail['Среднеземный осенний повседневный обед'] = {
        'Хлеб пшеничный домашний (грамм)':50 * 2,
        'Суп из сезонных овощей с фасолью (грамм)':200,
        'Лапша с баклажанным соусом (грамм)':200,
        'Рагу овощное с горошком (грамм)':100,
        'Салат из варёной свёклы (грамм)':100,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо первое горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        '||Блюдо второе холодное (100-грамм/порция)':1,
        }

metadict_detail['Среднеземный осенний повседневный ужин'] = {
        'Брускетта с печёным перцем и песто (грамм)':50 * 2,
        'Каша овсяная с мёдом (грамм)':200,
        'Фрукты осенние среднеземные (грамм)':200,
        '||Сэндвичи (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Фрукты свежие (200-грамм/порция)':1,
        }

metadict_detail['Среднеземное осеннее повседневное питьё v1'] = {
        'Чай чёрный (грамм)':200 * 2,
        'Пирог закрытый яблочный (грамм)':50,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':1,
        }

metadict_detail['Среднеземное осеннее повседневное питьё v2'] = {
        'Чай травяной с мёдом (грамм)':200 * 2,
        'Капкейки тыквенные (грамм)':50,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':1,
        }

metadict_detail['Среднеземное осеннее повседневное питьё v3'] = {
        'Сок яблочный (грамм)':200 * 2,
        'Пирог закрытый бататный (грамм)':50,
        '||Питьё холодное (200-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':1,
        }

metadict_detail['Среднеземный осенний праздничный завтрак'] = {
        'Брускетта с баклажанным соусом (грамм)':50 * 2,
        'Рис тушёный с овощами (грамм)':200,
        'Рагу овощное с шампиньонами (грамм)':200,
        '||Сэндвичи (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1 * 2,
        }

metadict_detail['Среднеземный осенний праздничный обед'] = {
        'Пицца с кабачком и шампиньонами (грамм)':50 * 2,
        'Суп-пюре из корня сельдерея с гренками (грамм)':200,
        'Овощи запечённые в кабачковом соусе (грамм)':200,
        'Салат огуречно-томатный со сладким перцем (грамм)':200,
        '||Выпечка (50-грамм/порция)':2,
        '||Блюдо первое горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе холодное (200-грамм/порция)':1,
        }

metadict_detail['Среднеземный осенний праздничный ужин'] = {
        'Вареники с вишней свежей (грамм)':10 * 10,
        'Каштан печёный (грамм)':200,
        'Батат печёный в медовой глазури (грамм)':100,
        '||Изделия из варёного теста (10-грамм/порция)':10,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        }

metadict_detail['Среднеземное осеннее праздничное питьё v1'] = {
        'Чай травяной с мёдом (грамм)':200 * 2,
        'Пирог открытый вишнёвый (грамм)':50 * 2,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':2,
        }

metadict_detail['Среднеземное осеннее праздничное питьё v2'] = {
        'Компот из свежей вишни (грамм)':200 * 2,
        '||Питьё холодное (200-грамм/порция)':2,
        }

metadict_detail['Среднеземное осеннее праздничное питьё v3'] = {
        'Вино белое сухое (грамм)':200,
        'Пирог открытый лимонный (грамм)':50,
        '||Питьё холодное (200-грамм/порция)':1,
        '||Выпечка (50-грамм/порция)':1,
        }

#----
# Среднеземный рацион (зима):
    # Декабрь, январь, февраль

metadict_detail['Среднеземный зимний повседневный завтрак'] = {
        'Лепёшки кукурузные с нутовой пастой (грамм)':50 * 2,
        'Рис тушёный с тыквой и кукурузой (грамм)':200,
        'Картофель тушёный с оливками и лимоном (грамм)':200,
        '||Сэндвичи (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1 * 2,
        }

metadict_detail['Среднеземный зимний повседневный обед'] = {
        'Хлеб пшеничный домашний (грамм)':50 * 2,
        'Суп-пюре арахисовый с бататом и томатами (грамм)':200,
        'Лапша с лютеницей (грамм)':200,
        'Турнепс тушёный с капустой (грамм)':200,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо первое горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе холодное (200-грамм/порция)':1,
        }

metadict_detail['Среднеземный зимний повседневный ужин'] = {
        'Брускетта с солёными томатами (грамм)':50 * 2,
        'Каша кукурузно-мучная (грамм)':200,
        'Тыква тушёная (грамм)':200,
        '||Сэндвичи (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе холодное (200-грамм/порция)':1,
        }

metadict_detail['Среднеземное зимнее повседневное питьё v1'] = {
        'Чай чёрный (грамм)':200 * 2,
        'Капкейки с яблочным джемом (грамм)':50,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':1,
        }

metadict_detail['Среднеземное зимнее повседневное питьё v2'] = {
        'Чай травяной с мёдом (грамм)':200 * 2,
        'Капкейки морковные (грамм)':50,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':1,
        }

metadict_detail['Среднеземное зимнее повседневное питьё v3'] = {
        'Сидр грушевый (грамм)':200,
        'Пирог закрытый тыквенный (грамм)':50,
        '||Питьё холодное (200-грамм/порция)':1,
        '||Выпечка (50-грамм/порция)':1,
        }

metadict_detail['Среднеземный зимний праздничный завтрак'] = {
        'Брускетта с солёными боровиками (грамм)':50 * 2,
        'Рис тушёный со свекольным кремом (грамм)':200,
        'Морковь печёная с розмарином (грамм)':200,
        '||Сэндвичи (50-грамм/порция)':2,
        '||Блюдо второе горячее (200-грамм/порция)':1 * 2,
        }

metadict_detail['Среднеземный зимний праздничный обед'] = {
        'Пицца с кабачком и шампиньонами (грамм)':50 * 2,
        'Суп-пюре из картофеля и лука-порея с шампиньонами (грамм)':200,
        'Запеканка бататная с курагой (грамм)':100,
        'Террин овощной (грамм)':100,
        'Пудинг варёный смородиновый (грамм)':100,
        '||Выпечка (50-грамм/порция)':2,
        '||Блюдо первое горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        '||Антреме холодное (100-грамм/порция)':1,
        '||Десерт горячий (100-грамм/порция)':1,
        }

metadict_detail['Среднеземный зимний праздничный ужин'] = {
        'Вареники с вишней мочёной (грамм)':10 * 10,
        'Пюре бататное (грамм)':200,
        'Капуста обжаренная в сухарях (грамм)':100,
        '||Изделия из варёного теста (10-грамм/порция)':10,
        '||Блюдо второе горячее (200-грамм/порция)':1,
        '||Блюдо второе горячее (100-грамм/порция)':1,
        }

metadict_detail['Среднеземное зимнее праздничное питьё v1'] = {
        'Чай травяной с мёдом (грамм)':200 * 2,
        'Пирог открытый тыквенный (грамм)':50 * 2,
        '||Питьё горячее (200-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':2,
        }

metadict_detail['Среднеземное зимнее праздничное питьё v2'] = {
        'Компот из сухофруктов с красным вином (грамм)':200 * 2,
        '||Питьё холодное (200-грамм/порция)':2,
        }

metadict_detail['Среднеземное зимнее праздничное питьё v3'] = {
        'Эль имбирный (грамм)':200,
        'Пирог открытый пекановый (грамм)':50,
        '||Питьё холодное (200-грамм/порция)':1,
        '||Выпечка (50-грамм/порция)':1,
        }
