#----
# Товары в банках и ящиках:

metadict_detail['|=Ящик лечо (литр)'] = {
        'Использование ящика для хранения продовольствия (часов/литр)':24*360,
        '|=Склад консервов в банках и ящиках (кубометр)':1 / 1000,
        }

metadict_detail['|=Ящик соуса песто (литр)'] = {
        'Использование ящика для хранения продовольствия (часов/литр)':24*360,
        '|=Склад консервов в банках и ящиках (кубометр)':1 / 1000,
        }

metadict_detail['|=Ящик соевого соуса (литр)'] = {
        'Использование ящика для хранения продовольствия (часов/литр)':24*360,
        '|=Склад консервов в банках и ящиках (кубометр)':1 / 1000,
        }

metadict_detail['|=Ящик томатного соуса (литр)'] = {
        'Использование ящика для хранения продовольствия (часов/литр)':24*360,
        '|=Склад консервов в банках и ящиках (кубометр)':1 / 1000,
        }

metadict_detail['|=Ящик яблочного джема (литр)'] = {
        'Использование ящика для хранения продовольствия (часов/литр)':24*360,
        '|=Склад консервов в банках и ящиках (кубометр)':1 / 1000,
        }

metadict_detail['|=Ящик земляничного варенья (литр)'] = {
        'Использование ящика для хранения продовольствия (часов/литр)':24*360,
        '|=Склад консервов в банках и ящиках (кубометр)':1 / 1000,
        }

metadict_detail['|=Ящик одуванчикового варенья (литр)'] = {
        'Использование ящика для хранения продовольствия (часов/литр)':24*360,
        '|=Склад консервов в банках и ящиках (кубометр)':1 / 1000,
        }

metadict_detail['|=Ящик смородинового варенья (литр)'] = {
        'Использование ящика для хранения продовольствия (часов/литр)':24*360,
        '|=Склад консервов в банках и ящиках (кубометр)':1 / 1000,
        }

#----
# Товары в бочках:

metadict_detail['|=Бочка хозяйственной воды (литр)'] = {
        # Исправить
            # Вода хранится в бочке не больше суток.
            # А с чего бы? Это, получается, сутки из года.
            # Слушай, я запуталась. Может полностью переделать эту чась?
        'Использование бочки для хранения воды (часов/литр)':24,
        }

metadict_detail['|=Бочка питьевой воды (литр)'] = {
        'Использование бочки для хранения воды (часов/литр)':24,
        }

metadict_detail['|=Бочка промышленной воды (литр)'] = {
        'Использование бочки для хранения воды (часов/литр)':24,
        }

metadict_detail['|=Бочка кленового сока (литр)'] = {
        # Вываривают в тот же день.
        'Использование бочки для хранения воды (часов/литр)':24,
        }

metadict_detail['|=Бочка арахисового масла (литр)'] = {
        # Исправить
            # Тащемта, объём самой бочки тоже нужно учитывать.
            # Можно просто взять коэффициент для усреднённых бочек.
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка квашеной капусты (литр)'] = {
        # Квашеные/мочёные/солёные овощи хранят в кадках, а в бочки перекладывают на продажу.
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка кленового сиропа (литр)'] = {
        # Сироп хранится в бочках круглый год. Ну, или пока не съедят.
        'Использование бочки для хранения продовольствия (часов/литр)':24*360,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка мёда (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*360,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка консервированной свёклы (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка консервированной моркови (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка консервированных кабачков (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка консервированных оливок (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка консервированных огурцов (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка консервированных томатов (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка конопляного масла (литр)'] = {
        # Масло производят по мере необходимости и меньше чем за месяц продают.
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка льняного масла (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка кунжутного масла (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка мочёной сливы (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка мочёных груш (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка мочёных яблок (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка оливкового масла (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка подсолнечного масла (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка соевого масла (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка какао-масла (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка яблочного сидра (литр)'] = {
        # Исправить
            # Бочка и так используется для брожения
            # Но не в бутылках же перевозить!
        #'Использование бочки для хранения продовольствия (часов/литр)':24*360,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка грушевого сидра (литр)'] = {
        #'Использование бочки для хранения продовольствия (часов/литр)':24*360,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка вина (литр)'] = {
        #'Использование бочки для хранения продовольствия (часов/литр)':24*360,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Ведро кленового сока (литр)'] = {
        # Исправить
            # Вёдра уже учтены как инструменты для сбора сока.
        # Сок хранится 5 дней весны. Собирают его в вёдра.
        #'Использование ведра для хранения кленового сока (часов/литр)':24*5,
        }

metadict_detail['|=Бочка арахиса (литр)'] = {
        # Бочка оборачивается каждый месяц, 12 раз в год. То есть хранится в нём еда 30 суток.
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка кукурузной крупы (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка кукурузной муки (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка овсяной муки (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка овсяной крупы (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка пшеничного солода (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка пшеничной муки (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка соевой муки (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка соевых бобов (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка соли (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сухой горчицы (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка корицы (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка кофейных зёрен (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сухой ванили (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сухой фасоли (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сушёной вишни (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сушёной груши (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сушёного абрикоса (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сушёного персика (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сушёного инжира (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сушёной сливы (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка изюма (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сушёных трав (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сушёных чайных листьев (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сушёных яблок (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка тростникового сахара (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка тростникового сахара-сырца (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка какао-порошка (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка какао-бобов (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка гречневой крупы (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка риса шлифованного (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка импортных пряностей (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка консервированных боровиков (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка льняной муки (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка местных пряностей (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка местных трав (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка ржаного солода (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка ржанор муки (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка соевого маргарина (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сухого гороха (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сухой чечевицы (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сушёной смородины (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сушёной черники (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сушёных белых грибов (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка сушёных томатов (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка яблочного уксуса (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка виноградного уксуса (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

metadict_detail['|=Бочка ячневой крупы (литр)'] = {
        'Использование бочки для хранения продовольствия (часов/литр)':24*30,
        '|=Склад продовольствия в бочках (кубометр)':1 / 1000,
        }

#----
# Сельскохозяйственное сырьё:
# Сроки хранения на сырьевой площадке отдельных видов плодов и ягод (не более):
    # абрикосов, вишен и винограда..........................12 часов 
    # персиков, слив, черешен, кинканов, 
    # фейхоа, черной смородины, крыжовника, 
    # кизила и орехов ......................................24 часа
    # летних и осенних сортов груш и яблок .................48 часов
    # мандаринов ...........................................5 суток
    # зимних сортов груш и яблок............................7 суток
    # клубники, земляники, малины...........................8 часов

metadict_detail['|=Корзина арахиса в шелухе (литр)'] = {
        # Объём корзины -- 0.1 кубометра, размеры 0.5x0.5x0.4; площадка -- 0.0025 кв.метра
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина батата (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина арбуза (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина дыни (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина винограда (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина вишни (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина абрикоса (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина инжира (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина персика (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина сливы (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина шампиньонов (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина вёшенок (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина груш (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина дикорастущих растений (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина красных водорослей (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина морской капусты (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина зерна овса (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина зерна пшеницы (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина красной фасоли в стручках (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина соевых бобов в стручках (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина кабачка (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина баклажанов (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина капусты белокочанной (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина картофеля (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина кофейных зёрен (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина лука репчатого (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина чеснока (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина моркови (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина огурцов (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина перца сладкого (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина оливок (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина свёклы (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина семян горчицы белой (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина семян конопли (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина семян льна (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина семян кунжута (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина семян подсолнечника (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина томатов (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина тростникового сахара-сырца (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина тыквы (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина чайных листьев (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина яблок (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина плодов какао (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина плодов кофейного дерева (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина стручков ванили (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина стручков красного перца (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина гвоздики (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина цветов шафрана (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина гороха в стручках (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина зерна гречихи (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина зерна риса посевного (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина дикорастущих грибов (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина дикорастущих орехов (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина дикорастущих ягод (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина зерна ржи (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина зерна ячменя (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина корнеплодов (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина овощей (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина огородных растений (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина петрушки (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина плодов пименты (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина плодов чёрного перца (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина ревеня (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина репы (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина брюквы (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина латука посевного (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина сельдерея (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина спаржи (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина кресс-салата (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина укропа (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина фруктов (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина чечевицы (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина зерна кукурузы (литр)'] = {
        'Использование корзины для хранения продовольствия (часов/литр)':24*30,
        '|=Склад сельскохозяйственного сырья (кубометр)':1/1000,
        }

#----
# Хранение в снопах:

metadict_detail['|=Связка сахарного тростника (литр)'] = {
        # Исправить
            # Ну насыпью же! Ага, двухметровые стволы.
        '|=Стог сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина початков кукурузы (литр)'] = {
        '|=Стог сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина цветов подсолнечника (литр)'] = {
        '|=Стог сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Корзина коробочек кунжута (литр)'] = {
        '|=Стог сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Сноп горчицы белой (литр)'] = {
        '|=Стог сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Сноп конопли (литр)'] = {
        '|=Стог сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Сноп льна (литр)'] = {
        '|=Стог сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Сноп овса (литр)'] = {
        '|=Стог сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Сноп овсяной соломы (литр)'] = {
        '|=Стог соломы (кубометр)':1/1000,
        }

metadict_detail['|=Сноп пшеницы (литр)'] = {
        '|=Стог сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Сноп пшеничной соломы (литр)'] = {
        '|=Стог соломы (кубометр)':1/1000,
        }

metadict_detail['|=Сноп ржаной соломы (литр)'] = {
        '|=Стог соломы (кубометр)':1/1000,
        }

metadict_detail['|=Сноп ржи (литр)'] = {
        '|=Стог сельскохозяйственного сырья (кубометр)':1/1000,
        }

metadict_detail['|=Сноп ячменной соломы (литр)'] = {
        '|=Стог соломы (кубометр)':1/1000,
        }

metadict_detail['|=Сноп ячменя (литр)'] = {
        '|=Стог сельскохозяйственного сырья (кубометр)':1/1000,
        }

#----
# Промышленные товары в таре:

metadict_detail['|=Бочка извести негашёной (литр)'] = {
        'Использование бочки для хранения промышленных товаров (часов/литр)':24*30,
        '|=Склад промышленных товаров (кубометр)':1/1000,
        }

metadict_detail['|=Бочка цемента М400 (литр)'] = {
        'Использование бочки для хранения промышленных товаров (часов/литр)':24*30,
        '|=Склад промышленных товаров (кубометр)':1/1000,
        }

metadict_detail['|=Бочка асбеста (литр)'] = {
        'Использование бочки для хранения промышленных товаров (часов/литр)':24*30,
        '|=Склад промышленных товаров (кубометр)':1/1000,
        }

metadict_detail['|=Бочка жидкого стекла (литр)'] = {
        'Использование бочки для хранения промышленных товаров (часов/литр)':24*30,
        '|=Склад промышленных товаров (кубометр)':1/1000,
        }

metadict_detail['|=Бочка дёгтя (литр)'] = {
        'Использование бочки для хранения промышленных товаров (часов/литр)':24*30,
        '|=Склад промышленных товаров (кубометр)':1/1000,
        }

metadict_detail['|=Бочка дегтярного масла (литр)'] = {
        'Использование бочки для хранения промышленных товаров (часов/литр)':24*30,
        '|=Склад промышленных товаров (кубометр)':1/1000,
        }

metadict_detail['|=Тюк пропитаной пакли (кубометр)'] = {
        '|=Склад строительных материалов (кубометр)':1,
        }

#----
# Строительные материалы

metadict_detail['|=Рулон глиносоломенного ковра (кубометр)'] = {
        '|=Склад строительных материалов (кубометр)':1,
        }

metadict_detail['|=Рулон соломенного ковра (кубометр)'] = {
        '|=Склад строительных материалов (кубометр)':1,
        }

metadict_detail['|=Рулон толя (кубометр)'] = {
        '|=Склад промышленных товаров (кубометр)':1,
        }

metadict_detail['|=Пеньковые верёвки (кубометр)'] = {
        '|=Склад промышленных товаров (кубометр)':1,
        }

metadict_detail['|=Прокат стальной (кубометр)'] = {
        '|=Склад промышленных товаров (кубометр)':1,
        }

metadict_detail['|=Литьё чугунное (кубометр)'] = {
        '|=Склад промышленных товаров (кубометр)':1,
        }

metadict_detail['|=Пиломатериалы свежие (кубометр)'] = {
        '|=Склад строительных материалов (кубометр)':1,
        }

metadict_detail['|=Кирпич (кубометр)'] = {
        '|=Склад строительных материалов (кубометр)':1,
        }

metadict_detail['|=Опилкобетон лёгкий (кубометр)'] = {
        '|=Склад строительных материалов (кубометр)':1,
        }

metadict_detail['|=Саман лёгкий (кубометр)'] = {
        '|=Склад строительных материалов (кубометр)':1,
        }

metadict_detail['|=Глина (кубометр)'] = {
        '|=Склад промышленного сырья (кубометр)':1,
        }

metadict_detail['|=Грунт (кубометр)'] = {
        # Исправить
            # А куда грунт девать? С глаз долой?
        }

metadict_detail['|=Дрова (кубометр)'] = {
        '|=Склад промышленного сырья (кубометр)':1,
        }

metadict_detail['|=Смоляк (кубометр)'] = {
        '|=Склад промышленного сырья (кубометр)':1,
        }

#metadict_detail['|=Сухая солома (кубометр)'] = {
#        '|=Склад промышленного сырья (кубометр)':1,
#        }

metadict_detail['|=Тюк сухой соломы (кубометр)'] = {
        '|=Склад промышленного сырья (кубометр)':1,
        }

metadict_detail['|=Тюк пакли (кубометр)'] = {
        '|=Склад промышленного сырья (кубометр)':1,
        }

metadict_detail['|=Лес круглый (кубометр)'] = {
        '|=Склад промышленного сырья (кубометр)':1,
        }

metadict_detail['|=Опилки древесные (кубометр)'] = {
        '|=Склад промышленного сырья (кубометр)':1,
        }

metadict_detail['|=Песок (кубометр)'] = {
        '|=Склад промышленного сырья (кубометр)':1,
        }

metadict_detail['|=Щебень (кубометр)'] = {
        '|=Склад промышленного сырья (кубометр)':1,
        }

metadict_detail['|=Гравий (кубометр)'] = {
        '|=Склад промышленного сырья (кубометр)':1,
        }

metadict_detail['|=Бутовый камень (кубометр)'] = {
        '|=Склад промышленного сырья (кубометр)':1,
        }

#----
# Типы складов:

metadict_detail['|=Стог сельскохозяйственного сырья (кубометр)'] = {
        '|===Склад полевой (кубометр)':1,
        }

metadict_detail['|=Стог соломы (кубометр)'] = {
        '|===Склад сырьевой (кубометр)':1,
        }

metadict_detail['|=Склад промышленного сырья (кубометр)'] = {
        '|===Склад сырьевой (кубометр)':1,
        }

metadict_detail['|=Склад сельскохозяйственного сырья (кубометр)'] = {
        '|===Склад сырьевой (кубометр)':1,
        }

metadict_detail['|=Склад продовольствия в бочках (кубометр)'] = {
        '|===Склад товарный (кубометр)':1,
        }

metadict_detail['|=Склад консервов в банках и ящиках (кубометр)'] = {
        '|===Склад товарный (кубометр)':1,
        }

metadict_detail['|=Склад промышленных товаров (кубометр)'] = {
        '|===Склад товарный (кубометр)':1,
        }

metadict_detail['|=Склад строительных материалов (кубометр)'] = {
        '|===Склад товарный (кубометр)':1,
        }
