#----
# Профессии (управленцы):
    # Число Данбара и закон Ципфа в управлении:
        # TODO: Метод SADRAT, грустнокрыса -- spot, access, develop, recruit, handle, terminate
        # Сюзерен может контролировать 10-12 человек (в норме 6-7 человек)
        # Распорядок    | Люди | Часов/контакт | Встречи
        # ------------- | ---- | ------------- | ------------------------
        # 8:00 - 10:00  | 128  | 4 ч и 42 мин  | Разведка, учёба, поездки
        # 10:00 - 12:00 | 64   | 9 ч и 24 мин  | Шлейф, 30+ мин/месяц
        # 12:00 - 14:00 | 32   | 19 часов/год  | Шлейф, 60+ мин/месяц
        # 14:00 - 16:00 | 16   | 38            | Слуги, 30 мин/неделя
        # 16:00 - 18:00 | 8    | 75            | Вассалы, 60 мин/неделя
        # 18:00 - 20:00 | 4    | 150           | Друзья, 30 мин/день
        # 20:00 - 22:00 | 2    | 300           | Семья, 60 мин/день
        # 22:00 - 24:00 | 1    | 600           | Семья, 120 мин/день
        # +1 часа раз в месяц на анализ сети контактов (12 часов/год)
        # +2 часа раз в 3-4 месяца переписать сеть контактов (8 часов/год)
        # Оценочная стоимость подготовки вассала 400 часов (5 лет)
        # Ежегодно теряется 30% контактов (45/150 ежегодно)
        # "Нетворкинг для разведчика" Андрей Безруков
        # http://flibusta.site/b/646001/read
        # http://palaman.livejournal.com/243479.html
        # https://ru.wikipedia.org/wiki/Закон_Ципфа#Приложения_закона
        # https://web.archive.org/web/20170611172510/https://sociology.stanford.edu/sites/default/files/publications/the_strength_of_weak_ties_and_exch_w-gans.pdf
    # Подбор персонала/работодателей, метод "Разборчивая невеста":
        # Невеста отказывает N / 2.718 женихам и выбирает следующего, кто лучше:
        # 30 дней × (6 собеседований / 2.718) / 3 вакансии = 22 отказов
        # 30 дней × (6 - (6 собеседований / 2.718)) / 3 вакансии = 38 выборка
        # 37% шанс выбора лучшего при большой выборке; 2.718 -- число Эйлера
        # Опасен / Не опасен; Интересен / Не интересен; Сложен / Не сложен.
        # https://ru.m.wikipedia.org/wiki/Задача_о_разборчивой_невесте
    # Мотивы власти (мотивация от элит для общества):
        # - Опасность (награда / наказание / враг / месть)
        # - Привычка (знание / закон / авторитет / эталон)
        # По силе воздействия: идеология, эго, награда, принуждение.
        # Управление улучшается от разнообразия управляющего воздействия.
        # https://web.archive.org/web/20241205001001/https://aftershock.news/?q=node/1402450
        # https://ru.wikipedia.org/wiki/Закон_необходимого_разнообразия
    # Проектирование, расчёт стоимости проекта:
        # Соотношение Брукса -- 33% времени проектирование, 17% разработка, 25% тестирование модулей, 25% тестирование продукта
        # Затраты = (2 × стоимость часа) / (коэф.продуктивности × коэф.риска)
        # Коэффициент продуктивности и коэффициент рисков обычно ниже 0.5
        # Подстановка:
        # (2 × 1) / (0.5 × 0.5) = ×8 (нормальная команда)
        # (2 × 1) / (0.3 × 0.3) = ×22 (посредственная команда)
        # "Фреймворк управления и анализа проектов DaShe" Сергей Щеглов
        # http://flibusta.site/b/836206/read
    # Проектирование, расчёт стоимости проекта, методика PERT:
        # E = (P + 4*M + O) / 6
        # По трём точкам:
        # P - Пессимистичная оценка (pessimistic)
        # M - Наиболее вероятная (most licely)
        # O - Оптимистичная (optimistic)
        # E - Наиболее вероятная оценка
        # Например (боевой приказ)
        # (10+4*5+2)/6=5.33 часов
    # Коэффициент труда управленцев к производящему труду:
        # - 0.1 -- New York Ship Building 1943
        # - 0.3-0.5 -- Россия 2018 год
        # За 20 век сфера услуг с 25% до 75% занятых. 3000 --> 2000 нормо-часов/год
        # В развитых странах 60% должностей бессмысленны, в прочих 30% рабочих мест.
        # В 1985-2005 расходы на административный персонал университетов США +66-135%.
        # Менеджериальный феодализм: положение в иерархии зависит от числа вассалов.
        # Иерархический инстинкт, закон Паркинсона. Статус ведомства от числа людей.
        # - Два заместителя --> кто-то пробивает третьего --> все пробивают третьего
        # - Короля играет свита. Число вассалов + их позиции = власть группы.
        # "Лестница в небо" Сергей Щеглов Михаил Хазин
        # "The principles of scientific management" Taylor 1911
        # https://alex-rozoff.livejournal.com/799611.html
        # https://alex-rozoff.livejournal.com/686553.html
        # https://alex-rozoff.livejournal.com/598569.html
        # http://shkolnikov.info/articles/10-vlast-i-obshhestvo/69179-priroda-i-protsess-neuderzhimogo-rosta-privilegiy

metadict_model['_-@Промышленность-добыча, управление, лесоруб'] = {
        '_-@@Промышленность-добыча (управление)':1,
        }

metadict_model['_-@Промышленность-добыча, управление, шахтёр'] = {
        '_-@@Промышленность-добыча (управление)':1,
        }

metadict_model['_-@Строительство, управление, дорожный строитель'] = {
        '_-@@Строительство (управление)':1,
        }

metadict_model['_-@Строительство, управление, железнодорожный монтёр'] = {
        '_-@@Строительство (управление)':1,
        }

metadict_model['_-@Строительство, управление, землекоп'] = {
        '_-@@Строительство (управление)':1,
        }

metadict_model['_-@Строительство, управление, каменщик'] = {
        '_-@@Строительство (управление)':1,
        }

metadict_model['_-@Строительство, управление, маляр'] = {
        '_-@@Строительство (управление)':1,
        }

metadict_model['_-@Строительство, управление, печник'] = {
        '_-@@Строительство (управление)':1,
        }

metadict_model['_-@Строительство, управление, плотник'] = {
        '_-@@Строительство (управление)':1,
        }

metadict_model['_-@Строительство, управление, штукатур'] = {
        '_-@@Строительство (управление)':1,
        }

metadict_model['_-@Транспорт, управление, водопроводчик'] = {
        '_-@@Транспорт (управление)':1,
        }

metadict_model['_-@Транспорт, управление, грузчик'] = {
        '_-@@Транспорт (управление)':1,
        }

metadict_model['_-@Транспорт, управление, путевой смотритель'] = {
        '_-@@Транспорт (управление)':1,
        }

metadict_model['_-@Транспорт, управление, лётчик-пегас'] = {
        '_-@@Транспорт (управление)':1,
        }

metadict_model['_-@Транспорт, управление, моряк'] = {
        '_-@@Транспорт (управление)':1,
        }

#----
# Работы по дому:

metadict_model['_-@Домохозяйство, повар'] = {
        # Пони изрядно склонны к кооперации, поэтому готовят на всех.
        # Это занятия, предполагающие работу 4 × 300 = 1200 часов/год.
        '_-@@Домохозяйство (работник)':1,
        }

metadict_model['_-@Домохозяйство, поварёнок'] = {
        # На ферме, в расширенной семье на 25 пони, 3 повара и 2-3 поварёнка.
        # amber -sm ферма Эпплов -E "@"
        # amber -sm Винодельня Берри -E "@"
        '_-@@Домохозяйство (работник)':1,
        }

metadict_model['_-@Домохозяйство, прачка'] = {
        # А другие, сменяя друг друга, занимаются стиркой, колкой дров, уборкой.
        '_-@@Домохозяйство (работник)':1,
        }

metadict_model['_-@Домохозяйство, разнорабочий'] = {
        '_-@@Домохозяйство (работник)':1,
        }

metadict_model['_-@Домохозяйство, водовоз'] = {
        '_-@@Домохозяйство (работник)':1,
        }

metadict_model['_-@Домохозяйство, уборщик'] = {
        '_-@@Домохозяйство (работник)':1,
        }

metadict_model['_-@Домохозяйство, писатели'] = {
        # Кто-то хорошо умеет писать письма.
        '_-@@Домохозяйство (работник)':1,
        }

metadict_model['_-@Домохозяйство, читатели'] = {
        # А кто-то читает вслух по вечерам.
        '_-@@Домохозяйство (работник)':1,
        }

#----
# Профессии:
    # 10-15% меняют профессию за 10 лет работы (20-30% в период строек/перемен)

metadict_model['_-@Земледелие, бобовые'] = {
        # Это вакансии, предполагающие работу 8 × 200 = 1600 часов/год
        '_-@@Земледелие (работник)':1,
        }

metadict_model['_-@Земледелие, грибовод'] = {
        '_-@@Земледелие (работник)':1,
        }

metadict_model['_-@Земледелие, зебра'] = {
        '_-@@Земледелие (зебра)':1,
        }

metadict_model['_-@Земледелие, зерновые'] = {
        '_-@@Земледелие (работник)':1,
        }

metadict_model['_-@Земледелие, лесник'] = {
        '_-@@Земледелие (работник)':1,
        }

metadict_model['_-@Земледелие, масличные'] = {
        '_-@@Земледелие (работник)':1,
        }

metadict_model['_-@Земледелие, огородник'] = {
        '_-@@Земледелие (работник)':1,
        }

metadict_model['_-@Земледелие, пчеловод'] = {
        '_-@@Земледелие (работник)':1,
        }

metadict_model['_-@Земледелие, садовод'] = {
        '_-@@Земледелие (работник)':1,
        }

metadict_model['_-@Земледелие, технические'] = {
        '_-@@Земледелие (работник)':1,
        }

metadict_model['_-@Земледелие, сушка'] = {
        '_-@@Земледелие (работник)':1,
        }

metadict_model['_-@Обслуживание-кулинария, повар'] = {
        '_-@@Обслуживание-кулинария (работник)':1,
        }

metadict_model['_-@Обслуживание-кулинария, поварёнок'] = {
        '_-@@Обслуживание-кулинария (работник)':1,
        }

metadict_model['_-@Обслуживание-кулинария, официант'] = {
        '_-@@Обслуживание-кулинария (работник)':1,
        }

metadict_model['_-@Обслуживание-кулинария, уборщица'] = {
        '_-@@Обслуживание-кулинария (работник)':1,
        }

metadict_model['_-@Обслуживание-культура, библиотекарь'] = {
        '_-@@Обслуживание-культура (работник)':1,
        }

metadict_model['_-@Обслуживание-медицина, волшебник-врач, 0 круг'] = {
        '_-@@Обслуживание-медицина (работник)':1,
        }

metadict_model['_-@Обслуживание-медицина, волшебник-врач, 1 круг'] = {
        '_-@@Обслуживание-медицина (работник)':1,
        }

metadict_model['_-@Обслуживание-медицина, волшебник-врач, 2 круг'] = {
        '_-@@Обслуживание-медицина (работник)':1,
        }

metadict_model['_-@Обслуживание-медицина, волшебник-врач, 3 круг'] = {
        '_-@@Обслуживание-медицина (работник)':1,
        }

metadict_model['_-@Обслуживание-медицина, волшебник-врач, 4 круг'] = {
        '_-@@Обслуживание-медицина (работник)':1,
        }

metadict_model['_-@Обслуживание-медицина, волшебник-врач, 5 круг'] = {
        '_-@@Обслуживание-медицина (работник)':1,
        }

metadict_model['_-@Обслуживание-медицина, врач, больница'] = {
        '_-@@Обслуживание-медицина (работник)':1,
        }

metadict_model['_-@Обслуживание-медицина, врач, поликлиника'] = {
        '_-@@Обслуживание-медицина (работник)':1,
        }

metadict_model['_-@Обслуживание-медицина, фельдшер, больница'] = {
        '_-@@Обслуживание-медицина (работник)':1,
        }

metadict_model['_-@Обслуживание-медицина, фельдшер, поликлиника'] = {
        '_-@@Обслуживание-медицина (работник)':1,
        }

metadict_model['_-@Обслуживание-медицина, фельдшер, скорая помощь'] = {
        '_-@@Обслуживание-медицина (работник)':1,
        }

metadict_model['_-@Обслуживание-медицина, фельдшер, скорая помощь, пегас'] = {
        '_-@@Обслуживание-медицина (пегас)':1,
        }

metadict_model['_-@Обслуживание-образование, учитель, начальная школа'] = {
        '_-@@Обслуживание-образование (работник)':1,
        }

metadict_model['_-@Обслуживание-образование, учитель, средняя школа'] = {
        '_-@@Обслуживание-образование (работник)':1,
        }

metadict_model['_-@Обслуживание-образование, учитель, профессиональная школа'] = {
        '_-@@Обслуживание-образование (работник)':1,
        }

metadict_model['_-@Обслуживание-образование, учитель, университет'] = {
        '_-@@Обслуживание-образование (работник)':1,
        }

metadict_model['_-@Промышленность-добыча, волшебник-шахтёр, 0 круг'] = {
        '_-@@Промышленность-добыча (работник)':1,
        }

metadict_model['_-@Промышленность-добыча, землекоп, глина'] = {
        '_-@@Промышленность-добыча (работник)':1,
        }

metadict_model['_-@Промышленность-добыча, землекоп, торф'] = {
        '_-@@Промышленность-добыча (работник)':1,
        }

metadict_model['_-@Промышленность-добыча, рабочий, лесоруб'] = {
        '_-@@Промышленность-добыча (работник)':1,
        }

metadict_model['_-@Промышленность-добыча, рабочий, сапёр'] = {
        '_-@@Промышленность-добыча (работник)':1,
        }

metadict_model['_-@Промышленность-добыча, рабочий, шахтёр'] = {
        '_-@@Промышленность-добыча (работник)':1,
        }

metadict_model['_-@Промышленность-добыча, рабочий, обогащение'] = {
        '_-@@Промышленность-добыча (работник)':1,
        }

metadict_model['_-@Промышленность-добыча, рабочий, шахтёр, щебень'] = {
        '_-@@Промышленность-добыча (работник)':1,
        }

metadict_model['_-@Промышленность-кустари, волшебник-светокристаллы, 2 круг'] = {
        '_-@@Промышленность-кустари (работник)':1,
        }

metadict_model['_-@Промышленность-кустари, рабочий, портной'] = {
        '_-@@Промышленность-кустари (работник)':1,
        }

metadict_model['_-@Промышленность-кустари, рабочий, сапожник'] = {
        '_-@@Промышленность-кустари (работник)':1,
        }

metadict_model['_-@Промышленность-кустари, рабочий, ткач'] = {
        '_-@@Промышленность-кустари (работник)':1,
        }

metadict_model['_-@Промышленность-кустари, рабочий, швец'] = {
        '_-@@Промышленность-кустари (работник)':1,
        }

metadict_model['_-@Промышленность-кустари, рабочий, керамика'] = {
        '_-@@Промышленность-кустари (работник)':1,
        }

metadict_model['_-@Промышленность-кустари, рабочий, корзины'] = {
        '_-@@Промышленность-кустари (работник)':1,
        }

metadict_model['_-@Промышленность-кустари, рабочий, бондарь'] = {
        '_-@@Промышленность-кустари (работник)':1,
        }

metadict_model['_-@Промышленность-кустари, рабочий, ящики'] = {
        '_-@@Промышленность-кустари (работник)':1,
        }

metadict_model['_-@Промышленность-фабрики, рабочий, металлургия'] = {
        '_-@@Промышленность-фабрики (работник)':1,
        }

metadict_model['_-@Промышленность-фабрики, рабочий, бумага'] = {
        '_-@@Промышленность-фабрики (работник)':1,
        }

metadict_model['_-@Промышленность-фабрики, рабочий, смолокур'] = {
        '_-@@Промышленность-фабрики (работник)':1,
        }

metadict_model['_-@Промышленность-фабрики, рабочий, углежог'] = {
        '_-@@Промышленность-фабрики (работник)':1,
        }

metadict_model['_-@Промышленность-фабрики, рабочий, известь'] = {
        '_-@@Промышленность-фабрики (работник)':1,
        }

metadict_model['_-@Промышленность-фабрики, рабочий, кафель'] = {
        '_-@@Промышленность-фабрики (работник)':1,
        }

metadict_model['_-@Промышленность-фабрики, рабочий, кирпич'] = {
        '_-@@Промышленность-фабрики (работник)':1,
        }

metadict_model['_-@Промышленность-фабрики, рабочий, кирпич саманный'] = {
        '_-@@Промышленность-фабрики (работник)':1,
        }

metadict_model['_-@Промышленность-фабрики, рабочий, красильщик'] = {
        '_-@@Промышленность-фабрики (работник)':1,
        }

metadict_model['_-@Промышленность-фабрики, рабочий, лесопилка'] = {
        '_-@@Промышленность-фабрики (работник)':1,
        }

metadict_model['_-@Промышленность-фабрики, рабочий, маслозавод'] = {
        '_-@@Промышленность-фабрики (работник)':1,
        }

metadict_model['_-@Промышленность-фабрики, рабочий, мыловар'] = {
        '_-@@Промышленность-фабрики (работник)':1,
        }

metadict_model['_-@Промышленность-фабрики, рабочий, клеевар'] = {
        '_-@@Промышленность-фабрики (работник)':1,
        }

metadict_model['_-@Промышленность-фабрики, рабочий, солевар'] = {
        '_-@@Промышленность-фабрики (работник)':1,
        }

metadict_model['_-@Промышленность-фабрики, рабочий, опилкобетон'] = {
        '_-@@Промышленность-фабрики (работник)':1,
        }

metadict_model['_-@Промышленность-фабрики, рабочий, паркет'] = {
        '_-@@Промышленность-фабрики (работник)':1,
        }

metadict_model['_-@Промышленность-фабрики, рабочий, пивоварня'] = {
        '_-@@Промышленность-фабрики (работник)':1,
        }

metadict_model['_-@Промышленность-фабрики, рабочий, мукомол'] = {
        '_-@@Промышленность-фабрики (работник)':1,
        }

metadict_model['_-@Промышленность-фабрики, рабочий, прядильщик'] = {
        '_-@@Промышленность-фабрики (работник)':1,
        }

metadict_model['_-@Промышленность-фабрики, рабочий, солод'] = {
        '_-@@Промышленность-фабрики (работник)':1,
        }

metadict_model['_-@Промышленность-фабрики, рабочий, типография'] = {
        '_-@@Промышленность-фабрики (работник)':1,
        }

metadict_model['_-@Промышленность-фабрики, рабочий, ткач'] = {
        '_-@@Промышленность-фабрики (работник)':1,
        }

metadict_model['_-@Промышленность-фабрики, рабочий, хлебозавод'] = {
        '_-@@Промышленность-фабрики (работник)':1,
        }

metadict_model['_-@Промышленность-фабрики, рабочий, цемент'] = {
        '_-@@Промышленность-фабрики (работник)':1,
        }

metadict_model['_-@Промышленность-фабрики, рабочий, черепица'] = {
        '_-@@Промышленность-фабрики (работник)':1,
        }

metadict_model['_-@Строительство, волшебник-сварщик, 0 круг'] = {
        '_-@@Строительство (работник)':1,
        }

metadict_model['_-@Строительство, дорожный строитель'] = {
        '_-@@Строительство (работник)':1,
        }

metadict_model['_-@Строительство, железнодорожный монтёр'] = {
        '_-@@Строительство (работник)':1,
        }

metadict_model['_-@Строительство, землекоп'] = {
        '_-@@Строительство (работник)':1,
        }

metadict_model['_-@Строительство, каменщик'] = {
        '_-@@Строительство (работник)':1,
        }

metadict_model['_-@Строительство, каменщик, печник'] = {
        '_-@@Строительство (работник)':1,
        }

metadict_model['_-@Строительство, кровельщик'] = {
        '_-@@Строительство (работник)':1,
        }

metadict_model['_-@Строительство, маляр'] = {
        '_-@@Строительство (работник)':1,
        }

metadict_model['_-@Строительство, плотник'] = {
        '_-@@Строительство (работник)':1,
        }

metadict_model['_-@Строительство, разнорабочий'] = {
        '_-@@Строительство (работник)':1,
        }

metadict_model['_-@Строительство, разнорабочий-пегас'] = {
        '_-@@Строительство (пегас)':1,
        }

metadict_model['_-@Строительство, штукатур'] = {
        '_-@@Строительство (работник)':1,
        }

metadict_model['_-@Транспорт, водовоз'] = {
        '_-@@Транспорт (работник)':1,
        }

metadict_model['_-@Транспорт, водовоз-пегас'] = {
        '_-@@Транспорт (пегас)':1,
        }

metadict_model['_-@Транспорт, водовоз-земнопони'] = {
        '_-@@Транспорт (работник)':1,
        }

metadict_model['_-@Транспорт, водопроводчик'] = {
        '_-@@Транспорт (работник)':1,
        }

metadict_model['_-@Транспорт, возничий-зебра'] = {
        '_-@@Транспорт (зебра)':1,
        }

metadict_model['_-@Транспорт, возничий-пегас'] = {
        '_-@@Транспорт (пегас)':1,
        }

metadict_model['_-@Транспорт, возничий-земнопони'] = {
        '_-@@Транспорт (работник)':1,
        }

metadict_model['_-@Транспорт, грузчик'] = {
        '_-@@Транспорт (работник)':1,
        }

metadict_model['_-@Транспорт, грузчик-зебра'] = {
        '_-@@Транспорт (зебра)':1,
        }

metadict_model['_-@Транспорт, железнодорожник'] = {
        '_-@@Транспорт (работник)':1,
        }

metadict_model['_-@Транспорт, железнодорожник-пегас'] = {
        '_-@@Транспорт (пегас)':1,
        }

metadict_model['_-@Транспорт, лётчик-пегас'] = {
        '_-@@Транспорт (пегас)':1,
        }

metadict_model['_-@Транспорт, моряк'] = {
        '_-@@Транспорт (работник)':1,
        }

metadict_model['_-@Транспорт, моряк-пегас'] = {
        '_-@@Транспорт (пегас)':1,
        }

metadict_model['_-@Транспорт, почтальон-пегас'] = {
        '_-@@Транспорт (пегас)':1,
        }

metadict_model['_-@Транспорт, почтовый служащий'] = {
        '_-@@Транспорт (работник)':1,
        }

metadict_model['_-@Транспорт, путевой смотритель'] = {
        '_-@@Транспорт (работник)':1,
        }

metadict_model['_-@Транспорт, таксист-пегас'] = {
        '_-@@Транспорт (пегас)':1,
        }

#----
# Группировка:

metadict_model['_-@@Домохозяйство (работник)'] = {
        '_-@@@Домохозяйство (работник)':1,
        }

metadict_model['_-@@Земледелие (зебра)'] = {
        '_-@@@Земледелие (работник)':1,
        }

metadict_model['_-@@Земледелие (работник)'] = {
        '_-@@@Земледелие (работник)':1,
        }

metadict_model['_-@@Обслуживание-кулинария (работник)'] = {
        '_-@@@Обслуживание (работник)':1,
        }

metadict_model['_-@@Обслуживание-культура (работник)'] = {
        '_-@@@Обслуживание (работник)':1,
        }

metadict_model['_-@@Обслуживание-медицина (пегас)'] = {
        '_-@@@Обслуживание (работник)':1,
        }

metadict_model['_-@@Обслуживание-медицина (работник)'] = {
        '_-@@@Обслуживание (работник)':1,
        }

metadict_model['_-@@Обслуживание-образование (работник)'] = {
        '_-@@@Обслуживание (работник)':1,
        }

metadict_model['_-@@Промышленность-добыча (работник)'] = {
        '_-@@@Промышленность (работник)':1,
        }

metadict_model['_-@@Промышленность-добыча (управление)'] = {
        '_-@@@Промышленность (работник)':1,
        }

metadict_model['_-@@Промышленность-кустари (работник)'] = {
        '_-@@@Промышленность (работник)':1,
        }

metadict_model['_-@@Промышленность-фабрики (работник)'] = {
        '_-@@@Промышленность (работник)':1,
        }

metadict_model['_-@@Строительство (пегас)'] = {
        '_-@@@Строительство (работник)':1,
        }

metadict_model['_-@@Строительство (работник)'] = {
        '_-@@@Строительство (работник)':1,
        }

metadict_model['_-@@Строительство (управление)'] = {
        '_-@@@Строительство (работник)':1,
        }

metadict_model['_-@@Транспорт (зебра)'] = {
        '_-@@@Транспорт (работник)':1,
        }

metadict_model['_-@@Транспорт (пегас)'] = {
        '_-@@@Транспорт (работник)':1,
        }

metadict_model['_-@@Транспорт (работник)'] = {
        '_-@@@Транспорт (работник)':1,
        }

metadict_model['_-@@Транспорт (управление)'] = {
        '_-@@@Транспорт (работник)':1,
        }
