#----
# Южноморский рацион:

metadict_detail['Южноморский рацион (пони/год)'] = {
        'Южноморский весенний рацион (пони/день)':90,
        'Южноморский летний рацион (пони/день)':90,
        'Южноморский осенний рацион (пони/день)':90,
        'Южноморский зимний рацион (пони/день)':90,
        }

#----
# Южноморский рацион (времена года):

metadict_detail['Южноморский весенний рацион (пони/день)'] = {
        # В эквестрийской неделе -- 6 дней
        'Южноморский весенний повседневный рацион (пони/день)':5 / 6,
        'Южноморский весенний праздничный рацион (пони/день)':1 / 6,
        }

metadict_detail['Южноморский летний рацион (пони/день)'] = {
        'Южноморский летний повседневный рацион (пони/день)':5 / 6,
        'Южноморский летний праздничный рацион (пони/день)':1 / 6,
        }

metadict_detail['Южноморский зимний рацион (пони/день)'] = {
        'Южноморский зимний повседневный рацион (пони/день)':5 / 6,
        'Южноморский зимний праздничный рацион (пони/день)':1 / 6,
        }

metadict_detail['Южноморский осенний рацион (пони/день)'] = {
        'Южноморский осенний повседневный рацион (пони/день)':5 / 6,
        'Южноморский осенний праздничный рацион (пони/день)':1 / 6,
        }

#----
# Южноморский рацион (дни недели):

metadict_detail['Южноморский весенний повседневный рацион (пони/день)'] = {
        'Южноморский весенний повседневный завтрак':1,
        'Южноморский весенний повседневный обед':1,
        'Южноморский весенний повседневный ужин':1,
        'Южноморское весеннее повседневное питьё v1':3 / 3,
        'Южноморское весеннее повседневное питьё v2':3 / 3,
        'Южноморское весеннее повседневное питьё v3':3 / 3,
        }

metadict_detail['Южноморский весенний праздничный рацион (пони/день)'] = {
        'Южноморский весенний праздничный завтрак':1,
        'Южноморский весенний праздничный обед':1,
        'Южноморский весенний праздничный ужин':1,
        'Южноморское весеннее праздничное питьё v1':3 / 3,
        'Южноморское весеннее праздничное питьё v2':3 / 3,
        'Южноморское весеннее праздничное питьё v3':3 / 3,
        }

metadict_detail['Южноморский зимний повседневный рацион (пони/день)'] = {
        'Южноморский зимний повседневный завтрак':1,
        'Южноморский зимний повседневный обед':1,
        'Южноморский зимний повседневный ужин':1,
        'Южноморское зимнее повседневное питьё v1':3 / 3,
        'Южноморское зимнее повседневное питьё v2':3 / 3,
        'Южноморское зимнее повседневное питьё v3':3 / 3,
        }

metadict_detail['Южноморский зимний праздничный рацион (пони/день)'] = {
        'Южноморский зимний праздничный завтрак':1,
        'Южноморский зимний праздничный обед':1,
        'Южноморский зимний праздничный ужин':1,
        'Южноморское зимнее праздничное питьё v1':3 / 3,
        'Южноморское зимнее праздничное питьё v2':3 / 3,
        'Южноморское зимнее праздничное питьё v3':3 / 3,
        }

metadict_detail['Южноморский летний повседневный рацион (пони/день)'] = {
        'Южноморский летний повседневный завтрак':1,
        'Южноморский летний повседневный обед':1,
        'Южноморский летний повседневный ужин':1,
        'Южноморское летнее повседневное питьё v1':3 / 3,
        'Южноморское летнее повседневное питьё v2':3 / 3,
        'Южноморское летнее повседневное питьё v3':3 / 3,
        }

metadict_detail['Южноморский летний праздничный рацион (пони/день)'] = {
        'Южноморский летний праздничный завтрак':1,
        'Южноморский летний праздничный обед':1,
        'Южноморский летний праздничный ужин':1,
        'Южноморское летнее праздничное питьё v1':3 / 3,
        'Южноморское летнее праздничное питьё v2':3 / 3,
        'Южноморское летнее праздничное питьё v3':3 / 3,
        }

metadict_detail['Южноморский осенний повседневный рацион (пони/день)'] = {
        'Южноморский осенний повседневный завтрак':1,
        'Южноморский осенний повседневный обед':1,
        'Южноморский осенний повседневный ужин':1,
        'Южноморское осеннее повседневное питьё v1':3 / 3,
        'Южноморское осеннее повседневное питьё v2':3 / 3,
        'Южноморское осеннее повседневное питьё v3':3 / 3,
        }

metadict_detail['Южноморский осенний праздничный рацион (пони/день)'] = {
        'Южноморский осенний праздничный завтрак':1,
        'Южноморский осенний праздничный обед':1,
        'Южноморский осенний праздничный ужин':1,
        'Южноморское осеннее праздничное питьё v1':3 / 3,
        'Южноморское осеннее праздничное питьё v2':3 / 3,
        'Южноморское осеннее праздничное питьё v3':3 / 3,
        }

#----
# Южноморский рацион (весна):
    # Март, апрель, май

metadict_detail['Южноморский весенний повседневный завтрак'] = {
        'Лепёшки рисово-просяные паровые (грамм)':25 * 4,
        'Рис обжаренный с капустой и спаржей (грамм)':250,
        'Салат из морской капусты (грамм)':125,
        'Картофель печёный дольками (грамм)':125,
        }

metadict_detail['Южноморский весенний повседневный обед'] = {
        'Рис варёный с соевым соусом (грамм)':250,
        'Суп-пюре гороховый с пряностями (грамм)':250,
        'Похлёбка картофельная с морской капустой (грамм)':125,
        'Батат печёный со шпинатом и соевым соусом (грамм)':125,
        'Капуста квашеная с соевым соусом (грамм)':125,
        }

metadict_detail['Южноморский весенний повседневный ужин'] = {
        'Лепёшки рисово-ячменные паровые (грамм)':25 * 4,
        'Каша пшённая с чечевицей и спаржей (грамм)':250,
        'Пюре бататное (грамм)':250,
        }

metadict_detail['Южноморское весеннее повседневное питьё v1'] = {
        'Чай чёрный (грамм)':250 * 2,
        'Кубики рисовые в сахарном сиропе (грамм)':50,
        'Финики без косточек (грамм)':20,
        }

metadict_detail['Южноморское весеннее повседневное питьё v2'] = {
        'Сидр яблочный (грамм)':250,
        'Блины рисовые с арахисовой пастой (грамм)':50,
        }

metadict_detail['Южноморское весеннее повседневное питьё v3'] = {
        'Чай чёрный с сахаром (грамм)':250 * 2,
        'Блины рисовые с темпе (грамм)':50,
        }

metadict_detail['Южноморский весенний праздничный завтрак'] = {
        'Лепёшки рисово-ячменные паровые (грамм)':25 * 4,
        'Рис варёный с консервированными овощами (грамм)':250,
        'Картофель тушёный в соевом соусе (грамм)':125,
        'Вёшенки тушёные (грамм)':125,
        }

metadict_detail['Южноморский весенний праздничный обед'] = {
        'Рис варёный с соевым соусом (грамм)':250,
        'Пюре гороховое с пряностями (грамм)':250,
        'Суп-пюре чечевичный со шпинатом (грамм)':125,
        'Картофель жареный соломкой (грамм)':125,
        'Паста нутовая (грамм)':125,
        }

metadict_detail['Южноморский весенний праздничный ужин'] = {
        'Хлеб пшеничный домашний (грамм)':25 * 4,
        'Суп-лапша с бататом и солёными томатами (грамм)':250,
        'Пудинг морковный (грамм)':125,
        }

metadict_detail['Южноморское весеннее праздничное питьё v1'] = {
        'Чай чёрный с лимоном (грамм)':250 * 2,
        'Лепёшки рисовые с лимонным сиропом (грамм)':25 * 4,
        'Желе из ревеня (грамм)':125,
        }

metadict_detail['Южноморское весеннее праздничное питьё v2'] = {
        'Вино белое сухое (грамм)':250,
        'Блины рисовые с нутовой пастой (грамм)':50,
        }

metadict_detail['Южноморское весеннее праздничное питьё v3'] = {
        'Компот из свежего ревеня (грамм)':250 * 2,
        }

#----
# Южноморский рацион (лето):
    # Июнь, июль, август

metadict_detail['Южноморский летний повседневный завтрак'] = {
        'Лепёшки рисово-просяные паровые (грамм)':25 * 4,
        'Рис обжаренный с капустой и овощами (грамм)':250,
        'Салат огуречный с соевым соусом (грамм)':125,
        'Пастернак печёный дольками (грамм)':125,
        }

metadict_detail['Южноморский летний повседневный обед'] = {
        'Рис варёный с соевым соусом (грамм)':250,
        'Суп-пюре нутовый с луком-пореем (грамм)':250,
        'Похлёбка томатная с чечевицей (грамм)':125,
        'Баклажан обжаренный с овощами (грамм)':125,
        'Капуста варёная с пряностями (грамм)':125,
        }

metadict_detail['Южноморский летний повседневный ужин'] = {
        # Исправить
            # Многовато лепёшек, блюдо какое-нибудь добавь.
        'Лепёшки рисово-ячменные паровые (грамм)':25 * 8,
        'Каша пшённая с чечевицей и овощами (грамм)':250,
        'Южноморские летние фрукты (грамм)':250,
        }

metadict_detail['Южноморское летнее повседневное питьё v1'] = {
        'Чай чёрный (грамм)':250 * 2,
        'Лепёшки рисовые с финиковым соусом (грамм)':25 * 4,
        'Арахис обжаренный (грамм)':20,
        }

metadict_detail['Южноморское летнее повседневное питьё v2'] = {
        'Вино красное сухое (грамм)':250,
        'Блины рисовые с арахисовой пастой (грамм)':50,
        }

metadict_detail['Южноморское летнее повседневное питьё v3'] = {
        'Чай чёрный с сахаром (грамм)':250 * 2,
        'Лепёшки картофельные с пряностями (грамм)':25 * 2,
        }

metadict_detail['Южноморский летний праздничный завтрак'] = {
        'Лепёшки рисово-ячменные паровые (грамм)':25 * 4,
        'Рис варёный с консервированными овощами (грамм)':250,
        'Картофель тушёный с горошком и пряностями (грамм)':125,
        'Вёшенки жареные (грамм)':125,
        }

metadict_detail['Южноморский летний праздничный обед'] = {
        'Рис варёный с соевым соусом (грамм)':250,
        'Суп-пюре шпинатный с темпе (грамм)':250,
        'Суп-пюре из батата со сладким перцем (грамм)':125,
        'Пастернак запечёный с томатами (грамм)':125,
        'Шарики с картофельной начинкой (грамм)':125,
        }

metadict_detail['Южноморский летний праздничный ужин'] = {
        'Хлеб пшеничный домашний (грамм)':25 * 4,
        'Суп-лапша с кабачком и свежими томатами (грамм)':250,
        'Пудинг кукурузный (грамм)':125,
        }

metadict_detail['Южноморское летнее праздничное питьё v1'] = {
        'Чай чёрный с лимоном (грамм)':250 * 2,
        'Лепёшки рисовые с яблочным сиропом (грамм)':25 * 4,
        'Желе лимонное (грамм)':125,
        }

metadict_detail['Южноморское летнее праздничное питьё v2'] = {
        'Вино белое сухое (грамм)':250,
        'Блины рисовые с финиковой пастой (грамм)':50,
        }

metadict_detail['Южноморское летнее праздничное питьё v3'] = {
        'Компот из свежих персиков (грамм)':250 * 2,
        }


#----
# Южноморский рацион (осень):
    # Сентябрь, октябрь, ноябрь

metadict_detail['Южноморский осенний повседневный завтрак'] = {
        'Лепёшки рисово-ячменные паровые (грамм)':25 * 4,
        'Рис обжаренный с капустой и грибами (грамм)':250,
        'Салат огуречный с соевым соусом (грамм)':125,
        'Батат печёный дольками (грамм)':125,
        }

metadict_detail['Южноморский осенний повседневный обед'] = {
        'Рис варёный с соевым соусом (грамм)':250,
        'Суп-пюре чечевичный с тыквой (грамм)':250,
        'Похлёбка томатная с фасолью (грамм)':125,
        'Кукуруза печёная с соевым соусом (грамм)':125,
        'Капуста варёная с пряностями (грамм)':125,
        }

metadict_detail['Южноморский осенний повседневный ужин'] = {
        'Хлеб соевый домашний (грамм)':25 * 4,
        'Каша пшённая с чечевицей и горошком (грамм)':250,
        'Южноморские осенние фрукты (грамм)':250,
        }

metadict_detail['Южноморское осеннее повседневное питьё v1'] = {
        'Чай чёрный (грамм)':250 * 2,
        'Лепёшки рисовые с алычовым соусом (грамм)':25 * 4,
        'Орех кешью обжаренный (грамм)':20,
        }

metadict_detail['Южноморское осеннее повседневное питьё v2'] = {
        'Сок яблочный (грамм)':250 * 2,
        'Блины рисовые с арахисовой пастой (грамм)':50,
        }

metadict_detail['Южноморское осеннее повседневное питьё v3'] = {
        'Чай чёрный с мёдом (грамм)':250 * 2,
        'Лепёшки картофельные с пряностями (грамм)':25 * 2,
        }

metadict_detail['Южноморский осенний праздничный завтрак'] = {
        'Лепёшки рисово-ячменные паровые (грамм)':25 * 4,
        'Рис варёный с консервированными овощами (грамм)':250,
        'Тыква фаршированная картофелем с пряностями (грамм)':125,
        'Вёшенки тушёные (грамм)':125,
        }

metadict_detail['Южноморский осенний праздничный обед'] = {
        'Рис варёный с соевым соусом (грамм)':250,
        'Нут тушёный с томатами и пряностями (грамм)':250,
        'Суп-пюре морковный с пряностями (грамм)':125,
        'Картофель жареный в соусе (грамм)':125,
        'Шарики с овощной начинкой (грамм)':125,
        }

metadict_detail['Южноморский осенний праздничный ужин'] = {
        'Хлеб пшеничный домашний (грамм)':25 * 4,
        'Суп-лапша с кабачком и свежими томатами (грамм)':250,
        'Пудинг тыквенный (грамм)':125,
        }

metadict_detail['Южноморское осеннее праздничное питьё v1'] = {
        'Чай чёрный с лимоном (грамм)':250 * 2,
        'Лепёшки рисовые с лимонным сиропом (грамм)':25 * 4,
        'Желе яблочное (грамм)':125,
        }

metadict_detail['Южноморское осеннее праздничное питьё v2'] = {
        'Вино белое сухое (грамм)':250,
        'Блины рисовые с картофелем (грамм)':50 * 2,
        }

metadict_detail['Южноморское осеннее праздничное питьё v3'] = {
        'Компот из свежей вишни (грамм)':250 * 2,
        }

#----
# Южноморский рацион (зима):
    # Декабрь, январь, февраль

metadict_detail['Южноморский зимний повседневный завтрак'] = {
        'Хлеб кукурузный домашний (грамм)':25 * 4,
        'Рис обжаренный с чечевицей и луком (грамм)':250,
        'Салат морковный с соевым соусом (грамм)':125,
        'Батат печёный дольками (грамм)':125,
        }

metadict_detail['Южноморский зимний повседневный обед'] = {
        'Рис варёный с соевым соусом (грамм)':250,
        'Суп-пюре фасолевый с пряностями (грамм)':250,
        'Похлёбка картофельная с морской капустой (грамм)':125,
        'Корень сельдерея печёный с соевым соусом (грамм)':125,
        'Капуста квашеная с соевым соусом (грамм)':125,
        }

metadict_detail['Южноморский зимний повседневный ужин'] = {
        'Хлеб кукурузный домашний (грамм)':25 * 4,
        'Каша пшённая с чечевицей (грамм)':250,
        'Пюре тыквенное (грамм)':250,
        }

metadict_detail['Южноморское зимнее повседневное питьё v1'] = {
        'Чай чёрный (грамм)':250 * 2,
        'Крендельки в сахарной глазури (грамм)':50,
        'Фисташки обжаренные (грамм)':20,
        }

metadict_detail['Южноморское зимнее повседневное питьё v2'] = {
        # Исправить
            # Добавь пирожки samosa
        'Сидр грушевый (грамм)':250,
        }

metadict_detail['Южноморское зимнее повседневное питьё v3'] = {
        'Чай чёрный с мёдом (грамм)':250 * 2,
        'Темпе обжаренный (грамм)':50,
        }

metadict_detail['Южноморский зимний праздничный завтрак'] = {
        'Хлеб пшеничный домашний (грамм)':25 * 4,
        'Рис варёный с консервированными овощами (грамм)':250,
        'Картофель тушёный с оливками и лимоном (грамм)':125,
        'Вёшенки жареные (грамм)':125,
        }

metadict_detail['Южноморский зимний праздничный обед'] = {
        'Рис варёный с соевым соусом (грамм)':250,
        'Пюре гороховое с пряностями (грамм)':250,
        'Суп нутовый с солёными томатами (грамм)':125,
        'Картофель жареный соломкой (грамм)':125,
        'Шарики нутовые в панировке (грамм)':125,
        }

metadict_detail['Южноморский зимний праздничный ужин'] = {
        'Хлеб пшеничный домашний (грамм)':25 * 4,
        'Суп-лапша с бататом и солёными томатами (грамм)':250,
        'Пудинг морковный (грамм)':125,
        }

metadict_detail['Южноморское зимнее праздничное питьё v1'] = {
        'Чай чёрный с лимоном (грамм)':250 * 2,
        'Желе виноградное (грамм)':125,
        }

metadict_detail['Южноморское зимнее праздничное питьё v2'] = {
        'Вино белое сухое (грамм)':250,
        'Темпе запечёный с сахаром (грамм)':50,
        }

metadict_detail['Южноморское зимнее праздничное питьё v3'] = {
        'Компот из сухофруктов (грамм)':250 * 2,
        }
