#----
# Заметки:
    # Группировка по кулинарным приёмам.
    # Сортировка, чистка, жарение, варка и так далее.

#----
# Потребление пищи и питья

metadict_model['_-Потребление антреме (нормо-часов)'] = {
        '_--Потребление пищи (нормо-часов)':1,
        }

metadict_model['_-Потребление второго блюда (нормо-часов)'] = {
        '_--Потребление пищи (нормо-часов)':1,
        }

metadict_model['_-Потребление выпечки (нормо-часов)'] = {
        '_--Потребление пищи (нормо-часов)':1,
        }

metadict_model['_-Потребление десерта (нормо-часов)'] = {
        '_--Потребление пищи (нормо-часов)':1,
        }

metadict_model['_-Потребление жареной выпечки (нормо-часов)'] = {
        '_--Потребление пищи (нормо-часов)':1,
        }

metadict_model['_-Потребление орешков (нормо-часов)'] = {
        '_--Потребление пищи (нормо-часов)':1,
        }

metadict_model['_-Потребление первого блюда (нормо-часов)'] = {
        '_--Потребление пищи (нормо-часов)':1,
        }

metadict_model['_-Потребление сладостей (нормо-часов)'] = {
        '_--Потребление пищи (нормо-часов)':1,
        }

metadict_model['_-Потребление вареников (нормо-часов)'] = {
        '_--Потребление пищи (нормо-часов)':1,
        }

metadict_model['_-Потребление соуса (нормо-часов)'] = {
        '_--Потребление пищи (нормо-часов)':1,
        }

metadict_model['_-Потребление сэндвичей (нормо-часов)'] = {
        '_--Потребление пищи (нормо-часов)':1,
        }

metadict_model['_-Потребление фруктов (нормо-часов)'] = {
        '_--Потребление пищи (нормо-часов)':1,
        }

metadict_model['_-Потребление хлеба (нормо-часов)'] = {
        '_--Потребление пищи (нормо-часов)':1,
        }

metadict_model['_-Потребление холодного питья (нормо-часов)'] = {
        '_--Потребление питья (нормо-часов)':1,
        }

metadict_model['_-Потребление горячего питья (нормо-часов)'] = {
        '_--Потребление питья (нормо-часов)':1,
        }

#----
# Процессы (кипячение):

metadict_model['_-Кипячение консервов (нормо-часов)'] = {
        '_--Кипячение (нормо-часов)':1,
        }    

metadict_model['_-Кипячение воды (нормо-часов)'] = {
        '_--Кипячение (нормо-часов)':1,
        }

#----
# Процессы (варка, уваривание):

metadict_model['_-Варка напитка (нормо-часов)'] = {
        '_--Варка пищи (нормо-часов)':1,
        }

metadict_model['_-Варка бобов (нормо-часов)'] = {
        '_--Варка пищи (нормо-часов)':1,
        }

metadict_model['_-Варка грибов (нормо-часов)'] = {
        '_--Варка пищи (нормо-часов)':1,
        }

metadict_model['_-Варка овощей (нормо-часов)'] = {
        '_--Варка пищи (нормо-часов)':1,
        }

metadict_model['_-Варка орехов (нормо-часов)'] = {
        '_--Варка пищи (нормо-часов)':1,
        }

metadict_model['_-Варка супа (нормо-часов)'] = {
        '_--Варка пищи (нормо-часов)':1,
        }

metadict_model['_-Варка лапши (нормо-часов)'] = {
        '_--Варка пищи (нормо-часов)':1,
        }

metadict_model['_-Варка вареников (нормо-часов)'] = {
        '_--Варка пищи (нормо-часов)':1,
        }

metadict_model['_-Варка пудинга (нормо-часов)'] = {
        '_--Варка пищи (нормо-часов)':1,
        }

metadict_model['_-Варка рисовых лепёшек (нормо-часов)'] = {
        '_--Варка пищи (нормо-часов)':1,
        }

metadict_model['_-Варка каши (нормо-часов)'] = {
        '_--Варка пищи (нормо-часов)':1,
        }

metadict_model['_-Варка риса (нормо-часов)'] = {
        '_--Варка пищи (нормо-часов)':1,
        }

metadict_model['_-Варка пшена (нормо-часов)'] = {
        '_--Варка пищи (нормо-часов)':1,
        }

metadict_model['_-Варка корнеплодов (нормо-часов)'] = {
        '_--Варка пищи (нормо-часов)':1,
        }

metadict_model['_-Варка компота (нормо-часов)'] = {
        '_--Варка пищи (нормо-часов)':1,
        }

metadict_detail['_-Бланширование овощей (нормо-часов)'] = {
        '_--Варка пищи (нормо-часов)':1,
        }

metadict_detail['_-Бланширование фруктов (нормо-часов)'] = {
        '_--Варка пищи (нормо-часов)':1,
        }

metadict_detail['_-Бланширование семян (нормо-часов)'] = {
        '_--Варка пищи (нормо-часов)':1,
        }

metadict_detail['_-Заваривание чая (нормо-часов)'] = {
        '_--Варка пищи (нормо-часов)':1,
        }

metadict_model['_-Заваривание кофе (нормо-часов)'] = {
        '_--Варка пищи (нормо-часов)':1,
        }

#----
# Процессы (варка, уваривание):

metadict_model['_-Варка напитка заранее (нормо-часов)'] = {
        '_--Варка пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Варка бульона заранее (нормо-часов)'] = {
        '_--Варка пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Варка соуса заранее (нормо-часов)'] = {
        '_--Варка пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Варка фруктов заранее (нормо-часов)'] = {
        '_--Варка пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Варка сиропа заранее (нормо-часов)'] = {
        '_--Варка пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Варка яблочного джема (нормо-часов)'] = {
        '_--Варка пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Варка варенья (нормо-часов)'] = {
        '_--Варка пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Варка семян (нормо-часов)'] = {
        '_--Варка пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Уваривание сиропа (нормо-часов)'] = {
        '_--Варка пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Уваривание сока кленового (нормо-часов)'] = {
        '_--Варка пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Уваривание сока виноградного (нормо-часов)'] = {
        '_--Варка пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Уваривание томатов (нормо-часов)'] = {
        '_--Варка пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Уваривание фруктов (нормо-часов)'] = {
        '_--Варка пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Уваривание бульона (нормо-часов)'] = {
        '_--Варка пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Бланширование лапши (нормо-часов)'] = {
        '_--Варка пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Бланширование орехов (нормо-часов)'] = {
        '_--Варка пищи заранее (нормо-часов)':1,
        }

metadict_detail['_-Заваривание муки (нормо-часов)'] = {
        '_--Варка пищи заранее (нормо-часов)':1,
        }

#----
# Процессы (тушение):

metadict_model['_-Тушение грибов (нормо-часов)'] = {
        '_--Тушение пищи (нормо-часов)':1,
        }

metadict_model['_-Тушение бобов (нормо-часов)'] = {
        '_--Тушение пищи (нормо-часов)':1,
        }

metadict_model['_-Тушение овощей (нормо-часов)'] = {
        '_--Тушение пищи (нормо-часов)':1,
        }

metadict_model['_-Тушение фруктов (нормо-часов)'] = {
        '_--Тушение пищи (нормо-часов)':1,
        }

#----
# Процессы (томление):

metadict_model['_-Томление овощей (нормо-часов)'] = {
        '_--Томление пищи (нормо-часов)':1,
        }

metadict_model['_-Томление пудинга (нормо-часов)'] = {
        '_--Томление пищи (нормо-часов)':1,
        }

metadict_model['_-Томление каши (нормо-часов)'] = {
        '_--Томление пищи (нормо-часов)':1,
        }

#----
# Процессы (запекание):

metadict_model['_-Запекание овощей (нормо-часов)'] = {
        '_--Запекание пищи (нормо-часов)':1,
        }

metadict_model['_-Запекание корнеплодов (нормо-часов)'] = {
        '_--Запекание пищи (нормо-часов)':1,
        }

metadict_model['_-Запекание фруктов (нормо-часов)'] = {
        '_--Запекание пищи (нормо-часов)':1,
        }

metadict_model['_-Запекание орехов (нормо-часов)'] = {
        '_--Запекание пищи (нормо-часов)':1,
        }

#----
# Процессы (выпечка):

metadict_model['_-Выпечка хлеба (нормо-часов)'] = {
        '_--Выпечка пищи (нормо-часов)':1,
        }

metadict_model['_-Выпечка пудинга (нормо-часов)'] = {
        '_--Выпечка пищи (нормо-часов)':1,
        }

metadict_model['_-Выпечка пряников (нормо-часов)'] = {
        '_--Выпечка пищи (нормо-часов)':1,
        }

metadict_model['_-Выпечка печенья (нормо-часов)'] = {
        '_--Выпечка пищи (нормо-часов)':1,
        }

metadict_detail['_-Выпечка блинов (нормо-часов)'] = {
        '_--Выпечка пищи (нормо-часов)':1,
        }

metadict_detail['_-Выпечка булочек (нормо-часов)'] = {
        '_--Выпечка пищи (нормо-часов)':1,
        }

metadict_detail['_-Выпечка кексов (нормо-часов)'] = {
        '_--Выпечка пищи (нормо-часов)':1,
        }

metadict_detail['_-Выпечка лепёшек (нормо-часов)'] = {
        '_--Выпечка пищи (нормо-часов)':1,
        }

metadict_detail['_-Выпечка пирога (нормо-часов)'] = {
        '_--Выпечка пищи (нормо-часов)':1,
        }

metadict_detail['_-Выпечка пирожков (нормо-часов)'] = {
        '_--Выпечка пищи (нормо-часов)':1,
        }

metadict_detail['_-Выпечка суфле (нормо-часов)'] = {
        '_--Выпечка пищи (нормо-часов)':1,
        }

#----
# Процессы (прокаливание, выпечка заранее):

metadict_model['_-Прокаливание крупы (нормо-часов)'] = {
        '_--Прокаливание пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Прокаливание муки (нормо-часов)'] = {
        '_--Прокаливание пищи заранее (нормо-часов)':1,
        }

#----
# Процессы (жарение):

metadict_model['_-Жарение темпе (нормо-часов)'] = {
        '_--Жарение пищи (нормо-часов)':1,
        }

metadict_model['_-Жарение блинов (нормо-часов)'] = {
        '_--Жарение пищи (нормо-часов)':1,
        }

metadict_model['_-Жарение оладий (нормо-часов)'] = {
        '_--Жарение пищи (нормо-часов)':1,
        }

metadict_model['_-Жарение пончиков (нормо-часов)'] = {
        '_--Жарение пищи (нормо-часов)':1,
        }

metadict_detail['_-Жарение выпечки (нормо-часов)'] = {
        '_--Жарение пищи (нормо-часов)':1,
        }

metadict_model['_-Жарение грибов (нормо-часов)'] = {
        '_--Жарение пищи (нормо-часов)':1,
        }

metadict_model['_-Жарение овощей (нормо-часов)'] = {
        '_--Жарение пищи (нормо-часов)':1,
        }

metadict_model['_-Жарение фруктов (нормо-часов)'] = {
        '_--Жарение пищи (нормо-часов)':1,
        }

metadict_model['_-Обжаривание хлеба (нормо-часов)'] = {
        '_--Жарение пищи (нормо-часов)':1,
        }

#----
# Процессы (жарение заранее):

metadict_model['_-Обжаривание бобов (нормо-часов)'] = {
        '_--Жарение пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Обжаривание орехов (нормо-часов)'] = {
        '_--Жарение пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Обжаривание семян (нормо-часов)'] = {
        '_--Жарение пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Обжаривание кофейных зёрен (нормо-часов)'] = {
        '_--Жарение пищи заранее (нормо-часов)':1,
        }

#----
# Процессы (протирание, выдавливание):

metadict_detail['_-Протирание бобов (нормо-часов)'] = {
        '_--Протирание пищи (нормо-часов)':1,
        }

metadict_detail['_-Протирание зелени (нормо-часов)'] = {
        '_--Протирание пищи (нормо-часов)':1,
        }

metadict_detail['_-Протирание овощей (нормо-часов)'] = {
        '_--Протирание пищи (нормо-часов)':1,
        }

metadict_detail['_-Протирание фруктов (нормо-часов)'] = {
        '_--Протирание пищи (нормо-часов)':1,
        }

metadict_detail['_-Выдавливание чеснока (нормо-часов)'] = {                                       
        '_--Протирание пищи (нормо-часов)':1,
        }

#----
# Процессы (протирание, выдавливание заранее):

metadict_detail['_-Процеживание бульона (нормо-часов)'] = {
        '_--Протирание пищи заранее (нормо-часов)':1,
        }

metadict_detail['_-Протирание томатов заранее (нормо-часов)'] = {
        '_--Протирание пищи заранее (нормо-часов)':1,
        }

metadict_detail['_-Протирание семян (нормо-часов)'] = {
        '_--Протирание пищи заранее (нормо-часов)':1,
        }

metadict_detail['_-Протирание орехов (нормо-часов)'] = {
        '_--Протирание пищи заранее (нормо-часов)':1,
        }

metadict_detail['_-Протирание крупы (нормо-часов)'] = {
        '_--Протирание пищи заранее (нормо-часов)':1,
        }

#----
# Процессы (отжим):

metadict_model['_-Отжим овощей (нормо-часов)'] = {
        '_--Отжим пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Отжим фруктов (нормо-часов)'] = {
        '_--Отжим пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Отжим соевого сусла (нормо-часов)'] = {
        '_--Отжим пищи заранее (нормо-часов)':1,
        }

#----
# Процессы (взбивание):

metadict_model['_-Взбивание крема (нормо-часов)'] = {
        '_--Взбивание пищи (нормо-часов)':1,
        }

metadict_model['_-Взбивание аквафабы (нормо-часов)'] = {
        '_--Взбивание пищи (нормо-часов)':1,
        }

#----
# Процессы (панировка, покрытия):

metadict_detail['_-Панировка грибов (нормо-часов)'] = {
        '_--Панировка пищи (нормо-часов)':1,
        }

metadict_detail['_-Панировка запеканки (нормо-часов)'] = {
        '_--Панировка пищи (нормо-часов)':1,
        }

metadict_detail['_-Панировка мелкой выпечки (нормо-часов)'] = {
        '_--Панировка пищи (нормо-часов)':1,
        }

metadict_detail['_-Панировка овощей (нормо-часов)'] = {
        '_--Панировка пищи (нормо-часов)':1,
        }

metadict_detail['_-Панировка овощей в масле (нормо-часов)'] = {
        '_--Панировка пищи (нормо-часов)':1,
        }

metadict_model['_-Натирание хлеба чесноком (нормо-часов)'] = {
        '_--Панировка пищи (нормо-часов)':1,
        }

metadict_detail['_-Смазывание оладьев соусом (нормо-часов)'] = {
        '_--Панировка пищи (нормо-часов)':1,
        }

#----
# Процессы (фаршировка):

metadict_model['_-Приготовление террина (нормо-часов)'] = {
        '_--Фаршировка пищи (нормо-часов)':1,
        }

metadict_model['_-Приготовление сэндвичей (нормо-часов)'] = {
        '_--Фаршировка пищи (нормо-часов)':1,
        }

metadict_detail['_-Фаршировка блинчиков (нормо-часов)'] = {
        '_--Фаршировка пищи (нормо-часов)':1,
        }

metadict_detail['_-Фаршировка булочек (нормо-часов)'] = {
        '_--Фаршировка пищи (нормо-часов)':1,
        }

metadict_detail['_-Фаршировка вареников (нормо-часов)'] = {
        '_--Фаршировка пищи (нормо-часов)':1,
        }

metadict_detail['_-Фаршировка голубцов (нормо-часов)'] = {
        '_--Фаршировка пищи (нормо-часов)':1,
        }

metadict_detail['_-Фаршировка капкейков (нормо-часов)'] = {
        '_--Фаршировка пищи (нормо-часов)':1,
        }

metadict_detail['_-Фаршировка пирожков (нормо-часов)'] = {
        '_--Фаршировка пищи (нормо-часов)':1,
        }

metadict_detail['_-Фаршировка пиццы (нормо-часов)'] = {
        '_--Фаршировка пищи (нормо-часов)':1,
        }

metadict_detail['_-Фаршировка рулета (нормо-часов)'] = {
        '_--Фаршировка пищи (нормо-часов)':1,
        }

metadict_detail['_-Фаршировка средних овощей (нормо-часов)'] = {
        '_--Фаршировка пищи (нормо-часов)':1,
        }

metadict_detail['_-Фаршировка тыквы (нормо-часов)'] = {
        '_--Фаршировка пищи (нормо-часов)':1,
        }

#----
# Процессы (смешивание, вымешивание):

metadict_model['_-Смешивание еды (нормо-часов)'] = {
        '_--Вымешивание пищи (нормо-часов)':1,
        }

metadict_model['_-Смешивание питья (нормо-часов)'] = {
        '_--Вымешивание пищи (нормо-часов)':1,
        }

metadict_model['_-Вымешивание пудинга (нормо-часов)'] = {
        '_--Вымешивание пищи (нормо-часов)':1,
        }

metadict_model['_-Заворачивание пудинга (нормо-часов)'] = {
        '_--Вымешивание пищи (нормо-часов)':1,
        }

metadict_model['_-Обминка теста (нормо-часов)'] = {
        '_--Вымешивание пищи (нормо-часов)':1,
        }

metadict_model['_-Разделка теста (нормо-часов)'] = {
        '_--Вымешивание пищи (нормо-часов)':1,
        }

metadict_model['_-Раскатка теста (нормо-часов)'] = {
        '_--Вымешивание пищи (нормо-часов)':1,
        }

metadict_model['_-Растягивание теста (нормо-часов)'] = {
        '_--Вымешивание пищи (нормо-часов)':1,
        }

metadict_model['_-Формовка теста (нормо-часов)'] = {
        '_--Вымешивание пищи (нормо-часов)':1,
        }

metadict_detail['_-Приготовление желе (нормо-часов)'] = {
        '_--Вымешивание пищи (нормо-часов)':1,
        }

#----
# Процессы (смешивание, вымешивание):

metadict_model['_-Смешивание сиропа (нормо-часов)'] = {
        '_--Вымешивание пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Вымешивание теста (нормо-часов)'] = {
        '_--Вымешивание пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Вымешивание соуса (нормо-часов)'] = {
        '_--Вымешивание пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Вымешивание мёда (нормо-часов)'] = {
        '_--Вымешивание пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Вымешивание пасты (нормо-часов)'] = {
        '_--Вымешивание пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Вымешивание рассола (нормо-часов)'] = {
        '_--Вымешивание пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Вымешивание раствора (нормо-часов)'] = {
        '_--Вымешивание пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Вымешивание соевого сусла (нормо-часов)'] = {
        '_--Вымешивание пищи заранее (нормо-часов)':1,
        }

#----
# Процессы (квашение, мочение):

metadict_model['_-Квашение капусты (нормо-часов)'] = {
        '_--Квашение пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Квашение овощей (нормо-часов)'] = {
        '_--Квашение пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Мочение фруктов (нормо-часов)'] = {
        '_--Квашение пищи заранее (нормо-часов)':1,
        }

#----
# Процессы (дрожжевое брожение):

metadict_model['_-Приготовление кваса (нормо-часов)'] = {
        '_--Брожение пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Приготовление эля (нормо-часов)'] = {
        '_--Брожение пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Приготовление закваски (нормо-часов)'] = {
        '_--Брожение пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Приготовление опары (нормо-часов)'] = {
        '_--Брожение пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Приготовление сидра (нормо-часов)'] = {
        '_--Брожение пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Приготовление вина (нормо-часов)'] = {
        '_--Брожение пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Приготовление соевого соуса (нормо-часов)'] = {
        '_--Брожение пищи заранее (нормо-часов)':1,
        }

metadict_detail['_-Уход за грибковой культурой дрожжей (нормо-часов)'] = {
        '_--Брожение пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Уход за грибковой культурой темпе (нормо-часов)'] = {
        '_--Брожение пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Уход за грибковой культурой коджи (нормо-часов)'] = {
        '_--Брожение пищи заранее (нормо-часов)':1,
        }

#----
# Процессы (маринование):

metadict_model['_-Маринование овощей (нормо-часов)'] = {
        '_--Маринование пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Маринование грибов (нормо-часов)'] = {
        '_--Маринование пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Маринование фруктов (нормо-часов)'] = {
        '_--Маринование пищи заранее (нормо-часов)':1,
        }

#----
# Процессы (соление):

metadict_detail['_-Соление грибов (нормо-часов)'] = {
        '_--Соление пищи заранее (нормо-часов)':1,
        }

metadict_detail['_-Соление овощей (нормо-часов)'] = {
        '_--Соление пищи заранее (нормо-часов)':1,
        }

#----
# Процессы (ферментация):

metadict_model['_-Ферментация стручков ванили (нормо-часов)'] = {
        # Хм, Ферментация зебрами! Я просто не могу удержаться.
        '_--Ферментация пищи зебрами (нормо-часов)':1,
        }

metadict_model['_-Ферментация кофейных зёрен (нормо-часов)'] = {
        '_--Ферментация пищи зебрами (нормо-часов)':1,
        }

metadict_model['_-Ферментация какао-бобов (нормо-часов)'] = {
        '_--Ферментация пищи зебрами (нормо-часов)':1,
        }

#----
# Процессы (проращивание, соложение):

metadict_detail['_-Проращивание бобов (нормо-часов)'] = {
        '_--Проращивание пищи заранее (нормо-часов)':1,
        }

metadict_detail['_-Проращивание зерна (нормо-часов)'] = {
        '_--Проращивание пищи заранее (нормо-часов)':1,
        }

#----
# Процессы (замачивание, регидрация):

metadict_model['_-Замачивание бобов (нормо-часов)'] = {
        '_--Замачивание пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Замачивание орехов (нормо-часов)'] = {
        '_--Замачивание пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Замачивание грибов (нормо-часов)'] = {
        '_--Замачивание пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Замачивание зерна (нормо-часов)'] = {
        '_--Замачивание пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Замачивание овощей (нормо-часов)'] = {
        '_--Замачивание пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Замачивание фруктов (нормо-часов)'] = {
        '_--Замачивание пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Замачивание сладостей (нормо-часов)'] = {
        '_--Замачивание пищи заранее (нормо-часов)':1,
        }

metadict_model['_-Замачивание риса (нормо-часов)'] = {
        '_--Замачивание пищи заранее (нормо-часов)':1,
        }

#----
# Процессы (сушка, дегидрация):

metadict_detail['_-Сушка лапши (нормо-часов)'] = {
        '_--Сушка пищи заранее (нормо-часов)':1,
        }

metadict_detail['_-Сушка овощей (нормо-часов)'] = {
        '_--Сушка пищи заранее (нормо-часов)':1,
        }

metadict_detail['_-Сушка пастилы (нормо-часов)'] = {
        '_--Сушка пищи заранее (нормо-часов)':1,
        }

metadict_detail['_-Сушка сладостей (нормо-часов)'] = {
        '_--Сушка пищи заранее (нормо-часов)':1,
        }

metadict_detail['_-Сушка сухарей (нормо-часов)'] = {
        '_--Сушка пищи заранее (нормо-часов)':1,
        }

metadict_detail['_-Сушка трав (нормо-часов)'] = {
        '_--Сушка пищи заранее (нормо-часов)':1,
        }

metadict_detail['_-Сушка фруктов (нормо-часов)'] = {
        '_--Сушка пищи заранее (нормо-часов)':1,
        }

metadict_detail['_-Сушка ягод (нормо-часов)'] = {
        '_--Сушка пищи заранее (нормо-часов)':1,
        }

metadict_detail['_-Сушка грибов (нормо-часов)'] = {
        '_--Сушка пищи заранее (нормо-часов)':1,
        }

#----
# Процессы (сушка, дегидрация):

metadict_detail['_-Сушка чайных листьев зебрами (нормо-часов)'] = {
        '_--Сушка пищи зебрами (нормо-часов)':1,
        }

metadict_detail['_-Сушка какао-бобов зебрами (нормо-часов)'] = {
        '_--Сушка пищи зебрами (нормо-часов)':1,
        }

metadict_detail['_-Сушка стручков ванили зебрами (нормо-часов)'] = {
        '_--Сушка пищи зебрами (нормо-часов)':1,
        }

metadict_detail['_-Сушка плодов кофейного дерева зебрами (нормо-часов)'] = {
        '_--Сушка пищи зебрами (нормо-часов)':1,
        }

#----
# Процессы (помол):

metadict_detail['_-Помол кофейных зёрен (нормо-часов)'] = {
        '_--Помол пищи заранее (нормо-часов)':1,
        }

metadict_detail['_-Помол пряностей (нормо-часов)'] = {
        '_--Помол пищи заранее (нормо-часов)':1,
        }

metadict_detail['_-Помол сахара-песка (нормо-часов)'] = {
        '_--Помол пищи заранее (нормо-часов)':1,
        }

metadict_detail['_-Помол сухарей (нормо-часов)'] = {
        '_--Помол пищи заранее (нормо-часов)':1,
        }

#----
# Процессы (шинковка):

metadict_detail['_-Шинковка грибов (нормо-часов)'] = {
        '_--Шинковка пищи (нормо-часов)':1,
        }

metadict_detail['_-Шинковка зелени (нормо-часов)'] = {
        '_--Шинковка пищи (нормо-часов)':1,
        }

metadict_detail['_-Шинковка овощей (нормо-часов)'] = {
        '_--Шинковка пищи (нормо-часов)':1,
        }

metadict_detail['_-Шинковка орехов (нормо-часов)'] = {
        '_--Шинковка пищи (нормо-часов)':1,
        }

metadict_detail['_-Шинковка фруктов (нормо-часов)'] = {
        '_--Шинковка пищи (нормо-часов)':1,
        }

#----
# Процессы (нарезка):

metadict_detail['_-Нарезка зелени (нормо-часов)'] = {
        '_--Нарезка пищи (нормо-часов)':1,
        }

metadict_detail['_-Нарезка лапши (нормо-часов)'] = {
        '_--Нарезка пищи (нормо-часов)':1,
        }

metadict_detail['_-Нарезка овощей (нормо-часов)'] = {
        '_--Нарезка пищи (нормо-часов)':1,
        }

metadict_detail['_-Нарезка орехов (нормо-часов)'] = {
        '_--Нарезка пищи (нормо-часов)':1,
        }

metadict_detail['_-Нарезка темпе (нормо-часов)'] = {
        '_--Нарезка пищи (нормо-часов)':1,
        }

metadict_detail['_-Нарезка фруктов (нормо-часов)'] = {
        '_--Нарезка пищи (нормо-часов)':1,
        }

metadict_detail['_-Нарезка хлеба (нормо-часов)'] = {
        '_--Нарезка пищи (нормо-часов)':1,
        }

#----
# Процессы (чистка):

metadict_detail['_-Чистка корнеплодов (нормо-часов)'] = {
        '_--Чистка пищи (нормо-часов)':1,
        }

metadict_detail['_-Чистка овощей (нормо-часов)'] = {
        '_--Чистка пищи (нормо-часов)':1,
        }

metadict_detail['_-Чистка орехов (нормо-часов)'] = {
        '_--Чистка пищи (нормо-часов)':1,
        }

metadict_detail['_-Чистка фруктов (нормо-часов)'] = {
        '_--Чистка пищи (нормо-часов)':1,
        }

#----
# Процессы (мытьё):

metadict_detail['_-Мытьё грибов (нормо-часов)'] = {
        '_--Мытьё пищи (нормо-часов)':1,
        }

metadict_detail['_-Мытьё корнеплодов (нормо-часов)'] = {
        '_--Мытьё пищи (нормо-часов)':1,
        }

metadict_detail['_-Мытьё крупы (нормо-часов)'] = {
        '_--Мытьё пищи (нормо-часов)':1,
        }

metadict_detail['_-Мытьё овощей (нормо-часов)'] = {
        '_--Мытьё пищи (нормо-часов)':1,
        }

metadict_detail['_-Мытьё орехов (нормо-часов)'] = {
        '_--Мытьё пищи (нормо-часов)':1,
        }

metadict_detail['_-Мытьё посуды (нормо-часов)'] = {
        '_--Мытьё пищи (нормо-часов)':1,
        }

metadict_detail['_-Мытьё фруктов (нормо-часов)'] = {
        '_--Мытьё пищи (нормо-часов)':1,
        }

#----
# Процессы (сортировка):

metadict_detail['_-Сортировка корнеплодов (нормо-часов)'] = {
        '_--Сортировка пищи (нормо-часов)':1,
        }

metadict_detail['_-Сортировка овощей (нормо-часов)'] = {
        '_--Сортировка пищи (нормо-часов)':1,
        }

metadict_detail['_-Сортировка орехов (нормо-часов)'] = {
        '_--Сортировка пищи (нормо-часов)':1,
        }

metadict_detail['_-Сортировка фруктов (нормо-часов)'] = {
        '_--Сортировка пищи (нормо-часов)':1,
        }

#----
# Процессы (перебор):

metadict_detail['_-Перебор грибов (нормо-часов)'] = {
        '_--Перебор пищи (нормо-часов)':1,
        }

metadict_detail['_-Перебор овощей (нормо-часов)'] = {
        '_--Перебор пищи (нормо-часов)':1,
        }

metadict_detail['_-Перебор фруктов (нормо-часов)'] = {
        '_--Перебор пищи (нормо-часов)':1,
        }

metadict_detail['_-Перебор ягод (нормо-часов)'] = {
        '_--Перебор пищи (нормо-часов)':1,
        }

#----
# Процессы (перебор):

metadict_detail['_-Перебор бобов (нормо-часов)'] = {
        '_--Перебор пищи заранее (нормо-часов)':1,
        }

metadict_detail['_-Перебор крупы (нормо-часов)'] = {
        '_--Перебор пищи заранее (нормо-часов)':1,
        }

metadict_detail['_-Перебор сухофруктов (нормо-часов)'] = {
        '_--Перебор пищи заранее (нормо-часов)':1,
        }

metadict_detail['_-Перебор трав (нормо-часов)'] = {
        '_--Перебор пищи заранее (нормо-часов)':1,
        }
