#----
# Категории профессиий

metadict_model['_-$Земледелие, бобовые (0.3_бит*нормо-час)'] = {
        '_-$$Земледелие (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Земледелие, грибовод (0.4_бит*нормо-час)'] = {
        '_-$$Земледелие (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Земледелие, зебра (0.1_бит*нормо-час)'] = {
        '_-$$Земледелие (0.1_бит*нормо-час)':1,
        }

metadict_model['_-$Земледелие, зерновые (0.3_бит*нормо-час)'] = {
        '_-$$Земледелие (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Земледелие, лесник (0.4_бит*нормо-час)'] = {
        '_-$$Земледелие (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Земледелие, масличные (0.2_бит*нормо-час)'] = {
        '_-$$Земледелие (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Земледелие, огородник (0.2_бит*нормо-час)'] = {
        '_-$$Земледелие (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Земледелие, пчеловод (0.5_бит*нормо-час)'] = {
        '_-$$Земледелие (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Земледелие, садовод (0.2_бит*нормо-час)'] = {
        '_-$$Земледелие (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Земледелие, технические (0.2_бит*нормо-час)'] = {
        '_-$$Земледелие (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Обслуживание-культура, библиотекарь (0.5_бит*нормо-час)'] = {
        '_-$$Обслуживание-культура (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Обслуживание-медицина, волшебство, 1 круг (2_бит*нормо-час)'] = {
        '_-$$Обслуживание-медицина (2_бит*нормо-час)':1,
        }

metadict_model['_-$Обслуживание-медицина, врач, больница (1_бит*нормо-час)'] = {
        '_-$$Обслуживание-медицина (1_бит*нормо-час)':1,
        }

metadict_model['_-$Обслуживание-медицина, врач, поликлиника (1_бит*нормо-час)'] = {
        '_-$$Обслуживание-медицина (1_бит*нормо-час)':1,
        }

metadict_model['_-$Обслуживание-медицина, фельдшер, больница (0.5_бит*нормо-час)'] = {
        '_-$$Обслуживание-медицина (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Обслуживание-медицина, фельдшер, поликлиника (0.5_бит*нормо-час)'] = {
        '_-$$Обслуживание-медицина (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Обслуживание-медицина, фельдшер, скорая помощь (0.5_бит*нормо-час)'] = {
        '_-$$Обслуживание-медицина (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Обслуживание-медицина, фельдшер, скорая помощь, пегас (0.5_бит*нормо-час)'] = {
        '_-$$Обслуживание-медицина (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Обслуживание-образование, учитель, начальная школа (0.5_бит*нормо-час)'] = {
        '_-$$Обслуживание-образование (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Обслуживание-образование, учитель, средняя школа (0.5_бит*нормо-час)'] = {
        '_-$$Обслуживание-образование (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Обслуживание-образование, учитель, старшая школа (0.5_бит*нормо-час)'] = {
        '_-$$Обслуживание-образование (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Обслуживание-образование, учитель, университет (1_бит*нормо-час)'] = {
        '_-$$Обслуживание-образование (1_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-добыча, волшебство, 0 круг (2_бит*нормо-час)'] = {
        '_-$$Промышленность-добыча (2_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-добыча, рабочий, лесоруб (0.3_бит*нормо-час)'] = {
        '_-$$Промышленность-добыча (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-добыча, рабочий, сапёр (2_бит*нормо-час)'] = {
        '_-$$Промышленность-добыча (2_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-добыча, рабочий, шахтёр (0.5_бит*нормо-час)'] = {
        '_-$$Промышленность-добыча (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-кустари, рабочий, портной (1_бит*нормо-час)'] = {
        '_-$$Промышленность-кустари (1_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-кустари, рабочий, сапожник (1_бит*нормо-час)'] = {
        '_-$$Промышленность-кустари (1_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-кустари, рабочий, ткач (0.2_бит*нормо-час)'] = {
        '_-$$Промышленность-кустари (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-кустари, рабочий, швец (0.5_бит*нормо-час)'] = {
        '_-$$Промышленность-кустари (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, землекоп, глина (0.2_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, дёготь (0.4_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, известь (0.4_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, кафель (0.5_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, кирпич (0.3_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, кирпич саманный (0.2_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, кирпич саманный (0.3_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, красильщик (0.3_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, красильщик (0.4_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, лесопилка (0.4_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, маслозавод (0.4_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, мыловар (0.4_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, опилкобетон (0.3_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, паркет (0.4_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, пивоварня (0.4_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, прядильщик (0.3_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, прядильщик (0.4_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, солевар (0.5_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, солод (0.4_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, типография (0.5_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, типография (1_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (1_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, ткач (0.5_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, хлебозавод (0.4_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, цемент (0.4_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Промышленность-фабрики, рабочий, шахтёр, щебень (0.4_бит*нормо-час)'] = {
        '_-$$Промышленность-фабрики (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Собирательство, валежник (0.1_бит*нормо-час)'] = {
        '_-$$Собирательство (0.1_бит*нормо-час)':1,
        }

metadict_model['_-$Собирательство, водоросли (0.3_бит*нормо-час)'] = {
        '_-$$Собирательство (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Собирательство, дикорастущие грибы (0.1_бит*нормо-час)'] = {
        '_-$$Собирательство (0.1_бит*нормо-час)':1,
        }

metadict_model['_-$Собирательство, дикорастущие орехи (0.1_бит*нормо-час)'] = {
        '_-$$Собирательство (0.1_бит*нормо-час)':1,
        }

metadict_model['_-$Собирательство, дикорастущие растения (0.1_бит*нормо-час)'] = {
        '_-$$Собирательство (0.1_бит*нормо-час)':1,
        }

metadict_model['_-$Собирательство, дикорастущие ягоды (0.1_бит*нормо-час)'] = {
        '_-$$Собирательство (0.1_бит*нормо-час)':1,
        }

metadict_model['_-$Собирательство, зебры, дикорастущие растения (0.1_бит*нормо-час)'] = {
        '_-$$Собирательство (0.1_бит*нормо-час)':1,
        }

metadict_model['_-$Собирательство, кленовый сок (0.1_бит*нормо-час)'] = {
        '_-$$Собирательство (0.1_бит*нормо-час)':1,
        }

metadict_model['_-$Строительство, волшебство, 0 круг (2_бит*нормо-час)'] = {
        '_-$$Строительство (2_бит*нормо-час)':1,
        }

metadict_model['_-$Строительство, железнодорожный монтёр (0.3_бит*нормо-час)'] = {
        '_-$$Строительство (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Строительство, землекоп (0.1_бит*нормо-час)'] = {
        '_-$$Строительство (0.1_бит*нормо-час)':1,
        }

metadict_model['_-$Строительство, каменщик (0.3_бит*нормо-час)'] = {
        '_-$$Строительство (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Строительство, каменщик, печник (0.5_бит*нормо-час)'] = {
        '_-$$Строительство (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Строительство, кровельщик (0.2_бит*нормо-час)'] = {
        '_-$$Строительство (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Строительство, маляр (0.3_бит*нормо-час)'] = {
        '_-$$Строительство (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Строительство, плотник (0.2_бит*нормо-час)'] = {
        '_-$$Строительство (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Строительство, плотник (0.3_бит*нормо-час)'] = {
        '_-$$Строительство (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Строительство, разнорабочий (0.2_бит*нормо-час)'] = {
        '_-$$Строительство (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Строительство, разнорабочий-пегас (0.2_бит*нормо-час)'] = {
        '_-$$Строительство (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Строительство, штукатур (0.3_бит*нормо-час)'] = {
        '_-$$Строительство (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, водовоз (0.1_бит*нормо-час)'] = {
        '_-$$Транспорт (0.1_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, водовоз-пегас (0.2_бит*нормо-час)'] = {
        '_-$$Транспорт (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, водопроводчик (0.4_бит*нормо-час)'] = {
        '_-$$Транспорт (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, возничий-зебра (0.1_бит*нормо-час)'] = {
        '_-$$Транспорт (0.1_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, возничий-пегас (0.2_бит*нормо-час)'] = {
        '_-$$Транспорт (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, грузчик (0.2_бит*нормо-час)'] = {
        '_-$$Транспорт (0.2_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, грузчик-зебра (0.1_бит*нормо-час)'] = {
        '_-$$Транспорт (0.1_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, железнодорожник (0.4_бит*нормо-час)'] = {
        '_-$$Транспорт (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, железнодорожник-пегас (0.3_бит*нормо-час)'] = {
        '_-$$Транспорт (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, лётчик-пегас (0.5_бит*нормо-час)'] = {
        '_-$$Транспорт (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, лётчик-пегас (1_бит*нормо-час)'] = {
        '_-$$Транспорт (1_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, моряк (0.3_бит*нормо-час)'] = {
        '_-$$Транспорт (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, моряк (1_бит*нормо-час)'] = {
        '_-$$Транспорт (1_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, моряк (4_бит*нормо-час)'] = {
        '_-$$Транспорт (4_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, моряк-пегас (0.3_бит*нормо-час)'] = {
        '_-$$Транспорт (0.3_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, почтальон-пегас (0.4_бит*нормо-час)'] = {
        '_-$$Транспорт (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, почтовый служащий (0.5_бит*нормо-час)'] = {
        '_-$$Транспорт (0.5_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, путевой смотритель (0.4_бит*нормо-час)'] = {
        '_-$$Транспорт (0.4_бит*нормо-час)':1,
        }

metadict_model['_-$Транспорт, таксист-пегас (0.5_бит*нормо-час)'] = {
        '_-$$Транспорт (0.5_бит*нормо-час)':1,
        }

#----
# Почасовой оклад

metadict_model['_-$$Земледелие (0.1_бит*нормо-час)'] = {
        '_-$$$Земледелие (бит*нормо-час)':0.1,
        }

metadict_model['_-$$Земледелие (0.2_бит*нормо-час)'] = {
        '_-$$$Земледелие (бит*нормо-час)':0.2,
        }

metadict_model['_-$$Земледелие (0.3_бит*нормо-час)'] = {
        '_-$$$Земледелие (бит*нормо-час)':0.3,
        }

metadict_model['_-$$Земледелие (0.4_бит*нормо-час)'] = {
        '_-$$$Земледелие (бит*нормо-час)':0.4,
        }

metadict_model['_-$$Земледелие (0.5_бит*нормо-час)'] = {
        '_-$$$Земледелие (бит*нормо-час)':0.5,
        }

metadict_model['_-$$Обслуживание-культура (0.5_бит*нормо-час)'] = {
        '_-$$$Обслуживание-культура (бит*нормо-час)':0.5,
        }

metadict_model['_-$$Обслуживание-медицина (0.5_бит*нормо-час)'] = {
        '_-$$$Обслуживание-медицина (бит*нормо-час)':0.5,
        }

metadict_model['_-$$Обслуживание-медицина (1_бит*нормо-час)'] = {
        '_-$$$Обслуживание-медицина (бит*нормо-час)':1,
        }

metadict_model['_-$$Обслуживание-медицина (2_бит*нормо-час)'] = {
        '_-$$$Обслуживание-медицина (бит*нормо-час)':2,
        }

metadict_model['_-$$Обслуживание-образование (0.5_бит*нормо-час)'] = {
        '_-$$$Обслуживание-образование (бит*нормо-час)':0.5,
        }

metadict_model['_-$$Обслуживание-образование (1_бит*нормо-час)'] = {
        '_-$$$Обслуживание-образование (бит*нормо-час)':1,
        }

metadict_model['_-$$Промышленность-добыча (0.3_бит*нормо-час)'] = {
        '_-$$$Промышленность-добыча (бит*нормо-час)':0.3,
        }

metadict_model['_-$$Промышленность-добыча (0.5_бит*нормо-час)'] = {
        '_-$$$Промышленность-добыча (бит*нормо-час)':0.5,
        }

metadict_model['_-$$Промышленность-добыча (2_бит*нормо-час)'] = {
        '_-$$$Промышленность-добыча (бит*нормо-час)':2,
        }

metadict_model['_-$$Промышленность-кустари (0.2_бит*нормо-час)'] = {
        '_-$$$Промышленность-кустари (бит*нормо-час)':0.2,
        }

metadict_model['_-$$Промышленность-кустари (0.5_бит*нормо-час)'] = {
        '_-$$$Промышленность-кустари (бит*нормо-час)':0.5,
        }

metadict_model['_-$$Промышленность-кустари (1_бит*нормо-час)'] = {
        '_-$$$Промышленность-кустари (бит*нормо-час)':1,
        }

metadict_model['_-$$Промышленность-фабрики (0.2_бит*нормо-час)'] = {
        '_-$$$Промышленность-фабрики (бит*нормо-час)':0.2,
        }

metadict_model['_-$$Промышленность-фабрики (0.3_бит*нормо-час)'] = {
        '_-$$$Промышленность-фабрики (бит*нормо-час)':0.3,
        }

metadict_model['_-$$Промышленность-фабрики (0.4_бит*нормо-час)'] = {
        '_-$$$Промышленность-фабрики (бит*нормо-час)':0.4,
        }

metadict_model['_-$$Промышленность-фабрики (0.5_бит*нормо-час)'] = {
        '_-$$$Промышленность-фабрики (бит*нормо-час)':0.5,
        }

metadict_model['_-$$Промышленность-фабрики (1_бит*нормо-час)'] = {
        '_-$$$Промышленность-фабрики (бит*нормо-час)':1,
        }

metadict_model['_-$$Собирательство (0.1_бит*нормо-час)'] = {
        '_-$$$Собирательство (бит*нормо-час)':0.1,
        }

metadict_model['_-$$Собирательство (0.3_бит*нормо-час)'] = {
        '_-$$$Собирательство (бит*нормо-час)':0.3,
        }

metadict_model['_-$$Строительство (0.1_бит*нормо-час)'] = {
        '_-$$$Строительство (бит*нормо-час)':0.1,
        }

metadict_model['_-$$Строительство (0.2_бит*нормо-час)'] = {
        '_-$$$Строительство (бит*нормо-час)':0.2,
        }

metadict_model['_-$$Строительство (0.3_бит*нормо-час)'] = {
        '_-$$$Строительство (бит*нормо-час)':0.3,
        }

metadict_model['_-$$Строительство (0.5_бит*нормо-час)'] = {
        '_-$$$Строительство (бит*нормо-час)':0.5,
        }

metadict_model['_-$$Строительство (2_бит*нормо-час)'] = {
        '_-$$$Строительство (бит*нормо-час)':2,
        }

metadict_model['_-$$Транспорт (0.1_бит*нормо-час)'] = {
        '_-$$$Транспорт (бит*нормо-час)':0.1,
        }

metadict_model['_-$$Транспорт (0.2_бит*нормо-час)'] = {
        '_-$$$Транспорт (бит*нормо-час)':0.2,
        }

metadict_model['_-$$Транспорт (0.3_бит*нормо-час)'] = {
        '_-$$$Транспорт (бит*нормо-час)':0.3,
        }

metadict_model['_-$$Транспорт (0.4_бит*нормо-час)'] = {
        '_-$$$Транспорт (бит*нормо-час)':0.4,
        }

metadict_model['_-$$Транспорт (0.5_бит*нормо-час)'] = {
        '_-$$$Транспорт (бит*нормо-час)':0.5,
        }

metadict_model['_-$$Транспорт (1_бит*нормо-час)'] = {
        '_-$$$Транспорт (бит*нормо-час)':1,
        }

metadict_model['_-$$Транспорт (4_бит*нормо-час)'] = {
        '_-$$$Транспорт (бит*нормо-час)':4,
        }

#----
# Доходы суммарно.

metadict_model['_-$$$Земледелие (бит*нормо-час)'] = {
        '-|$ Продукция, стоимость (бит)':1,
        }

metadict_model['_-$$$Обслуживание-культура (бит*нормо-час)'] = {
        '-|$ Продукция, стоимость (бит)':1,
        }

metadict_model['_-$$$Обслуживание-медицина (бит*нормо-час)'] = {
        '-|$ Продукция, стоимость (бит)':1,
        }

metadict_model['_-$$$Обслуживание-образование (бит*нормо-час)'] = {
        '-|$ Продукция, стоимость (бит)':1,
        }

metadict_model['_-$$$Промышленность-добыча (бит*нормо-час)'] = {
        '-|$ Продукция, стоимость (бит)':1,
        }

metadict_model['_-$$$Промышленность-кустари (бит*нормо-час)'] = {
        '-|$ Продукция, стоимость (бит)':1,
        }

metadict_model['_-$$$Промышленность-фабрики (бит*нормо-час)'] = {
        '-|$ Продукция, стоимость (бит)':1,
        }

metadict_model['_-$$$Собирательство (бит*нормо-час)'] = {
        '-|$ Продукция, стоимость (бит)':1,
        }

metadict_model['_-$$$Строительство (бит*нормо-час)'] = {
        '-|$ Продукция, стоимость (бит)':1,
        }

metadict_model['_-$$$Транспорт (бит*нормо-час)'] = {
        '-|$ Продукция, стоимость (бит)':1,
        }
