#----
# Городской рацион:
    # Жизненный уровень рабочих России (конец XIX - начало XX в.)
    # http://istmat.info/node/52

#----
# Городской рацион:

metadict_detail['Городской рацион (пони/год)'] = {
        'Городской весенний рацион (пони/день)':90,
        'Городской летний рацион (пони/день)':90,
        'Городской осенний рацион (пони/день)':90,
        'Городской зимний рацион (пони/день)':90,
        }

#----
# Городской рацион (времена года):

metadict_detail['Городской весенний рацион (пони/день)'] = {
        # В эквестрийской неделе -- 6 дней
        'Городской весенний повседневный рацион (пони/день)':5 / 6,
        'Городской весенний праздничный рацион (пони/день)':1 / 6,
        }

metadict_detail['Городской летний рацион (пони/день)'] = {
        'Городской летний повседневный рацион (пони/день)':5 / 6,
        'Городской летний праздничный рацион (пони/день)':1 / 6,
        }

metadict_detail['Городской зимний рацион (пони/день)'] = {
        'Городской зимний повседневный рацион (пони/день)':5 / 6,
        'Городской зимний праздничный рацион (пони/день)':1 / 6,
        }

metadict_detail['Городской осенний рацион (пони/день)'] = {
        'Городской осенний повседневный рацион (пони/день)':5 / 6,
        'Городской осенний праздничный рацион (пони/день)':1 / 6,
        }

#----
# Городской рацион (дни недели):

metadict_detail['Городской весенний повседневный рацион (пони/день)'] = {
        'Городской весенний повседневный завтрак':1,
        'Городской весенний повседневный обед':1,
        'Городской весенний повседневный ужин':1,
        'Городское весеннее повседневное питьё v1':3 / 3,
        'Городское весеннее повседневное питьё v2':3 / 3,
        'Городское весеннее повседневное питьё v3':3 / 3,
        }

metadict_detail['Городской весенний праздничный рацион (пони/день)'] = {
        'Городской весенний праздничный завтрак':1,
        'Городской весенний праздничный обед':1,
        'Городской весенний праздничный ужин':1,
        'Городское весеннее праздничное питьё v1':3 / 3,
        'Городское весеннее праздничное питьё v2':3 / 3,
        'Городское весеннее праздничное питьё v3':3 / 3,
        }

metadict_detail['Городской зимний повседневный рацион (пони/день)'] = {
        'Городской зимний повседневный завтрак':1,
        'Городской зимний повседневный обед':1,
        'Городской зимний повседневный ужин':1,
        'Городское зимнее повседневное питьё v1':3 / 3,
        'Городское зимнее повседневное питьё v2':3 / 3,
        'Городское зимнее повседневное питьё v3':3 / 3,
        }

metadict_detail['Городской зимний праздничный рацион (пони/день)'] = {
        'Городской зимний праздничный завтрак':1,
        'Городской зимний праздничный обед':1,
        'Городской зимний праздничный ужин':1,
        'Городское зимнее праздничное питьё v1':3 / 3,
        'Городское зимнее праздничное питьё v2':3 / 3,
        'Городское зимнее праздничное питьё v3':3 / 3,
        }

metadict_detail['Городской летний повседневный рацион (пони/день)'] = {
        'Городской летний повседневный завтрак':1,
        'Городской летний повседневный обед':1,
        'Городской летний повседневный ужин':1,
        'Городское летнее повседневное питьё v1':3 / 3,
        'Городское летнее повседневное питьё v2':3 / 3,
        'Городское летнее повседневное питьё v3':3 / 3,
        }

metadict_detail['Городской летний праздничный рацион (пони/день)'] = {
        'Городской летний праздничный завтрак':1,
        'Городской летний праздничный обед':1,
        'Городской летний праздничный ужин':1,
        'Городское летнее праздничное питьё v1':3 / 3,
        'Городское летнее праздничное питьё v2':3 / 3,
        'Городское летнее праздничное питьё v3':3 / 3,
        }

metadict_detail['Городской осенний повседневный рацион (пони/день)'] = {
        'Городской осенний повседневный завтрак':1,
        'Городской осенний повседневный обед':1,
        'Городской осенний повседневный ужин':1,
        'Городское осеннее повседневное питьё v1':3 / 3,
        'Городское осеннее повседневное питьё v2':3 / 3,
        'Городское осеннее повседневное питьё v3':3 / 3,
        }

metadict_detail['Городской осенний праздничный рацион (пони/день)'] = {
        'Городской осенний праздничный завтрак':1,
        'Городской осенний праздничный обед':1,
        'Городской осенний праздничный ужин':1,
        'Городское осеннее праздничное питьё v1':3 / 3,
        'Городское осеннее праздничное питьё v2':3 / 3,
        'Городское осеннее праздничное питьё v3':3 / 3,
        }

#----
# Городской рацион (весна):
    # Март, апрель, май

metadict_detail['Городской весенний повседневный завтрак'] = {
        # Исправить
            # Ничем не отличается от среднеземного.
        'Сэндвич с арахисовой пастой (грамм)':50 * 2,
        'Фасоль тушёная (грамм)':250,
        'Картофель тушёный со спаржей (грамм)':250,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (250-грамм/порция)':1 * 2,
        }

metadict_detail['Городской весенний повседневный обед'] = {
        'Хлеб кукурузный домашний (грамм)':50 * 2,
        'Похлёбка фасолевая (грамм)':250,
        'Лапша с песто и шампиньонами (грамм)':250,
        'Салат из варёной спаржи (грамм)':125,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо первое горячее (250-грамм/порция)':1,
        '||Блюдо второе горячее (250-грамм/порция)':1,
        '||Блюдо второе холодное (125-грамм/порция)':1,
        }

metadict_detail['Городской весенний повседневный ужин'] = {
        'Хлеб кукурузный домашний (грамм)':50 * 2,
        'Каша овсяная с кленовым сиропом (грамм)':250,
        'Морковь тушёная (грамм)':250,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (250-грамм/порция)':1,
        '||Блюдо второе холодное (250-грамм/порция)':1,
        }

metadict_detail['Городское весеннее повседневное питьё v1'] = {
        'Чай чёрный (грамм)':250 * 2,
        'Маффины с сухофруктами (грамм)':50 * 2,
        '||Питьё горячее (250-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':2,
        }

metadict_detail['Городское весеннее повседневное питьё v2'] = {
        'Чай травяной с кленовым сиропом (грамм)':250 * 2,
        'Маффины с джемом из ревеня (грамм)':50,
        '||Питьё горячее (250-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':1,
        }

metadict_detail['Городское весеннее повседневное питьё v3'] = {
        'Сидр яблочный (грамм)':250,
        '||Питьё холодное (250-грамм/порция)':1,
        }

metadict_detail['Городской весенний праздничный завтрак'] = {
        'Сэндвич с пекановой пастой (грамм)':50 * 2,
        'Рис варёный с кукурузой (грамм)':250,
        'Сморчки тушёные (грамм)':250,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (250-грамм/порция)':1 * 2,
        }

metadict_detail['Городской весенний праздничный обед'] = {
        'Пицца с шампиньонами (грамм)':50 * 2,
        'Суп-пюре свекольный с кремом (грамм)':250,
        'Корень сельдерея жареный в масле (грамм)':250,
        'Лечо со сладким перцем консервированное (грамм)':250,
        '||Выпечка (50-грамм/порция)':2,
        '||Блюдо первое горячее (250-грамм/порция)':1,
        '||Блюдо второе горячее (250-грамм/порция)':1,
        '||Блюдо второе холодное (250-грамм/порция)':1,
        }

metadict_detail['Городской весенний праздничный ужин'] = {
        'Оладьи кукурузные с кленовым сиропом (грамм)':50 * 2,
        'Пюре картофельное (грамм)':250,
        'Одуванчики обжаренные (грамм)':125,
        '||Выпечка жареная (50-грамм/порция)':2,
        '||Блюдо второе горячее (250-грамм/порция)':1,
        '||Блюдо второе горячее (125-грамм/порция)':1,
        }

metadict_detail['Городское весеннее праздничное питьё v1'] = {
        'Чай одуванчиковый (грамм)':250 * 2,
        'Пирог открытый кленовый (грамм)':50 * 2,
        '||Питьё горячее (250-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':2,
        }

metadict_detail['Городское весеннее праздничное питьё v2'] = {
        'Компот из сухофруктов (грамм)':250 * 2,
        '||Питьё холодное (250-грамм/порция)':2,
        }

metadict_detail['Городское весеннее праздничное питьё v3'] = {
        'Вино белое сухое (грамм)':250,
        'Пончики с глазурью (грамм)':50,
        '||Питьё холодное (250-грамм/порция)':1,
        '||Выпечка (50-грамм/порция)':1,
        }

#----
# Городской рацион (лето):
    # Июнь, июль, август

metadict_detail['Городской летний повседневный завтрак'] = {
        'Сэндвич с арахисовой пастой (грамм)':50 * 2,
        'Рис варёный с фасолью (грамм)':250,
        'Картофель печёный с розмарином (грамм)':250,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (250-грамм/порция)':1 * 2,
        }

metadict_detail['Городской летний повседневный обед'] = {
        'Хлеб кукурузный домашний (грамм)':50 * 2,
        'Похлёбка томатная с чечевицей (грамм)':250,
        'Лапша с песто и овощами (грамм)':250,
        'Салат из брокколи (грамм)':125,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо первое горячее (250-грамм/порция)':1,
        '||Блюдо второе горячее (250-грамм/порция)':1,
        '||Блюдо второе холодное (125-грамм/порция)':1,
        }

metadict_detail['Городской летний повседневный ужин'] = {
        # Исправить
            # Полента сама по себе скучна.
        'Хлеб пшеничный домашний (грамм)':50 * 2,
        'Каша кукурузно-мучная (грамм)':250,
        'Среднеземные летние фрукты (грамм)':250,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (250-грамм/порция)':1,
        '||Фрукты свежие (250-грамм/порция)':1,
        }

metadict_detail['Городское летнее повседневное питьё v1'] = {
        'Чай чёрный (грамм)':250 * 2,
        'Маффины вишнёвые (грамм)':50 * 2,
        '||Питьё горячее (250-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':2,
        }

metadict_detail['Городское летнее повседневное питьё v2'] = {
        'Чай травяной с кленовым сиропом (грамм)':250 * 2,
        'Шарлотка земляничная (грамм)':50,
        '||Питьё горячее (250-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':1,
        }

metadict_detail['Городское летнее повседневное питьё v3'] = {
        'Вино красное сухое (грамм)':250,
        '||Питьё холодное (250-грамм/порция)':1,
        }

metadict_detail['Городской летний праздничный завтрак'] = {
        'Сэндвич с пекановой пастой (грамм)':50 * 2,
        'Рис варёный с боровиками (грамм)':250,
        'Артишоки обжаренные (грамм)':250,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (250-грамм/порция)':1 * 2,
        }

metadict_detail['Городской летний праздничный обед'] = {
        'Пицца с брокколи (грамм)':50 * 2,
        'Суп-пюре картофельный с гренками (грамм)':250,
        'Лапша с белыми грибами (грамм)':250,
        'Рагу овощное (грамм)':250,
        '||Выпечка (50-грамм/порция)':2,
        '||Блюдо первое горячее (250-грамм/порция)':1,
        '||Блюдо второе горячее (250-грамм/порция)':1 * 2,
        }

metadict_detail['Городской летний праздничный ужин'] = {
        'Оладьи кукурузные с кленовым сиропом (грамм)':50 * 2,
        'Пюре картофельное (грамм)':250,
        'Брокколи обжаренные (грамм)':125,
        '||Выпечка жареная (50-грамм/порция)':2,
        '||Блюдо второе горячее (250-грамм/порция)':1,
        '||Блюдо второе горячее (125-грамм/порция)':1,
        }

metadict_detail['Городское летнее праздничное питьё v1'] = {
        'Чай травяной с кленовым сиропом (грамм)':250 * 2,
        'Пирог открытый вишнёвый (грамм)':50 * 2,
        '||Питьё горячее (250-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':2,
        }

metadict_detail['Городское летнее праздничное питьё v2'] = {
        'Компот из свежего ревеня (грамм)':250 * 2,
        '||Питьё холодное (250-грамм/порция)':2,
        }

metadict_detail['Городское летнее праздничное питьё v3'] = {
        'Эль имбирный (грамм)':250,
        'Пончики с глазурью (грамм)':50,
        '||Питьё холодное (250-грамм/порция)':1,
        '||Выпечка (50-грамм/порция)':1,
        }


#----
# Городской рацион (осень):
    # Сентябрь, октябрь, ноябрь

metadict_detail['Городской осенний повседневный завтрак'] = {
        'Сэндвич с арахисовой пастой (грамм)':50 * 2,
        'Суп из сезонных овощей с фасолью (грамм)':250,
        'Картофель тушёный с горошком и пряностями (грамм)':250,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо первое горячее (250-грамм/порция)':1,
        '||Блюдо второе горячее (250-грамм/порция)':1,
        }

metadict_detail['Городской осенний повседневный обед'] = {
        'Хлеб кукурузный домашний (грамм)':50 * 2,
        'Похлёбка фасолево-кукурузная с пастернаком (грамм)':250,
        'Лапша с песто и овощами (грамм)':250,
        'Салат из варёной свёклы (грамм)':125,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо первое горячее (250-грамм/порция)':1,
        '||Блюдо второе горячее (250-грамм/порция)':1,
        '||Блюдо второе холодное (125-грамм/порция)':1,
        }

metadict_detail['Городской осенний повседневный ужин'] = {
        'Хлеб кукурузный домашний (грамм)':50 * 2,
        'Каша овсяная с мёдом (грамм)':250,
        'Среднеземные осенние фрукты (грамм)':250,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (250-грамм/порция)':1,
        '||Фрукты свежие (250-грамм/порция)':1,
        }

metadict_detail['Городское осеннее повседневное питьё v1'] = {
        'Чай чёрный (грамм)':250 * 2,
        'Маффины тыквенные (грамм)':50 * 2,
        '||Питьё горячее (250-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':2,
        }

metadict_detail['Городское осеннее повседневное питьё v2'] = {
        'Чай травяной с мёдом (грамм)':250 * 2,
        'Шарлотка яблочная (грамм)':50,
        '||Питьё горячее (250-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':1,
        }

metadict_detail['Городское осеннее повседневное питьё v3'] = {
        'Сок яблочный (грамм)':250 * 2,
        '||Питьё холодное (250-грамм/порция)':2,
        }

metadict_detail['Городской осенний праздничный завтрак'] = {
        'Сэндвич с пекановой пастой (грамм)':50 * 2,
        'Рис варёный с овощами (грамм)':250,
        'Шампиньоны тушёные (грамм)':250,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (250-грамм/порция)':1 * 2,
        }

metadict_detail['Городской осенний праздничный обед'] = {
        # Исправить
            # Фалафель оставь южанам
        'Пицца с артишоками (грамм)':50 * 2,
        'Суп-пюре из корня сельдерея (грамм)':250,
        'Баклажан обжаренный с томатами (грамм)':250,
        'Шарики фасолевые в панировке (грамм)':25 * 5,
        '||Выпечка (50-грамм/порция)':2,
        '||Блюдо первое горячее (250-грамм/порция)':1,
        '||Блюдо второе горячее (250-грамм/порция)':1,
        '||Выпечка жареная (25-грамм/порция)':5,
        }

metadict_detail['Городской осенний праздничный ужин'] = {
        'Оладьи кукурузные с яблочным сиропом (грамм)':50 * 2,
        'Пюре картофельное (грамм)':250,
        'Морковь в медовой глазури (грамм)':125,
        '||Выпечка жареная (50-грамм/порция)':2,
        '||Блюдо второе горячее (250-грамм/порция)':1,
        '||Блюдо второе горячее (125-грамм/порция)':1,
        }

metadict_detail['Городское осеннее праздничное питьё v1'] = {
        'Чай травяной с мёдом (грамм)':250 * 2,
        'Пирог открытый лимонный (грамм)':50 * 2,
        '||Питьё горячее (250-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':2,
        }

metadict_detail['Городское осеннее праздничное питьё v2'] = {
        'Компот из свежей вишни (грамм)':250 * 2,
        '||Питьё холодное (250-грамм/порция)':2,
        }

metadict_detail['Городское осеннее праздничное питьё v3'] = {
        'Вино белое сухое (грамм)':250,
        'Пирог открытый пекановый (грамм)':50,
        '||Питьё холодное (250-грамм/порция)':1,
        '||Выпечка (50-грамм/порция)':1,
        }

#----
# Городской рацион (зима):
    # Декабрь, январь, февраль

metadict_detail['Городской зимний повседневный завтрак'] = {
        'Сэндвич с арахисовой пастой (грамм)':50 * 2,
        'Рис варёный со свекольным кремом (грамм)':250,
        'Картофель тушёный с оливками и лимоном (грамм)':250,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (250-грамм/порция)':1 * 2,
        }

metadict_detail['Городской зимний повседневный обед'] = {
        'Хлеб кукурузный домашний (грамм)':50 * 2,
        'Похлёбка чечевичная (грамм)':250,
        'Лапша с баклажанным соусом (грамм)':250,
        'Капуста тушёная (грамм)':125,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо первое горячее (250-грамм/порция)':1,
        '||Блюдо второе горячее (250-грамм/порция)':1,
        '||Блюдо второе горячее (125-грамм/порция)':1,
        }

metadict_detail['Городской зимний повседневный ужин'] = {
        'Хлеб пшеничный домашний (грамм)':50 * 2,
        'Каша кукурузно-мучная (грамм)':250,
        'Тыква тушёная (грамм)':250,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (250-грамм/порция)':1,
        '||Блюдо второе холодное (250-грамм/порция)':1,
        }

metadict_detail['Городское зимнее повседневное питьё v1'] = {
        'Чай чёрный (грамм)':250 * 2,
        'Маффины морковные (грамм)':50 * 2,
        '||Питьё горячее (250-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':2,
        }

metadict_detail['Городское зимнее повседневное питьё v2'] = {
        'Чай травяной с мёдом (грамм)':250 * 2,
        'Маффины с яблочным джемом (грамм)':50,
        '||Питьё горячее (250-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':1,
        }

metadict_detail['Городское зимнее повседневное питьё v3'] = {
        'Сидр грушевый (грамм)':250,
        '||Питьё холодное (250-грамм/порция)':1,
        }

metadict_detail['Городской зимний праздничный завтрак'] = {
        'Сэндвич с пекановой пастой (грамм)':50 * 2,
        'Рис варёный с тыквой и кукурузой (грамм)':250,
        'Салат из консервированных кабачков (грамм)':250,
        '||Хлеб (50-грамм/порция)':2,
        '||Блюдо второе горячее (250-грамм/порция)':1,
        '||Блюдо второе холодное (250-грамм/порция)':1,
        }

metadict_detail['Городской зимний праздничный обед'] = {
        'Пицца с кабачками (грамм)':50 * 2,
        'Суп-пюре картофельный с шампиньонами (грамм)':250,
        'Террин овощной (грамм)':250,
        'Шарики чечевичные в панировке (грамм)':25 * 5,
        '||Выпечка (50-грамм/порция)':2,
        '||Блюдо первое горячее (250-грамм/порция)':1,
        '||Блюдо второе горячее (250-грамм/порция)':1,
        '||Выпечка жареная (25-грамм/порция)':5,
        }

metadict_detail['Городской зимний праздничный ужин'] = {
        'Оладьи кукурузные с мёдом (грамм)':50 * 2,
        'Пюре картофельное (грамм)':250,
        'Капуста обжаренная в сухарях (грамм)':125,
        '||Выпечка жареная (50-грамм/порция)':2,
        '||Блюдо второе горячее (250-грамм/порция)':1,
        '||Блюдо второе горячее (125-грамм/порция)':1,
        }

metadict_detail['Городское зимнее праздничное питьё v1'] = {
        'Чай травяной с мёдом (грамм)':250 * 2,
        'Пирог открытый тыквенный (грамм)':50 * 2,
        '||Питьё горячее (250-грамм/порция)':2,
        '||Выпечка (50-грамм/порция)':2,
        }

metadict_detail['Городское зимнее праздничное питьё v2'] = {
        'Компот из сухофруктов (грамм)':250 * 2,
        '||Питьё холодное (250-грамм/порция)':2,
        }

metadict_detail['Городское зимнее праздничное питьё v3'] = {
        'Эль имбирный (грамм)':250,
        'Пирог открытый пекановый (грамм)':50,
        '||Питьё холодное (250-грамм/порция)':1,
        '||Выпечка (50-грамм/порция)':1,
        }
