#----
# Городской рацион:

metadict_detail['Городской рацион (человек/год)'] = {
        'Городской весенний рацион (человек/день)':90,
        'Городской летний рацион (человек/день)':90,
        'Городской осенний рацион (человек/день)':90,
        'Городской зимний рацион (человек/день)':90,
        }

#----
# Городской рацион (времена года):

metadict_detail['Городской весенний рацион (человек/день)'] = {
        'Городской весенний повседневный рацион (человек/день)':6 / 7,
        'Городской весенний праздничный рацион (человек/день)':1 / 7,
        }

metadict_detail['Городской летний рацион (человек/день)'] = {
        'Городской летний повседневный рацион (человек/день)':6 / 7,
        'Городской летний праздничный рацион (человек/день)':1 / 7,
        }

metadict_detail['Городской зимний рацион (человек/день)'] = {
        'Городской зимний повседневный рацион (человек/день)':6 / 7,
        'Городской зимний праздничный рацион (человек/день)':1 / 7,
        }

metadict_detail['Городской осенний рацион (человек/день)'] = {
        'Городской осенний повседневный рацион (человек/день)':6 / 7,
        'Городской осенний праздничный рацион (человек/день)':1 / 7,
        }

#----
# Городской рацион (дни недели):

metadict_detail['Городской весенний повседневный рацион (человек/день)'] = {
        'Городской весенний повседневный завтрак':1,
        'Городской весенний повседневный обед':1,
        'Городской весенний повседневный ужин':1,
        }

metadict_detail['Городской весенний праздничный рацион (человек/день)'] = {
        'Городской весенний праздничный завтрак':1,
        'Городской весенний праздничный обед':1,
        'Городской весенний праздничный ужин':1,
        }

metadict_detail['Городской зимний повседневный рацион (человек/день)'] = {
        'Городской зимний повседневный завтрак':1,
        'Городской зимний повседневный обед':1,
        'Городской зимний повседневный ужин':1,
        }

metadict_detail['Городской зимний праздничный рацион (человек/день)'] = {
        'Городской зимний праздничный завтрак':1,
        'Городской зимний праздничный обед':1,
        'Городской зимний праздничный ужин':1,
        }

metadict_detail['Городской летний повседневный рацион (человек/день)'] = {
        'Городской летний повседневный завтрак':1,
        'Городской летний повседневный обед':1,
        'Городской летний повседневный ужин':1,
        }

metadict_detail['Городской летний праздничный рацион (человек/день)'] = {
        'Городской летний праздничный завтрак':1,
        'Городской летний праздничный обед':1,
        'Городской летний праздничный ужин':1,
        }

metadict_detail['Городской осенний повседневный рацион (человек/день)'] = {
        'Городской осенний повседневный завтрак':1,
        'Городской осенний повседневный обед':1,
        'Городской осенний повседневный ужин':1,
        }

metadict_detail['Городской осенний праздничный рацион (человек/день)'] = {
        'Городской осенний праздничный завтрак':1,
        'Городской осенний праздничный обед':1,
        'Городской осенний праздничный ужин':1,
        }

#----
# Городской рацион (весна):
    # Март, апрель, май

metadict_detail['Городской весенний повседневный завтрак'] = {
        # Пресная лепешка из ячменной муки на простокваше (1840-е годы) 
            # https://cook-weekend.blogspot.com/2011/07/1840.html
        'Сыр овечий рассольный (грамм)':125,
        'Вино красное разбавленное (грамм)':250 * 2,
        'Лепёшки ячменно-пшеничные на сыворотке (грамм)':50 * 4,
        '||Блюдо твёрдое холодное (125-грамм/порция)':1,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Хлеб вчерашний (50-грамм/порция)':4,
        }

metadict_detail['Городской весенний повседневный обед'] = {
        # Кислое молоко -- мацони
        'Суп-пюре чечевичный с пряной зеленью (грамм)':250 * 2,
        'Молоко коровье кислое (грамм)':250 * 2,
        'Лепёшки ячменно-пшеничные на сыворотке (грамм)':50 * 4,
        '||Блюдо жидкое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Хлеб свежий (50-грамм/порция)':4,
        }

metadict_detail['Городской весенний повседневный ужин'] = {
        # Каша -- шавля.
            # 1.7 овцы на человека по Кавказскому краю.
            # В достатке баранина, весенняя стрижка отар.
        # Потребление вина в Грузии конца 19 века -- 0.34 литра/человека в сутки
        'Каша перловая с бараниной (грамм)':250 * 2,
        'Вино красное разбавленное (грамм)':250 * 2,
        'Лепёшки пшеничные с пряной зеленью (грамм)':50 * 4,
        '||Блюдо густое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Хлеб свежий (50-грамм/порция)':4,
        }

metadict_detail['Городской весенний праздничный завтрак'] = {
        }

metadict_detail['Городской весенний праздничный обед'] = {
        # Исправить
            # Переноси, допиливай. Но сначала закончи повседневный рацион.
        # Бозбаш, суп из баранины и дроблёной крупы.
        # Сациви. Курица варёная, соус из орехов
        # Гурули. Курица тушёная с орехами в вине
        # Буглама. Тушёная баранина.
        # Плаки. Тушёная форель, припускание,
        # Долма. Голубцы из виноградных листьев с говядиой.
        # Чуду. Лепёшки с начинкой. Творогом, пряной зеленью.
        # Чашушули. Говядина, тушёная с зеленью и пряностями.
        # Лывжа. Тушёная баранина с чесноком и чабером.
        }

metadict_detail['Городской весенний праздничный ужин'] = {
        # Хм, всего 30 яиц с курицы в год. Можно делать лепёшки с яйцом, или праздничный суп загустить.
        }

#----
# Городской рацион (лето):
    # Июнь, июль, август

metadict_detail['Городской летний повседневный завтрак'] = {
        # Осетровых бьют весной, во время хода в устье местной Волги, объёмы огромны.
            # https://ru.wikisource.org/wiki/ЭСБЕ/Осетр,_рыбы_из_семейства_осетровых
            # РИ (1880-е годы) белуги, осетра, севрюги и шипа 600000 пд. (10k тонн)
            # Из них икры 40000 пд (650 тонн, 6.7% массы улова)
        # Пантикапей (нынешняя Керчь), житница эллинских колоний. Рабов кормили преимущественно рыбой.
            # Полагаю, осетровыми, добытыми ради икры:
            # https://www.youtube.com/watch?v=6X4SXoQqiRc
        'Фрукты закавказские летние (грамм)':125,
        'Рыба морская красная вяленая (грамм)':125,
        'Вино красное разбавленное (грамм)':250 * 2,
        'Лепёшки ячменно-пшеничные на сыворотке (грамм)':50 * 4,
        '||Фрукты (125-грамм/порция)':1,
        '||Блюдо твёрдое холодное (125-грамм/порция)':1,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Хлеб вчерашний (50-грамм/порция)':4,
        }

metadict_detail['Городской летний повседневный обед'] = {
        'Суп-пюре нутовый с пряной зеленью (грамм)':250 * 2,
        'Вино красное разбавленное (грамм)':250 * 2,
        'Лепёшки ячменно-пшеничные на сыворотке (грамм)':50 * 4,
        '||Блюдо жидкое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Хлеб свежий (50-грамм/порция)':4,
        }

metadict_detail['Городской летний повседневный ужин'] = {
        'Каша пшённая с фруктами (грамм)':250 * 2,
        'Вино красное разбавленное (грамм)':250 * 2,
        'Лепёшки ячменно-пшеничные на сыворотке (грамм)':50 * 4,
        '||Блюдо густое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Хлеб свежий (50-грамм/порция)':4,
        }

metadict_detail['Городской летний праздничный завтрак'] = {
        }

metadict_detail['Городской летний праздничный обед'] = {
        }

metadict_detail['Городской летний праздничный ужин'] = {
        }

#----
# Городской рацион (осень):
    # Сентябрь, октябрь, ноябрь

metadict_detail['Городской осенний повседневный завтрак'] = {
        # Исправить
            # Лепёшки с творогом
            # Тесто на сыворотке
        # Сбор урожая, дешёвая пшеница в городах.
        'Фрукты закавказские летние (грамм)':125,
        'Молоко коровье кислое (грамм)':250 * 2,
        'Лепёшки пшеничные (грамм)':50 * 4,
        '||Фрукты (125-грамм/порция)':1,
        '||Блюдо твёрдое холодное (125-грамм/порция)':1,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Хлеб вчерашний (50-грамм/порция)':4,
        }

metadict_detail['Городской осенний повседневный обед'] = {
        # Крупяно-бобовый суп -- зернушка
            # http://www.rus-food-recipes.ru/P_6/1/18.htm
        'Суп крупяно-бобовый с орехами (грамм)':250 * 2,
        'Вино красное разбавленное (грамм)':250 * 2,
        'Лепёшки пшеничные (грамм)':50 * 4,
        '||Блюдо жидкое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Хлеб свежий (50-грамм/порция)':4,
        }

metadict_detail['Городской осенний повседневный ужин'] = {
        # Забой годовалых телят, солонина.
        'Каша рисовая с телятиной (грамм)':250 * 2,
        'Вино красное разбавленное (грамм)':250 * 2,
        'Лепёшки пшеничные с пряной зеленью (грамм)':50 * 4,
        '||Блюдо густое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Хлеб свежий (50-грамм/порция)':4,
        }

metadict_detail['Городской осенний праздничный завтрак'] = {
        }

metadict_detail['Городской осенний праздничный обед'] = {
        }

metadict_detail['Городской осенний праздничный ужин'] = {
        }

#----
# Городской рацион (зима):
    # Декабрь, январь, февраль

metadict_detail['Городской зимний повседневный завтрак'] = {
        # Исправить
            # Допилить
            # Зима, уныние, промыслы. Пусть лучше пекут лепёшки с сыром -- хачапури.
            # А ещё чурчхела как раз поспеет.
        'Молоко коровье кислое (грамм)':250 * 2,
        'Лепёшки пшеничные (грамм)':50 * 4,
        '||Блюдо твёрдое холодное (125-грамм/порция)':1,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Хлеб вчерашний (50-грамм/порция)':4,
        }

metadict_detail['Городской зимний повседневный обед'] = {
        # Избыток молока, делают масло и сыры.
        'Суп чечевичный на молоке (грамм)':500,
        'Вино красное разбавленное (грамм)':500,
        'Лепёшки пшеничные (грамм)':50 * 4,
        '||Блюдо жидкое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Хлеб свежий (50-грамм/порция)':4,
        }

metadict_detail['Городской зимний повседневный ужин'] = {
        # Забой старых животных
        'Каша перловая с говядиной (грамм)':500,
        'Вино красное разбавленное (грамм)':500,
        'Лепёшки пшеничные (грамм)':50 * 4,
        '||Блюдо густое горячее (250-грамм/порция)':2,
        '||Питьё холодное (250-грамм/порция)':2,
        '||Хлеб свежий (50-грамм/порция)':4,
        }

metadict_detail['Городской зимний праздничный завтрак'] = {
        }

metadict_detail['Городской зимний праздничный обед'] = {
        }

metadict_detail['Городской зимний праздничный ужин'] = {
        }
