#----
# Потребление (пища):

metadict_army['Едоки-женщины (горожане)'] = {
        'Городской рацион (человек/год)':1,
        '-Едоки':1,
        }

metadict_army['Едоки-женщины (знатные)'] = {
        'Городской рацион (человек/год)':1,
        '-Едоки':1,
        }

metadict_army['Едоки-мужчины (горожане)'] = {
        'Городской рацион (человек/год)':1,
        '-Едоки':1,
        }

metadict_army['Едоки-мужчины (знатные)'] = {
        'Городской рацион (человек/год)':1,
        '-Едоки':1,
        }

metadict_army['Едоки-мужчины (селяне)'] = {
        'Сельский рацион (человек/год)':1,
        '-Едоки':1,
        }

metadict_army['Едоки-женщины (селяне)'] = {
        'Сельский рацион (человек/год)':1,
        '-Едоки':1,
        }

metadict_army['Едоки-женщины (карлы)'] = {
        'Сельский рацион (человек/год)':1,
        '-Едоки':1,
        }

metadict_army['Едоки-женщины (рабы)'] = {
        'Сельский рацион (человек/год)':1,
        '-Едоки':1,
        }

metadict_army['Едоки-мужчины (карлы)'] = {
        # Исправить
            # Карлов будем кормить рыбой и ячменём.
        'Сельский рацион (человек/год)':1,
        '-Едоки':1,
        }

metadict_army['Едоки-мужчины (рабы)'] = {
        'Сельский рацион (человек/год)':1,
        '-Едоки':1,
        }
