#----
# Подавление вывода данных:

#metadict_model['-----Регионы'] = {
#        }
#
#metadict_model['----Округа'] = {
#        }
#
#metadict_model['---Города'] = {
#        }
#
#metadict_model['---Городища'] = {
#        }
#
#metadict_model['---Селения'] = {
#        }
#
#metadict_model['--Общины'] = {
#        }
#
#metadict_model['-Семьи'] = {
#        }
#
#metadict_model['--Население'] = {
#        }

metadict_model['-Едоки'] = {
        }

metadict_model['-Работники'] = {
        }

metadict_model['-Бедняки'] = {
        }

metadict_model['-Горожане'] = {
        }

metadict_model['-Горожане-женщины взрослые (15-50 лет)'] = {
        }

metadict_model['-Горожане-женщины дети (0-15 лет)'] = {
        }

metadict_model['-Горожане-женщины старухи (50+ лет)'] = {
        }

metadict_model['-Горожане-мужчины взрослые (15-50 лет)'] = {
        }

metadict_model['-Горожане-мужчины дети (0-15 лет)'] = {
        }

metadict_model['-Горожане-мужчины старики (50+ лет)'] = {
        }

metadict_model['-Знатные'] = {
        }

metadict_model['-Знатные-женщины взрослые (15-50 лет)'] = {
        }

metadict_model['-Знатные-женщины дети (0-15 лет)'] = {
        }

metadict_model['-Знатные-женщины старухи (50+ лет)'] = {
        }

metadict_model['-Знатные-мужчины взрослые (15-50 лет)'] = {
        }

metadict_model['-Знатные-мужчины дети (0-15 лет)'] = {
        }

metadict_model['-Знатные-мужчины старики (50+ лет)'] = {
        }

metadict_model['-Рабы'] = {
        }

metadict_model['-Селяне'] = {
        }

metadict_model['-Селяне-женщины взрослые (15-50 лет)'] = {
        }

metadict_model['-Селяне-женщины дети (0-15 лет)'] = {
        }

metadict_model['-Селяне-женщины старухи (50+ лет)'] = {
        }

metadict_model['-Селяне-мужчины взрослые (15-50 лет)'] = {
        }

metadict_model['-Селяне-мужчины дети (0-15 лет)'] = {
        }

metadict_model['-Селяне-мужчины старики (50+ лет)'] = {
        }

metadict_army['-Карлы-самки взрослые (15-50 лет)'] = {
        }

metadict_army['-Карлы-самки дети (0-15 лет)'] = {
        }

metadict_army['-Карлы-самки старухи (50+ лет)'] = {
        }

metadict_army['-Карлы-самцы взрослые (15-50 лет)'] = {
        }

metadict_army['-Карлы-самцы дети (0-15 лет)'] = {
        }

metadict_army['-Карлы-самцы старики (50+ лет)'] = {
        }

metadict_army['-Рабы-женщины взрослые (15-50 лет)'] = {
        }

metadict_army['-Рабы-женщины дети (0-15 лет)'] = {
        }

metadict_army['-Рабы-женщины старухи (50+ лет)'] = {
        }

metadict_army['-Рабы-мужчины взрослые (15-50 лет)'] = {
        }

metadict_army['-Рабы-мужчины дети (0-15 лет)'] = {
        }

metadict_army['-Рабы-мужчины старики (50+ лет)'] = {
        }

#----

metadict_model['_+Работа женщины-горожанки (нормо-часов)'] = {
        }

metadict_model['_+Работа женщины-знатной (нормо-часов)'] = {
        }

metadict_model['_+Работа женщины-селянки (нормо-часов)'] = {
        }

metadict_model['_+Работа мужчины-горожанина (нормо-часов)'] = {
        }

metadict_model['_+Работа мужчины-знатного (нормо-часов)'] = {
        }

metadict_model['_+Работа мужчины-селянина (нормо-часов)'] = {
        }

metadict_army['_+Работа женщины-карлы (нормо-часов)'] = {
        }

metadict_army['_+Работа женщины-рабыни (нормо-часов)'] = {
        }

metadict_army['_+Работа мужчины-карла (нормо-часов)'] = {
        }

metadict_army['_+Работа мужчины-раба (нормо-часов)'] = {
        }
