#----
# Обработка пищи (домашняя):

#----
# Готовые блюда (вариации):

metadict_detail['Рыба морская красная вяленая (килограмм)'] = {
        'Осётр вяленый (грамм)':500,
        'Севрюга вяленая (грамм)':300,
        'Белуга вяленая (грамм)':200,
        }

metadict_detail['Каша пшённая с фруктами (килограмм)'] = {
        'Каша пшённая (грамм)':700,
        'Фрукты закавказские летние (грамм)':300,
        }

metadict_detail['Лепёшки пшеничные с пряной зеленью (килограмм)'] = {
        # Лаваш с зеленью
        'Лепёшки пшеничные (грамм)':800,
        'Зелень пряная шинкованная (грамм)':200,
        }

#----
# Готовые блюда (фрукты):

metadict_detail['Фрукты закавказские летние (килограмм)'] = {
        # Исправить
            # Уточнить сезонность
            # Алыча (ткемали), слива, груша, яблоки, инжир, гранат.
        'Виноград отборный (грамм)':300,
        'Яблоко чищеное (грамм)':200,
        'Алыча отборная (грамм)':100,
        'Инжир отборный (грамм)':100,
        'Груша чищеная (грамм)':100,
        'Слива чищеная (грамм)':100,
        'Гранат чищеный (грамм)':100,
        }

#----
# Готовые блюда (супы):

metadict_detail['Суп чечевичный на молоке (килограмм)'] = {
        'Чечевица замоченная (грамм)':400,
        'Овощи пряные шинкованные обжаренные (грамм)':200,
        'Масло сливочное коровье (грамм)':25,
        'Зелень пряная сушёная (грамм)':5,
        'Семена кориандра (грамм)':1,
        'Семена зиры (грамм)':1,
        'Вода для готовки (грамм)':300,
        'Молоко коровье кислое (грамм)':400,
        '_-Варка чечевицы в котелке (килограмм)':1.3,
        '-Испарение воды в котле (килограмм)':0.3,
        '-Кипячение воды в котле (килограмм)':1,
        }

metadict_detail['Суп-пюре чечевичный с пряной зеленью (килограмм)'] = {
        # Исправить
            # Сделай ароматизированное масло
            # Да и с пряностями уточни.
        'Чечевица замоченная (грамм)':400,
        'Овощи пряные шинкованные обжаренные (грамм)':100,
        'Зелень пряная сушёная (грамм)':5,
        'Семена кориандра (грамм)':1,
        'Семена зиры (грамм)':1,
        'Соль поваренная (грамм)':5,
        'Масло оливковое (грамм)':50,
        'Вода для готовки (грамм)':700,
        '_-Протирание бобов в ступе (килограмм)':0.4,
        '_-Варка чечевицы в котелке (килограмм)':1.3,
        '-Испарение воды в котле (килограмм)':0.3,
        '-Кипячение воды в котле (килограмм)':1,
        }

metadict_detail['Суп-пюре нутовый с пряной зеленью (килограмм)'] = {
        'Нут замоченный (грамм)':400,
        'Овощи пряные шинкованные обжаренные (грамм)':100,
        'Зелень пряная сушёная (грамм)':10,
        'Семена кориандра (грамм)':1,
        'Семена зиры (грамм)':1,
        'Соль поваренная (грамм)':5,
        'Масло оливковое (грамм)':50,
        'Вода для готовки (грамм)':700,
        '_-Протирание бобов в ступе (килограмм)':0.4,
        '_-Варка чечевицы в котелке (килограмм)':1.3,
        '-Испарение воды в котле (килограмм)':0.3,
        '-Кипячение воды в котле (килограмм)':1,
        }

metadict_detail['Суп крупяно-бобовый с орехами (килограмм)'] = {
        # Зернушка
            # http://www.rus-food-recipes.ru/P_6/1/19.htm
        'Нут варёный (грамм)':200,
        'Горох варёный (грамм)':200,
        'Пшеница варёная (грамм)':100,
        'Чечевица варёная (грамм)':100,
        'Орех грецкий толчёный (грамм)':25,
        'Лук шинкованный обжаренный (грамм)':100,
        'Мука пшеничная прокаленная (грамм)':25,
        'Масло сливочное коровье (грамм)':25,
        'Зелень базилика сушёная (грамм)':5,
        'Зелень чабера сушёная (грамм)':5,
        'Зелень мяты сушёная (грамм)':2,
        }

#----
# Готовые блюда (каши):

metadict_detail['Каша перловая с бараниной (килограмм)'] = {
        # Шавля
        'Крупа перловая замоченная прокаленная (грамм)':300,
        'Баранина нарезанная припущенная обжаренная (грамм)':100,
        'Овощи пряные шинкованные обжаренные (грамм)':100,
        'Алыча сушёная (грамм)':15,
        'Семена зиры (грамм)':3,
        'Соль поваренная (грамм)':5,
        'Вода для готовки (грамм)':750,
        'Бульон костный бараний (грамм)':250,
        '_-Варка перловой каши в котелке (килограмм)':1.6,
        '-Испарение воды в котле (килограмм)':0.6,
        '-Кипячение воды в котле (килограмм)':1.0,
        }

metadict_detail['Каша перловая с говядиной (килограмм)'] = {
        'Крупа перловая замоченная прокаленная (грамм)':300,
        'Говядина нарезанная припущенная обжаренная (грамм)':100,
        'Овощи пряные шинкованные обжаренные (грамм)':200,
        'Алыча сушёная (грамм)':15,
        'Семена зиры (грамм)':3,
        'Соль поваренная (грамм)':5,
        'Вода для готовки (грамм)':750,
        'Бульон костный говяжий (грамм)':250,
        '_-Варка перловой каши в котелке (килограмм)':1.6,
        '-Испарение воды в котле (килограмм)':0.6,
        '-Кипячение воды в котле (килограмм)':1.0,
        }

metadict_detail['Каша перловая с телятиной (килограмм)'] = {
        # Осень, много овощей
        'Крупа перловая замоченная прокаленная (грамм)':300,
        'Телятина нарезанная припущенная обжаренная (грамм)':100,
        'Овощи пряные шинкованные обжаренные (грамм)':300,
        'Алыча отборная (грамм)':60,
        'Семена зиры (грамм)':3,
        'Соль поваренная (грамм)':5,
        'Вода для готовки (грамм)':900,
        '_-Варка перловой каши в котелке (килограмм)':1.6,
        '-Испарение воды в котле (килограмм)':0.6,
        '-Кипячение воды в котле (килограмм)':1.0,
        }

metadict_detail['Каша рисовая с телятиной (килограмм)'] = {
        # Нет, не плов, тоже шавля
        'Рис замоченный (грамм)':300,
        'Телятина нарезанная припущенная обжаренная (грамм)':100,
        'Овощи пряные шинкованные обжаренные (грамм)':300,
        'Гранат чищеный (грамм)':50,
        'Семена зиры (грамм)':3,
        'Соль поваренная (грамм)':5,
        'Вода для готовки (грамм)':600,
        '_-Тушение риса в котелке (килограмм)':1.3,
        '-Испарение воды в котле (килограмм)':0.3,
        '-Кипячение воды в котле (килограмм)':1.0,
        }

metadict_detail['Каша пшённая (килограмм)'] = {
        'Крупа пшённая промытая (грамм)':300,
        'Масло сливочное коровье (грамм)':50,
        'Соль поваренная (грамм)':5,
        'Вода для готовки (грамм)':1000,
        '_-Варка пшённой каши в котелке (килограмм)':1.3,
        '-Испарение воды в котле (килограмм)':0.3,
        '-Кипячение воды в котле (килограмм)':1.0,
        }

#----
# Готовые блюда (хлеб):

metadict_detail['Лепёшки пшеничные (килограмм)'] = {
        # Лаваш, маца, chapati
        'Тесто пшеничное бездрожжевое для лаваша (грамм)':1200,
        '_-Подготовка теста для лепёшек (килограмм)':1.2,
        '_-Выпечка лепёшек в тандыре (килограмм)':1.2,
        '-Испарение воды в печи (килограмм)':0.2,
        '-Кипячение воды в печи (килограмм)':1,
        }

metadict_detail['Лепёшки пшеничные на сыворотке (килограмм)'] = {
        'Тесто пшеничное бездрожжевое на сыворотке (грамм)':1200,
        '_-Подготовка теста для лепёшек (килограмм)':1.2,
        '_-Выпечка лепёшек в тандыре (килограмм)':1.2,
        '-Испарение воды в печи (килограмм)':0.2,
        '-Кипячение воды в печи (килограмм)':1,
        }

metadict_detail['Лепёшки ячменно-пшеничные на сыворотке (килограмм)'] = {
        'Тесто ячменно-пшеничное бездрожжевое на сыворотке (грамм)':1200,
        '_-Подготовка теста для лепёшек (килограмм)':1.2,
        '_-Выпечка лепёшек в тандыре (килограмм)':1.2,
        '-Испарение воды в печи (килограмм)':0.2,
        '-Кипячение воды в печи (килограмм)':1,
        }

#----
# Готовые блюда (напитки):

metadict_detail['Вино красное разбавленное (килограмм)'] = {
        # Венеция 14 век, галерная мастерская (Арсенал), 1700 рабочих, раздавали вино разбавленное 1:2
            # https://antoin.livejournal.com/866393.html
        'Вино красное сухое (грамм)':333,
        'Вода для готовки (грамм)':666,
        }

#----
# Готовые блюда (сыры):

metadict_detail['Сыр овечий рассольный (килограмм)'] = {
        # Нужен сучужный фермент (из отдела желудка овец/ягнят)
            # https://ru.wikisource.org/wiki/ЭСБЕ/Брынза
            # https://ru.wikisource.org/wiki/ЭСБЕ/Сыры_и_сыроварение
        # 5 литров овечьего молока на килограмм сыра.
        # Вымешивают сгусток 30 минут, затем прессуют.
        # Рассол 20%, 5 суток.
        'Молоко овечье (грамм)':5000,
        'Рассол 20% (грамм)':500,
        '+Сыворотка молочная овечья (доступно/килограмм)':4,
        '_~Молоко овечье (створаживание/грамм)':5000,
        }

#----
# Ингредиенты (творог):

metadict_detail['Творог коровий (килограмм)'] = {
        # Из простокваши, нагрев при T 80-100°C в течении 3 часов.
        'Молоко коровье кислое (грамм)':8000,
        '_~Молоко коровье кислое (створаживание/грамм)':8000,
        '+Сыворотка творожная коровья (доступно/килограмм)':7,
        }

#----
# Ингредиенты (масло):

metadict_detail['Масло сливочное коровье (килограмм)'] = {
        # https://ru.wikisource.org/wiki/ЭСБЕ/Масло_коровье
        'Сливки коровьи (грамм)':4000,
        '+Пахта сливочная коровья (доступно/килограмм)':3,
        '_~Сливки коровьи (сепарация/грамм)':4000,
        }

#----
# Ингредиенты (кисломолочные):

metadict_detail['Молоко коровье кислое (килограмм)'] = {
        'Молоко коровье снятое (грамм)':1000,
        }

#----
# Ингредиенты (сливки):

metadict_detail['Сливки коровьи (килограмм)'] = {
        # Жирность снятого молока -- 1%
        # https://ru.wikisource.org/wiki/ЭСБЕ/Сливки
        'Молоко коровье (грамм)':6500,
        '+Молоко коровье снятое (доступно/килограмм)':5.5,
        '_~Молоко коровье (сепарация/грамм)':6500,
        }

#----
# Готовые блюда (спиртовое брожение):

metadict_detail['Вино красное сухое (килограмм)'] = {
        # Нормы технологического проектирования винодельческих заводов по переработке винограда:
            # http://xcook.info/product/krasnoe-suhoe-vino.html
            # http://www.norm-load.ru/SNiP/Data1/9/9947/index.htm#i831023
            # https://ru.wikisource.org/wiki/ЭСБЕ/Виноделие
        'Виноград отборный (грамм)':2000,
        '_-Приготовление вина (килограмм)':2,
        '_~Сусло виноградное (спиртовое брожение/грамм)':2000,
        '_~Сусло виноградное (фильтрация/грамм)':2000,
        '+Сусло виноградное (доступно/килограмм)':1,
        }

metadict_detail['Вино белое сухое (килограмм)'] = {
        # Вино окрашивает кожица ягод, так что сорт может быть тот же.
        'Виноград отборный (грамм)':2000,
        '_-Приготовление вина (килограмм)':2,
        '_~Сусло виноградное (спиртовое брожение/грамм)':2000,
        '_~Сусло виноградное (фильтрация/грамм)':2000,
        '+Сусло виноградное (доступно/килограмм)':1,
        }

#----
# Ингредиенты (зелень):

metadict_detail['Зелень пряная сушёная (килограмм)'] = {
        # Исправить
            # Перенеси в пряности
        'Зелень укропа сушёная (грамм)':1000 / 9,
        'Зелень фенхеля сушёная (грамм)':1000 / 9,
        'Зелень петрушки сушёная (грамм)':1000 / 9,
        'Зелень сельдерея сушёная (грамм)':1000 / 9,
        'Зелень кориандра сушёная (грамм)':1000 / 9,
        'Зелень базилика сушёная (грамм)':1000 / 9,
        'Зелень чабера сушёная (грамм)':1000 / 9,
        'Зелень мяты сушёная (грамм)':1000 / 9,
        'Лист лавра сушёный (грамм)':1000 / 9,
        }

metadict_detail['Зелень пряная шинкованная (килограмм)'] = {
        # Исправить
            # Сезоны разные
            # Предполагается, что это дикоросы.
        'Зелень кресса отборная (грамм)':1000 / 13,
        'Зелень укропа отборная (грамм)':1000 / 13,
        'Зелень фенхеля отборная (грамм)':1000 / 13,
        'Зелень петрушки отборная (грамм)':1000 / 13,
        'Зелень базилика отборная (грамм)':1000 / 13,
        'Зелень сельдерея отборная (грамм)':1000 / 13,
        'Зелень кориандра отборная (грамм)':1000 / 13,
        'Зелень эстрагона отборная (грамм)':1000 / 13,
        'Зелень мелиссы отборная (грамм)':1000 / 13,
        'Зелень кервеля отборная (грамм)':1000 / 13,
        'Зелень руколы отборная (грамм)':1000 / 13,
        'Зелень чабера отборная (грамм)':1000 / 13,
        'Зелень мяты отборная (грамм)':1000 / 13,
        '_-Шинковка зелени (килограмм)':1,
        }

#----
# Ингредиенты (тесто):

metadict_detail['Тесто пшеничное бездрожжевое для лаваша (килограмм)'] = {
        # Влажность теста -- 60%; горячая вода;
        # Вымешивать -- 5 минут; расстойка -- 30 минут;
        'Мука пшеничная (грамм)':620,
        'Соль поваренная (грамм)':10,
        'Вода кипячёная в котелке (грамм)':380,
        '_-Приготовление бездрожжевого теста (килограмм)':1,
        }

metadict_detail['Тесто пшеничное бездрожжевое на сыворотке (килограмм)'] = {
        'Мука пшеничная (грамм)':620,
        'Соль поваренная (грамм)':10,
        'Сыворотка творожная коровья (грамм)':380,
        '_-Приготовление бездрожжевого теста (килограмм)':1,
        }

metadict_detail['Тесто ячменно-пшеничное бездрожжевое на сыворотке (килограмм)'] = {
        'Мука пшеничная (грамм)':320,
        'Мука ячменная (грамм)':300,
        'Соль поваренная (грамм)':10,
        'Сыворотка творожная коровья (грамм)':380,
        '_-Приготовление бездрожжевого теста (килограмм)':1,
        }

#----
# Ингредиенты (рассолы):

metadict_detail['Рассол 20% (килограмм)'] = {
        'Соль поваренная (грамм)':200,
        'Вода для готовки (грамм)':800,
        }

#----
# Ингредиенты (варка бобов и зерна):

metadict_detail['Горох варёный (килограмм)'] = {
        'Горох замоченный (грамм)':700,
        'Вода для готовки (грамм)':1500,
        '_-Варка гороха в котелке (килограмм)':2.2,
        #'+Бульон бобовый (доступно/килограмм)':0.7,
        '-Испарение воды в котле (килограмм)':0.5,
        '-Кипячение воды в котле (килограмм)':1.7,
        }

metadict_detail['Чечевица варёная (килограмм)'] = {
        'Чечевица замоченная (грамм)':800,
        'Вода для готовки (грамм)':1200,
        '_-Варка чечевицы в котелке (килограмм)':2.0,
        #'+Бульон бобовый (доступно/килограмм)':0.5,
        '-Испарение воды в котле (килограмм)':0.3,
        '-Кипячение воды в котле (килограмм)':1.5,
        }

metadict_detail['Нут варёный (килограмм)'] = {
        'Нут замоченный (грамм)':800,
        'Вода для готовки (грамм)':1200,
        '_-Варка нута в котелке (килограмм)':2.0,
        #'+Бульон бобовый (доступно/килограмм)':0.5,
        '-Испарение воды в котле (килограмм)':0.3,
        '-Кипячение воды в котле (килограмм)':1.5,
        }

metadict_detail['Пшеница варёная (килограмм)'] = {
        'Пшеница замоченная (грамм)':800,
        'Вода для готовки (грамм)':1200,
        '_-Варка пшеницы в котелке (килограмм)':2.0,
        '-Испарение воды в котле (килограмм)':0.3,
        '-Кипячение воды в котле (килограмм)':1.5,
        }

#----
# Ингредиенты (бульоны):

metadict_detail['Бульон костный бараний (килограмм)'] = {
        # The Professional Chef/The Culinary Institute of America. - 8th ed. стр 368
        'Кости бараньи запечённые (грамм)':500,
        'Овощи пряные шинкованные запечённые (грамм)':100,
        'Пряности букета гарни с петрушкой (грамм)':10,
        'Лист лавра сушёный (грамм)':0.6,
        'Вино красное сухое (грамм)':100,
        'Вода для готовки (грамм)':1300,
        '_-Варка костного бульона в котелке (килограмм)':2,
        '_-Процеживание бульона через мешок (килограмм)':1.5,
        '-Испарение воды в котле (килограмм)':0.5,
        '-Кипячение воды в котле (килограмм)':1.5,
        '_~Кости бараньи (фильтрация/грамм)':500,
        '_~Овощи пряные шинкованные запечённые (фильтрация/грамм)':100,
        '_~Пряности букета гарни (фильтрация/грамм)':10,
        '+Мезга овощная (доступно/килограмм)':0.1,
        '+Пищевые отходы костные (доступно/килограмм)':0.5,
        }

metadict_detail['Бульон костный говяжий (килограмм)'] = {
        'Кости говяжьи запечённые (грамм)':500,
        'Овощи пряные шинкованные запечённые (грамм)':100,
        'Пряности букета гарни с петрушкой (грамм)':10,
        'Лист лавра сушёный (грамм)':0.6,
        'Вино красное сухое (грамм)':100,
        'Вода для готовки (грамм)':1300,
        '_-Варка костного бульона в котелке (килограмм)':2,
        '_-Процеживание бульона через мешок (килограмм)':1.5,
        '-Испарение воды в котле (килограмм)':0.5,
        '-Кипячение воды в котле (килограмм)':1.5,
        '_~Кости бараньи (фильтрация/грамм)':500,
        '_~Овощи пряные шинкованные запечённые (фильтрация/грамм)':100,
        '_~Пряности букета гарни (фильтрация/грамм)':10,
        '+Мезга овощная (доступно/килограмм)':0.1,
        '+Пищевые отходы костные (доступно/килограмм)':0.5,
        }

#----
# Ингредиенты (наборы):

metadict_detail['Овощи пряные шинкованные обжаренные (килограмм)'] = {
        # Для каши, плова
        'Морковь шинкованная обжаренная (грамм)':500,
        'Лук шинкованный обжаренный (грамм)':400,
        'Чеснок давленый обжаренный (грамм)':100,
        }

metadict_detail['Овощи пряные шинкованные запечённые (килограмм)'] = {
        # Мирпуа. Запекают на мангале, чтобы усилить вкус:
            # https://en.wikipedia.org/wiki/Mirepoix_(cuisine)
            # The Professional Chef/The Culinary Institute of America. - 8th ed. стр 356
        'Морковь шинкованная печёная (грамм)':500,
        'Лук шинкованный печёный (грамм)':400,
        'Чеснок чищеный печёный (грамм)':100,
        }

#----
# Ингредиенты (запекание):

metadict_detail['Кости бараньи запечённые (килограмм)'] = {
        'Кости бараньи (грамм)':1100,
        '_-Запекание костей на противене (килограмм)':1.1,
        '-Испарение воды на очаге (килограмм)':0.1,
        '-Кипячение воды на очаге (килограмм)':1,
        }

metadict_detail['Кости говяжьи запечённые (килограмм)'] = {
        'Кости говяжьи (грамм)':1100,
        '_-Запекание костей на противене (килограмм)':1.1,
        '-Испарение воды на очаге (килограмм)':0.1,
        '-Кипячение воды на очаге (килограмм)':1,
        }

metadict_detail['Морковь шинкованная печёная (килограмм)'] = {
        'Морковь шинкованная (грамм)':1300,
        '_-Запекание корнеплодов на противене (килограмм)':1.3,
        '-Испарение воды на очаге (килограмм)':0.3,
        '-Кипячение воды на очаге (килограмм)':1,
        }

metadict_detail['Лук шинкованный печёный (килограмм)'] = {
        'Лук шинкованный (грамм)':1300,
        '_-Запекание овощей на противене (килограмм)':1.3,
        '-Испарение воды на очаге (килограмм)':0.3,
        '-Кипячение воды на очаге (килограмм)':1,
        }

metadict_detail['Чеснок чищеный печёный (килограмм)'] = {
        'Чеснок чищеный (грамм)':1300,
        '_-Запекание овощей на противене (килограмм)':1.3,
        '-Испарение воды на очаге (килограмм)':0.3,
        '-Кипячение воды на очаге (килограмм)':1,
        }

#----
# Ингредиенты (обжаривание):

metadict_detail['Баранина нарезанная припущенная обжаренная (килограмм)'] = {
        'Баранина нарезанная припущенная (грамм)':1200,
        'Жир бараний курдючный топлёный (грамм)':50,
        '_-Обжаривание мяса в казане (килограмм)':1.3,
        '-Испарение воды на очаге (килограмм)':0.3,
        '-Кипячение воды на очаге (килограмм)':1,
        }

metadict_detail['Говядина нарезанная припущенная обжаренная (килограмм)'] = {
        # Исправить
            # Скорее уж солонина.
            # Можно использовать нутряной/почечный жир (или сохранить для более ценных блюд)
            # Льняное масло нефильтрованное, нужно прокаливать.
        'Говядина нарезанная припущенная (грамм)':1200,
        'Масло льняное прокаленное (грамм)':50,
        '_-Обжаривание мяса в казане (килограмм)':1.3,
        '-Испарение воды на очаге (килограмм)':0.3,
        '-Кипячение воды на очаге (килограмм)':1,
        }

metadict_detail['Телятина нарезанная припущенная обжаренная (килограмм)'] = {
        'Телятина нарезанная припущенная (грамм)':1200,
        'Масло льняное прокаленное (грамм)':50,
        '_-Обжаривание мяса в казане (килограмм)':1.3,
        '-Испарение воды на очаге (килограмм)':0.3,
        '-Кипячение воды на очаге (килограмм)':1,
        }

metadict_detail['Лук шинкованный обжаренный (килограмм)'] = {
        # Масло отчаянно экономим. Нужно вдвое больше
        'Лук шинкованный (грамм)':1200,
        'Масло льняное прокаленное (грамм)':50,
        '_-Обжаривание овощей в казане (килограмм)':1.3,
        '-Испарение воды на очаге (килограмм)':0.3,
        '-Кипячение воды на очаге (килограмм)':1,
        }

metadict_detail['Чеснок давленый обжаренный (килограмм)'] = {
        'Чеснок давленый (грамм)':1000,
        'Масло льняное прокаленное (грамм)':50,
        '_-Обжаривание овощей в казане (килограмм)':1.3,
        '-Испарение воды на очаге (килограмм)':0.3,
        '-Кипячение воды на очаге (килограмм)':1,
        }

metadict_detail['Морковь шинкованная обжаренная (килограмм)'] = {
        'Морковь шинкованная (грамм)':1200,
        'Масло льняное прокаленное (грамм)':50,
        '_-Шинковка овощей (килограмм)':1.2,
        '_-Обжаривание овощей в казане (килограмм)':1.3,
        '-Испарение воды на очаге (килограмм)':0.3,
        '-Кипячение воды на очаге (килограмм)':1,
        }

#----
# Ингредиенты (припускание):

metadict_detail['Баранина нарезанная припущенная (килограмм)'] = {
        # Мясо зрелого животного -- 60 минут.
        'Баранина нарезанная (грамм)':1200,
        'Вода для готовки (грамм)':300,
        '_-Припускание мяса в казане (килограмм)':1.5,
        '-Испарение воды на очаге (килограмм)':0.5,
        '-Кипячение воды на очаге (килограмм)':1,
        }

metadict_detail['Говядина нарезанная припущенная (килограмм)'] = {
        'Говядина нарезанная (грамм)':1200,
        'Вода для готовки (грамм)':300,
        '_-Припускание мяса в казане (килограмм)':1.5,
        '-Испарение воды на очаге (килограмм)':0.5,
        '-Кипячение воды на очаге (килограмм)':1,
        }

metadict_detail['Телятина нарезанная припущенная (килограмм)'] = {
        'Телятина нарезанная (грамм)':1200,
        'Вода для готовки (грамм)':300,
        '_-Припускание мяса в казане (килограмм)':1.5,
        '-Испарение воды на очаге (килограмм)':0.5,
        '-Кипячение воды на очаге (килограмм)':1,
        }

#----
# Ингредиенты (прокаливание):

metadict_detail['Мука пшеничная прокаленная (килограмм)'] = {
        'Мука пшеничная (грамм)':1000,
        '_-Прокаливание муки на сковороде (килограмм)':1,
        }

metadict_detail['Рис прокаленный (килограмм)'] = {
        'Рис нешлифованный (грамм)':1000,
        '_-Перебор крупы (килограмм)':1,
        '_-Промывание крупы (килограмм)':1,
        '_-Прокаливание крупы на сковороде (килограмм)':1,
        }

metadict_detail['Крупа перловая замоченная прокаленная (килограмм)'] = {
        'Крупа перловая замоченная (грамм)':1100,
        '_-Прокаливание крупы на сковороде (килограмм)':1.1,
        }

metadict_detail['Масло льняное прокаленное (килограмм)'] = {
        # Фильтровать не умеют, прокаливают. На слабейшем огне, не менее часа.
        'Масло льняное (грамм)':1000,
        '_-Прокаливание масла на сковороде (килограмм)':1.0,
        }

#----
# Ингредиенты (вытапливание):

metadict_detail['Жир бараний курдючный топлёный (килограмм)'] = {
        'Жир бараний курдючный (грамм)':1100,
        '_-Вытапливание жира в казане (килограмм)':1.1,
        '_~Жир бараний курдючный (фильтрация/грамм)':1100,
        }

#----
# Ингредиенты (измельчение):

metadict_detail['Орех грецкий толчёный (килограмм)'] = {
        'Орех грецкий чищенный (грамм)':1000,
        '_-Измельчение орехов в ступе (килограмм)':1,
        }

metadict_detail['Лук шинкованный (килограмм)'] = {
        'Лук чищеный (грамм)':1000,
        '_-Шинковка овощей (килограмм)':1,
        }

metadict_detail['Морковь шинкованная (килограмм)'] = {
        'Морковь чищеная (грамм)':1000,
        '_-Шинковка овощей (килограмм)':1,
        }

metadict_detail['Чеснок давленый (килограмм)'] = {
        'Чеснок чищеный (грамм)':1000,
        '_-Шинковка овощей (килограмм)':1,
        }

metadict_detail['Баранина нарезанная (килограмм)'] = {
        'Баранина вырезка (грамм)':1000,
        '_-Нарезка мяса (килограмм)':1,
        }

metadict_detail['Говядина нарезанная (килограмм)'] = {
        'Говядина вырезка (грамм)':1000,
        '_-Нарезка мяса (килограмм)':1,
        }

metadict_detail['Телятина нарезанная (килограмм)'] = {
        'Телятина вырезка (грамм)':1000,
        '_-Нарезка мяса (килограмм)':1,
        }

#----
# Ингредиенты (замачивание, регидрация, проращивание):

metadict_detail['Крупа перловая замоченная (килограмм)'] = {
        # Воду кипятят и сливают после нескольких часов замачивания
        'Крупа перловая (грамм)':700,
        'Вода кипячёная в котелке (грамм)':2000,
        '_-Перебор крупы (килограмм)':0.7,
        '_-Промывание крупы (килограмм)':0.7,
        '_-Замачивание зерна (килограмм)':3,
        }

metadict_detail['Рис замоченный (килограмм)'] = {
        # 100 грамм риса впитывают 50 мл воды при 60°C
        'Рис нешлифованный (грамм)':650,
        'Вода для готовки (грамм)':1000,
        '_-Перебор крупы (килограмм)':0.7,
        '_-Промывание крупы (килограмм)':0.7,
        '_-Замачивание риса (килограмм)':1.7,
        }

metadict_detail['Чечевица замоченная (килограмм)'] = {
        'Чечевица сухая (грамм)':500,
        'Вода для готовки (грамм)':2000,
        '_-Перебор бобов (килограмм)':0.5,
        '_-Замачивание бобов (килограмм)':1,
        }

metadict_detail['Горох замоченный (килограмм)'] = {
        'Горох сухой (грамм)':500,
        'Вода для готовки (грамм)':2000,
        '_-Перебор бобов (килограмм)':0.5,
        '_-Замачивание бобов (килограмм)':1,
        }

metadict_detail['Нут замоченный (килограмм)'] = {
        'Нут сухой (грамм)':500,
        'Вода для готовки (грамм)':2000,
        '_-Перебор бобов (килограмм)':0.5,
        '_-Замачивание бобов (килограмм)':1,
        }

metadict_detail['Пшеница замоченная (килограмм)'] = {
        'Зерно пшеницы (грамм)':500,
        'Вода для готовки (грамм)':2000,
        '_-Перебор зерна (килограмм)':0.5,
        '_-Замачивание пшеницы (килограмм)':1,
        }

#----
# Ингредиенты (сушка на воздухе):

metadict_detail['Белуга вяленая (килограмм)'] = {
        'Белуга чищеная (грамм)':2000,
        '_-Вяление рыбы (килограмм)':2,
        '-Испарение воды на воздухе (килограмм)':1,
        }

metadict_detail['Осётр вяленый (килограмм)'] = {
        'Осётр чищеный (грамм)':2000,
        '_-Вяление рыбы (килограмм)':2,
        '-Испарение воды на воздухе (килограмм)':1,
        }

metadict_detail['Севрюга вяленая (килограмм)'] = {
        'Севрюга чищеная (грамм)':2000,
        '_-Вяление рыбы (килограмм)':2,
        '-Испарение воды на воздухе (килограмм)':1,
        }

metadict_detail['Алыча сушёная (килограмм)'] = {
        'Алыча отборная (грамм)':4000,
        '_-Сушка фруктов (килограмм)':4,
        '-Испарение воды на воздухе (килограмм)':4,
        }

#----
# Ингредиенты (специи сушёные):

metadict_detail['Лист малины сушёный (килограмм)'] = {
        'Лист малины отборный (грамм)':10000,
        '_-Сушка трав (килограмм)':10,
        '-Испарение воды на воздухе (килограмм)':10,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Лист рябины сушёный (килограмм)'] = {
        'Лист рябины отборный (грамм)':10000,
        '_-Сушка трав (килограмм)':10,
        '-Испарение воды на воздухе (килограмм)':10,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Лист шиповника сушёный (килограмм)'] = {
        'Лист шиповника отборный (грамм)':10000,
        '_-Сушка трав (килограмм)':10,
        '-Испарение воды на воздухе (килограмм)':10,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Эстрагон сушёный (килограмм)'] = {
        # Тархун
        'Зелень эстрагона отборная (грамм)':11000,
        '_-Сушка трав (килограмм)':11,
        '-Испарение воды на воздухе (килограмм)':11,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Чеснок сушёный (килограмм)'] = {
        'Чеснок чищеный (грамм)':2300,
        '_-Нарезка овощей (килограмм)':2.3,
        '_-Сушка овощей (килограмм)':2.3,
        '-Испарение воды на воздухе (килограмм)':2.3,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Лук сушёный (килограмм)'] = {
        'Лук чищеный (грамм)':4600,
        '_-Нарезка овощей (килограмм)':4.6,
        '_-Сушка овощей (килограмм)':4.6,
        '-Испарение воды на воздухе (килограмм)':4.6,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Зелень чабера сушёная (килограмм)'] = {
        'Зелень чабера отборная (грамм)':7000,
        '_-Сушка трав (килограмм)':7,
        '-Испарение воды на воздухе (килограмм)':7,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Зелень кориандра сушёная (килограмм)'] = {
        'Зелень кориандра отборная (грамм)':10000,
        '_-Сушка трав (килограмм)':10,
        '-Испарение воды на воздухе (килограмм)':10,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Зелень фенугрека сушёная (килограмм)'] = {
        'Зелень фенугрека отборная (грамм)':10000,
        '_-Сушка трав (килограмм)':10,
        '-Испарение воды на воздухе (килограмм)':10,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Зелень петрушки сушёная (килограмм)'] = {
        'Зелень петрушки отборная (грамм)':6000,
        '_-Сушка трав (килограмм)':6,
        '-Испарение воды на воздухе (килограмм)':6,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Зелень укропа сушёная (килограмм)'] = {
        'Зелень укропа отборная (грамм)':7000,
        '_-Сушка трав (килограмм)':7,
        '-Испарение воды на воздухе (килограмм)':7,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Зелень сельдерея сушёная (килограмм)'] = {
        'Зелень сельдерея отборная (грамм)':7000,
        '_-Сушка трав (килограмм)':7,
        '-Испарение воды на воздухе (килограмм)':7,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Крапива сушёная (килограмм)'] = {
        'Крапива отборная (грамм)':7000,
        '_-Сушка трав (килограмм)':7,
        '-Испарение воды на воздухе (килограмм)':7,
        #'|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Лаванда сушёная (килограмм)'] = {
        'Лаванда отборная (грамм)':7000,
        '_-Сушка трав (килограмм)':7,
        '-Испарение воды на воздухе (килограмм)':7,
        #'|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Любисток сушёный (килограмм)'] = {
        'Любисток отборный (грамм)':7000,
        '_-Сушка трав (килограмм)':7,
        '-Испарение воды на воздухе (килограмм)':7,
        #'|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Чабрец сушёный (килограмм)'] = {
        'Чабрец отборный (грамм)':7000,
        '_-Сушка трав (килограмм)':7,
        '-Испарение воды на воздухе (килограмм)':7,
        #'|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Зелень руколы сушёная (килограмм)'] = {
        'Зелень руколы отборная (грамм)':7000,
        '_-Сушка трав (килограмм)':7,
        '-Испарение воды на воздухе (килограмм)':7,
        #'|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Зелень фенхеля сушёная (килограмм)'] = {
        'Зелень фенхеля отборная (грамм)':7000,
        '_-Сушка трав (килограмм)':7,
        '-Испарение воды на воздухе (килограмм)':7,
        #'|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Таволга сушёная (килограмм)'] = {
        'Таволга отборная (грамм)':7000,
        '_-Сушка трав (килограмм)':7,
        '-Испарение воды на воздухе (килограмм)':7,
        #'|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Иссоп сушёный (килограмм)'] = {
        # Исправить
            # Не используется
            # Ароматный, терпкий. К компотам, фасолевой похлёбке и тушёному картофелю.
        'Иссоп отборный (грамм)':7000,
        '_-Сушка трав (килограмм)':7,
        '-Испарение воды на воздухе (килограмм)':7,
        #'|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Зелень мяты сушёная (килограмм)'] = {
        'Зелень мяты отборная (грамм)':6000,
        '_-Сушка трав (килограмм)':6,
        '-Испарение воды на воздухе (килограмм)':6,
        #'|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Зверобой сушёный (килограмм)'] = {
        'Зверобой отборный (грамм)':7000,
        '_-Сушка трав (килограмм)':7,
        '-Испарение воды на воздухе (килограмм)':7,
        #'|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Ромашка сушёная (килограмм)'] = {
        'Ромашка отборная (грамм)':7000,
        '_-Сушка трав (килограмм)':7,
        '-Испарение воды на воздухе (килограмм)':7,
        #'|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Кипрей сушёный (килограмм)'] = {
        # Иван-чай
        'Кипрей отборный (грамм)':5000,
        '_-Сушка трав (килограмм)':5,
        '-Испарение воды на воздухе (килограмм)':5,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Клевер сушёный (килограмм)'] = {
        'Клевер отборный (грамм)':7000,
        '_-Сушка трав (килограмм)':7,
        '-Испарение воды на воздухе (килограмм)':7,
        #'|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Одуванчик сушёный (килограмм)'] = {
        'Одуванчик чищеный (грамм)':7000,
        '_-Сушка трав (килограмм)':7,
        '-Испарение воды на воздухе (килограмм)':7,
        #'|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Лист смородины сушёный (килограмм)'] = {
        'Лист смородины отборный (грамм)':7000,
        '_-Сушка трав (килограмм)':7,
        '-Испарение воды на воздухе (килограмм)':7,
        #'|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Лист вишни сушёный (килограмм)'] = {
        'Лист вишни отборный (грамм)':7000,
        '_-Сушка трав (килограмм)':7,
        '-Испарение воды на воздухе (килограмм)':7,
        #'|=Бочка местных трав (килограмм)':1,
        }

metadict_detail['Лист лавра сушёный (килограмм)'] = {
        'Лист лавра (грамм)':7000,
        '_-Сушка трав (килограмм)':7,
        '-Испарение воды на воздухе (килограмм)':7,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Зелень базилика сушёная (килограмм)'] = {
        'Зелень базилика отборная (грамм)':8000,
        '_-Сушка трав (килограмм)':8,
        '-Испарение воды на воздухе (килограмм)':8,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Орегано сушёный (килограмм)'] = {
        # Душица
        'Орегано (килограмм)':8,
        '_-Сушка трав (килограмм)':8,
        '-Испарение воды на воздухе (килограмм)':8,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Тимьян сушёный (килограмм)'] = {
        'Тимьян (килограмм)':8,
        '_-Сушка трав (килограмм)':8,
        '-Испарение воды на воздухе (килограмм)':8,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Майоран сушёный (килограмм)'] = {
        'Майоран (килограмм)':8,
        '_-Сушка трав (килограмм)':8,
        '-Испарение воды на воздухе (килограмм)':8,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Розмарин сушёный (килограмм)'] = {
        'Розмарин (килограмм)':8,
        '_-Сушка трав (килограмм)':8,
        '-Испарение воды на воздухе (килограмм)':8,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Шалфей сушёный (килограмм)'] = {
        'Шалфей (килограмм)':8,
        '_-Сушка трав (килограмм)':8,
        '-Испарение воды на воздухе (килограмм)':8,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Мелисса сушёная (килограмм)'] = {
        'Зелень мелиссы отборная (грамм)':6000,
        '_-Сушка трав (килограмм)':6,
        '-Испарение воды на воздухе (килограмм)':6,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Паприка сушёная (килограмм)'] = {
        'Перец нежгучий отборный (грамм)':8000,
        '_-Сушка овощей (килограмм)':8,
        '-Испарение воды на воздухе (килограмм)':8,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Перец острый сушёный (килограмм)'] = {
        'Перец острый отборный (грамм)':8000,
        '_-Сушка овощей (килограмм)':8,
        '-Испарение воды на воздухе (килограмм)':8,
        #'|=Бочка местных пряностей (килограмм)':1,
        }

metadict_detail['Шафран сушёный (килограмм)'] = {
        'Рыльца шафрана (килограмм)':10,
        '_-Сушка трав (килограмм)':10,
        '-Испарение воды на воздухе (килограмм)':10,
        #'|=Бочка импортных пряностей (килограмм)':1,
        }

metadict_detail['Лист карри сушёный (килограмм)'] = {
        'Лист карри (грамм)':6000,
        '_-Сушка трав (килограмм)':6,
        '-Испарение воды на воздухе (килограмм)':6,
        #'|=Бочка импортных пряностей (килограмм)':1,
        }

metadict_detail['Гвоздика сушёная (килограмм)'] = {
        'Гвоздика (килограмм)':8,
        '_-Сушка трав (килограмм)':8,
        '-Испарение воды на воздухе (килограмм)':8,
        #'|=Бочка импортных пряностей (килограмм)':1,
        }

metadict_detail['Перец душистый сушёный (килограмм)'] = {
        'Плоды пименты лекарственной (килограмм)':8,
        '_-Сушка фруктов (килограмм)':8,
        '-Испарение воды на воздухе (килограмм)':8,
        #'|=Бочка импортных пряностей (килограмм)':1,
        }

metadict_detail['Бадьян сушёный (килограмм)'] = {
        'Плоды бадьяна (килограмм)':8,
        '_-Сушка фруктов (килограмм)':8,
        '-Испарение воды на воздухе (килограмм)':8,
        #'|=Бочка импортных пряностей (килограмм)':1,
        }

metadict_detail['Перец чёрный сушёный (килограмм)'] = {
        'Плоды чёрного перца (килограмм)':8,
        '_-Сушка фруктов (килограмм)':8,
        '-Испарение воды на воздухе (килограмм)':8,
        #'|=Бочка импортных пряностей (килограмм)':1,
        }

#----
# Ингредиенты (чистка рыбы и мяса):

metadict_detail['Белуга чищеная (килограмм)'] = {
        'Туша белужья (килограмм)':1.2,
        '_-Разделка крупной рыбы (килограмм)':1.2,
        '+Кости рыбьи (доступно/килограмм)':0.2,
        }

metadict_detail['Осётр чищеный (килограмм)'] = {
        'Туша осетровая (килограмм)':1.2,
        '_-Разделка крупной рыбы (килограмм)':1.2,
        '+Кости рыбьи (доступно/килограмм)':0.2,
        }

metadict_detail['Севрюга чищеная (килограмм)'] = {
        'Туша севрюжья (килограмм)':1.2,
        '_-Разделка крупной рыбы (килограмм)':1.2,
        '+Кости рыбьи (доступно/килограмм)':0.2,
        }

metadict_detail['Баранина вырезка (килограмм)'] = {
        'Туша баранья (килограмм)':1.8,
        '_-Разделка мяса (килограмм)':1.8,
        '+Кости бараньи (доступно/килограмм)':0.8,
        }

metadict_detail['Говядина вырезка (килограмм)'] = {
        'Туша говяжья (килограмм)':1.4,
        '_-Разделка мяса (килограмм)':1.4,
        '+Кости говяжьи (доступно/килограмм)':0.4,
        }

metadict_detail['Телятина вырезка (килограмм)'] = {
        'Туша телячья (килограмм)':1.5,
        '_-Разделка мяса (килограмм)':1.5,
        '+Кости говяжьи (доступно/килограмм)':0.5,
        }

#----
# Ингредиенты (разделка туш):

metadict_detail['Туша баранья (килограмм)'] = {
        # Субпродукты: ноги по запястный/скакательный сустав,
            # кровь, внутренние органы, шкура, хвост (курдюк) и голова.
        # Убойный выход 40%:
            # https://lektsii.org/4-22560.html
            # https://selo-exp.com/ovcy/edilbaevskaya-poroda-ovec.html
            # https://house-animals.ru/statya/vyhod-myasa-baraniny-i-kachestvo-baraniny
        'Живой вес барана (килограмм)':2.3,
        '_-Разделка мелкого рогатого скота (килограмм)':2.3,
        }

metadict_detail['Туша говяжья (килограмм)'] = {
        # Убойный выход 47%:
        'Живой вес коровы (килограмм)':2,
        '_-Разделка крупного рогатого скота (килограмм)':2,
        }

metadict_detail['Туша телячья (килограмм)'] = {
        'Живой вес телёнка (килограмм)':2,
        '_-Разделка крупного рогатого скота (килограмм)':2,
        }

metadict_detail['Туша белужья (килограмм)'] = {
        'Живой вес белуги (килограмм)':1.5,
        '_-Разделка крупной рыбы (килограмм)':1.5,
        }

metadict_detail['Туша севрюжья (килограмм)'] = {
        'Живой вес севрюги (килограмм)':1.5,
        '_-Разделка крупной рыбы (килограмм)':1.5,
        }

metadict_detail['Туша осетровая (килограмм)'] = {
        'Живой вес осетра (килограмм)':1.5,
        '_-Разделка крупной рыбы (килограмм)':1.5,
        }

#----
# Ингредиенты (промывание):

metadict_detail['Крупа пшённая промытая (килограмм)'] = {
        # Промывают кипятком
        'Крупа пшённая (грамм)':1000,
        'Вода кипячёная в котелке (грамм)':2000,
        '_-Перебор крупы (килограмм)':1,
        '_-Промывание крупы (килограмм)':3,
        }

#----
# Ингредиенты (чистка):

metadict_detail['Лук чищеный (килограмм)'] = {
        'Лук репчатый (килограмм)':1.3,
        '_-Чистка корнеплодов (килограмм)':1.3,
        '+Пищевые отходы овощные (доступно/килограмм)':0.3,
        }

metadict_detail['Морковь чищеная (килограмм)'] = {
        'Морковь (килограмм)':1.3,
        '_-Чистка корнеплодов (килограмм)':1.3,
        '+Пищевые отходы корнеплодов (доступно/килограмм)':0.3,
        }

metadict_detail['Чеснок чищеный (килограмм)'] = {
        'Чеснок (килограмм)':1.3,
        '_-Чистка овощей (килограмм)':1.3,
        '+Пищевые отходы овощные (доступно/килограмм)':0.3,
        }

metadict_detail['Яблоко чищеное (килограмм)'] = {
        'Яблоко (килограмм)':1.5,
        '_-Чистка фруктов (килограмм)':1.5,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.5,
        }

metadict_detail['Слива чищеная (килограмм)'] = {
        'Слива (килограмм)':1.3,
        '_-Чистка фруктов (килограмм)':1.3,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.3,
        }

metadict_detail['Гранат чищеный (килограмм)'] = {
        'Гранат (килограмм)':1.8,
        '_-Чистка фруктов (килограмм)':1.8,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.8,
        }

metadict_detail['Груша чищеная (килограмм)'] = {
        'Груша (килограмм)':1.3,
        '_-Чистка фруктов (килограмм)':1.3,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.3,
        }

metadict_detail['Миндаль чищенный (килограмм)'] = {
        # Миндаль нужно залить кипятком и просушить, чтобы снять шкурку
        'Орех миндаля (килограмм)':1.3,
        'Вода кипячёная в котелке (грамм)':1000,
        '_-Чистка орехов (килограмм)':1.3,
        '+Пищевые отходы ореховые (доступно/килограмм)':0.3,
        '_-Бланширование орехов в котелке (килограмм)':1,
        }

metadict_detail['Орех грецкий чищенный (килограмм)'] = {
        'Орех грецкий (килограмм)':1.3,
        '_-Чистка орехов (килограмм)':1.3,
        '+Пищевые отходы ореховые (доступно/килограмм)':0.3,
        }


#----
# Ингредиенты (отбор):

metadict_detail['Инжир отборный (килограмм)'] = {
        'Инжир (килограмм)':1.2,
        '_-Перебор фруктов (килограмм)':1.2,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.2,
        }

#----
# Ингредиенты (отбор):

metadict_detail['Рыльца шафрана (килограмм)'] = {
        # Килограмм рылец шафрана = 80 000 цветов
        # Много ручной работы -- 2-12 тысяч евро/килограмм (2016 год)
            # https://en.wikipedia.org/wiki/Saffron
        'Цветы шафрана (килограмм)':100,
        '_-Перебор трав (килограмм)':100,
        '+Пищевые отходы травяные (доступно/килограмм)':99,
        }

metadict_detail['Корень имбиря отборный (килограмм)'] = {
        'Имбирь (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Корень куркумы (килограмм)'] = {
        # Исправить
            # Вспомни. Куркуму как-то обрабатывают, прежде чем применять.
            # И да, везде и повсюду используют её в порошке.
        'Куркума (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Корица палочкой (килограмм)'] = {
        'Корица (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Лист смородины отборный (килограмм)'] = {
        'Лист смородины (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Лист вишни отборный (килограмм)'] = {
        'Лист вишни (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Лист винограда отборный (килограмм)'] = {
        'Лист винограда (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Лист малины отборный (килограмм)'] = {
        'Лист малины (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Лист рябины отборный (килограмм)'] = {
        'Лист рябины (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Лист шиповника отборный (килограмм)'] = {
        'Лист шиповника (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Лист дуба отборный (килограмм)'] = {
        'Лист дуба (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Лист хрена отборный (килограмм)'] = {
        'Хрен (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Зелень базилика отборная (килограмм)'] = {
        'Базилик (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Зелень эстрагона отборная (килограмм)'] = {
        'Эстрагон (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Зелень кервеля отборная (килограмм)'] = {
        'Кервель (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Зелень кресса отборная (килограмм)'] = {
        'Кресс-салат (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Крапива отборная (килограмм)'] = {
        'Крапива (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Щавель отборный (килограмм)'] = {
        'Щавель (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Шпинат отборный (килограмм)'] = {
        'Шпинат (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Салат-латук отборный (килограмм)'] = {
        'Латук посевной (килограмм)':1.2,
        '_-Чистка овощей (килограмм)':1.2,
        '+Пищевые отходы овощные (доступно/килограмм)':0.2,
        }

metadict_detail['Зелень фенхеля отборная (килограмм)'] = {
        'Фенхель (килограмм)':1.2,
        '_-Чистка овощей (килограмм)':1.2,
        '+Пищевые отходы овощные (доступно/килограмм)':0.2,
        }

metadict_detail['Ботва свекольная отборная (килограмм)'] = {
        'Ботва свекольная (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Ботва морковная отборная (килограмм)'] = {
        'Ботва морковная (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Зелень сельдерея отборная (килограмм)'] = {
        'Сельдерей (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Зелень мелиссы отборная (килограмм)'] = {
        'Мелисса (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Зелень петрушки отборная (килограмм)'] = {
        'Петрушка (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Зелень кориандра отборная (килограмм)'] = {
        'Кориандр (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Зелень фенугрека отборная (килограмм)'] = {
        'Фенугрек (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Зелень чабера отборная (килограмм)'] = {
        'Чабер (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Земляника отборная (килограмм)'] = {
        'Земляника (килограмм)':1.2,
        '_-Перебор ягод (килограмм)':1.2,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.2,
        }

metadict_detail['Гранат отборный (килограмм)'] = {
        'Гранат (килограмм)':1.2,
        '_-Перебор фруктов (килограмм)':1.2,
        }

metadict_detail['Лимон отборный (килограмм)'] = {
        'Лимон (килограмм)':1.2,
        '_-Перебор фруктов (килограмм)':1.2,
        }

metadict_detail['Зелень лука отборная (килограмм)'] = {
        'Лук зелёный (килограмм)':1.2,
        '_-Перебор овощей (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Огурцы отборные (килограмм)'] = {
        'Огурцы (килограмм)':1.2,
        '_-Перебор овощей (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Горошек зелёный (килограмм)'] = {
        # Молодой горох сладких сортов.
        'Бобы гороха в стручках (килограмм)':1.2,
        '_-Перебор овощей (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Фасоль стручковая отборная (килограмм)'] = {
        'Бобы фасоли в стручках (килограмм)':1.2,
        '_-Перебор овощей (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Фасоль свежая (килограмм)'] = {
        'Бобы фасоли в стручках (килограмм)':1.2,
        '_-Перебор овощей (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Смородина отборная (килограмм)'] = {
        'Смородина (килограмм)':1.2,
        '_-Перебор ягод (килограмм)':1.2,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.2,
        }

metadict_detail['Крыжовник отборный (килограмм)'] = {
        'Крыжовник (килограмм)':1.2,
        '_-Перебор ягод (килограмм)':1.2,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.2,
        }

metadict_detail['Рябина отборная (килограмм)'] = {
        'Рябина (килограмм)':1.2,
        '_-Перебор ягод (килограмм)':1.2,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.2,
        }

metadict_detail['Шиповник отборный (килограмм)'] = {
        'Шиповник (килограмм)':1.2,
        '_-Перебор ягод (килограмм)':1.2,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.2,
        }

metadict_detail['Клюква отборная (килограмм)'] = {
        'Клюква (килограмм)':1.2,
        '_-Перебор ягод (килограмм)':1.2,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.2,
        }

metadict_detail['Малина отборная (килограмм)'] = {
        'Малина (килограмм)':1.2,
        '_-Перебор ягод (килограмм)':1.2,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.2,
        }

metadict_detail['Морошка отборная (килограмм)'] = {
        'Морошка (килограмм)':1.2,
        '_-Перебор ягод (килограмм)':1.2,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.2,
        }

metadict_detail['Ревень отборный (килограмм)'] = {
        'Ревень (килограмм)':1.2,
        '_-Перебор овощей (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Яблоко отборное (килограмм)'] = {
        'Яблоко (килограмм)':1.2,
        '_-Перебор фруктов (килограмм)':1.2,
        }

metadict_detail['Груша отборная (килограмм)'] = {
        'Груша (килограмм)':1.2,
        '_-Перебор фруктов (килограмм)':1.2,
        }

metadict_detail['Томаты отборные (килограмм)'] = {
        'Томаты (килограмм)':1.2,
        '_-Перебор овощей (килограмм)':1.2,
        '+Пищевые отходы овощные (доступно/килограмм)':0.2,
        }

metadict_detail['Артишоки отборные (килограмм)'] = {
        'Артишоки (килограмм)':1.2,
        '_-Чистка овощей (килограмм)':1.2,
        '+Пищевые отходы овощные (доступно/килограмм)':0.2,
        }

metadict_detail['Каперсы отборные (килограмм)'] = {
        'Каперсы (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Зелень укропа отборная (килограмм)'] = {
        'Укроп (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Черника отборная (килограмм)'] = {
        'Черника (килограмм)':1.2,
        '_-Перебор ягод (килограмм)':1.2,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.2,
        }

metadict_detail['Вишня отборная (килограмм)'] = {
        'Вишня (килограмм)':1.2,
        '_-Перебор ягод (килограмм)':1.2,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.2,
        }

metadict_detail['Виноград отборный (килограмм)'] = {
        'Виноград (килограмм)':1.2,
        '_-Перебор ягод (килограмм)':1.2,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.2,
        }

metadict_detail['Алыча отборная (килограмм)'] = {
        'Алыча (килограмм)':1.2,
        '_-Перебор фруктов (килограмм)':1.2,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.2,
        }

metadict_detail['Слива отборная (килограмм)'] = {
        'Слива (килограмм)':1.2,
        '_-Перебор фруктов (килограмм)':1.2,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.2,
        }

metadict_detail['Персик отборный (килограмм)'] = {
        'Персик (килограмм)':1.2,
        '_-Перебор фруктов (килограмм)':1.2,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.2,
        }

metadict_detail['Абрикос отборный (килограмм)'] = {
        'Абрикос (килограмм)':1.2,
        '_-Перебор фруктов (килограмм)':1.2,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.2,
        }

metadict_detail['Инжир отборный (килограмм)'] = {
        'Инжир (килограмм)':1.2,
        '_-Перебор фруктов (килограмм)':1.2,
        '+Пищевые отходы фруктовые (доступно/килограмм)':0.2,
        }

metadict_detail['Зверобой отборный (килограмм)'] = {
        'Зверобой (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Клевер отборный (килограмм)'] = {
        'Клевер (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Иссоп отборный (килограмм)'] = {
        'Иссоп (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Ромашка отборная (килограмм)'] = {
        'Ромашка (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Кипрей отборный (килограмм)'] = {
        'Кипрей (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Таволга отборная (килограмм)'] = {
        'Таволга (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Зелень руколы отборная (килограмм)'] = {
        'Рукола (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Чабрец отборный (килограмм)'] = {
        'Чабрец (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Зелень мяты отборная (килограмм)'] = {
        'Мята (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Лаванда отборная (килограмм)'] = {
        'Лаванда (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Любисток отборный (килограмм)'] = {
        'Любисток (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Сморчки отборные (килограмм)'] = {
        'Сморчки (килограмм)':1.2,
        'Вода для готовки (грамм)':1000,
        'Соль поваренная (грамм)':10,
        '_-Перебор грибов (килограмм)':1.2,
        '_-Промывание грибов (килограмм)':1,
        '_-Замачивание грибов (килограмм)':2,
        '+Пищевые отходы грибные (доступно/килограмм)':0.2,
        }

metadict_detail['Вёшенки отборные (килограмм)'] = {
        'Вёшенки (килограмм)':1.2,
        'Вода для готовки (грамм)':1000,
        'Соль поваренная (грамм)':10,
        '_-Перебор грибов (килограмм)':1.2,
        '_-Замачивание грибов (килограмм)':2,
        '+Пищевые отходы грибные (доступно/килограмм)':0.2,
        }

metadict_detail['Морская капуста отборная (килограмм)'] = {
        'Морская капуста (килограмм)':1.2,
        '_-Перебор трав (килограмм)':1.2,
        '+Пищевые отходы травяные (доступно/килограмм)':0.2,
        }

metadict_detail['Перец острый отборный (килограмм)'] = {
        'Стручки острого перца (килограмм)':1.2,
        '_-Перебор овощей (килограмм)':1.2,
        '+Пищевые отходы овощные (доступно/килограмм)':0.2,
        }

metadict_detail['Перец нежгучий отборный (килограмм)'] = {
        'Стручки нежгучего перца (килограмм)':1.2,
        '_-Перебор овощей (килограмм)':1.2,
        '+Пищевые отходы овощные (доступно/килограмм)':0.2,
        }
