#----
# Подавление вывода данных:

metadict_model['-Животное на убой белуга (требуется/особь)'] = {
        }

metadict_model['-Животное на убой осётр (требуется/особь)'] = {
        }

metadict_model['-Животное на убой севрюга (требуется/особь)'] = {
        }

metadict_model['-Кости бараньи (требуется/килограмм)'] = {
        }

metadict_model['-Кости говяжьи (требуется/килограмм)'] = {
        }

metadict_model['Соль поваренная (килограмм)'] = {
        }

metadict_model['Вода хозяйственная (литр)'] = {
        }

metadict_model['+Сыворотка молочная овечья (доступно/килограмм)'] = {
        }

metadict_model['+Шкура баранья (доступно/квадратный метр)'] = {
        }

metadict_model['+Шкура коровья (доступно/квадратный метр)'] = {
        }

metadict_model['+Кости бараньи (доступно/килограмм)'] = {
        }

metadict_model['+Кости говяжьи (доступно/килограмм)'] = {
        }

metadict_model['+Кости рыбьи (доступно/килограмм)'] = {
        }

metadict_model['+Молоко коровье снятое (доступно/килограмм)'] = {
        }

metadict_model['+Пахта сливочная коровья (доступно/килограмм)'] = {
        }

metadict_model['-Жир бараний курдючный (требуется/килограмм)'] = {
        }

metadict_model['-Молоко коровье снятое (требуется/килограмм)'] = {
        }

metadict_model['-Сыворотка творожная коровья (требуется/килограмм)'] = {
        }

#----
# Подавление вывода данных:

#metadict_model['Алыча (килограмм)'] = {
#        # Позже посчитаем земледелие.
#        }
#
#metadict_model['Кервель (килограмм)'] = {
#        }
#
#metadict_model['Кориандр (килограмм)'] = {
#        }
#
#metadict_model['Кресс-салат (килограмм)'] = {
#        }
#
#metadict_model['Мелисса (килограмм)'] = {
#        }
#
#metadict_model['Мята (килограмм)'] = {
#        }
#
#metadict_model['Рукола (килограмм)'] = {
#        }
#
#metadict_model['Укроп (килограмм)'] = {
#        }
#
#metadict_model['Фенхель (килограмм)'] = {
#        }
#
#metadict_model['Эстрагон (килограмм)'] = {
#        }
#
#metadict_model['Гранат (килограмм)'] = {
#        }
#
#metadict_model['Груша (килограмм)'] = {
#        }
#
#metadict_model['Зерно просо (килограмм)'] = {
#        }
#
#metadict_model['Зерно риса посевного (килограмм)'] = {
#        }
#
#metadict_model['Инжир (килограмм)'] = {
#        }
#
#metadict_model['Слива (килограмм)'] = {
#        }
#
#metadict_model['Яблоко (килограмм)'] = {
#        }
#
#metadict_model['Базилик (килограмм)'] = {
#        }
#
#metadict_model['Виноград (килограмм)'] = {
#        }
#
#metadict_model['Зерно ячменя (килограмм)'] = {
#        }
#
#metadict_model['Лист лавра (килограмм)'] = {
#        }
#
#metadict_model['Лук репчатый (килограмм)'] = {
#        }
#
#metadict_model['Майоран (килограмм)'] = {
#        }
#
#metadict_model['Морковь (килограмм)'] = {
#        }
#
#metadict_model['Петрушка (килограмм)'] = {
#        }
#
#metadict_model['Сельдерей (килограмм)'] = {
#        }
#
#metadict_model['Семена зиры (килограмм)'] = {
#        }
#
#metadict_model['Семена льна (килограмм)'] = {
#        }
#
#metadict_model['Тимьян (килограмм)'] = {
#        }
#
#metadict_model['Чабер (килограмм)'] = {
#        }
#
#metadict_model['Чеснок (килограмм)'] = {
#        }

#----
# Подавление вывода данных:

metadict_model['||Блюдо густое горячее (250-грамм/порция)'] = {
        # Можно посуду подключить.
        }

metadict_model['||Блюдо жидкое горячее (250-грамм/порция)'] = {
        }

metadict_model['||Блюдо твёрдое холодное (125-грамм/порция)'] = {
        }

metadict_model['||Фрукты (125-грамм/порция)'] = {
        }

metadict_model['||Питьё холодное (250-грамм/порция)'] = {
        }

metadict_model['||Хлеб вчерашний (50-грамм/порция)'] = {
        }

metadict_model['||Хлеб свежий (50-грамм/порция)'] = {
        }

#----
# Подавление вывода данных:

metadict_model['-Испарение воды в котле (килограмм)'] = {
        # Для расчётов очага. Позже допилю.
        }

metadict_model['-Испарение воды на воздухе (килограмм)'] = {
        }

metadict_model['-Испарение воды на очаге (килограмм)'] = {
        }

metadict_model['-Кипячение воды в котле (килограмм)'] = {
        }

metadict_model['-Кипячение воды на очаге (килограмм)'] = {
        }

metadict_model['-Испарение воды в печи (килограмм)'] = {
        }

metadict_model['-Кипячение воды в печи (килограмм)'] = {
        }

#----
# Подавление вывода данных:

metadict_model['_-Варка костного бульона в котелке (килограмм)'] = {
        # Будет использоваться для оценки трудозатрат.
        }

metadict_model['_-Варка гороха в котелке (килограмм)'] = {
        }

metadict_model['_-Варка нута в котелке (килограмм)'] = {
        }

metadict_model['_-Варка пшеницы в котелке (килограмм)'] = {
        }

metadict_model['_-Варка чечевицы в котелке (килограмм)'] = {
        }

metadict_model['_-Выпечка лепёшек в тандыре (килограмм)'] = {
        }

metadict_model['_-Замачивание бобов (килограмм)'] = {
        }

metadict_model['_-Замачивание пшеницы (килограмм)'] = {
        }

metadict_model['_-Измельчение орехов в ступе (килограмм)'] = {
        }

metadict_model['_-Обмолот бобов (килограмм)'] = {
        }

metadict_model['_-Перебор бобов (килограмм)'] = {
        }

metadict_model['_-Перебор зерна (килограмм)'] = {
        }

metadict_model['_-Переработка оливок в масло (килограмм)'] = {
        }

metadict_model['_-Подготовка теста для лепёшек (килограмм)'] = {
        }

metadict_model['_-Помол зерна (килограмм)'] = {
        }

metadict_model['_-Приготовление бездрожжевого теста (килограмм)'] = {
        }

metadict_model['_-Прокаливание муки на сковороде (килограмм)'] = {
        }

metadict_model['_-Протирание бобов в ступе (килограмм)'] = {
        }

metadict_model['_-Чистка орехов (килограмм)'] = {
        }

metadict_model['_-Шинковка зелени (килограмм)'] = {
        }

metadict_model['_-Варка пшённой каши в котелке (килограмм)'] = {
        }

metadict_model['_-Вытапливание жира в казане (килограмм)'] = {
        }

metadict_model['_-Дробление зерна (килограмм)'] = {
        }

metadict_model['_-Замачивание риса (килограмм)'] = {
        }

metadict_model['_-Обмолот зерна (килограмм)'] = {
        }

metadict_model['_-Прокаливание масла на сковороде (килограмм)'] = {
        }

metadict_model['_-Тушение риса в котелке (килограмм)'] = {
        }

metadict_model['_-Чистка фруктов (килограмм)'] = {
        }

metadict_model['_-Варка перловой каши в котелке (килограмм)'] = {
        }

metadict_model['_-Замачивание зерна (килограмм)'] = {
        }

metadict_model['_-Запекание корнеплодов на противене (килограмм)'] = {
        }

metadict_model['_-Запекание костей на противене (килограмм)'] = {
        }

metadict_model['_-Запекание овощей на противене (килограмм)'] = {
        }

metadict_model['_-Нарезка мяса (килограмм)'] = {
        }

metadict_model['_-Обжаривание мяса в казане (килограмм)'] = {
        }

metadict_model['_-Обжаривание овощей в казане (килограмм)'] = {
        }

metadict_model['_-Перебор крупы (килограмм)'] = {
        }

metadict_model['_-Перебор фруктов (килограмм)'] = {
        }

metadict_model['_-Перебор ягод (килограмм)'] = {
        }

metadict_model['_-Приготовление вина (килограмм)'] = {
        }

metadict_model['_-Припускание мяса в казане (килограмм)'] = {
        }

metadict_model['_-Прокаливание крупы на сковороде (килограмм)'] = {
        }

metadict_model['_-Промывание крупы (килограмм)'] = {
        }

metadict_model['_-Процеживание бульона через мешок (килограмм)'] = {
        }

metadict_model['_-Сушка фруктов (килограмм)'] = {
        }

metadict_model['_-Чистка корнеплодов (килограмм)'] = {
        }

metadict_model['_-Разделка мяса (килограмм)'] = {
        }

metadict_model['_-Чистка овощей (килограмм)'] = {
        }

metadict_model['_-Шинковка овощей (килограмм)'] = {
        }

metadict_model['_-Кипячение воды в котелке (килограмм)'] = {
        }

metadict_model['_-Перебор трав (килограмм)'] = {
        }

metadict_model['_-Отжим семян в масло (килограмм)'] = {
        }

metadict_model['_-Сушка трав (килограмм)'] = {
        }

metadict_model['_-Чистка и шлифование зерна (килограмм)'] = {
        }

metadict_model['_-Вяление рыбы (килограмм)'] = {
        }

metadict_model['_-Разделка крупной рыбы (килограмм)'] = {
        }

metadict_model['_-Разделка мелкого рогатого скота (килограмм)'] = {
        }

metadict_model['_-Разделка крупного рогатого скота (килограмм)'] = {
        }

#----
# Подавление вывода данных:

#metadict_model['-----Регионы'] = {
#        }
#
#metadict_model['----Округа'] = {
#        }
#
#metadict_model['---Города'] = {
#        }
#
#metadict_model['---Городища'] = {
#        }
#
#metadict_model['---Селения'] = {
#        }
#
#metadict_model['--Общины'] = {
#        }
#
#metadict_model['-Семьи'] = {
#        }
#
#metadict_model['--Население'] = {
#        }

metadict_model['-Едоки'] = {
        }

metadict_model['-Работники'] = {
        }

metadict_model['-Бедняки'] = {
        }

metadict_model['-Горожане'] = {
        }

metadict_model['-Горожане-женщины взрослые (15-50 лет)'] = {
        }

metadict_model['-Горожане-женщины дети (0-15 лет)'] = {
        }

metadict_model['-Горожане-женщины старухи (50+ лет)'] = {
        }

metadict_model['-Горожане-мужчины взрослые (15-50 лет)'] = {
        }

metadict_model['-Горожане-мужчины дети (0-15 лет)'] = {
        }

metadict_model['-Горожане-мужчины старики (50+ лет)'] = {
        }

metadict_model['-Знатные'] = {
        }

metadict_model['-Знатные-женщины взрослые (15-50 лет)'] = {
        }

metadict_model['-Знатные-женщины дети (0-15 лет)'] = {
        }

metadict_model['-Знатные-женщины старухи (50+ лет)'] = {
        }

metadict_model['-Знатные-мужчины взрослые (15-50 лет)'] = {
        }

metadict_model['-Знатные-мужчины дети (0-15 лет)'] = {
        }

metadict_model['-Знатные-мужчины старики (50+ лет)'] = {
        }

metadict_model['-Рабы'] = {
        }

metadict_model['-Селяне'] = {
        }

metadict_model['-Селяне-женщины взрослые (15-50 лет)'] = {
        }

metadict_model['-Селяне-женщины дети (0-15 лет)'] = {
        }

metadict_model['-Селяне-женщины старухи (50+ лет)'] = {
        }

metadict_model['-Селяне-мужчины взрослые (15-50 лет)'] = {
        }

metadict_model['-Селяне-мужчины дети (0-15 лет)'] = {
        }

metadict_model['-Селяне-мужчины старики (50+ лет)'] = {
        }

metadict_model['-Карлы-самки взрослые (15-50 лет)'] = {
        }

metadict_model['-Карлы-самки дети (0-15 лет)'] = {
        }

metadict_model['-Карлы-самки старухи (50+ лет)'] = {
        }

metadict_model['-Карлы-самцы взрослые (15-50 лет)'] = {
        }

metadict_model['-Карлы-самцы дети (0-15 лет)'] = {
        }

metadict_model['-Карлы-самцы старики (50+ лет)'] = {
        }

metadict_model['-Рабы-женщины взрослые (15-50 лет)'] = {
        }

metadict_model['-Рабы-женщины дети (0-15 лет)'] = {
        }

metadict_model['-Рабы-женщины старухи (50+ лет)'] = {
        }

metadict_model['-Рабы-мужчины взрослые (15-50 лет)'] = {
        }

metadict_model['-Рабы-мужчины дети (0-15 лет)'] = {
        }

metadict_model['-Рабы-мужчины старики (50+ лет)'] = {
        }

#----

metadict_model['_+Работа женщины-горожанки (нормо-часов)'] = {
        }

metadict_model['_+Работа женщины-знатной (нормо-часов)'] = {
        }

metadict_model['_+Работа женщины-селянки (нормо-часов)'] = {
        }

metadict_model['_+Работа мужчины-горожанина (нормо-часов)'] = {
        }

metadict_model['_+Работа мужчины-знатного (нормо-часов)'] = {
        }

metadict_model['_+Работа мужчины-селянина (нормо-часов)'] = {
        }

metadict_model['_+Работа женщины-карлы (нормо-часов)'] = {
        }

metadict_model['_+Работа женщины-рабыни (нормо-часов)'] = {
        }

metadict_model['_+Работа мужчины-карла (нормо-часов)'] = {
        }

metadict_model['_+Работа мужчины-раба (нормо-часов)'] = {
        }

#----
# Субпродукты бараньи:

metadict_model['+Курдюк бараний (доступно/килограмм)'] = {
        '+Жир бараний курдючный (доступно/килограмм)':0.8,
        }

metadict_model['+Жир бараний курдючный (доступно/килограмм)'] = {
        '+Жир бараний (доступно/килограмм)':1,
        }

metadict_model['+Жир бараний почечный (доступно/килограмм)'] = {
        '+Жир бараний (доступно/килограмм)':1,
        }

metadict_model['+Жир бараний прочий (доступно/килограмм)'] = {
        '+Жир бараний (доступно/килограмм)':1,
        }

metadict_model['+Голова баранья (доступно/килограмм)'] = {
        '+Череп бараний (доступно/килограмм)':0.40,
        '+Челюсть баранья (доступно/килограмм)':0.15,
        '+Субпродукты бараньи (доступно/килограмм)':0.45,
        }

metadict_model['+Сухожилия бараньи (доступно/килограмм)'] = {
        '+Субпродукты бараньи (доступно/килограмм)':1,
        }

metadict_model['+Диафрагма баранья (доступно/килограмм)'] = {
        '+Ливер бараний (доступно/килограмм)':1,
        }

metadict_model['+Калтык бараний (доступно/килограмм)'] = {
        '+Субпродукты бараньи (доступно/килограмм)':1,
        }

metadict_model['+Кишечник бараний (доступно/килограмм)'] = {
        '+Субпродукты бараньи (доступно/килограмм)':1,
        }

metadict_model['+Ноги с копытами бараньи (доступно/килограмм)'] = {
        '+Субпродукты бараньи (доступно/килограмм)':1,
        }

metadict_model['+Кровь баранья (доступно/килограмм)'] = {
        '+Субпродукты бараньи (доступно/килограмм)':1,
        }

metadict_model['+Лёгкие бараньи (доступно/килограмм)'] = {
        '+Ливер бараний (доступно/килограмм)':1,
        }

metadict_model['+Мозги бараньи (доступно/килограмм)'] = {
        '+Субпродукты бараньи (доступно/килограмм)':1,
        }

metadict_model['+Печень баранья (доступно/килограмм)'] = {
        '+Ливер бараний (доступно/килограмм)':1,
        }

metadict_model['+Рубец бараний (доступно/килограмм)'] = {
        '+Ливер бараний (доступно/килограмм)':1,
        }

metadict_model['+Селезёнка баранья (доступно/килограмм)'] = {
        '+Ливер бараний (доступно/килограмм)':1,
        }

metadict_model['+Сердце баранье (доступно/килограмм)'] = {
        '+Ливер бараний (доступно/килограмм)':1,
        }

metadict_model['+Шкура баранья (доступно/килограмм)'] = {
        '+Шкура баранья (доступно/штук)':0.3,
        }

metadict_model['+Язык бараний (доступно/килограмм)'] = {
        '+Субпродукты бараньи (доступно/килограмм)':1,
        }

metadict_model['+Череп бараний (доступно/килограмм)'] = {
        '+Пищевые отходы костные (доступно/килограмм)':1,
        }

metadict_model['+Челюсть баранья (доступно/килограмм)'] = {
        '+Пищевые отходы костные (доступно/килограмм)':1,
        }

#----
# Субпродукты коровьи, КРС:

metadict_model['+Жир говяжий почечный (доступно/килограмм)'] = {
        # Исправить
            # Это очень ценный нутряной жир
        '+Жир говяжий (доступно/килограмм)':1,
        }

metadict_model['+Жир говяжий с ливера (доступно/килограмм)'] = {
        '+Жир говяжий (доступно/килограмм)':1,
        }

metadict_model['+Жир говяжий прочий (доступно/килограмм)'] = {
        '+Жир говяжий (доступно/килограмм)':1,
        }

metadict_model['+Голова говяжья (доступно/килограмм)'] = {
        # Череп 350 кг коровы -- 4-5 кг.
        '+Череп говяжий (доступно/килограмм)':0.4,
        '+Челюсть говяжья (доступно/килограмм)':0.15,
        '+Субпродукты говяжьи (доступно/килограмм)':0.45,
        }

metadict_model['+Вымя говяжье (доступно/килограмм)'] = {
        '+Ливер говяжий (доступно/килограмм)':1,
        }

metadict_model['+Калтык говяжий (доступно/килограмм)'] = {
        '+Субпродукты говяжьи (доступно/килограмм)':1,
        }

metadict_model['+Кишечник говяжий (доступно/килограмм)'] = {
        '+Субпродукты говяжьи (доступно/килограмм)':1,
        }

metadict_model['+Книжка говяжья (доступно/килограмм)'] = {
        '+Ливер говяжий (доступно/килограмм)':1,
        }

metadict_model['+Кровь говяжья (доступно/килограмм)'] = {
        '+Субпродукты говяжьи (доступно/килограмм)':1,
        }

metadict_model['+Лёгкие говяжьи (доступно/килограмм)'] = {
        '+Ливер говяжий (доступно/килограмм)':1,
        }

metadict_model['+Ноги с копытами говяжьи (доступно/килограмм)'] = {
        '+Субпродукты говяжьи (доступно/килограмм)':1,
        }

metadict_model['+Печень говяжья (доступно/килограмм)'] = {
        '+Ливер говяжий (доступно/килограмм)':1,
        }

metadict_model['+Пищевод говяжий (доступно/килограмм)'] = {
        '+Субпродукты говяжьи (доступно/килограмм)':1,
        }

metadict_model['+Почки говяжьи (доступно/килограмм)'] = {
        '+Ливер говяжий (доступно/килограмм)':1,
        }

metadict_model['+Рога говяжьи (доступно/килограмм)'] = {
        '+Субпродукты говяжьи (доступно/килограмм)':1,
        }

metadict_model['+Рубец говяжий (доступно/килограмм)'] = {
        '+Ливер говяжий (доступно/килограмм)':1,
        }

metadict_model['+Сальник говяжий (доступно/килограмм)'] = {
        '+Ливер говяжий (доступно/килограмм)':1,
        }

metadict_model['+Селезёнка говяжья (доступно/килограмм)'] = {
        '+Ливер говяжий (доступно/килограмм)':1,
        }

metadict_model['+Сердце говяжье (доступно/килограмм)'] = {
        '+Ливер говяжий (доступно/килограмм)':1,
        }

metadict_model['+Сухожилия говяжьи (доступно/килограмм)'] = {
        '+Субпродукты говяжьи (доступно/килограмм)':1,
        }

metadict_model['+Сычуг говяжий (доступно/килограмм)'] = {
        '+Ливер говяжий (доступно/килограмм)':1,
        }

metadict_model['+Трахея говяжья (доступно/килограмм)'] = {
        '+Ливер говяжий (доступно/килограмм)':1,
        }

metadict_model['+Уши говяжьи (доступно/килограмм)'] = {
        '+Субпродукты говяжьи (доступно/килограмм)':1,
        }

metadict_model['+Шкура коровья (доступно/килограмм)'] = {
        # Выделанная шкура весит вдвое меньше.
        # Толщина 1-4 мм, площадь одной шкуры -- 2.5 кв.метра, плотность (сырой) -- 8-10 кг/кв.метр
        # Характеристика и классификация кожевенного сырья
            # https://vuzlit.ru/264222/harakteristika_klassifikatsiya_kozhevennogo_syrya
        '+Шкура коровья (доступно/штук)':0.10,
        }

metadict_model['+Язык говяжий (доступно/килограмм)'] = {
        '+Субпродукты говяжьи (доступно/килограмм)':1,
        }

metadict_model['+Мозги говяжьи (доступно/килограмм)'] = {
        '+Субпродукты говяжьи (доступно/килограмм)':1,
        }

metadict_model['+Губы говяжьи (доступно/килограмм)'] = {
        '+Субпродукты говяжьи (доступно/килограмм)':1,
        }

metadict_model['+Череп говяжий (доступно/килограмм)'] = {
        '+Пищевые отходы костные (доступно/килограмм)':1,
        }

metadict_model['+Челюсть говяжья (доступно/килограмм)'] = {
        '+Пищевые отходы костные (доступно/килограмм)':1,
        }

#----
# Кожевенное сырьё:

metadict_model['+Шкура баранья (доступно/штук)'] = {
        '+Шкура баранья (доступно/квадратный метр)':0.6,
        }

metadict_model['+Шкура коровья (доступно/штук)'] = {
        '+Шкура коровья (доступно/квадратный метр)':2.5,
        }

#----
# Побочные продукты:

metadict_model['+Мезга овощная (доступно/килограмм)'] = {
        '+Пищевые отходы овощные (доступно/килограмм)':1,
        }

metadict_model['+Мезга виноградная (доступно/килограмм)'] = {
        '+Пищевые отходы фруктовые (доступно/килограмм)':1,
        }

metadict_model['+Мезга вишнёвая (доступно/килограмм)'] = {
        '+Пищевые отходы фруктовые (доступно/килограмм)':1,
        }

metadict_model['+Мезга гранатовая (доступно/килограмм)'] = {
        '+Пищевые отходы фруктовые (доступно/килограмм)':1,
        }

metadict_model['+Мезга яблочная (доступно/килограмм)'] = {
        '+Пищевые отходы фруктовые (доступно/килограмм)':1,
        }

metadict_model['+Отруби бобовые (доступно/килограмм)'] = {
        '+Пищевые отходы бобовые (доступно/килограмм)':1,
        }

metadict_model['+Отруби просяные (доступно/килограмм)'] = {
        '++Отруби зерновые (доступно/килограмм)':1,
        }

metadict_model['+Отруби пшеничные (доступно/килограмм)'] = {
        '++Отруби зерновые (доступно/килограмм)':1,
        }

metadict_model['+Отруби рисовые (доступно/килограмм)'] = {
        '++Отруби зерновые (доступно/килограмм)':1,
        }

metadict_model['+Отруби ячменные (доступно/килограмм)'] = {
        '++Отруби зерновые (доступно/килограмм)':1,
        }

metadict_model['+Маринад оливковый (доступно/килограмм)'] = {
        '+Маринад (доступно/килограмм)':1,
        }

metadict_model['+Маринад морковный (доступно/килограмм)'] = {
        '+Маринад (доступно/килограмм)':1,
        }

metadict_model['+Маринад овощной (доступно/килограмм)'] = {
        '+Маринад (доступно/килограмм)':1,
        }

metadict_model['+Сусло виноградное (доступно/килограмм)'] = {
        '+Сусло (доступно/килограмм)':1,
        }

metadict_model['+Сусло вишнёвое (доступно/килограмм)'] = {
        '+Сусло (доступно/килограмм)':1,
        }

metadict_model['+Масло снятое (доступно/килограмм)'] = {
        # От фритюра, от бульона на обжаренных овощах
        }

metadict_model['+Жир снятый (доступно/килограмм)'] = {
        # От бульонов, супов
        }

#----
# Мусор, компост:

metadict_model['+Маринад (доступно/килограмм)'] = {
        }

metadict_model['+Рассол (доступно/килограмм)'] = {
        }

metadict_model['+Сусло (доступно/килограмм)'] = {
        '++Пищевые отходы (доступно/килограмм)':1,
        }

metadict_model['+Пищевые отходы рыбные (доступно/килограмм)'] = {
        '++Пищевые отходы (доступно/килограмм)':1,
        }

metadict_model['+Пищевые отходы костные (доступно/килограмм)'] = {
        '++Пищевые отходы (доступно/килограмм)':1,
        }

metadict_model['+Пищевые отходы грибные (доступно/килограмм)'] = {
        '++Пищевые отходы (доступно/килограмм)':1,
        }

metadict_model['+Пищевые отходы корнеплодов (доступно/килограмм)'] = {
        '++Пищевые отходы (доступно/килограмм)':1,
        }

metadict_model['+Пищевые отходы овощные (доступно/килограмм)'] = {
        '++Пищевые отходы (доступно/килограмм)':1,
        }

metadict_model['+Пищевые отходы ореховые (доступно/килограмм)'] = {
        '++Пищевые отходы (доступно/килограмм)':1,
        }

metadict_model['+Пищевые отходы травяные (доступно/килограмм)'] = {
        '++Пищевые отходы (доступно/килограмм)':1,
        }

metadict_model['+Пищевые отходы фруктовые (доступно/килограмм)'] = {
        '++Пищевые отходы (доступно/килограмм)':1,
        }

metadict_model['+Пищевые отходы бобовые (доступно/килограмм)'] = {
        '++Пищевые отходы (доступно/килограмм)':1,
        }

metadict_model['+Пищевые отходы зерновые (доступно/килограмм)'] = {
        '++Пищевые отходы (доступно/килограмм)':1,
        }

metadict_model['++Отруби зерновые (доступно/килограмм)'] = {
        '++Пищевые отходы (доступно/килограмм)':1,
        }

metadict_model['++Пищевые отходы (доступно/килограмм)'] = {
        # Исправить
            # Уточни плотность в компостной яме.
        '++Пищевые отходы (доступно/кубометр)':1 / 700,
        }

metadict_model['++Солома сухая (доступно/килограмм)'] = {
        '++Солома сухая (доступно/кубометр)':1 / 50,
        }

metadict_model['++Пищевые отходы (доступно/кубометр)'] = {
        }

metadict_model['++Солома сухая (доступно/кубометр)'] = {
        }

#----
# Убираем лишние параметры из вывода (их можно вызвать по ключу -e)

metadict_model['--Питательные вещества (грамм)'] = {
        }

metadict_model['---Алкоголь (литров)'] = {
        }

#----
# Энергетическая ценность пищи:

metadict_model['-Белки (грамм)'] = {
        '--Калорийность белков (килокалорий)':4,
        '--Питательные вещества (грамм)':1,
        }

metadict_model['-Жиры (грамм)'] = {
        '--Калорийность жиров (килокалорий)':9,
        '--Питательные вещества (грамм)':1,
        }

metadict_model['-Углеводы (грамм)'] = {
        '--Калорийность углеводов (килокалорий)':4,
        '--Питательные вещества (грамм)':1,
        }

metadict_model['-Этанол (грамм)'] = {
        '--Этанол (миллилитров)':1 / 0.7893,
        '--Калорийность этанола (килокалорий)':7.1,
        '--Питательные вещества (грамм)':1,
        }

#----
# Энергетическая ценность (группировка):

metadict_model['--Калорийность этанола (килокалорий)'] = {                                          
        '---Калорийность пищи (килокалорий)':1,
        }

metadict_model['--Калорийность белков (килокалорий)'] = {
        '---Калорийность пищи (килокалорий)':1,
        }

metadict_model['--Калорийность жиров (килокалорий)'] = {
        '---Калорийность пищи (килокалорий)':1,
        }

metadict_model['--Калорийность углеводов (килокалорий)'] = {
        '---Калорийность пищи (килокалорий)':1,
        }

metadict_model['---Калорийность пищи (килокалорий)'] = {
        '++Энергия пищи (килокалорий)':1,
        }

metadict_model['++Энергия пищи (килокалорий)'] = {
        '++Энергия пищи (МДж)':4.1868 / 1000,
        }

metadict_model['++Энергия пищи (МДж)'] = {
        }

#----
# Считаем потребление алкоголя:
    # https://ru.wikipedia.org/wiki/Этанол

metadict_model['--Этанол (миллилитров)'] = {
        '---Алкоголь (литров)':1 / 1000,
        }
