##----
# Убираем зсоряющие вывод параметры:
# Их можно вызвать так:
# ~/workspace/amber-in-the-dark/scripts/army-structure-analyser.py -D ~/workspace/amber-in-the-dark/scripts/dict_chars -sm Твайлайт -e Скорость

metadict_model['++++ Бросок 1d20='] = {
        }

#metadict_model['---| Класс доспеха'] = {
#        }

#metadict_model['---| Класс доспеха (касание)'] = {
#        }

metadict_model['---| Модификатор атаки вблизи'] = {
        }

metadict_model['---| Модификатор атаки вдали'] = {
        }

metadict_model['---| Модификатор инициативы'] = {
        }

metadict_model['---| Коррекция уровня (Level adjustment)'] = {
        }

metadict_army['0 lvl (заклинания) (восстановление/раундов)'] = {
        }

metadict_army['1 lvl (заклинания) (восстановление/раундов)'] = {
        }

metadict_army['2 lvl (заклинания) (восстановление/раундов)'] = {
        }

metadict_army['3 lvl (заклинания) (восстановление/раундов)'] = {
        }

metadict_army['4 lvl (заклинания) (восстановление/раундов)'] = {
        }

metadict_army['5 lvl (заклинания) (восстановление/раундов)'] = {
        }

metadict_army['6 lvl (заклинания) (восстановление/раундов)'] = {
        }

metadict_army['7 lvl (заклинания) (восстановление/раундов)'] = {
        }

metadict_army['8 lvl (заклинания) (восстановление/раундов)'] = {
        }

metadict_army['9 lvl (заклинания) (восстановление/раундов)'] = {
        }

##----

metadict_model['---| Скорость, галоп (километров/час)'] = {
        }

metadict_model['---| Скорость, рысь (километров/час)'] = {
        }

metadict_model['---| Скорость, спринт (километров/час)'] = {
        }

metadict_model['---| Скорость, шаг (километров/час)'] = {
        }

metadict_model['Высота головы, от шеи до затылка (сантиметров)'] = {
        }

metadict_model['Диаметр копыта (сантиметров)'] = {
        }

metadict_model['Длина головы, от носа до затылка (сантиметров)'] = {
        }

metadict_model['Длина задних ног, до коленной чашечки (сантиметров)'] = {
        }

metadict_model['Длина передних ног, до плечевого сустава (сантиметров)'] = {
        }

metadict_model['Длина тела, от хвоста до груди (сантиметров)'] = {
        }

metadict_model['Масса тела (килограмм)'] = {
        }

metadict_model['Объём тела (литров)'] = {
        }

metadict_model['Площадь тела (квадратных сантиметров)'] = {
        }

metadict_model['Рост в ушках (сантиметров)'] = {
        }

metadict_model['Рост в холке (сантиметров)'] = {
        }

metadict_model['Ширина головы, от скулы до скулы (сантиметров)'] = {
        }

#----

##----
# Скрываем навыки:

metadict_model['-= Выступление (Воздушный танец)'] = {
        }

metadict_model['-= Выступление (Оратор)'] = {
        }

metadict_model['-= Выступление (Песня)'] = {
        }

metadict_model['-= Выступление (Скрипка)'] = {
        }

metadict_model['-= Выступление (Стихи)'] = {
        }

metadict_model['-= Выступление (Танец)'] = {
        }

metadict_model['-= Знания (Биология)'] = {
        }

metadict_model['-= Знания (Военная наука)'] = {
        }

metadict_model['-= Знания (Высшее общество Эквестрии)'] = {
        }

metadict_model['-= Знания (География Востока)'] = {
        }

metadict_model['-= Знания (География Подмирья)'] = {
        }

metadict_model['-= Знания (География Старого мира)'] = {
        }

metadict_model['-= Знания (География Эквестрии)'] = {
        }

metadict_model['-= Знания (Геология)'] = {
        }

metadict_model['-= Знания (Естествознание)'] = {
        }

metadict_model['-= Знания (Земледелие)'] = {
        }

metadict_model['-= Знания (Инженерное дело)'] = {
        }

metadict_model['-= Знания (История Востока)'] = {
        }

metadict_model['-= Знания (История Подмирья)'] = {
        }

metadict_model['-= Знания (История Старого мира)'] = {
        }

metadict_model['-= Знания (История Эквестрии)'] = {
        }

metadict_model['-= Знания (Логика)'] = {
        }

metadict_model['-= Знания (Магия Эглан)'] = {
        }

metadict_model['-= Знания (Математика)'] = {
        }

metadict_model['-= Знания (Местные, города Востока)'] = {
        }

metadict_model['-= Знания (Местные, города Подмирья)'] = {
        }

metadict_model['-= Знания (Местные, города Эквестрии)'] = {
        }

metadict_model['-= Знания (Природа Востока)'] = {
        }

metadict_model['-= Знания (Природа Ночного мира)'] = {
        }

metadict_model['-= Знания (Природа Подмирья)'] = {
        }

metadict_model['-= Знания (Природа Эквестрии)'] = {
        }

metadict_model['-= Знания (Теория магии)'] = {
        }

metadict_model['-= Знания (Физика)'] = {
        }

metadict_model['-= Знания (Философия и право)'] = {
        }

metadict_model['-= Знания (Химия)'] = {
        }

metadict_model['-= Знания (Экономика Востока)'] = {
        }

metadict_model['-= Знания (Экономика Эквестрии)'] = {
        }

metadict_model['-= Навык (Акробатика)'] = {
        }

metadict_army['-= Навык (Альпинизм)'] = {
        }

metadict_army['-= Навык (Ловушки)'] = {
        }

metadict_model['-= Навык (Взлом замков)'] = {
        }

metadict_model['-= Навык (Кража)'] = {
        }

metadict_model['-= Навык (Выживание)'] = {
        }

metadict_model['-= Навык (Гимнастика)'] = {
        }

metadict_model['-= Навык (Дипломатия)'] = {
        }

metadict_model['-= Навык (Запугивание)'] = {
        }

metadict_model['-= Навык (Каллиграфия)'] = {
        }

metadict_model['-= Навык (Концентрация)'] = {
        }

metadict_model['-= Навык (Лечение)'] = {
        }

metadict_model['-= Навык (Лёгкая атлетика)'] = {
        }

metadict_model['-= Навык (Магические устройства)'] = {
        }

metadict_model['-= Навык (Магическое искусство)'] = {
        }

metadict_model['-= Навык (Маскировка)'] = {
        }

metadict_model['-= Навык (Обман)'] = {
        }

metadict_model['-= Навык (Наблюдение)'] = {
        }

metadict_model['-= Навык (Оценка стоимости)'] = {
        }

metadict_model['-= Навык (Плавание)'] = {
        }

metadict_model['-= Навык (Поиск)'] = {
        }

metadict_model['-= Навык (Полёт)'] = {
        }

metadict_model['-= Навык (Прислушивание)'] = {
        }

metadict_model['-= Навык (Проницательность)'] = {
        }

metadict_model['-= Навык (Сбор информации)'] = {
        }

metadict_model['-= Навык (Секс)'] = {
        }

metadict_model['-= Навык (Скрытность)'] = {
        }

metadict_model['-= Навык (Тихий шаг)'] = {
        }

metadict_model['-= Ремесло (Черчение)'] = {
        }

metadict_model['-= Профессия (Арбитр)'] = {
        }

metadict_model['-= Профессия (Моряк)'] = {
        }

metadict_model['-= Профессия (Огородник)'] = {
        }

metadict_model['-= Профессия (Офицер)'] = {
        }

metadict_model['-= Профессия (Пахарь)'] = {
        }

metadict_model['-= Профессия (Посол)'] = {
        }

metadict_model['-= Профессия (Садовод)'] = {
        }

metadict_model['-= Ремесло (Архитектура)'] = {
        }

metadict_model['-= Ремесло (Изобретательство)'] = {
        }

metadict_model['-= Ремесло (Кулинария)'] = {
        }

metadict_model['-= Ремесло (Картография)'] = {
        }

metadict_model['-= Ремесло (Металлургия)'] = {
        }

metadict_model['-= Ремесло (Рисование)'] = {
        }

metadict_model['-= Ремесло (Судостроение)'] = {
        }
